

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	ФактСтоимостьЦвет = Объект.ФактСтоимостьЦвет;
	ФактКоличествоЦвет = Объект.ФактКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ФактКоличествоЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ФактКоличествоЦвет = ФактКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ФактСтоимостьЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика. 
	Объект.ФактСтоимостьЦвет = ФактСтоимостьЦвет;
КонецПроцедуры
