
&НаКлиенте
// Процедура предназначена для открытия обработки печати комплекта документов
//
// Параметры:
//  ПараметрКоманды - (ДокументСсылка.РеализацияТоваровУслуг, Массив), выбранные реализации
//  ПараметрыВыполненияКоманды - (ПараметрыВыполненияКоманды), структура, передаваемая в обработчик
//
// Возвращаемое значение:
//  Нет.
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("мРеализации", ПараметрКоманды);
	ОткрытьФорму("Обработка.абс_ПечатьКомплектаОтгрузочныхДокументов.Форма", ПараметрыФормы); 	
	
КонецПроцедуры
