

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ТипДокументаДляСогласования") Тогда
		Объект.ТипДокументаДляСогласования=ЭтаФорма.Параметры.ТипДокументаДляСогласования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.абс_МаршрутыСогласованияДокументов.Форма.ФормаВыбораУправляемая",Новый Структура("ТипДокументаДляСогласования",Объект.ТипДокументаДляСогласования),Элемент);
КонецПроцедуры

