
Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыНакопления.Лео_Переработчики.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	Для каждого стр из ТабЧасть цикл
		Если стр.Контрагент = "Всего:" тогда
			  продолжить;
	    КонецЕсли;
	Движение = НаборЗаписей.Добавить();
	Движение.Регистратор = Ссылка;
	Движение.Период = стр.День;
	Движение.Контрагент = стр.Контрагент;
	Движение.Человек    = стр.КоличествоЧ;
	Движение.Упаковано  = стр.КоличествоКГ;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры
