
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого СтрокаТаб Из Товары Цикл
		Движение = Движения.абс_ЗначенияСвойствНоменклатурыКонтрагентов.Добавить();
		Движение.Период           = Дата;
		Движение.Контрагент       = Контрагент;
		Движение.Номенклатура     = СтрокаТаб.Номенклатура;
		Движение.Свойство         = СтрокаТаб.Свойство;
		Движение.ЗначениеСвойства = СтрокаТаб.ЗначениеСвойства;
	КонецЦикла;
	
	Движения.абс_ЗначенияСвойствНоменклатурыКонтрагентов.Записывать = Истина;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Свойство) Тогда
		Для Каждого СтрокаТаб Из Товары Цикл
			СтрокаТаб.Свойство = Свойство;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

