////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ РЕКВИЗИТЫ

// Очищает реквизиты, относящиеся к платежам
//
&НаКлиенте
Процедура ПриОчисткеВалютыДокумента()
	
	Объект.СуммаДокумента = 0;
	Объект.СуммаНДС = 0;
	Объект.КурсДокумента = 0;
	Объект.КратностьДокумента = 0;
	
	Для Каждого Платеж Из Объект.РасшифровкаПлатежа Цикл
		Платеж.СуммаПлатежа = 0;
	КонецЦикла;
	
	Объект.БанковскийСчетКасса = Неопределено;
	Объект.ВключатьВПлатежныйКалендарь = Ложь;
	
КонецПроцедуры

// Процедура устанавливает, что можно выбрать кассу или банковский счет
// В зависимости от формы оплаты
//
&НаКлиенте
Процедура ОграничитьВыборСчетаКассы()

	Если Объект.ФормаОплаты = ВидыДенежныхСредствБезналичные Тогда
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	ИначеЕсли Объект.ФормаОплаты = ВидыДенежныхСредствНаличные Тогда
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
	Иначе
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов;
	КонецЕсли;
	
КонецПроцедуры //

// Определяет доступность валюты документа
// Валюта недоступна, если выбрана касса или банковский счет
//
&НаКлиенте
Процедура УстановитьДоступностьВалютыДокумента()

	Если Объект.БанковскийСчетКасса = Неопределено ИЛИ Объект.БанковскийСчетКасса.Пустая() Тогда
		Элементы.ВалютаДокумента.Доступность = Истина;
	Иначе
		Элементы.ВалютаДокумента.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //

// Процедура изменяет валюту документа исходя из выбранной кассы или банковского счета
//
&НаСервере
Процедура ПолучитьВалютуБанковскогоСчетаИлиКассы()

	Объект.ВалютаДокумента = Объект.БанковскийСчетКасса.ВалютаДенежныхСредств;
	
	ПриИзмененииВалютыДокумента();
	
КонецПроцедуры //

// В процедуре пересчитывается сумма платежа и курс валюты документа
//
&НаСервере
Процедура ПриИзмененииВалютыДокумента()

	Если Объект.ВалютаДокумента = СтараяВалютаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаТаблица(Истина);
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;
	
КонецПроцедуры //
 
// Обработчик события "ПриИзменении" поля "Дата"
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРасхода) И НЕ Объект.ВалютаДокумента.Пустая() Тогда
		
		РассчитатьСуммуПлатежаТаблица(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ДатаРасхода"
//
&НаКлиенте
Процедура ДатаРасходаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаРасхода) И НЕ Объект.ВалютаДокумента.Пустая() Тогда
		
		РассчитатьСуммуПлатежаТаблица(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ВалютаДокумента"
//
&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Если Объект.ВалютаДокумента = СтараяВалютаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВалютаДокумента.Пустая() Тогда
		ПриОчисткеВалютыДокумента();
	Иначе
		ПриИзмененииВалютыДокумента();
	КонецЕсли;	
	ОбновлениеОтображения();
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ФормаОплаты"
//
&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	Объект.БанковскийСчетКасса = Неопределено;
	
	ОграничитьВыборСчетаКассы();
	
	УстановитьДоступностьВалютыДокумента();	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "Контрагент"
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.РасшифровкаПлатежа.Очистить();
	СтрокаПлатежа = Объект.РасшифровкаПлатежа.Добавить();
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "БанковскийСчетКасса"
//
&НаКлиенте
Процедура БанковскийСчетКассаПриИзменении(Элемент)
	
	Если НЕ Объект.БанковскийСчетКасса.Пустая() Тогда
		ПолучитьВалютуБанковскогоСчетаИлиКассы();
	КонецЕсли;	
	
	Объект.РазмещениеЗаявки.Очистить();
	
	УстановитьДоступностьВалютыДокумента();	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "Организация"
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НЕ ПустаяСтрока(Объект.Номер) Тогда
		ПрефиксацияОбъектовСобытия.ОчиститьНомерОбъекта(Объект.Номер, Объект.Организация);
	КонецЕсли; 
	
	ОграничитьВыборДоговора();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// РАСЧЕТЫ С КОНТРАГЕНТАМИ

// Процедура ограничивает выбор договора по организации, если она указана
//
&НаКлиенте
Процедура ОграничитьВыборДоговора()

	ПараметрыВыбораДоговора = Элементы.РасшифровкаПлатежаДоговорКонтрагента.ПараметрыВыбора;
	
	УстановитьНовыеПараметры = Ложь;
	
	НовыйМассивПараметров = Новый Массив;
	Для каждого СвязьПараметровВыбора Из ПараметрыВыбораДоговора Цикл
		НовыйМассивПараметров.Добавить(СвязьПараметровВыбора);
	КонецЦикла;
	
	// Удалим выбор по организации
	ИндексСвязи = 0;
	Для каждого ПараметрВыбора Из НовыйМассивПараметров Цикл
		Если ПараметрВыбора.Имя = "Отбор.Организация" Тогда
			НовыйМассивПараметров.Удалить(ИндексСвязи);
			УстановитьНовыеПараметры = Истина;
			Прервать;
		КонецЕсли;
		ИндексСвязи = ИндексСвязи + 1;
	КонецЦикла;
	
	Если НЕ Объект.Организация.Пустая() Тогда
		// Добавим выбор по организации
		ЕстьПараметрПоОрганизации = Ложь;
		Для каждого ПараметрВыбора Из НовыйМассивПараметров Цикл
			Если ПараметрВыбора.Имя = "Отбор.Организация" Тогда
				ЕстьПараметрПоОрганизации = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьПараметрПоОрганизации Тогда
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Организация", Объект.Организация);
			НовыйМассивПараметров.Добавить(ПараметрВыбора);
			УстановитьНовыеПараметры = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Если УстановитьНовыеПараметры Тогда
		Элементы.РасшифровкаПлатежаДоговорКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	КонецЕсли; 
	
КонецПроцедуры //
 
// Функция возвращает данные необходимые для выполнения действий связанных с изменением договора
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеПриИзмененииДоговора(ПараметрыДокумента)

	СтруктураДанных = Новый Структура;
	
	СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(ПараметрыДокумента.ДоговорКонтрагента, Новый Структура("ВалютаВзаиморасчетов,ОсновнаяСтатьяДвиженияДенежныхСредств"), "Справочник.ДоговорыКонтрагентов");
	
	ТекущаяВалютаВзаиморасчетов = СвойстваДоговора.ВалютаВзаиморасчетов;
	
	СтруктураДанных.Вставить("ВалютаВзаиморасчетов", ТекущаяВалютаВзаиморасчетов);
	
	СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ТекущаяВалютаВзаиморасчетов, ПараметрыДокумента.Дата);
	
	СтруктураДанных.Вставить("СтруктураКурсаВзаиморасчетов", СтруктураКурсаВзаиморасчетов);
	
	Если ЗначениеЗаполнено(СвойстваДоговора.ОсновнаяСтатьяДвиженияДенежныхСредств) Тогда
		СтруктураДанных.Вставить("СтатьяДвиженияДенежныхСредств", СвойстваДоговора.ОсновнаяСтатьяДвиженияДенежныхСредств);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции //

// Процедура пересчитывает сумму платежа в ТЧ "РасшифровкаПлатежа"
// исходя из суммы взаиморасчетов
//
&НаСервере
Процедура РассчитатьСуммуПлатежаТаблица(УстановитьКурсДокумента = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если УстановитьКурсДокумента Тогда
		ДатаКурса = ?(ДокументОбъект.ДатаРасхода='00010101', ДокументОбъект.Дата, ДокументОбъект.ДатаРасхода);
		СтруктураКурсаВалютаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДатаКурса);
		ДокументОбъект.КурсДокумента        = СтруктураКурсаВалютаДокумента.Курс;
		ДокументОбъект.КратностьДокумента   = СтруктураКурсаВалютаДокумента.Кратность;
	КонецЕсли; 
	
	Для Каждого СтрокаПлатеж Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		ВалютаВзаиморасчетов = СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		
		Если ВалютаВзаиморасчетов = ДокументОбъект.ВалютаДокумента Тогда
			
			СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаВзаиморасчетов;
	
		ИначеЕсли (ДокументОбъект.КурсДокумента <> 0) И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0) И (СтрокаПлатеж.КурсВзаиморасчетов <> 0) Тогда
			СтрокаПлатеж.СуммаПлатежа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
												СтрокаПлатеж.СуммаВзаиморасчетов, 
												ВалютаВзаиморасчетов,
												ДокументОбъект.ВалютаДокумента,
												СтрокаПлатеж.КурсВзаиморасчетов,
												ДокументОбъект.КурсДокумента,
												СтрокаПлатеж.КратностьВзаиморасчетов,
												ДокументОбъект.КратностьДокумента);
		Иначе
			СтрокаПлатеж.СуммаПлатежа = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ДокументОбъект.СуммаНДС = ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаНДС");
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

// Процедура рассчитывает курс взаиморасчетов в строке ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РассчитатьКурсВзаиморасчетов(СтрокаПлатеж)
	
	Если (СтрокаПлатеж.СуммаВзаиморасчетов <> 0) И (Объект.КратностьДокумента <> 0) Тогда
		СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа
							* Объект.КурсДокумента 
							* СтрокаПлатеж.КратностьВзаиморасчетов
							/ СтрокаПлатеж.СуммаВзаиморасчетов
							/ Объект.КратностьДокумента;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчитывает сумму взаиморасчетов в ТЧ "РасшифровкаПлатежа" 
// исходя из суммы платежа
//
&НаКлиенте
Процедура РассчитатьСуммуВзаиморасчетов(СтрокаПлатеж, ВалютаВзаиморасчетов)
	
	Если ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа;
			
	ИначеЕсли СтрокаПлатеж.КурсВзаиморасчетов <> 0 
		И Объект.КратностьДокумента <> 0
		И СтрокаПлатеж.КурсВзаиморасчетов <> 0 Тогда
		
		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
													СтрокаПлатеж.СуммаПлатежа,
													Объект.ВалютаДокумента,
			                                        ВалютаВзаиморасчетов,
			                                        Объект.КурсДокумента, 
													СтрокаПлатеж.КурсВзаиморасчетов,
													Объект.КратностьДокумента, 
													СтрокаПлатеж.КратностьВзаиморасчетов);	
	Иначе
		СтрокаПлатеж.СуммаВзаиморасчетов = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Объект.СуммаНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");

КонецПроцедуры

// Процедура пересчитывает сумму платежа в строке ТЧ "РасшифровкаПлатежа" 
// исходя из суммы взаиморасчетов
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежа(СтрокаПлатеж, ВалютаВзаиморасчетов)
	
	Если ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаВзаиморасчетов;
	
	ИначеЕсли (Объект.КурсДокумента <> 0) 
		И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0)
		И (СтрокаПлатеж.КурсВзаиморасчетов <> 0) Тогда
		
		СтрокаПлатеж.СуммаПлатежа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
										СтрокаПлатеж.СуммаВзаиморасчетов, 
										ВалютаВзаиморасчетов,
										Объект.ВалютаДокумента,
			                            СтрокаПлатеж.КурсВзаиморасчетов,
										Объект.КурсДокумента,
										СтрокаПлатеж.КратностьВзаиморасчетов,
										Объект.КратностьДокумента);
	Иначе
		СтрокаПлатеж.СуммаПлатежа = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Объект.СуммаНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");

КонецПроцедуры

// Процедура устанавливает тип сделки который можно выбрать
// Тип сделки зависит от вида операции и договора
//
&НаКлиенте
Процедура УстановитьПараметрыВыбораСделки()

	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаПлатеж.ДоговорКонтрагента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации <> ВидОперацииОплатаПоставщику
		И Объект.ВидОперации <> ВидОперацииВозвратДенежныхСредствПокупателю Тогда
		Возврат;
	КонецЕсли;
		
	СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(СтрокаПлатеж.ДоговорКонтрагента, Новый Структура("ВедениеВзаиморасчетов"), "Справочник.ДоговорыКонтрагентов");
	
	Если Объект.ВидОперации = ВидОперацииОплатаПоставщику  Тогда
		СтрокаТипаЗаказа = "ЗаказПоставщику";
		ТипДокументаСчет = "СчетНаОплатуПоставщика";
	ИначеЕсли Объект.ВидОперации = ВидОперацииВозвратДенежныхСредствПокупателю Тогда
		СтрокаТипаЗаказа = "ЗаказПокупателя";
		ТипДокументаСчет = "СчетНаОплатуПокупателю";
	КонецЕсли;
	
	Если СвойстваДоговора.ВедениеВзаиморасчетов = ВедениеВзаиморасчетовПоСчетам Тогда
		ТипДокументаСделки = ТипДокументаСчет;
	Иначе
		ТипДокументаСделки = СтрокаТипаЗаказа;
	КонецЕсли; 
	
	Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка." + ТипДокументаСделки);
	
КонецПроцедуры //

// Процедура изменяет курс взаиморасчетов и заполняет другие поля строки, связанные с договором
//
&НаКлиенте
Процедура ПриИзмененииДоговора(СтрокаПлатеж)
	
	ДанныеОбменаССервером = Новый Структура;
	ДанныеОбменаССервером.Вставить("Дата", Объект.Дата);
	ДанныеОбменаССервером.Вставить("ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента);
	ЗначенияДляЗаполнения = ПолучитьДанныеПриИзмененииДоговора(ДанныеОбменаССервером);
	
	СтрокаПлатеж.Сделка = Неопределено; // Для сделки нет значения по умолчанию в договоре
	СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Неопределено; 

	// Надо поменять валюту и курс взаиморасчетов
	СтрокаПлатеж.КурсВзаиморасчетов      = ЗначенияДляЗаполнения.СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = ЗначенияДляЗаполнения.СтруктураКурсаВзаиморасчетов.Кратность;
	
	РассчитатьСуммуВзаиморасчетов(СтрокаПлатеж, ЗначенияДляЗаполнения.ВалютаВзаиморасчетов);

	Если ЗначенияДляЗаполнения.Свойство("СтатьяДвиженияДенежныхСредств") Тогда
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = ЗначенияДляЗаполнения.СтатьяДвиженияДенежныхСредств;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ДоговорКонтрагента" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаДоговорКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииДоговора(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	УстановитьПараметрыВыбораСделки();
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "СуммаПлатеж" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РассчитатьКурсВзаиморасчетов(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Объект.СуммаНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "СуммаВзаиморасчетов" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВзаиморасчетовПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(СтрокаПлатеж.ДоговорКонтрагента, Новый Структура("ВалютаВзаиморасчетов"), "Справочник.ДоговорыКонтрагентов");
	
	ТекущаяВалютаВзаиморасчетов = СвойстваДоговора.ВалютаВзаиморасчетов;
	
	РассчитатьСуммуПлатежа(СтрокаПлатеж, ТекущаяВалютаВзаиморасчетов);
	
КонецПроцедуры

// Обработчик события "ПередУдалением" ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриНачалеРедактирования" ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьПараметрыВыбораСделки();
	
КонецПроцедуры

// Обработчик события "НачалоВыбора" поля "Сделка" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаСделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаПлатеж.ДоговорКонтрагента.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ФОРМА

// В процедуре инициализируются значения констант формы
// Константы используются при выполнении модуля формы
//
&НаСервере
Процедура УстановитьЗначенияКонстантФормы()
	
	ВидыДенежныхСредствБезналичные = Перечисления.ВидыДенежныхСредств.Безналичные;
	ВидыДенежныхСредствНаличные    = Перечисления.ВидыДенежныхСредств.Наличные;
	
	ВидОперацииОплатаПоставщику = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
	ВидОперацииВозвратДенежныхСредствПокупателю = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю;
	
	ВедениеВзаиморасчетовПоСчетам = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	
КонецПроцедуры //

// Процедура устанавливает параметры выбора договора в ТЧ "РасшифровкаПлатежа"
// Выбор договора зависит от вида операции
//
&НаСервере
Процедура УстановитьПараметрыВыбораДоговора()
	
	СписокВидовДоговоров = УправлениеДенежнымиСредствами.ОпределитьВидДоговораСКонтрагентом(Объект.ВидОперации);
	
	МассивПараметровВыбора = Новый Массив;
	
	МассивВидовДоговоров = СписокВидовДоговоров.ВыгрузитьЗначения();
	
	НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоров));
	МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
	
	Элементы.РасшифровкаПлатежаДоговорКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияКонстантФормы();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		// Это существующий документ. 
		// Проверим, что его можно менять.
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(РеквизитФормыВЗначение("Объект"), ЭтаФорма);
		
		//Если используется функционал согласования заявок - проверим можно ли редактировать заявку
		Если НЕ ТолькоПросмотр Тогда
			ТолькоПросмотр = НЕ УправлениеДенежнымиСредствами.РазрешеноИзменениеЗаявки(Объект.Ссылка);
		КонецЕсли;
		
	Иначе
		
		Если Параметры.Свойство("КопируемыйОбъект") Тогда
			// Форма создается программно, при этом выполняется копирование
			ДокументОбъект = РеквизитФормыВЗначение("Объект");
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Параметры.КопируемыйОбъект,, "Номер,Дата,ПометкаУдаления,Проведен,Ответственный,Состояние,АвтоРезервированиеПоЗаявке,АвтоРазмещениеПоЗаявке");
			ДокументОбъект.РасшифровкаПлатежа.Загрузить(Параметры.КопируемыйОбъект.РасшифровкаПлатежа.Выгрузить());
			
			ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		КонецЕсли;
		
		Если Параметры.ВидОперации.Пустая() Тогда
			Объект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		Иначе
			Объект.ВидОперации = Параметры.ВидОперации;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами Тогда
		Элементы.РасшифровкаПлатежаСделка.Видимость = Ложь;
	КонецЕсли; 
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;	
	
	УстановитьПараметрыВыбораДоговора();
	
	// Установим заголовок основной страницы
	ВидОперацииСтрока = Строка(Объект.ВидОперации);
	//Элементы.РасчетыСКонтрагентами.Заголовок = ВРег(Лев(ВидОперацииСтрока,1)) + Сред(ВидОперацииСтрока,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СуммаРасшифровки = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Если СуммаРасшифровки <> Объект.СуммаДокумента Тогда
		
		Если Вопрос("Не совпадают сумма документа и ее расшифровка. Пересчитать сумму документа?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
			
			Объект.СуммаДокумента = СуммаРасшифровки;
			
		Иначе
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОграничитьВыборСчетаКассы();
	ОграничитьВыборДоговора();
	УстановитьДоступностьВалютыДокумента();
	ОбновлениеОтображения();
КонецПроцедуры

//+Лео Сафонов ЕА
&НаКлиенте
Процедура Лео_ДоговорКонтрагентаПриИзменении(Элемент)
	
	Лео_ДоговорКонтрагентаПриИзмененииНаСервере();
	ОбновлениеОтображения();	
КонецПроцедуры

&НаСервере
Процедура Лео_ДоговорКонтрагентаПриИзмененииНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");

	Для Каждого СтрокаПлатеж Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		СтрокаПлатеж.ДоговорКонтрагента = ДокументОбъект.Лео_ДоговорКонтрагента;
		ДанныеОбменаССервером = Новый Структура;
		ДанныеОбменаССервером.Вставить("Дата", Объект.Дата);
		ДанныеОбменаССервером.Вставить("ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента);
		ЗначенияДляЗаполнения = ПолучитьДанныеПриИзмененииДоговора(ДанныеОбменаССервером);
		
		СтрокаПлатеж.Сделка = Неопределено; // Для сделки нет значения по умолчанию в договоре
		СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Неопределено; 

		// Надо поменять валюту и курс взаиморасчетов
		СтрокаПлатеж.КурсВзаиморасчетов      = ЗначенияДляЗаполнения.СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = ЗначенияДляЗаполнения.СтруктураКурсаВзаиморасчетов.Кратность;
		
		РассчитатьСуммуВзаиморасчетовСервер(СтрокаПлатеж, ЗначенияДляЗаполнения.ВалютаВзаиморасчетов);

		Если ЗначенияДляЗаполнения.Свойство("СтатьяДвиженияДенежныхСредств") Тогда
			СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = ЗначенияДляЗаполнения.СтатьяДвиженияДенежныхСредств;
		КонецЕсли; 	
		
		
		Если СтрокаПлатеж.ДоговорКонтрагента.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		Если Объект.ВидОперации <> ВидОперацииОплатаПоставщику
			И Объект.ВидОперации <> ВидОперацииВозвратДенежныхСредствПокупателю Тогда
			Возврат;
		КонецЕсли;
			
		СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(СтрокаПлатеж.ДоговорКонтрагента, Новый Структура("ВедениеВзаиморасчетов"), "Справочник.ДоговорыКонтрагентов");
		
		Если Объект.ВидОперации = ВидОперацииОплатаПоставщику  Тогда
			СтрокаТипаЗаказа = "ЗаказПоставщику";
			ТипДокументаСчет = "СчетНаОплатуПоставщика";
		ИначеЕсли Объект.ВидОперации = ВидОперацииВозвратДенежныхСредствПокупателю Тогда
			СтрокаТипаЗаказа = "ЗаказПокупателя";
			ТипДокументаСчет = "СчетНаОплатуПокупателю";
		КонецЕсли;
		
		Если СвойстваДоговора.ВедениеВзаиморасчетов = ВедениеВзаиморасчетовПоСчетам Тогда
			ТипДокументаСделки = ТипДокументаСчет;
		Иначе
			ТипДокументаСделки = СтрокаТипаЗаказа;
		КонецЕсли; 
		
		//СтрокаПлатеж.Сделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка." + ТипДокументаСделки);

	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуВзаиморасчетовСервер(СтрокаПлатеж, ВалютаВзаиморасчетов)
	
	Если ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа;
			
	ИначеЕсли СтрокаПлатеж.КурсВзаиморасчетов <> 0 
		И Объект.КратностьДокумента <> 0
		И СтрокаПлатеж.КурсВзаиморасчетов <> 0 Тогда
		
		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
													СтрокаПлатеж.СуммаПлатежа,
													Объект.ВалютаДокумента,
			                                        ВалютаВзаиморасчетов,
			                                        Объект.КурсДокумента, 
													СтрокаПлатеж.КурсВзаиморасчетов,
													Объект.КратностьДокумента, 
													СтрокаПлатеж.КратностьВзаиморасчетов);	
	Иначе
		СтрокаПлатеж.СуммаВзаиморасчетов = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
    Объект.СуммаНДС = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения()
	
	РассчитатьСуммуПлатежаТаблица(Истина);
	
	ВалютаВзаиморасчетовПоДоговору = Объект.Лео_ДоговорКонтрагента.ВалютаВзаиморасчетов;
	
	Элементы.ИнфНадписьКурса.Заголовок = РаботаСДиалогами.ПолучитьИнформациюКурсаВалютыСтрокой(ВалютаВзаиморасчетовПоДоговору, 
																					Объект.КурсДокумента,
																					Объект.КратностьДокумента,
																					глЗначениеПеременной("ВалютаРегламентированногоУчета"),
																					Истина);
																					
	// Установим заголовки по значению поля "Получатель" 
	// (это или контрагент или подотчетник или КассаККМ).

	// Надпись НадписьСуммаВзаиморасчетов
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетовПоДоговору) Тогда
		Элементы.НадписьСуммаВзаиморасчетов.Заголовок = "Сумма <нет валюты>:";
	Иначе	
		Элементы.НадписьСуммаВзаиморасчетов.Заголовок = "Сумма " + СокрЛП(ВалютаВзаиморасчетовПоДоговору) + ":";
	КонецЕсли;	

										
	Если Объект.ВалютаДокумента.Пустая() Тогда
		
		Элементы.НадписьСуммаДокумента.Заголовок="Не указана валюта расхода денежных средств!";
		Элементы.НадписьСуммаДокумента.ЦветТекста=ЦветаСтиля.ТекстПредупреждающейНадписи;
		
	Иначе
		
		Элементы.НадписьСуммаДокумента.Заголовок="Всего по заявке: "+
									Формат(Объект.СуммаДокумента,"ЧЦ=15; ЧДЦ=2; ЧН=Ноль")+
									" "+СокрЛП(Объект.ВалютаДокумента);							
		Элементы.НадписьСуммаДокумента.ЦветТекста=ЦветаСтиля.ТекстИнформационнойНадписи;
		
		Элементы.НадписьСуммаНДС.Заголовок="Всего НДС: "+
									Формат(Объект.СуммаНДС,"ЧЦ=15; ЧДЦ=2; ЧН=Ноль")+
									" "+СокрЛП(Объект.ВалютаДокумента);							
		Элементы.НадписьСуммаНДС.ЦветТекста=ЦветаСтиля.ТекстИнформационнойНадписи;
		
		
		
	КонецЕсли;
	
	ТекстВалюта = Строка(Объект.ВалютаДокумента);
	
	//Элементы.НадписьВалютаДокумент.Заголовок=ТекстВалюта;
	//Элементы.НадписьВалютаДокумент1.Заголовок=ТекстВалюта;
	//Элементы.НадписьВалютаДокумент2.Заголовок=ТекстВалюта;
	//Элементы.НадписьВалютаДокумент3.Заголовок=ТекстВалюта;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриИзменении(Элемент)
	
	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСтавкаНДСПриИзменении(Элемент)
	УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(Элементы.РасшифровкаПлатежа.ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура абс_ДопПараметры(Команда)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");

	
	Если НЕ РольДоступна("абс_ВводДопПараметровЗРС") Тогда
		
		Предупреждение("Нет прав на ввод доп. параметров.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.абс_ЭтапСогласования) ИЛИ НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
		
		Предупреждение("Редактирование доп. параметров недоступно.");
		Возврат;		
	КонецЕсли;
	
	ФормаДопПараметров = Получитьформу("абс_ФормаДопПараметров");
	
	ФормаДопПараметров.Организация			= ДокументОбъект.Организация;
	ФормаДопПараметров.ФормаОплаты			= ДокументОбъект.ФормаОплаты;
	
	ФормаДопПараметров.БанковскийСчетКасса 	= ДокументОбъект.БанковскийСчетКасса;
	ФормаДопПараметров.абс_СКредитногоСчета	= ДокументОбъект.абс_СКредитногоСчета;
	
	Если ФормаДопПараметров.ОткрытьМодально() = Истина Тогда
		
		ДокументОбъект.БанковскийСчетКасса 	= ФормаДопПараметров.БанковскийСчетКасса;
		ДокументОбъект.абс_СКредитногоСчета	= ФормаДопПараметров.абс_СКредитногоСчета;
	
		ДокументОбъект.Записать();
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура абс_ОперативныйБюджет(Команда)
	абс_ОперативныйБюджетСервер ()
КонецПроцедуры

&НаКлиенте
Процедура абс_ОперативныйБюджетСервер ()

НеобходимоПроведениеДокумента = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НеобходимоПроведениеДокумента = Истина;
	КонецЕсли;
	
	Если НЕ Объект.Проведен Тогда
		НеобходимоПроведениеДокумента = Истина;
	КонецЕсли;
	
	Если Модифицированность Тогда
		НеобходимоПроведениеДокумента = Истина;
	КонецЕсли;
			
	Если НеобходимоПроведениеДокумента Тогда
		Предупреждение("Перед заполнением оперативного бюджета необходимо провести документ!");
		Возврат;
	КонецЕсли;	
	
	// Получим данные по ЗРС
	ЗапросДанныеЗРС = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование КАК ЗаявкаНаРасходованиеСредств,
	|	СУММА(ЗаявкиНаРасходованиеСредствОбороты.СуммаУпрПриход) КАК СуммаЗРС,
	|	СУММА(ЗаявкиНаРасходованиеСредствОбороты.СуммаУпрПриход - ЗаявкиНаРасходованиеСредствОбороты.абс_СуммаНДСУпрПриход) КАК СуммаЗРСБезНДС
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Обороты(, , , ЗаявкаНаРасходование = &ЗРС) КАК ЗаявкиНаРасходованиеСредствОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование");
	
	ЗапросДанныеЗРС.УстановитьПараметр("ЗРС", Объект.Ссылка);
	
	ДанныеЗРС = ЗапросДанныеЗРС.Выполнить().Выгрузить();
	
	СтруктураДанныхЗРС = Новый Структура("ЗаявкаНаРасходованиеСредств, СуммаЗРС, СуммаЗРСБезНДС");
	
	Если ДанныеЗРС.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанныхЗРС, ДанныеЗРС[0]);
	Иначе
		Сообщить("По ЗРС не найдено суммы в бюджете, возможно документ не проведен!");
		Возврат;
	КонецЕсли;
	
	// Найдем документ оперативного бюджета
    Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ОперативныйБюджет.Ссылка
	|ИЗ
	|	Документ.абс_ОперативныйБюджет КАК абс_ОперативныйБюджет
	|ГДЕ
	|	абс_ОперативныйБюджет.ЦФО = &ЦФО
	|	И абс_ОперативныйБюджет.ДатаПланирования = &ДатаПланирования
	|	И абс_ОперативныйБюджет.Проведен
	|	И абс_ОперативныйБюджет.Организация = &Организация");
	
	Запрос.УстановитьПараметр("ЦФО"					, Объект.ЦФО);
	Запрос.УстановитьПараметр("Организация"			, Объект.Организация);
	Запрос.УстановитьПараметр("ДатаПланирования"	, НачалоГода(Объект.ДатаРасхода));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекДокумент = Документы.абс_ОперативныйБюджет.ПустаяСсылка();
	
	Если Выборка.Следующий() Тогда
		ТекДокумент = Выборка.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекДокумент) Тогда
		Предупреждение("Не найден документ ""Оперативный бюджет"" по ЦФО " + Объект.ЦФО + ", Организации " + Объект.Организация + " на " + Формат(НачалоГода(Объект.ДатаРасхода), "ДФ=yyyy") + " год.");
		Возврат;
	КонецЕсли;
	
	// Откроем форму оперативного бюджета для выбора аналитики
	//СтруктураВыбраннойАналитики = ОткрытьФормуМодально("Документ.абс_ОперативныйБюджет.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДокумент), ЭтаФорма);
	//
	//Если СтруктураВыбраннойАналитики = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	
	//СтруктураВыбранныхАналитик =  ОткрытьФормуМодально("Документ.абс_ОперативныйБюджет.Форма.ФормаДокумента", Новый Структура("Ключ", ТекДокумент), ЭтаФорма);
	СтруктураВыбранныхАналитик =  ОткрытьФормуМодально("Документ.абс_ОперативныйБюджет.Форма.ФормаДокументаДляВыбораАналитик", Новый Структура("Ключ", ТекДокумент), ЭтаФорма);
	
	Если СтруктураВыбранныхАналитик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураВыбранныхАналитик.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	// Распределим суммы по ячейкам	
	ФормаРаспределенияАналитик = Объект.ПолучитьФорму("абс_ФормаРаспределенияОперФактаПоЯчейкам");
	
	ТабАналитик = ФормаРаспределенияАналитик.ТабличноеПолеРаспределения; 
	
	НомерСтроки = 0;
	
	Для Каждого ТекВыбраннаяАналитика из СтруктураВыбранныхАналитик Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтрокиПоАналитике = ТабАналитик.НайтиСтроки(Новый Структура("ИдентификаторСтрокиБюджета,НомерМесяца", ТекВыбраннаяАналитика.ИдентификаторСтрокиБюджета, ТекВыбраннаяАналитика.НомерМесяца));
		
		Если СтрокиПоАналитике.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаАналитики = ТабАналитик.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаАналитики, ТекВыбраннаяАналитика);
		
		СтрокаАналитики.НомерСтроки = НомерСтроки;
		СтрокаАналитики.КодСтатьи 	= СтрокаАналитики.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		СтрокаАналитики.Месяц 		= Дата(1, СтрокаАналитики.НомерМесяца, 1);
		
	КонецЦикла;
	
	ФормаРаспределенияАналитик.СуммаЗРС 		= ДанныеЗРС[0].СуммаЗРС;
	ФормаРаспределенияАналитик.СуммаЗРСБезНДС 	= ДанныеЗРС[0].СуммаЗРСБезНДС;
	
	Если СтруктураВыбранныхАналитик.Количество() = 1 Тогда
		
		ТабАналитик[0].СуммаЗРС 		= ДанныеЗРС[0].СуммаЗРС;
		ТабАналитик[0].СуммаЗРСБезНДС 	= ДанныеЗРС[0].СуммаЗРСБезНДС;
		
	Иначе
		
		РезультатВыбора = ФормаРаспределенияАналитик.ОткрытьМодально();
		
		Если РезультатВыбора = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаРаспределенияЗРС = ФормаРаспределенияАналитик.ТабличноеПолеРаспределения.Скопировать();		
	
	//СтруктураВыбраннойАналитики = Неопределено;
	// Сохраним ЗРС в документе
	
	ТекДокументОбъект = ТекДокумент.ПолучитьОбъект();
	
	// Удалим строки по ЗРС, затем снова добавим
	СтрокиПоЗРС = ТекДокументОбъект.ЗаявкиНаРасходованиеСредств.НайтиСтроки(Новый Структура("ЗаявкаНаРасходованиеСредств", Объект.Ссылка));
	
	МассивНомеровМесяцевДляПересчета = Новый Массив;
	
	Для Каждого СтрокаЗРС Из СтрокиПоЗРС Цикл
		Если МассивНомеровМесяцевДляПересчета.Найти(СтрокаЗРС.НомерМесяца) = Неопределено Тогда
			МассивНомеровМесяцевДляПересчета.Добавить(СтрокаЗРС.НомерМесяца);
		КонецЕсли;
		
		ТекДокументОбъект.ЗаявкиНаРасходованиеСредств.Удалить(СтрокаЗРС);
	КонецЦикла;
	
	Для Каждого НомерМесяцаДляПересчета Из МассивНомеровМесяцевДляПересчета Цикл		
		ПроверитьСтокиПодвержденоПоОперБюджету(ТекДокументОбъект, НомерМесяцаДляПересчета);	
	КонецЦикла;
	
	// Добавим строку по ЗРС, аполним аналитику заявки
	Для Каждого СтруктураВыбраннойАналитики Из ТаблицаРаспределенияЗРС Цикл
		
		НоваяСтрокаЗРС = ТекДокументОбъект.ЗаявкиНаРасходованиеСредств.Добавить();
		
		НоваяСтрокаЗРС.ЦФО 							= ТекДокументОбъект.ЦФО;
		НоваяСтрокаЗРС.СтатьяОборотовПоБюджетам 	= СтруктураВыбраннойАналитики.СтатьяОборотовПоБюджетам;
		НоваяСтрокаЗРС.АналитикаБюджета 			= СтруктураВыбраннойАналитики.АналитикаБюджета;
		НоваяСтрокаЗРС.Контрагент 					= СтруктураВыбраннойАналитики.Контрагент;
		НоваяСтрокаЗРС.НомерМесяца 					= СтруктураВыбраннойАналитики.НомерМесяца;
		НоваяСтрокаЗРС.ИдентификаторСтрокиБюджета 	= СтруктураВыбраннойАналитики.ИдентификаторСтрокиБюджета;
		НоваястрокаЗРС.Подтверждено					= Истина;
		
		НоваяСтрокаЗРС.ЗаявкаНаРасходованиеСредств 	= Объект.Ссылка;
		
		НоваяСтрокаЗРС.СуммаЗРС      				= СтруктураВыбраннойАналитики.СуммаЗРС;
		НоваяСтрокаЗРС.СуммаЗРСБезНДС               = СтруктураВыбраннойАналитики.СуммаЗРСБезНДС;
		
		// Пересчитаем итог по строке опер. бюджета
		ПроверитьСтокиПодвержденоПоОперБюджету(ТекДокументОбъект, СтруктураВыбраннойАналитики.НомерМесяца);
		
	КонецЦикла;
	
	ТекДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ТекДокументОбъект.ПересчитатьИтогиТЧСоставБюджета(ТекДокументОбъект);
	
	Предупреждение("ЗРС добавлена в оперативный бюджет");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтокиПодвержденоПоОперБюджету(Объект, ИндексТекМесяца)
	
	//Процерим строки с признаком "Подтверждено"
	
	//СтрокиПодтверждено = Объект.СоставБюджета.НайтиСтроки(Новый Структура("Подтверждено" + ИндексТекМесяца, Истина));
	СтрокиПодтверждено = Объект.СоставБюджета;
	
	Для Каждого СтрПодтверждено Из СтрокиПодтверждено Цикл
		
		СтруктураАналитик = Новый Структура("ИдентификаторСтрокиБюджета");
		ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрПодтверждено);
		
		СтруктураАналитик.Вставить("НомерМесяца", ИндексТекМесяца);
		
		СтрокиЗРС = Объект.ЗаявкиНаРасходованиеСредств.НайтиСтроки(СтруктураАналитик);
		
		ВсегоСуммаЗРСПоАналитике 		= 0;
		ВсегоСуммаЗРСБезНДСПоАналитике 	= 0;
		
		Для Каждого СтрЗРС Из СтрокиЗРС Цикл
			
			ВсегоСуммаЗРСПоАналитике 		= ВсегоСуммаЗРСПоАналитике 			+ СтрЗРС.СуммаЗРС;
			ВсегоСуммаЗРСБезНДСПоАналитике 	= ВсегоСуммаЗРСБезНДСПоАналитике 	+ СтрЗРС.СуммаЗРСБезНДС;
			
		КонецЦикла;
		
		Если СтрПодтверждено["Подтверждено" + ИндексТекМесяца] Тогда
			Если ВсегоСуммаЗРСПоАналитике >= СтрПодтверждено["ОперФактСумма" + ИндексТекМесяца] Тогда
				
				СтрПодтверждено["Подтверждено" + ИндексТекМесяца] = Ложь;
				
				СтрПодтверждено["ОперФактСумма" + ИндексТекМесяца] 			= ВсегоСуммаЗРСПоАналитике;
				СтрПодтверждено["ОперФактСуммаБезНДС" + ИндексТекМесяца]	= ВсегоСуммаЗРСБезНДСПоАналитике;
			КонецЕсли;
		Иначе
			
			СтрПодтверждено["ОперФактСумма" + ИндексТекМесяца] 			= ВсегоСуммаЗРСПоАналитике;
			СтрПодтверждено["ОперФактСуммаБезНДС" + ИндексТекМесяца]	= ВсегоСуммаЗРСБезНДСПоАналитике;
			
		КонецЕсли;
	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Лео_ПредоплатаПриИзменении(Элемент)
	Если Не Объект.Лео_Предоплата Тогда
		Элементы.Лео_ПроцентПредоплаты.Доступность = Ложь;
		Элементы.Лео_ФиксСуммаПредоплаты.Доступность = Ложь;
		Объект.Лео_ПроцентПредоплаты = 0;
		Объект.Лео_ФиксСуммаПредоплаты = 0;
	Иначе
		Элементы.Лео_ПроцентПредоплаты.Доступность = Истина;
		Элементы.Лео_ФиксСуммаПредоплаты.Доступность = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Лео_ПроцентПредоплатыПриИзменении(Элемент)
	
	Если Объект.Лео_ПроцентПредоплаты > 0 Тогда
		Объект.Лео_ФиксСуммаПредоплаты = 0;	
		Элементы.Лео_ФиксСуммаПредоплаты.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лео_ФиксСуммаПредоплатыПриИзменении(Элемент)
	
	Если Объект.Лео_ФиксСуммаПредоплаты > 0 Тогда
		Объект.Лео_ПроцентПредоплаты = 0;	
		Элементы.Лео_ПроцентПредоплаты.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если Параметры.Ключ.Пустая() или ЭтаФорма.Модифицированность  Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура абс_Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура абс_Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура абс_Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры


