
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект,Отказ);
	
	Если Неактуальный Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаб ИЗ НоменклатураСертификата Цикл
		Движение = Движения.абс_ТоварыСертификатов.Добавить();
		Движение.Период                           = Лео_ДатазаписиВБазу;
		Движение.Номенклатура                     = СтрокаТаб.Номенклатура;
		//АБС 26.05.2014 44000
		Движение.ВидСертификата 				  = ВидСертификата;
		//АБС 26.05.2014 44000
		Движение.ДатаНачалаДействияСертификата    = ДатаНачалаДействияСертификата;
		Движение.ДатаОкончанияДействияСертификата = ДатаОкончанияДействияСертификата;
	КонецЦикла;
	
	Движения.абс_ТоварыСертификатов.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДатаНачалаДействияСертификата = ТекущаяДата();
	
КонецПроцедуры

