
&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Строка ИЗ Объект.Контрагенты Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Строка ИЗ Объект.Контрагенты Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьКонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентовНаСервере()
	
	ТаблицаСтопЛиста = абс_УправлениеДебиторскойЗадолженностью.ПолучитьТаблицуСтопЛиста();
	
	Объект.Контрагенты.Загрузить(ТаблицаСтопЛиста);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	
	УстановитьСтатусыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусыНаСервере()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ТаблицаСтопЛписта = ЭтотОбъект.Контрагенты.Выгрузить();
	
	абс_УправлениеДебиторскойЗадолженностью.УстановитьСтатусыСтопЛиста(ТаблицаСтопЛписта);
	
	ЭтотОбъект.Контрагенты.Загрузить(ТаблицаСтопЛписта);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьЗаказ(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.Заказы.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.Заказы.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов, Истина);
	
	Элементы.Заказы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьЗаказСервер(МассивЗаказов, ВыполнятьРассылку = Ложь)
	
	Для Каждого ЗаказПокупателя ИЗ МассивЗаказов Цикл
		НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
		НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Разблокирован;
		НоваяЗапись.ПринудительнаяБлокировка = Ложь;
		ПредоплатныйЗаказ = ЗапросПредоплатностиЗаказа(ЗаказПокупателя);
		Если ПредоплатныйЗаказ = Истина Тогда
			НоваяЗапись.ПредоплатныйЗаказ = Истина;	
		КонецЕсли;	
		НаборЗаписей.Записать();
		Если ВыполнятьРассылку Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", ЗаказПокупателя.Контрагент);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Перечисления.абс_СтатусыЗадолженности.Разблокирован);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуБлокировкиЗаказа(СтруктураПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//+Лаврухин
Функция ЗапросПредоплатностиЗаказа(ЗаказПокупателя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_КонтрольДЗПоЗаказам.ПредоплатныйЗаказ КАК ПредоплатныйЗаказ
	               |ИЗ
	               |	РегистрСведений.абс_КонтрольДЗПоЗаказам КАК абс_КонтрольДЗПоЗаказам
	               |ГДЕ
	               |	абс_КонтрольДЗПоЗаказам.ЗаказПокупателя = &Заказ";
	Запрос.УстановитьПараметр("Заказ", ЗаказПокупателя);
	Результат = Запрос.Выполнить().Выгрузить();	
	
	//СтатусДЗ = Перечисления.абс_СтатусыДЗПоЗаказам.ПустаяСсылка();
	Для Каждого Строка Из Результат Цикл
		ПредоплатныйЗаказ = Строка.ПредоплатныйЗаказ;
	КонецЦикла;
	
	Возврат ПредоплатныйЗаказ;
	
КонецФункции
//-Лаврухин


&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ФормаЗаказа = Элементы.Заказы.ТекущиеДанные.ЗаказПокупателя.ПолучитьФорму();
	ФормаЗаказа.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьБезРассылки(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.Заказы.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.Заказы.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов);
	
	Элементы.Заказы.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("абс_ФормированиеСтопЛиста") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетМораторнаяЗадолженность(Команда)
	
	ТабДок = СформироватьОтчетМораторнаяЗадолженностьСервер();
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетМораторнаяЗадолженностьСервер()
	
	СтруктураПараметров = абс_УправлениеДебиторскойЗадолженностью.СформироватьОтчетСтопЛистМораторнаяЗадолженность();
	ТабДок = СтруктураПараметров.ТабДок;
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ОтчетСтолЛист(Команда)
	
	ТабДок = СформироватьОтчетСтопЛистСервер();
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСтопЛистСервер();
	
	СтруктураПараметров = абс_УправлениеДебиторскойЗадолженностью.СформироватьОтчетСтопЛистПросроченнаяЗадолженность();
	ТабДок = СтруктураПараметров.ТабДок;
	Возврат ТабДок;
	
КонецФункции

//<< Горбунов ограничил права для пользователей по заказу Воронова
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если
		ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Лео_ФормированиеСтопЛистаПросмотр)
		Тогда
		Отказ = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.СтопЛист.Доступность = Ложь;
		Элементы.ОтчетСтолЛист.Доступность = Ложь;
		Элементы.ОтчетМораторнаяЗадолженность.Доступность = Ложь;
	ИначеЕсли
		ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Лео_ФормированиеСтопЛистаБухгалтерия)
		Тогда
		Отказ = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
	Иначе
		Предупреждение("Запрещенно открывать данную форму");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
//>> Горбунов

//+Лаврухин 17.09.2014
&НаКлиенте
Процедура Переформирование_STOP_листа(Команда)
	
	абс_РегламентныеЗадания.абс_ОбработкаСтопЛиста();
	//абс_РегламентныеЗадания.абс_РассылкаСтопЛиста();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаказы(Команда)
	Элементы.Заказы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьБезРассылки(Команда)
	
	Если Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ЗаблокированныеЗаказы1.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	ЗаблокироватьЗаказСервер(МассивЗаказов);
	
	Элементы.ЗаблокированныеЗаказы1.Обновить();
	Элементы.Заказы.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьЗаказСервер(МассивЗаказов, ВыполнятьРассылку = Ложь)
	
	Для Каждого ЗаказПокупателя ИЗ МассивЗаказов Цикл
		НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
		НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован;
		НоваяЗапись.ПринудительнаяБлокировка = Истина;
		НаборЗаписей.Записать();
		Если ВыполнятьРассылку Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", ЗаказПокупателя.Контрагент);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Перечисления.абс_СтатусыЗадолженности.Разблокирован);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуБлокировкиЗаказа(СтруктураПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринРазблокироватьЗаказ(Команда)
		Если Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ПринудительнаяБлокировкаЗаказов.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов, Истина);
	
	Элементы.ПринудительнаяБлокировкаЗаказов.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПринОбновить(Команда)
	Элементы.ПринудительнаяБлокировкаЗаказов.Обновить();
КонецПроцедуры
//-Лаврухин 17.09.2014

//+Лаврухин 16.02.2015
&НаКлиенте
Процедура РазблокированныеЗаблокироватьЗаказСервер(МассивЗаказов, ВыполнятьРассылку = Истина) 
	
	Для Каждого ЗаказПокупателя ИЗ МассивЗаказов Цикл
		НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
		НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован;
		НоваяЗапись.ПринудительнаяБлокировка = Истина;
		НаборЗаписей.Записать();
		Если ВыполнятьРассылку Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", ЗаказПокупателя.Контрагент);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Перечисления.абс_СтатусыЗадолженности.Разблокирован);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуПолитическойБлокировкиЗаказа(СтруктураПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БлокировкаРазблокированных(Команда)
	Если Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ЗаблокированныеЗаказы1.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ЗаблокированныеЗаказы1.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокированныеЗаблокироватьЗаказСервер(МассивЗаказов);
	
	Элементы.ЗаблокированныеЗаказы1.Обновить();
	Элементы.Заказы.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеЗаблокированных(Команда)
	Элементы.ЗаблокированныеЗаказы1.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПринудительнаяБлокировкаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ФормаЗаказа = Элементы.ПринудительнаяБлокировкаЗаказов.ТекущиеДанные.ЗаказПокупателя.ПолучитьФорму();
	ФормаЗаказа.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокированныеЗаказы1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ФормаЗаказа = Элементы.ЗаблокированныеЗаказы1.ТекущиеДанные.ЗаказПокупателя.ПолучитьФорму();
	ФормаЗаказа.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПринРазблокироватьЗаказБезРассылки(Команда)
	
	Если Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	
	Для каждого НомерСтроки из Элементы.ПринудительнаяБлокировкаЗаказов.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(Элементы.ПринудительнаяБлокировкаЗаказов.ДанныеСтроки(НомерСтроки).ЗаказПокупателя);
	КонецЦикла;
	
	РазблокироватьЗаказСервер(МассивЗаказов, Ложь);
	
	Элементы.ПринудительнаяБлокировкаЗаказов.Обновить();

	
КонецПроцедуры

&НаКлиенте
Процедура ПереформированиеРазослать_STOP_листа(Команда)
	абс_РегламентныеЗадания.абс_ОбработкаСтопЛиста();
	абс_РегламентныеЗадания.абс_РассылкаСтопЛиста();
КонецПроцедуры

//-Лаврухин 16.02.2015




