
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по согласованию:
	
	//Если используется механизм согласования документов , и документ еще не прошел по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	//Если Состояние = Перечисления.СостоянияОбъектов.Отклонен или Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку 
	//	ИЛИ НЕ ЗначениеЗаполнено(Состояние) Тогда
	//		//Ответ = Вопрос("Отправить на согласование?",РежимДиалогаВопрос.ДаНет);
	//	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	 Состояние = Перечисления.СостоянияОбъектов.Подготовлен; 
	//   // КонецЕсли;
	//КонецЕсли;

	
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(ДоговорКонтрагента.Организация,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ЗаявкаНаАкцию,Дата) Тогда
		Если Состояние = Перечисления.СостоянияОбъектов.Подготовлен Тогда
			Запрос = Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние = Перечисления.СостоянияОбъектов.Отклонен или Выборка.Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку Тогда
					МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Подразделение,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ЗаявкаНаАкцию);
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					// Повторно
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.Активность = Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
					НоваяЗапись.Этап = МаршрутСогласования;
					НоваяЗапись.ТекущийЭтап = "Начальный";
					НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
					Попытка
					   НоваяЗапись.Комментарий = ДополнительныеСвойства.КомментарийИнициатора;
				    Исключение
					КонецПопытки;   
					НаборЗаписейСостояниеСогласования.Записать();
					ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
					ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования,НоваяЗапись.Состояние);

					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Документ уже пошел по маршруту согласования
			Возврат;
		КонецЕсли;
		МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Подразделение,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ЗаявкаНаАкцию);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить новый маршрут согласования документа", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		 
                //Первый раз
                НаборЗаписейСостояниеСогласования.Очистить();
				НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
				
				НоваяЗапись.Период = ТекущаяДата();
				НоваяЗапись.Активность = Истина;
				НоваяЗапись.ДокументДляСогласования = Ссылка;
				НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				НоваяЗапись.Этап = МаршрутСогласования;
				НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
				НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
				НоваяЗапись.ТекущийЭтап = "Начальный";
				НаборЗаписейСостояниеСогласования.Записать();
				ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
				ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования,НоваяЗапись.Состояние);
			
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Состояние = Перечисления.СостоянияОбъектов.ПустаяСсылка();
	ЭтапСогласования = справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	УровеньСогласования = 0;
	НомерТма = "";
	Номер = "";
	ВыполненРасчет = Ложь;
	Ответственный = Справочники.Пользователи.ПустаяСсылка();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ВыполненРасчет Тогда
         Сообщить("Документ не рассчитан! Возможна только запись документа");
		 РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;	 
	
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Состояние = Перечисления.СостоянияОбъектов.Отклонен или Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку 
		     ИЛИ НЕ ЗначениеЗаполнено(Состояние) Тогда
		      Состояние = Перечисления.СостоянияОбъектов.Подготовлен; 
	    КонецЕсли;
	КонецЕсли;
	
	// проверка заполнения
	Если НЕ ЗначениеЗаполнено(МенеджерРег) Тогда
		Сообщить("Необходимо заполнить реквезит - МЕНЕДЖЕР",30);
		Отказ	=	Истина;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный	=	ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;  
	Если Ответственный=Справочники.Пользователи.ПустаяСсылка() Тогда
		Ответственный	=	Справочники.Пользователи.НайтиПоНаименованию("Тимонина Светлана Николаевна");
	КонецЕсли;  
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.  
КонецПроцедуры
