////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьЭлементСправочникаЛеоПараметрыОбменаЛоджикЛайн();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЭлементСправочникаЛеоПараметрыОбменаЛоджикЛайн () Экспорт
	
	Объект.ПараметрыПоУмолчанию 		= Справочники.абс_ПараметрыОбменаЛогистика.ЛоджикЛайн;
	
	Объект.ДатаОтгрузки 				= ТекущаяДата()+ 86400 ;
	Объект.ТипЦеныЗалоговаяСтоимость 	= Объект.ПараметрыПоУмолчанию.ТипЦеныЗалоговая;
	
	Объект.Организация 					= Объект.ПараметрыПоУмолчанию.Организация;
	Объект.Склад						= Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
	
	Объект.ВыгрузкаНакладныхПоСериям			= Истина;
	Объект.ВыгрузкаПриходовПоСериям				= Истина;
	Объект.ИмпортОперативныхОстатковПоСериям 	= Истина;
	
КонецПроцедуры

&НаСервере
Функция СформироватьИмяФайла(Имя,Каталог,Дата,Организация = Неопределено)
	
	Если НЕ Организация = Неопределено Тогда
		Имя = Имя + "_" + СокрЛП(Организация.Префикс);
	КонецЕсли;
	
	ИмяДата =  Формат(Дата,"ДЛФ=D");
	ИмяВремя = Формат(ТекущаяДата(),"ДЛФ=T");
	ИмяФайла =	СтрЗаменить(Имя + "_"+ ИмяДата + "_" + ИмяВремя ,".","_");  
	ИмяФайла =	СтрЗаменить(ИмяФайла," ","_");
	ИмяФайла =	СтрЗаменить(ИмяФайла,":","_");
	ИмяФайла = Каталог + "\" + ИмяФайла +".xls";
	
	Возврат ИмяФайла;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла)
	
	ВыгруженоУспешно = Ложь;
	
	Попытка
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		
		ВыгруженоУспешно = Истина;
	Исключение 
		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если ВыгруженоУспешно Тогда
		Предупреждение("Файл выгрузки успешно сформирован!");
	Иначе
		Предупреждение("Произошла ошибка при записи файла, файл выгрузки не сформирован!");
	КонецЕсли;	
	
	Возврат ВыгруженоУспешно;
	
КонецФункции

&НаКлиенте
Процедура ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(ТабличнаяЧасть, ПризнакВыгружать);
	
	Для Каждого Стр Из ТабличнаяЧасть Цикл
		
		Стр.Выгружать = ПризнакВыгружать;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуИзСтроки(Стр)
	Д = Дата("00010101000000");
	Если ПустаяСтрока(Стр) Тогда
		Возврат Д;
	КонецЕсли;
	
	Если Найти(Стр,".")>0 Тогда
		Если Найти(Стр,":")>0 И Найти(Стр," ")>0 Тогда 
			М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
			Возврат ПолучитьДатуИзСтроки(М[0]);
		КонецЕсли;
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,".");
	ИначеЕсли Найти(Стр,"/")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"/");
	ИначеЕсли Найти(Стр,",")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,",");
	ИначеЕсли Найти(Стр,"-")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"-");
	КонецЕсли;
	
	Попытка
		Если М.Количество()=3 Тогда //"01.02.13" или "01.02.2013"
			Год = ?(СтрДлина(М[2])=2,2000+М[2],М[2]);
			Д = Дата(Год,М[1],М[0]);
		ИначеЕсли М.Количество()=2 Тогда //"02.13" или "02.2013";
			Год = ?(СтрДлина(М[1])=2,2000+М[1],М[1]);
			Д = Дата(Год,М[0],1);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Д;
КонецФункции

&НаСервере
Функция ЛогированиеФайлЛога()
	
	ИмяФайла = "ЛогОбмена_" + Формат(ТекущаяДата(),"ДФ=гг_ММ_д") +".txt";
	
	КаталогЛога = Объект.ПараметрыПоУмолчанию.ПутьКЛогФайлу;
	Если КаталогЛога = "" Тогда
		КаталогЛога = КаталогВременныхФайлов();
	КонецЕсли;
	ТекстЛога = Новый ЗаписьТекста(КаталогЛога + "\" + ИмяФайла, КодировкаТекста.UTF16,,Истина,);
	Возврат  ТекстЛога;
	
КонецФункции

&НаСервере
Функция ЗагрузитьМетодом_ExcelApplication(Знач ИмяФайла, ПерваяСтрокаЗаголовки = Истина, НачалоСтрокДанных = 2, ТекстЛога = Неопределено) Экспорт
	
	
	Перем оЕ, Книга, Лист;                  
	
	// создаем объект Excel
	Попытка
		оЕ = Новый COMОбъект("Excel.Application");
	Исключение
		мСообщениеПользователю("Ошибка запуска Excel: " + ОписаниеОшибки(), ТекстЛога);
		
		оЕ = Неопределено;
		
		Возврат Неопределено;
	КонецПопытки;
	
	// открываем файл
	Попытка
		Книга = оЕ.Workbooks.Open(ИмяФайла);
	Исключение
		мСообщениеПользователю("Ошибка открытия файла " + ИмяФайла + ": " + ОписаниеОшибки(), ТекстЛога);
		
		Книга 		= Неопределено;
		
		оЕ.Quit();
		оЕ 			= Неопределено;
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	// получаем данные листа 1
	Попытка
		Лист = Книга.Worksheets(1);
		
		КоличествоСтрок 	= Лист.UsedRange.Rows.Count;
		КоличествоКолонок 	= Лист.UsedRange.Columns.Count;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		Для Сч = 1 По КоличествоКолонок Цикл
			Если ПерваяСтрокаЗаголовки Тогда
				Колонка = ТаблицаРезультат.Колонки.Добавить(Строка(Лист.Cells(1,Сч).Value));
				Колонка.Заголовок = Строка(Лист.Cells(1,Сч).Value);
			Иначе
				Колонка = ТаблицаРезультат.Колонки.Добавить("Колонка"+СтрЗаменить(Строка(Сч),Символы.НПП,""));
			КонецЕсли;
		КонецЦикла;
		
		ПерваяСтрока = НачалоСтрокДанных;//?(ПерваяСтрокаЗаголовки,2,1);
		
		МассивДанных = Лист.Range(Лист.Cells(ПерваяСтрока,1),Лист.Cells(КоличествоСтрок,КоличествоКолонок)).Value.Unload();
		
		Лист 		= Неопределено;
		Книга 		= Неопределено;
		
		оЕ.Quit();
		оЕ 			= Неопределено;
		
		Для Сч = ПерваяСтрока По КоличествоСтрок Цикл
			ТаблицаРезультат.Добавить();
		КонецЦикла;
		
		Для Сч = 0 По КоличествоКолонок-1 Цикл
			ТаблицаРезультат.ЗагрузитьКолонку(МассивДанных[Сч],Сч);
		КонецЦикла;
		
		//Для Каждого Строка из ТаблицаРезультат Цикл
		//	Если ТипЗнч(Строка.Колонка1) = Тип("Число") Тогда
		//		Строка.Колонка1 = Строка(Формат(Строка.Колонка1, "ЧГ=0"));
		//	КонецЕсли;
		//КонецЦикла;
		
		Возврат ТаблицаРезультат;
		
	Исключение
		
		мСообщениеПользователю("Ошибка загрузки данных: " + ОписаниеОшибки(), ТекстЛога);
		
		Лист 		= Неопределено;
		Книга 		= Неопределено;
		
		оЕ.Quit();
		оЕ 			= Неопределено;
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ КОНТРАГЕНТЫ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ClientsКнопкаВыделитьВсе(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.Clients, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ClientsКнопкаСнятьВыделение(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.Clients, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокКонтрагентов(Команда)
	
	СформироватьЗапросClients();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСписокКонтрагентов(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуКонтрагенты;
	
	ИмяФайла = СформироватьИмяФайла("Clients",Каталог,ТекущаяДата());
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = ВыгрузкаClientsВТабДок("Clients");
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
		
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Процедура СформироватьЗапросClients()
	
	спБизнесРегионов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.БизнесРегионы Цикл
		спБизнесРегионов.Добавить(СтрокаТЧ.БизнесРегион);	
	КонецЦикла;
	
	Объект.Clients.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК UrAdr,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ЮрАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК FactAdres,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ФактАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК PHONE,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Телефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК КодТТП
	|ПОМЕСТИТЬ ВТ_КодыТТП
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_KODSETI)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК КодПокупателя
	|ПОМЕСТИТЬ ВТ_КодыПокупателей
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_КодПокупателя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.НаименованиеПолное
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.НаименованиеПолное
	|	КОНЕЦ КАК NAMEKOR,
	|	Контрагенты.КодПоОКПО КАК OKPO,
	|	Контрагенты.ИНН КАК INN,
	|	Контрагенты.КПП КАК KPP,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.Код
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.Код
	|	КОНЕЦ КАК BIK,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.Наименование
	|	КОНЕЦ КАК Bank,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.НомерСчета
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.НомерСчета
	|	КОНЕЦ КАК RaschSchet,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.КоррСчет
	|	КОНЕЦ КАК KorrSchet,
	|	ИСТИНА КАК Выгружать,
	|	Контрагенты.Ссылка,
	|	ЕСТЬNULL(ВТ_ФактАдреса.FactAdres, ВТ_ФактАдресаГоловнойКонтрагент.FactAdres) КАК FactAdres,
	|	ЕСТЬNULL(ВТ_ЮрАдреса.UrAdr, ВТ_ЮрАдресаГоловнойКонтрагент.UrAdr) КАК UrAdr,
	|	ВТ_Телефон.PHONE,
	|	ВЫБОР
	|		КОГДА ВТ_КодыТТП.КодТТП ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_КодыТТПГоловнойКонтрагент.КодТТП ЕСТЬ NULL 
	|						ТОГДА Контрагенты.ГоловнойКонтрагент.Код
	|					ИНАЧЕ ВТ_КодыТТПГоловнойКонтрагент.КодТТП
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_КодыТТП.КодТТП
	|	КОНЕЦ КАК KODSETI,
	|	Контрагенты.ИНН + ""/"" + ЕСТЬNULL(ВТ_КодыПокупателей.КодПокупателя, Контрагенты.Код) КАК KODKOR
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮрАдреса КАК ВТ_ЮрАдреса
	|		ПО Контрагенты.Ссылка = ВТ_ЮрАдреса.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФактАдреса КАК ВТ_ФактАдреса
	|		ПО Контрагенты.Ссылка = ВТ_ФактАдреса.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Телефон КАК ВТ_Телефон
	|		ПО Контрагенты.Ссылка = ВТ_Телефон.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыТТП КАК ВТ_КодыТТП
	|		ПО Контрагенты.Ссылка = ВТ_КодыТТП.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыТТП КАК ВТ_КодыТТПГоловнойКонтрагент
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_КодыТТПГоловнойКонтрагент.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыПокупателей КАК ВТ_КодыПокупателей
	|		ПО Контрагенты.Ссылка = ВТ_КодыПокупателей.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮрАдреса КАК ВТ_ЮрАдресаГоловнойКонтрагент
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_ЮрАдресаГоловнойКонтрагент.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФактАдреса КАК ВТ_ФактАдресаГоловнойКонтрагент
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_ФактАдресаГоловнойКонтрагент.Контрагент
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоБизнесРегиону = ИСТИНА
	|				ТОГДА Контрагенты.Регион В ИЕРАРХИИ (&БизнесРегион)
	|						ИЛИ Контрагенты.ГоловнойКонтрагент.Регион В ИЕРАРХИИ (&БизнесРегион)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &БезОтбораПоСтатусуКонтрагента
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Контрагенты.абс_СтатусКонтрагента В (&Статус)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.Наименование";
	
	Запрос.УстановитьПараметр("БизнесРегион"					, спБизнесРегионов);
	Запрос.УстановитьПараметр("Статус"							, Объект.СтатусКонтрагента);
	Запрос.УстановитьПараметр("ОтборПоБизнесРегиону"			, НЕ спБизнесРегионов.Количество() = 0 );
	Запрос.УстановитьПараметр("БезОтбораПоСтатусуКонтрагента"	, Объект.БезОтбораПоСтатусуКонтрагента);
	
	Результат = Запрос.Выполнить();
	
	ТзClients = Результат.Выгрузить();
	
	Для каждого СтрокаТЗ из ТзClients Цикл
		
		Контрагент = СтрокаТЗ.Ссылка;
		
		Если ЗначениеЗаполнено(Контрагент.абс_KodKorУТ) Тогда
			СтрокаТЗ.KodKor = Контрагент.абс_KodKorУТ;
		ИначеЕсли ЗначениеЗаполнено(Контрагент.ГоловнойКонтрагент.абс_KodKorУТ) Тогда
			СтрокаТЗ.KodKor = Контрагент.ГоловнойКонтрагент.абс_KodKorУТ;
		КонецЕсли;
		Если ЗначениеЗаполнено(Контрагент.абс_KodSeti) Тогда
			СтрокаТЗ.KODSETI = Контрагент.абс_KodSeti;
		ИначеЕсли ЗначениеЗаполнено(Контрагент.ГоловнойКонтрагент.абс_KodSeti) Тогда
			СтрокаТЗ.KODSETI = Контрагент.ГоловнойКонтрагент.абс_KodSeti;
		КонецЕсли;		
		
	КонецЦикла;
	
	Объект.Clients.Загрузить(ТзClients);	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаClientsВТабДок(ИмяМакета)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров 		= Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	СтрокиКВыгрузке = Объект.Clients.НайтиСтроки(Новый Структура("Выгружать", Истина));
	
	Для Каждого Стр Из СтрокиКВыгрузке Цикл
		
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ НОМЕНКЛАТУРА
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура AssortКнопкаВыделитьВсе(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.Assort, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура AssortКнопкаСнятьВыделение(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.Assort, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокНоменклатуры(Команда)
	
	СформироватьЗапросAssort();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНоменклатуру(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуАсортимент;
	
	ИмяФайла = СформироватьИмяФайла("Assort",Каталог,ТекущаяДата());
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = ВыгрузкаAssortВТабДок("Assort");
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНоменклатуруКонтрагентов(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуАсортимент;
	
	ИмяФайла = СформироватьИмяФайла("AssCost",Каталог,ТекущаяДата());
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = СформироватьЗапросAssCost();
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
		
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Функция СформироватьЗапросAssort()
	
	//Выгружаем номенклатуру из групп.
	спГруппНоменклатуры = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.ГруппыНоменклатуры Цикл
		спГруппНоменклатуры.Добавить(СтрокаТЧ.ГруппаНоменклатуры);		
	КонецЦикла;
	
	спНоменклатура = новый Массив;
	Для каждого СтрокаТЧ из Объект.СписокНоменклатур Цикл
		спНоменклатура.Добавить(СтрокаТЧ.Номенклатура);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Номенклатура,
	|	ЗначенияСвойствОбъектов.Значение КАК СрокГодности
	|ПОМЕСТИТЬ ВТ_СрокГодности
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
	|	Штрихкоды.ЕдиницаИзмерения.Вес КАК Вес,
	|	Штрихкоды.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И Штрихкоды.СерияНоменклатуры = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
	|	И Штрихкоды.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения.Вес,
	|	Штрихкоды.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ТипЦен = &ТипЦены) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕдиницыИзмерения.Владелец,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕдиницыИзмерения.Наименование) КАК Наименование,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору,
	|	МАКСИМУМ(ЕдиницыИзмерения.Вес) КАК Вес,
	|	МАКСИМУМ(ЕдиницыИзмерения.ВесНетто) КАК ВесНетто,
	|	МАКСИМУМ(ЕдиницыИзмерения.Объем) КАК Объем,
	|	МАКСИМУМ(ЕдиницыИзмерения.Коэффициент) КАК Коэффициент,
	|	МАКСИМУМ(ЕдиницыИзмерения.ПорогОкругления) КАК ПорогОкругления,
	|	МАКСИМУМ(ЕдиницыИзмерения.абс_Высота) КАК абс_Высота,
	|	МАКСИМУМ(ЕдиницыИзмерения.абс_Глубина) КАК абс_Глубина,
	|	МАКСИМУМ(ЕдиницыИзмерения.абс_Ширина) КАК абс_Ширина,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕдиницыИзмерения.абс_ЛинейныеРазмерыПредставление) КАК абс_ЛинейныеРазмерыПредставление
	|ПОМЕСТИТЬ ВТ_ЕдИзмПалет
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование = ""паллет""
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕдиницыИзмерения.Владелец,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Артикул КАК KodAss,
	|	СпрНоменклатура.НаименованиеПолное КАК NameAss,
	|	ВТ_Штрихкоды.Штрихкод КАК EAN13,
	|	СпрНоменклатура.ЕдиницаИзмеренияМест.Коэффициент КАК Fasovka,
	|	ВТ_ЕдИзмПалет.Коэффициент КАК FasovkaP,
	|	0 КАК EdIzm,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ СпрНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18
	|		КОГДА СпрНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ СпрНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА СпрНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|				ИЛИ СпрНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК StavNDS,
	|	643 КАК IdCountry,
	|	СпрНоменклатура.ЕдиницаИзмеренияМест.Вес * 10000 КАК Brutto,
	|	ВТ_Цены.Цена КАК PRICE,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ЕдиницаИзмеренияМест.ВесНетто > 0
	|			ТОГДА СпрНоменклатура.ЕдиницаИзмеренияМест.ВесНетто * 10000
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаИзмеренияМест.Вес * 10000
	|	КОНЕЦ КАК Massa,
	|	СпрНоменклатура.Ссылка,
	|	ВЫРАЗИТЬ((ВЫРАЗИТЬ(ВТ_СрокГодности.СрокГодности КАК ЧИСЛО(15, 2))) * 30.4 КАК ЧИСЛО(15, 2)) КАК Realiz,
	|	ИСТИНА КАК Выгружать
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ПО СпрНоменклатура.Ссылка = ВТ_Штрихкоды.Номенклатура
	|			И СпрНоменклатура.ЕдиницаХраненияОстатков = ВТ_Штрихкоды.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО СпрНоменклатура.Ссылка = ВТ_Цены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокГодности КАК ВТ_СрокГодности
	|		ПО СпрНоменклатура.Ссылка = ВТ_СрокГодности.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдИзмПалет КАК ВТ_ЕдИзмПалет
	|		ПО СпрНоменклатура.Ссылка = ВТ_ЕдИзмПалет.Владелец
	|ГДЕ
	|	СпрНоменклатура.Артикул <> """"
	|	И СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	|	//УСЛОВИЕ ГРУППЫ
	|	//УСЛОВИЕ НОМЕНКЛАТУРА
	|	И ВЫБОР
	|			КОГДА &БезОтбораПоСтатусу = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СпрНоменклатура.абс_СтатусНоменклатуры В (&Статус)
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТипЦены"				, Объект.ТипЦеныЗалоговаяСтоимость);
	Запрос.УстановитьПараметр("ТекущаяДата"			, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("БезОтбораПоСтатусу"	, Объект.БезОтбораПоСтатусуНоменклатуры);
	Запрос.УстановитьПараметр("Статус"				, Объект.СтатусНоменклатуры);
	
	Если спГруппНоменклатуры.Количество() > 0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ ГРУППЫ", "И СпрНоменклатура.Ссылка В ИЕРАРХИИ(&СписокГруппНоменклатуры)"); 
		Запрос.УстановитьПараметр("СписокГруппНоменклатуры", спГруппНоменклатуры);
	КонецЕсли;
	
	Если спНоменклатура.Количество() > 0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ НОМЕНКЛАТУРА", "И СпрНоменклатура.Ссылка В (&СписокНоменклатуры)"); 
		Запрос.УстановитьПараметр("СписокНоменклатуры", спНоменклатура);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ТзAssort = Результат.Выгрузить();
	
	Объект.Assort.Загрузить(ТзAssort);
	
КонецФункции

&НаСервере
Функция СформироватьЗапросAssCost()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК КодТТП
	|ПОМЕСТИТЬ ВТ_КодыТТП
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_КодПокупателя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Артикул КАК KodAss,
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства КАК KodAssSeti,
	|	0 КАК Cost,
	|	ВЫБОР
	|		КОГДА ВТ_КодыТТП.КодТТП ЕСТЬ NULL 
	|			ТОГДА абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент.Код
	|		ИНАЧЕ абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент.Код + ""/"" + ВТ_КодыТТП.КодТТП
	|	КОНЕЦ КАК KodSeti
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(, Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя)) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыТТП КАК ВТ_КодыТТП
	|		ПО абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент = ВТ_КодыТТП.Контрагент
	|ГДЕ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Артикул <> """"");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("AssCost");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого Стр Из Результат Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	
	Возврат ТабДок;	
	
КонецФункции

&НаСервере
Функция ВыгрузкаAssortВТабДок(ИмяМакета);
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
	СтрокиКВыгрузке = Объект.Assort.НайтиСтроки(Новый Структура("Выгружать", Истина));
	
	Для Каждого Стр Из СтрокиКВыгрузке Цикл
		
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ НАКЛАДНЫЕ И ЗАКАЗЫ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ПодобратьЗаказы(Команда)
	
	СформироватьСписокЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРеализцииНаКлиенте(Команда)
	
	СоздатьДокументыРеализции();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСчФактуры(Команда)
	
	СформироватьСчФактурыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТаблицуЗаказов(Команда)
	
	СформироватьТаблицуNakl();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтгружен(Команда)
	
	УстановитьСтатусОтгружен_Сервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗаказы(Команда)
	
	СоздатьДокументыРеализции();
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуЗаказы;
	ИмяФайла = СформироватьИмяФайла ("Nakl",Каталог,Объект.ДатаОтгрузки,Объект.Организация);
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = ВыгрузкаNaklВТабДок();
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаказыДляРеестра(Команда)
	
	СформироватьСписокЗаказовДляРеестра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаказыДляСверки(Команда)
	
	СформироватьСписокЗаказовДляСверки();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРеестр(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуЗаказы;
	ИмяФайла = СформироватьИмяФайла ("ReestrNakl", Каталог, Объект.ДатаОтгрузки, Объект.Организация);
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;

	Табдок = ВыгрузкаReestrNaklВТабДок();

	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСверку(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуЗаказы;
	ИмяФайла = СформироватьИмяФайла ("SverkaShapok",Каталог,Объект.ДатаОтгрузки);
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = ВыгрузкаSverkaShapokВТабДок();
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовУстановтитьВсеФлаги(Команда)
	
	ЗаказыУстановитьСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовСнятьВсеФлаги(Команда)
	
	ЗаказыУстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Процедура СформироватьСписокЗаказов()
	
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Контрагент,
	|	ИСТИНА КАК Выгружать,
	|	ЗаказПокупателя.Грузополучатель КАК ТТП
	|ПОМЕСТИТЬ ДокументыЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ПоДатеОтгрузки = ИСТИНА
	|				ТОГДА ЗаказПокупателя.ДатаОтгрузки = &ДатаОтгрузки
	|			ИНАЧЕ ЗаказПокупателя.Дата МЕЖДУ &Дата1 И &Дата2
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоказатьЗакрытыеЗаказы
	|				ТОГДА ЗаказПокупателя.абс_Статус В (&СписокСтатусовЗакрыто)
	|			ИНАЧЕ ЗаказПокупателя.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.КОтгрузке)
	|		КОНЕЦ
	|	И ЗаказПокупателя.Организация = &Организация
	|	И ЗаказПокупателя.СкладГруппа = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.Сделка = ДокументыЗаказы.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(СчетФактураВыданный.Ссылка) КАК Ссылка,
	|	СчетФактураВыданный.ДокументОснование
	|ПОМЕСТИТЬ ВтСчетФактура
	|ИЗ
	|	ДокументыРеализации КАК ДокументыРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ДокументыРеализации.Ссылка = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЗаказы.Ссылка КАК ДокументЗаказ,
	|	ДокументыЗаказы.Контрагент,
	|	ДокументыЗаказы.Выгружать,
	|	ДокументыЗаказы.ТТП,
	|	ДокументыРеализации.Ссылка КАК ДокументРеализация,
	|	ДокументыЗаказы.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ВтСчетФактура.Ссылка КАК ДокументСчетФактура
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтСчетФактура КАК ВтСчетФактура
	|			ПО ДокументыРеализации.Ссылка = ВтСчетФактура.ДокументОснование
	|		ПО ДокументыЗаказы.Ссылка = ДокументыРеализации.Ссылка.Сделка";	
	
	ЗапросЗаказы.УстановитьПараметр("ПоказатьЗакрытыеЗаказы"	, Объект.ПоказатьЗакрытыеЗаказы);						 
	ЗапросЗаказы.УстановитьПараметр("Дата1"						, НачалоДня(Объект.НачПериода));
	ЗапросЗаказы.УстановитьПараметр("Дата2"						, КонецДня(Объект.КонПериода));
	ЗапросЗаказы.УстановитьПараметр("ДатаОтгрузки"				, НачалоДня(Объект.ДатаОтгрузки));
	ЗапросЗаказы.УстановитьПараметр("ПоДатеОтгрузки"			, Объект.ПоДатеОтгрузки);
	ЗапросЗаказы.УстановитьПараметр("Организация"				, Объект.Организация);  
	ЗапросЗаказы.УстановитьПараметр("Склад"						, Объект.Склад);  
	
	СписокСтатусовЗакрыто = Новый СписокЗначений;
	
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
	
	ЗапросЗаказы.УстановитьПараметр("СписокСтатусовЗакрыто", СписокСтатусовЗакрыто);
	
	
	ТабЗнач = ЗапросЗаказы.Выполнить().Выгрузить();
	Объект.СписокЗаказов.Загрузить(ТабЗнач);
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗаказовДляРеестра()
	
	ЗапросЗаказы = Новый Запрос( 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Контрагент,
	|	ИСТИНА КАК Выгружать,
	|	ЗаказПокупателя.Грузополучатель КАК ТТП
	|ПОМЕСТИТЬ ДокументыЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ЗаказПокупателя.ДатаОтгрузки = &ДатаОтгрузки
	|	И ЗаказПокупателя.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
	|	И ЗаказПокупателя.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыЗаказы КАК ДокументыЗаказы
	|		ПО РеализацияТоваровУслуг.Сделка = ДокументыЗаказы.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЗаказы.Ссылка КАК ДокументЗаказ,
	|	ДокументыЗаказы.Контрагент,
	|	ДокументыЗаказы.Выгружать,
	|	ДокументыЗаказы.ТТП,
	|	ДокументыРеализации.Ссылка КАК ДокументРеализация,
	|	ДокументыЗаказы.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|		ПО ДокументыЗаказы.Ссылка = ДокументыРеализации.Ссылка.Сделка");	
						 
					 
	ЗапросЗаказы.УстановитьПараметр("ДатаОтгрузки"	, НачалоДня(Объект.ДатаОтгрузки));
    ЗапросЗаказы.УстановитьПараметр("Организация"	, Объект.Организация);
	
	ТабЗнач = ЗапросЗаказы.Выполнить().Выгрузить();
	Объект.СписокЗаказов.Загрузить(ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗаказовДляСверки()
	
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Контрагент,
	|	ИСТИНА КАК Выгружать,
	|	ЗаказПокупателя.Грузополучатель КАК ТТП
	|ПОМЕСТИТЬ ДокументыЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ЗаказПокупателя.ДатаОтгрузки = &Дата1
	|	И ЗаказПокупателя.абс_Статус в (&СписокСтатусовЗакрыто)
	|	И ЗаказПокупателя.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыЗаказы КАК ДокументыЗаказы
	|		ПО РеализацияТоваровУслуг.Сделка = ДокументыЗаказы.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЗаказы.Ссылка КАК ДокументЗаказ,
	|	ДокументыЗаказы.Контрагент,
	|	ДокументыЗаказы.Выгружать,
	|	ДокументыЗаказы.ТТП,
	|	ДокументыРеализации.Ссылка КАК ДокументРеализация,
	|	ДокументыЗаказы.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|		ПО ДокументыЗаказы.Ссылка = ДокументыРеализации.Ссылка.Сделка";	
	
	
	ЗапросЗаказы.УстановитьПараметр("Дата1"			, НачалоДня(Объект.ДатаОтгрузки));
	ЗапросЗаказы.УстановитьПараметр("Организация"	, Объект.ПараметрыПоУмолчанию.Организация);
	СписокСтатусовЗакрыто = Новый СписокЗначений;
	
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
	
	ЗапросЗаказы.УстановитьПараметр("СписокСтатусовЗакрыто", СписокСтатусовЗакрыто);
	ТабЗнач = ЗапросЗаказы.Выполнить().Выгрузить();
	Объект.СписокЗаказов.Загрузить(ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура ЗаказыУстановитьСнятьФлажки(Флаг);
	
	НайденныеСтроки = Объект.СписокЗаказов.НайтиСтроки(Новый Структура("Выгружать", Не Флаг));
	
	Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		НайденнаяСтрока.Выгружать = Флаг;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьДокументыРеализции() Экспорт
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина Тогда
			Если СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
				ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			Иначе
				Продолжить;
				//ДокументРеализация = СтрокаТЧ.ДокументРеализация.ПолучитьОбъект();
			КонецЕсли;
			ДокументРеализация.Заполнить(СтрокаТЧ.ДокументЗаказ);
			Если ЗначениеЗаполнено(СтрокаТЧ.ДокументЗаказ.ДатаОтгрузки) Тогда
				ДокументРеализация.Дата = КонецДня(СтрокаТЧ.ДокументЗаказ.ДатаОтгрузки);
			Иначе
				ДокументРеализация.Дата=ТекущаяДата();
			КонецЕсли;
			// Сначала запишем документ, затем проведем
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			СтрокаТЧ.ДокументРеализация = ДокументРеализация.Ссылка;
			Сообщить ("Создан документ ""Реализация товаров и услуг "" №" + ДокументРеализация.Номер + " от " + ДокументРеализация.Дата);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСчФактурыСервер()
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и СтрокаТЧ.ДокументСчетФактура = Документы.СчетФактураВыданный.ПустаяСсылка() и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка()  Тогда
			
			ДокументьСчФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
			ДокументьСчФактура.Заполнить(СтрокаТЧ.ДокументРеализация);
			//Сначала запишем документ, потом проведем
			ДокументьСчФактура.Записать(РежимЗаписиДокумента.Запись);
			ДокументьСчФактура.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаТЧ.ДокументСчетФактура = ДокументьСчФактура.Ссылка;
			Сообщить ("Создан документ ""Счет-фактура выданный "" №" + ДокументьСчФактура.Номер + " от " + ДокументьСчФактура.Дата);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВыгрузкаNaklВТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Nakl");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого Стр Из Объект.Nakl Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ВыгрузкаReestrNaklВТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ReestrNakl");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
    ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
    спДокументов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			спДокументов.Добавить(СтрокаТЧ.ДокументЗаказ);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК ЗаказСсылка,
	|	СУММА(ЗаказПокупателяТовары.КоличествоМест * ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Вес) КАК ОбщийВес,
	|	СУММА(ЗаказПокупателяТовары.КоличествоМест) КАК КоличествоМест,
	|	СУММА(ЗаказПокупателяТовары.Количество) КАК КоличествоШт,
	|	СУММА(ЗаказПокупателяТовары.КоличествоМест * ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Объем) КАК ОбщийОбъем,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА ЗаказПокупателяТовары.Сумма
	|			ИНАЧЕ ЗаказПокупателяТовары.Сумма + ЗаказПокупателяТовары.СуммаНДС
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ДанныеПоТоварамЗаказов
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&СпДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателя.ДатаОтгрузки КАК ДатаПоставки,
	|	ЗаказПокупателя.Ссылка КАК ЗаказСсылка,
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
	|	ЗаказПокупателя.Контрагент.НаименованиеПолное КАК ИмяПолучателя,
	|	"""" КАК АдресГрузополучателя,
	|	"""" КАК АдресДоставки,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.ОбщийВес, 0) КАК ОбщийВес,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.КоличествоШт, 0) КАК КоличествоШт,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.ОбщийОбъем, 0) КАК ОбщийОбъем,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.Сумма, 0) КАК Сумма,
	|	ЗаказПокупателя.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Сделка = ЗаказПокупателя.Ссылка
	|			И (РеализацияТоваровУслуг.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоТоварамЗаказов КАК ВТ_ДанныеПоТоварамЗаказов
	|		ПО (ЗаказПокупателя.Ссылка = ВТ_ДанныеПоТоварамЗаказов.ЗаказСсылка)
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&СпДокументов)");
		
    Запрос.УстановитьПараметр("спДокументов", спДокументов);
	Результат = Запрос.Выполнить();

	ТзReestrNakl = Результат.Выгрузить();

	Для Каждого Стр Из ТзReestrNakl Цикл
		
		ОбластьПараметров.Параметры.Заполнить(Стр);
		
		ОбластьПараметров.Параметры.НомерЗаказа = ОбщегоНазначения.ПолучитьНомерНаПечать(Стр.ЗаказСсылка);
		ОбластьПараметров.Параметры.НомерНакладной = ОбщегоНазначения.ПолучитьНомерНаПечать(Стр.РеализацияСсылка);
		
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	
    Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ВыгрузкаSverkaShapokВТабДок()
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("SverkaShapok");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
	спДокументов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			спДокументов.Добавить(СтрокаТЧ.ДокументЗаказ);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.Дата КАК ДатаПоставки,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, """") КАК НомерНакладной,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент.Код КАК КодКонтрагента,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Вес, 0) * ЗаказПокупателяТовары.КоличествоМест КАК ОбщийВес,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА ЗаказПокупателяТовары.Сумма
	|		ИНАЧЕ ЗаказПокупателяТовары.Сумма + ЗаказПокупателяТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ЗаказПокупателяТовары.Ссылка = РеализацияТоваровУслуг.Сделка
	|			И (РеализацияТоваровУслуг.Проведен)
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтБезГруппировки.ДатаПоставки КАК DATEDOC,
	|	ВтБезГруппировки.НомерНакладной КАК NUMDOC,
	|	1 КАК TYPEDOC,
	|	ВтБезГруппировки.КодКонтрагента КАК KODKONTR,
	|	СУММА(ВтБезГруппировки.Сумма) КАК SUMDOCNDS,
	|	СУММА(ВтБезГруппировки.ОбщийВес) КАК MASSA
	|ИЗ
	|	ВТ_Данные КАК ВтБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтБезГруппировки.ДатаПоставки,
	|	ВтБезГруппировки.НомерНакладной,
	|	ВтБезГруппировки.КодКонтрагента";
	
	Запрос.УстановитьПараметр("спДокументов", спДокументов);
	Результат = Запрос.Выполнить();
	
	ТзReestrNakl = Результат.Выгрузить();
	
	Для Каждого Стр Из ТзReestrNakl Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	Возврат ТабДок;	
КонецФункции

&НаСервере
Процедура СформироватьТаблицуNakl()
	
	спДокументов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			спДокументов.Добавить(СтрокаТЧ.ДокументЗаказ);
		КонецЕсли;	
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК КодТТП
	|ПОМЕСТИТЬ ВТ_КодыТТП
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_КодПокупателя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(16)) КАК НомерМагазина
	|ПОМЕСТИТЬ ВТ_НомерМагазина
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер КАК НомерРеализации,
	|	РеализацияТоваровУслуг.Сделка КАК ЗаказПокупателя,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Сделка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Номер КАК НомерСчетФактуры,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	ВТ_Реализация.Реализация
	|ПОМЕСТИТЬ ВТ_СчетФактура
	|ИЗ
	|	ВТ_Реализация КАК ВТ_Реализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ВТ_Реализация.Реализация = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК ЗаказСсылка,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПокупателяТовары.Ссылка.Грузополучатель КАК Грузополучатель,
	|	ЗаказПокупателяТовары.Ссылка.Номер КАК NomZak,
	|	ЗаказПокупателяТовары.Ссылка.Дата КАК DataZak,
	|	ЗаказПокупателяТовары.Номенклатура.Артикул КАК Kodass,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяТовары.Сумма / ЗаказПокупателяТовары.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Price,
	|	ЗаказПокупателяТовары.Количество КАК Kolich,
	|	ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки КАК Data,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.Наименование КАК NOM_DOG,
	|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.Дата КАК DATA_DOG,
	|	ЗаказПокупателяТовары.НомерСтроки КАК POS,
	|	ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Коэффициент КАК FasPromezh,
	|	ЗаказПокупателяТовары.Ссылка.НомерПоДаннымПокупателя КАК Zayavka,
	|	1 КАК NaklType,
	|	1 КАК State,
	|	1 КАК FST,
	|	""шт"" КАК EDIZMREAL,
	|	ЗаказПокупателяТовары.Ссылка.АдресДоставки КАК G_AdrDost,
	|	ЗаказПокупателяТовары.СерияНоменклатуры.абс_ДатаПроизводства КАК NomPart,
	|	ЗаказПокупателяТовары.СерияНоменклатуры.абс_ДатаПроизводства КАК MarkirData,
	|	ЗаказПокупателяТовары.СерияНоменклатуры.абс_УдостоверениеКачества.Номер КАК NomUdostK,
	|	ЗаказПокупателяТовары.СерияНоменклатуры.СрокГодности КАК SrokRealiz,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК ПолныйСрокГодности
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара))
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200)) КАК АдресДоставки,
	|	ЗаказПокупателя.Контрагент,
	|	ЕСТЬNULL(КонтактнаяИнформация.абс_ДатаАктуальностиКИ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаАктуальности
	|ПОМЕСТИТЬ АдресаДоставкиСДатами
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаказПокупателя.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = &Вид)
	|			И (КонтактнаяИнформация.Тип = &Тип)
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаДоставкиСДатами.Контрагент,
	|	МАКСИМУМ(АдресаДоставкиСДатами.ДатаАктуальности) КАК ДатаАктуальности
	|ПОМЕСТИТЬ ДатыКИ
	|ИЗ
	|	АдресаДоставкиСДатами КАК АдресаДоставкиСДатами
	|
	|СГРУППИРОВАТЬ ПО
	|	АдресаДоставкиСДатами.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаДоставкиСДатами.Контрагент,
	|	АдресаДоставкиСДатами.АдресДоставки
	|ПОМЕСТИТЬ АдресаДоставки
	|ИЗ
	|	АдресаДоставкиСДатами КАК АдресаДоставкиСДатами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыКИ КАК ДатыКИ
	|		ПО АдресаДоставкиСДатами.Контрагент = ДатыКИ.Контрагент
	|			И АдресаДоставкиСДатами.ДатаАктуальности = ДатыКИ.ДатаАктуальности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.ЗаказСсылка КАК ЗаказСсылка,
	|	ВТ_Заказы.Контрагент,
	|	ВТ_Заказы.Грузополучатель,
	|	ВТ_Заказы.NomZak,
	|	ВТ_Заказы.DataZak,
	|	ВТ_Заказы.Kodass,
	|	ВТ_Заказы.Price,
	|	ВТ_Заказы.Kolich,
	|	ВТ_Заказы.Data,
	|	ВТ_Заказы.NOM_DOG,
	|	ВТ_Заказы.DATA_DOG,
	|	ВТ_Заказы.POS,
	|	ВТ_Заказы.FasPromezh,
	|	ВТ_Заказы.Zayavka,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.ЗаказСсылка.Грузополучатель, ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_Заказы.ЗаказСсылка.Контрагент.ИНН + ""/"" + ВТ_Заказы.ЗаказСсылка.Контрагент.Код
	|		ИНАЧЕ ВТ_Заказы.ЗаказСсылка.Грузополучатель.ИНН + ""/"" + ЕСТЬNULL(ВТ_КодыТТП.КодТТП, ВТ_Заказы.ЗаказСсылка.Грузополучатель.Код)
	|	КОНЕЦ КАК KodKor,
	|	ВТ_НомерМагазина.НомерМагазина КАК KodTT_Seti,
	|	ВТ_Заказы.NaklType,
	|	ВТ_Заказы.State,
	|	ВТ_Заказы.FST,
	|	ВТ_Заказы.EDIZMREAL,
	|	ЕСТЬNULL(ВТ_Реализация.НомерРеализации, """") КАК Nomer,
	|	ЕСТЬNULL(ВТ_СчетФактура.НомерСчетФактуры, """") КАК NomSF,
	|	"""" КАК G_Platelsh,
	|	"""" КАК G_Poluch,
	|	АдресаДоставки.АдресДоставки КАК G_AdrDost,
	|	ВТ_Реализация.Реализация КАК РеализацияСсылка,
	|	ВТ_СчетФактура.СчетФактура КАК СчетФактураСсылка,
	|	ВТ_Заказы.NomPart,
	|	ВТ_Заказы.MarkirData,
	|	ВТ_Заказы.NomUdostK,
	|	ВТ_Заказы.SrokRealiz,
	|	ВТ_Заказы.ПолныйСрокГодности
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыТТП КАК ВТ_КодыТТП
	|		ПО ВТ_Заказы.ЗаказСсылка.Грузополучатель = ВТ_КодыТТП.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомерМагазина КАК ВТ_НомерМагазина
	|		ПО ВТ_Заказы.ЗаказСсылка.Грузополучатель = ВТ_НомерМагазина.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетФактура КАК ВТ_СчетФактура
	|			ПО ВТ_Реализация.Реализация = ВТ_СчетФактура.Реализация
	|		ПО ВТ_Заказы.ЗаказСсылка = ВТ_Реализация.ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаДоставки КАК АдресаДоставки
	|		ПО ВТ_Заказы.Контрагент = АдресаДоставки.Контрагент";
	
	Запрос.УстановитьПараметр("спДокументов", спДокументов);
	//Запрос.УстановитьПараметр("ВидСвойства", Справочники.логВидыСвойствНоменклатуры.НайтиПоКоду("000000004"));
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	
	ТзNakl = Запрос.Выполнить().Выгрузить();	
	
	Объект.Nakl.Очистить();
	
	Для каждого СтрокаNakl из ТзNakl Цикл
		
		НовСтр = Объект.Nakl.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаNakl);
		
		Если ЗначениеЗаполнено(СтрокаNakl.ЗаказСсылка) Тогда
			НовСтр.NomZak 		= ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаNakl.ЗаказСсылка); 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаNakl.РеализацияСсылка) Тогда
			НовСтр.Nomer 		= ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаNakl.РеализацияСсылка); 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаNakl.СчетФактураСсылка) Тогда
			НовСтр.NomSF 		= ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаNakl.СчетФактураСсылка); 
		КонецЕсли;
		
		НовСтр.Kodass 			= СокрЛП(НовСтр.Kodass);
		
		Если Объект.ВыгрузкаНакладныхПоСериям Тогда
			НовСтр.State		= "1";
			Серия 				= Формат(СтрокаNakl.NomPart,"ДФ=dd.MM.yyyy");
			ДатаПроизводства 	= Формат(СтрокаNakl.NomPart,"ДФ=dd.MM.yy");
			Если ЗначениеЗаполнено(СтрокаNakl.NomPart) Тогда
				СрокГодности 		= (ДобавитьМесяц(СтрокаNakl.NomPart,СтрокаNakl.ПолныйСрокГодности) - СтрокаNakl.NomPart)/(60*60*24);
			Иначе
				СрокГодности = 0;
			КонецЕсли;
			
			НовСтр.NomPart		= СтрЗаменить(Серия, ".", " ");
			НовСтр.MarkirData	= ДатаПроизводства;
			НовСтр.SrokRealiz	= СрокГодности;
		Иначе
			НовСтр.State		= 0;
			НовСтр.NomPart		= "";
			НовСтр.MarkirData	= "";
			НовСтр.NomUdostK	= "";
			НовСтр.SrokRealiz	= "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаNakl.Грузополучатель.абс_KodKorУТ) Тогда
			НовСтр.KodKor = СтрокаNakl.Грузополучатель.абс_KodKorУТ;
		ИначеЕсли ЗначениеЗаполнено(СтрокаNakl.Контрагент.абс_KodKorУТ) Тогда
			НовСтр.KodKor = СтрокаNakl.Контрагент.абс_KodKorУТ;
		КонецЕсли;
		
		//+Лео Сафонов ЕА 06.08.2014
		//Если ЗначениеЗаполнено(СтрокаNakl.Грузополучатель.абс_KodSeti) Тогда
		//	НовСтр.KodTT_Seti = СтрокаNakl.Грузополучатель.абс_KodSeti;
		//ИначеЕсли ЗначениеЗаполнено(СтрокаNakl.Контрагент.абс_KodSeti) Тогда
		//	НовСтр.KodTT_Seti = СтрокаNakl.Контрагент.абс_KodSeti;
		//КонецЕсли;
		//-Лео Сафонов ЕА 06.08.2014 

		
		Если Объект.ВыгрузкаЛефЭкспо = Истина Тогда
			НовСтр.KodKor 		= Объект.Организация.ИНН + "/" + "000000000";
			НовСтр.KodTT_Seti 	= "";
		КонецЕсли;
					
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусОтгружен_Сервер()
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			ЗаменитьДатуЖелаемойОтгрузки(СтрокаТЧ.ДокументЗаказ, Перечисления.абс_СтатусыОтгрузки.Отгружен);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьДатуЖелаемойОтгрузки(ДокументЗаказ,Статус)
	ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
	ДокументОбъект.абс_Статус = Статус;
	ДокументОбъект.ДатаОтгрузки = Объект.ДатаОтгрузки;
	ДокументОбъект.Записать();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ ПЕРЕМЕЩЕНИЯ ЛЛ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура СписокПеремещенийУстановитьВсеФлаги(Команда)
	ПеремещенияУстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокПеремещенийСнятьВсеФлаги(Команда)
	ПеремещенияУстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокПеремещенийНаСкладЛЛ(Команда)
	
	СкладОтправитель =  Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
	СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
	СформироватьСписокПеремещенийЛЛ_Сервер(СкладОтправитель, СкладПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПеремещенияНаСкладЛЛ(Команда)	
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
	
	ИмяФайла = СформироватьИмяФайла("Nakl",Каталог,Объект.ДатаОтгрузки);
		
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда
			ИмяФайла =Каталог+ "\" + ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаТЗ.Перемещение) + ".xls";
			Прервать;
		Конецесли;
	КонецЦикла;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = СформироватьТабДокПеремещенияНаСкладЛЛ_Сервер();
		
	Если ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла) Тогда
		
		ПроставитьПризнакВыгруженПеремещенийЛЛ();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВозвратовСоСкладаЛЛ(Команда)
	
	СкладОтправитель =  Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
	СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
	СформироватьСписокПеремещенийЛЛ_Сервер(СкладОтправитель, СкладПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВозвратыСоСкладаЛЛ(Команда)
	
	ВидОперации = "ВозвратСоСкладаЛЛ";
	
	Если ВидОперации = "ОтгрузкаНаСкладЛЛ" Тогда
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
	ИначеЕсли ВидОперации = "ВозвратСоСкладаЛЛ" Тогда
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиВозвратыСоСклада;
	Иначе
		Возврат;
	КонецЕсли;
	
	ИмяФайла = СформироватьИмяФайла("LP",Каталог,Объект.ДатаОтгрузки);
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = СформироватьТабДокВозвратаСоСкладаЛЛ_Сервер(ВидОперации);
	
		Если ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла) Тогда
		
		ПроставитьПризнакВыгруженПеремещенийЛЛ();
		
	КонецЕсли;

КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Функция СформироватьТабДокПеремещенияНаСкладЛЛ_Сервер()
	
	спДокументов = Новый СписокЗначений;
	
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда
			спДокументов.Добавить(СтрокаТЗ.Перемещение);
		Конецесли;
	КонецЦикла;
	
	Объект.СписокПеремещений.Выгрузить().ВыгрузитьКолонку("Перемещение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК КодТТП
	|ПОМЕСТИТЬ ВТ_КодыТТП
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_КодПокупателя)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(16)) КАК НомерМагазина
	|ПОМЕСТИТЬ ВТ_НомерМагазина
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка КАК ЗаказСсылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.абс_Контрагент КАК Контрагент,
	|	ПеремещениеТоваровТовары.Ссылка.Дата КАК Data,
	|	ПеремещениеТоваровТовары.Ссылка.Номер КАК Nomer,
	|	ПеремещениеТоваровТовары.Ссылка.Номер КАК NomZak,
	|	ПеремещениеТоваровТовары.Ссылка.Дата КАК DataZak,
	|	0 КАК NaklType,
	|	1 КАК State,
	|	0 КАК FST,
	|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Kodass,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Price,
	|	ПеремещениеТоваровТовары.НомерСтроки КАК POS,
	|	ПеремещениеТоваровТовары.СерияНоменклатуры.абс_ДатаПроизводства КАК NomPart,
	|	ПеремещениеТоваровТовары.СерияНоменклатуры.абс_ДатаПроизводства КАК MarkirData,
	|	ПеремещениеТоваровТовары.СерияНоменклатуры.СрокГодности КАК SrokRealiz,
	|	ПеремещениеТоваровТовары.Количество КАК Kolich,
	|	""шт"" КАК EDIZMREAL,
	|	&ДоговорЛЛ_Номер КАК NOM_DOG,
	|	&ДоговорЛЛ_Дата КАК DATA_DOG,
	|	ЕСТЬNULL(ПеремещениеТоваровТовары.ЕдиницаИзмеренияМест.Коэффициент, 0) КАК FasPromezh,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК ПолныйСрокГодности
	|ПОМЕСТИТЬ ВТ_Перемещения
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦен, ТипЦен = &ТипЦенЗалоговая) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара))
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Перемещения.Контрагент.ИНН + ""/000000000"" КАК KodKor,
	|	ВТ_Перемещения.ЗаказСсылка,
	|	ВТ_Перемещения.Data,
	|	ВТ_Перемещения.Nomer,
	|	ВТ_Перемещения.NomZak,
	|	ВТ_Перемещения.DataZak,
	|	ВТ_Перемещения.Kodass,
	|	ВТ_Перемещения.Price,
	|	ВТ_Перемещения.Kolich,
	|	ВТ_Перемещения.NomPart,
	|	ВТ_Перемещения.MarkirData,
	|	ВТ_Перемещения.SrokRealiz,
	|	ВТ_Перемещения.NOM_DOG,
	|	ВТ_Перемещения.DATA_DOG,
	|	ВТ_Перемещения.POS,
	|	ВТ_Перемещения.FasPromezh,
	|	ЕСТЬNULL(ВТ_НомерМагазина.НомерМагазина, """") КАК KodTT_Seti,
	|	ВТ_Перемещения.NaklType,
	|	ВТ_Перемещения.State,
	|	ВТ_Перемещения.FST,
	|	ВТ_Перемещения.EDIZMREAL,
	|	ВТ_Перемещения.ПолныйСрокГодности
	|ИЗ
	|	ВТ_Перемещения КАК ВТ_Перемещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыТТП КАК ВТ_КодыТТП
	|		ПО ВТ_Перемещения.Контрагент = ВТ_КодыТТП.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомерМагазина КАК ВТ_НомерМагазина
	|		ПО ВТ_Перемещения.Контрагент = ВТ_НомерМагазина.Контрагент";
	
	Контрагент = Объект.ПараметрыПоУмолчанию.ПоступлениеКонтрагент;
	Договор = Объект.ПараметрыПоУмолчанию.ПоступлениеДоговор;
	ИНН = Контрагент.ИНН;
	
	Запрос.УстановитьПараметр("спДокументов", спДокументов);
	Запрос.УстановитьПараметр("КонтрагентЛЛ", Контрагент);
	Запрос.УстановитьПараметр("ДатаЦен", Объект.КонПериода);
	Запрос.УстановитьПараметр("ТипЦенЗалоговая", Объект.ТипЦеныЗалоговаяСтоимость);
	Запрос.УстановитьПараметр("КонтрагентЛЛ_ИНН", ИНН);
	Запрос.УстановитьПараметр("ДоговорЛЛ_Номер", Договор.Номер);
	Запрос.УстановитьПараметр("ДоговорЛЛ_Дата", Договор.Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Обработки.абс_ОбменСЛоджикЛайн.ПолучитьМакет("Nakl");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.KodKor 		= Лев(Выборка.KodKor, 25);
		ОбластьСтрока.Параметры.Data 		= Формат(Выборка.Data, "ДФ=dd.MM.yy");
		//ОбластьСтрока.Параметры.Nomer		= Лев(Выборка.Nomer, 25);
		//ОбластьСтрока.Параметры.NomZak		= Лев(Выборка.NomZak, 25);
		ОбластьСтрока.Параметры.Nomer		= ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ЗаказСсылка);
		ОбластьСтрока.Параметры.NomZak		= ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ЗаказСсылка);
		ОбластьСтрока.Параметры.DataZak 	= Формат(Выборка.DataZak, "ДФ=dd.MM.yy");
		ОбластьСтрока.Параметры.NaklType	= Формат(Выборка.NaklType, "ЧЦ=1; ЧДЦ=0; ЧН=; ЧГ=0");
		ОбластьСтрока.Параметры.State		= Формат(Выборка.State, "ЧЦ=1; ЧДЦ=0; ЧН=; ЧГ=0");
		ОбластьСтрока.Параметры.FST			= Формат(Выборка.FST, "ЧЦ=1; ЧДЦ=0; ЧН=; ЧГ=0");
		ОбластьСтрока.Параметры.KodAss		= Лев(Выборка.KodAss, 15);
		ОбластьСтрока.Параметры.Price		= Формат(Выборка.Price, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
		ОбластьСтрока.Параметры.Kolich		= Формат(Выборка.Kolich, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=0");
		ОбластьСтрока.Параметры.DATA_DOG 	= Формат(Выборка.DATA_DOG, "ДФ=dd.MM.yy");
		ОбластьСтрока.Параметры.POS			= Число(Выборка.POS);
		ОбластьСтрока.Параметры.FasPromezh	= Число(Выборка.FasPromezh);
		ОбластьСтрока.Параметры.EDIZMREAL 	= Лев(Выборка.EDIZMREAL, 30);
		ОбластьСтрока.Параметры.KodTT_Seti 	= Лев(Выборка.KodTT_Seti, 25);
		
		Если Объект.ВыгрузкаПриходовПоСериям Тогда
			ОбластьСтрока.Параметры.State		= "1";
			Серия = Формат(Выборка.NomPart,"ДФ=dd.MM.yyyy");
			ДатаПроизводства = Формат(Выборка.NomPart,"ДФ=dd.MM.yy");
			СрокГодности = (ДобавитьМесяц(Выборка.NomPart,Выборка.ПолныйСрокГодности) - Выборка.NomPart)/(60*60*24);
			ОбластьСтрока.Параметры.NomPart		= СтрЗаменить(Серия, ".", " ");
			ОбластьСтрока.Параметры.MarkirData	= ДатаПроизводства;
			ОбластьСтрока.Параметры.SrokRealiz	= СрокГодности;
		Иначе
			ОбластьСтрока.Параметры.State		= "0";
			ОбластьСтрока.Параметры.NomPart		= "";
			ОбластьСтрока.Параметры.MarkirData	= "";
			ОбластьСтрока.Параметры.SrokRealiz	= "";
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;	
	
КонецФункции

&НаСервере
Процедура ВыгрузитьСписокПеремещенийЛЛ_Сервер(ВидОперации)
	
	Если ВидОперации = "ОтгрузкаНаСкладЛЛ" Тогда
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
	ИначеЕсли ВидОперации = "ВозвратСоСкладаЛЛ" Тогда
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиВозвратыСоСклада;
	Иначе
		Возврат;
	КонецЕсли;
	
	ИмяФайла = СформироватьИмяФайла("LP",Каталог,Объект.ДатаОтгрузки);
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = СформироватьТабДокВозвратаСоСкладаЛЛ_Сервер(ВидОперации);
	
	ФайлЗаписан = Ложь;
	Попытка
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		ФайлЗаписан = Истина;
	Исключение 
		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;			
	
	Если ФайлЗаписан Тогда
		Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
			Если СтрокаТЗ.Выгружать Тогда
				Попытка
					ПеремещениеОбъект = СтрокаТЗ.Перемещение.ПолучитьОбъект();
				    ПеремещениеОбъект.абс_Выгружен = Истина;
					ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			Конецесли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьТабДокВозвратаСоСкладаЛЛ_Сервер(ВидОперации)
	
	спДокументов = Новый СписокЗначений;
	
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда
			спДокументов.Добавить(СтрокаТЗ.Перемещение);
		Конецесли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеТоваровТовары.Ссылка.Номер КАК NumDoc,
	|	ПеремещениеТоваровТовары.Ссылка.Дата КАК DateDoc,
	|	&КодЛоджикЛайн КАК KodKontr,
	|	ПеремещениеТоваровТовары.СерияНоменклатуры.абс_ДатаПроизводства КАК MarkirData,
	|	ПеремещениеТоваровТовары.СерияНоменклатуры.Наименование КАК KodPart,
	|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК KodTMC,
	|	ПеремещениеТоваровТовары.Номенклатура.Наименование КАК NameTMC,
	|	ПеремещениеТоваровТовары.ЕдиницаИзмерения.Наименование КАК EdIzm,
	|	ПеремещениеТоваровТовары.Количество КАК Kol,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Price,
	|	ПеремещениеТоваровТовары.Количество * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК SumBezNDS,
	|	0 КАК SumNDS,
	|	0 КАК Cost,
	|	ПеремещениеТоваровТовары.Номенклатура.НомерГТД.Представление КАК NGTD,
	|	ПеремещениеТоваровТовары.Номенклатура.СтранаПроисхождения.Код КАК IdCountry,
	|	ПеремещениеТоваровТовары.Номенклатура.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦен, ТипЦен = &ТипЦенЛоджикЛайн) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&спДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	NumDoc";
	
	Запрос.УстановитьПараметр("ДатаЦен", Объект.КонПериода);
	Запрос.УстановитьПараметр("КодЛоджикЛайн", СокрЛП(Объект.ПараметрыПоУмолчанию.ПоступлениеКонтрагент.ИНН + "/000000000"));
	Запрос.УстановитьПараметр("ТипЦенЛоджикЛайн", Объект.ТипЦеныЗалоговаяСтоимость);
	Запрос.УстановитьПараметр("спДокументов", спДокументов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	Если ВидОперации = "ОтгрузкаНаСкладЛЛ" Тогда
		Макет = Обработки.абс_ОбменСЛоджикЛайн.ПолучитьМакет("LP_Prihod");
	ИначеЕсли ВидОперации = "ВозвратСоСкладаЛЛ" Тогда
		Макет = Обработки.абс_ОбменСЛоджикЛайн.ПолучитьМакет("LP_Vozvrat");
	Иначе
		Возврат ТабДок;
	КонецЕсли;	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.NumDoc 		= Лев(Выборка.NumDoc, 25);
		ОбластьСтрока.Параметры.DateDoc 	= Формат(Выборка.DateDoc, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.KodKontr	= Лев(Выборка.KodKontr, 25);
		ОбластьСтрока.Параметры.MarkirData 	= Формат(Выборка.MarkirData, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.KodPart		= Лев(Выборка.KodPart, 25);
		ОбластьСтрока.Параметры.KodTMC		= Лев(Выборка.KodTMC, 15);
		ОбластьСтрока.Параметры.NameTMC		= Лев(Выборка.NameTMC, 100);
		ОбластьСтрока.Параметры.EdIzm		= Лев(Выборка.EdIzm, 2);
		ОбластьСтрока.Параметры.Kol			= Формат(Выборка.Kol, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=0");
		ОбластьСтрока.Параметры.Price		= Формат(Выборка.Price, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=0");
		
		Если ВидОперации = "ОтгрузкаНаСкладЛЛ" Тогда
			ОбластьСтрока.Параметры.SumBezNDS	= Формат(Выборка.SumBezNDS, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=0");
			
			чСуммаНДС = УчетНДС.РассчитатьСуммуНДС(Выборка.SumBezNDS, Истина, Ложь, УчетНДС.ПолучитьСтавкуНДС(Выборка.СтавкаНДС));
			
			ОбластьСтрока.Параметры.SumNDS		= Формат(чСуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=0");
			ОбластьСтрока.Параметры.Cost		= Формат(Выборка.SumBezNDS + чСуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=0");
		КонецЕсли;
		
		ОбластьСтрока.Параметры.NGTD		= Лев(Выборка.NGTD, 50);
		Попытка
			ОбластьСтрока.Параметры.IdCountry	= Число(Выборка.IdCountry);
		Исключение
			ОбластьСтрока.Параметры.IdCountry	= 0;
		КонецПопытки;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;	
	
КонецФункции

&НаСервере
Процедура ВыгрузитьПеремещенияНаСкладЛЛ_Сервер()
		
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
	
	ИмяФайла = СформироватьИмяФайла("Nakl",Каталог,Объект.ДатаОтгрузки);
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = СформироватьТабДокПеремещенияНаСкладЛЛ_Сервер();
	
	ФайлЗаписан = Ложь;
	Попытка
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		ФайлЗаписан = Истина;
	Исключение 
		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если ФайлЗаписан Тогда
		Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
			Если СтрокаТЗ.Выгружать Тогда
				Попытка
					ПеремещениеОбъект = СтрокаТЗ.Перемещение.ПолучитьОбъект();
				    ПеремещениеОбъект.абс_Выгружен = Истина;
					ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			Конецесли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокПеремещенийЛЛ_Сервер(СкладОтправитель, СкладПолучатель)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НЕ ПеремещениеТоваров.Ссылка.абс_Выгружен КАК Выгружать,
	|	ПеремещениеТоваров.Ссылка КАК Перемещение,
	|	ПеремещениеТоваров.СкладОтправитель,
	|	ПеремещениеТоваров.СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	|	И ПеремещениеТоваров.Проведен
	|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваров.МоментВремени");
	
	Запрос.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(Объект.НачПериода), Объект.НачПериода, '00010101'));
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(Объект.КонПериода), КонецДня(Объект.КонПериода), '39990101'));
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	
	Результат = Запрос.Выполнить();
	
	Объект.СписокПеремещений.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПеремещенияУстановитьСнятьФлажки(Флаг)
	
	НайденныеСтроки = Объект.СписокПеремещений.НайтиСтроки(Новый Структура("Выгружать", Не Флаг));
	
	Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		НайденнаяСтрока.Выгружать = Флаг;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроставитьПризнакВыгруженПеремещенийЛЛ()
	
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда
			Попытка
				ПеремещениеОбъект = СтрокаТЗ.Перемещение.ПолучитьОбъект();
			    ПеремещениеОбъект.абс_Выгружен = Истина;
				ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		Конецесли;
	КонецЦикла;
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ ИМПОРТ ОТ ЛЛ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ИмпортПоступленияНаСкладЛоджикЛайн(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуПриходНаСклад;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
	КонецЦикла;
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортПоступленияНаСкладЛоджикЛайнНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	Иначе
		Сообщить("Нет файла для загрузки.");
		Возврат;
	КонецЕсли;
	
	Каталог = Каталог + "\Arhiv "+ Формат(Год(ТекущаяДата()),"ЧГ=0")+"г\";
	
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортВозвратТовараСоСкладаЛоджиклайн(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВозвратТовара;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
	КонецЦикла;
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортВозвратТовараСоСкладаЛоджиклайнНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	Иначе
		Сообщить("Нет файла для загрузки.");
		Возврат;
	КонецЕсли;
	
	Каталог = Каталог + "\Arhiv "+ Формат(Год(ТекущаяДата()),"ЧГ=0")+"г\";
	
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортОтгрузок(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
	КонецЦикла;
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ЗагрузитьОтгрузкиЛоджикЛайн(ПомещенныеФайлы);
		КонецЕсли;
	Иначе
		Сообщить("Нет файла для загрузки.");
		Возврат;
	КонецЕсли;
	
	Для каждого ФайлМассива из МассивФайлов Цикл
		Каталог = Каталог + "\Arhiv\";
		ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортОстатков(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуОстатки;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	Сообщение = Новый СообщениеПользователю;
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	//+Обход массива файлов
	//загружаем первый видимый (там могут быть экселевские "копии" типа ~$имяфайла.xslx)
	ФайлОстатков = Неопределено;
	Для Каждого Файл Из МассивФайлов Цикл
		Если НЕ Файл.ПолучитьНевидимость() Тогда
			ФайлОстатков = Файл;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ФайлОстатков = Неопределено Тогда
		Сообщение.Текст = "Не найден файл для загрузки!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлОстатков.ПолноеИмя));		
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортОстатковНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	КонецЕсли;
	
	//переместим файл загрузки в архив
	Если Прав(Каталог, 1) <> "\" ТОгда
		Каталог = Каталог + "\";
	КонецЕсли;
	Каталог = Каталог + "Arhiv\";
	Попытка
		ПереместитьФайл(ФайлОстатков.ПолноеИмя,Каталог + ФайлОстатков.Имя);
	Исключение
		Сообщение.Текст = "Не удалось переместить файл загрузки в архив, сделайте это вручную!";
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Процедура ИмпортПоступленияНаСкладЛоджикЛайнНаСервере(МассивФайлов)
	
	ТекстЛога = ЛогированиеФайлЛога();
	
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
        мСообщениеПользователю("" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС, ТекстЛога);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		КолвоСтрокExcel = 1;	
		
		ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Истина, , ТекстЛога);	
		
		Если ТабЗнач = Неопределено Тогда
			мСообщениеПользователю("Загрузка данных не произведена!", ТекстЛога);
			Возврат;
		КонецЕсли;
		
		ИмпортНакладных = Объект.ИмпортНакладныхПриходаТовараНаСкладЛоджикЛайн;
		ИмпортНакладных.Очистить();
		
		Для каждого Строка из  ТабЗнач Цикл				
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",(СокрЛП(Строка.KodTMC)));
			Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных = ИмпортНакладных.Добавить();
				СтрокаИмпортаНакладных.Номенклатура = Номенклатура;
			Иначе	
				мСообщениеПользователю("" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС, ТекстЛога);
				//Продолжить;
			КонецЕсли;
			
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СокрЛП(Строка.EdIzm), , , Номенклатура);
			Если Не ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = ЕдиницаИзмерения;
			Иначе	
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
				
				мСообщениеПользователю("" + ТекущаяДата() + " Не найдена единица """ + Строка.EdIzm + """по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС, ТекстЛога);
				//Продолжить;
			КонецЕсли;
			
			СерияСтрока = СокрЛП(Строка.KodPart);
			СерияСтрока = Лев(СерияСтрока,2) + "." + Сред(СерияСтрока,4,2) + "." + Сред(СерияСтрока,7,4);
			Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СерияСтрока, Истина, , Номенклатура);
			Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных.Серия = Серия;
			Иначе	
				мСообщениеПользователю("" + ТекущаяДата() + " Не найдена серия """ + Строка.KodPart + """по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС, ТекстЛога);
				//Продолжить;
			КонецЕсли;
			
			СтрокаИмпортаНакладных.SALESID 		= СокрЛП(Строка.SalesId);
			СтрокаИмпортаНакладных.DateDoc		= ПолучитьДатуИзСтроки(Строка.DateDoc);
			СтрокаИмпортаНакладных.NumDoc 		= СокрЛП(Строка.NumDoc);
			СтрокаИмпортаНакладных.KodKontr 	= СокрЛП(Строка.KodKontr);
			СтрокаИмпортаНакладных.MarkirData 	= ПолучитьДатуИзСтроки(Строка.MarkirData);
			СтрокаИмпортаНакладных.KodPart 		= СокрЛП(Строка.KodPart);
			СтрокаИмпортаНакладных.KodTMC 		= СокрЛП(Строка.KodTMC);
			СтрокаИмпортаНакладных.NameTMC 		= СокрЛП(Строка.NameTMC);
			СтрокаИмпортаНакладных.EdIzm 		= СокрЛП(Строка.EdIzm);
			СтрокаИмпортаНакладных.Kol 			= Число(Строка.Kol);
			СтрокаИмпортаНакладных.Price 		= Число(Строка.Price);
			СтрокаИмпортаНакладных.SumBezNDS 	= Число(Строка.SumBezNDS);
			СтрокаИмпортаНакладных.SumNDS 		= Число(Строка.SumNDS);
			СтрокаИмпортаНакладных.Cost 		= Число(Строка.Cost);
			
		КонецЦикла;
		
		ТЗ_ДокПоступления = ИмпортНакладных.Выгрузить(,"Kol,DateDoc,NumDoc");
		ТЗ_ДокПоступления.Свернуть("DateDoc,NumDoc","Kol");
		
		Если ТЗ_ДокПоступления.Количество() > 0 Тогда
			
			Для каждого ДокПоступления из ТЗ_ДокПоступления Цикл
				
				ОтборПоДокПоступления 	= Новый Структура;
				ОтборПоДокПоступления.Вставить("NumDoc", ДокПоступления.NumDoc);
				
				СтрокиПоДокПоступления = ИмпортНакладных.Выгрузить(ОтборПоДокПоступления, "Номенклатура,Kol,ЕдиницаИзмерения,Серия");
				СтрокиПоДокПоступления.Свернуть("Номенклатура,ЕдиницаИзмерения,Серия","Kol");
				
				//ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.НайтиПоРеквизиту("абс_НомерЛЛ",ДокПоступления.NumDoc);
				//ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.НайтиПоНомеру(ДокПоступления.NumDoc, ДокПоступления.DateDoc);
				СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				ДокументПриходЛоджикЛайн = ПолучитьДокументПеремещенияТоваров(ДокПоступления.NumDoc, ДокПоступления.DateDoc, СкладОтправитель, СкладПолучатель, Организация);
				
				Если ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
					
					ДокументПриходЛоджикЛайн = НайтиДокументПеремещения(ДокПоступления.NumDoc, ДокПоступления.DateDoc, Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора); 
					
					Если ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
						
						мСообщениеПользователю("Не найден документ Перемещение № " + ДокПоступления.NumDoc + " от " + ДокПоступления.DateDoc, ТекстЛога);
						
						Если Объект.ФормироватьНовыеДокументы Тогда
							ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.СоздатьДокумент();
						Иначе
							Продолжить;
						КонецЕсли;
					Иначе
						ДокументПриходЛоджикЛайн = ДокументПриходЛоджикЛайн.ПолучитьОбъект();							
					КонецЕсли;
				Иначе	
					ДокументПриходЛоджикЛайн = ДокументПриходЛоджикЛайн.ПолучитьОбъект();
				КонецЕсли;
				
				//ДокументПриходЛоджикЛайн.Номер = ДокВозврата.NumDoc;
				Если НЕ ЗначениеЗаполнено(ДокументПриходЛоджикЛайн.абс_НомерЛЛ) тогда
					ДокументПриходЛоджикЛайн.абс_НомерЛЛ = ДокПоступления.NumDoc;
				КонецЕсли;
				
				ДокументПриходЛоджикЛайн.Дата 				= КонецДня(ДокПоступления.DateDoc);
				ДокументПриходЛоджикЛайн.Организация		= Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				
				ДокументПриходЛоджикЛайн.ВидОперации 		= Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
				ДокументПриходЛоджикЛайн.ОтражатьВУправленческомУчете = Истина;				
				ДокументПриходЛоджикЛайн.СкладОтправитель 	= Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				ДокументПриходЛоджикЛайн.Товары.Очистить();
				
				Для Каждого СтрокаНоменклатура Из СтрокиПоДокПоступления Цикл
					СтрокаТабЧасти 						= ДокументПриходЛоджикЛайн.Товары.Добавить();
					СтрокаТабЧасти.Номенклатура 		= СтрокаНоменклатура.Номенклатура;
					СтрокаТабЧасти.Количество 			= СтрокаНоменклатура.Kol;
					СтрокаТабЧасти.ЕдиницаИзмерения 	= СтрокаНоменклатура.ЕдиницаИзмерения;
					СтрокаТабЧасти.СерияНоменклатуры	= СтрокаНоменклатура.Серия;
					СтрокаТабЧасти.Коэффициент			= СтрокаНоменклатура.ЕдиницаИзмерения.Коэффициент;
					СтрокаТабЧасти.ЕдиницаИзмеренияМест	= СтрокаНоменклатура.Номенклатура.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабЧасти, ДокументПриходЛоджикЛайн);
				КонецЦикла;
				
				//проверим на расхождения
				флРасхождения = Ложь;
				
				СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				ДокументОтгрузкиНаЛЛ = ПолучитьДокументПеремещенияТоваров(ДокПоступления.NumDoc, ДокПоступления.DateDoc, СкладОтправитель, СкладПолучатель, Организация);
				
				тзОтгружено = ДокументОтгрузкиНаЛЛ.Товары.Выгрузить(); 
				тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
				СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
				
				Если ДокументОтгрузкиНаЛЛ.Товары.Количество()<>ДокументПриходЛоджикЛайн.Товары.Количество() Тогда
					флРасхождения = Истина;
				КонецЕсли;
				
				Для Каждого СтрокаТовары Из ДокументОтгрузкиНаЛЛ.Товары Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
					мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
					Если мСтроки.Количество() = 0 Тогда
						флРасхождения = Истина;
					ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
						флРасхождения = Истина;
					КонецЕсли;						
					Если флРасхождения Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если флРасхождения Тогда
					
					мСообщениеПользователю("" + ТекущаяДата() + " По документу " + ДокументПриходЛоджикЛайн + " зафиксированы расхождения!", ТекстЛога);
					
				КонецЕсли;
				
				Попытка
					
					ДокументПриходЛоджикЛайн.Записать(РежимЗаписиДокумента.Запись);
					
					//ДокументПриходЛоджикЛайн.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					
					мСообщениеПользователю("" + ТекущаяДата() + "Записан документ " + ДокументПриходЛоджикЛайн, ТекстЛога);
					
					СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					СтрокаТаб.СсылкаДокумент  = ДокументПриходЛоджикЛайн.Ссылка;
					СтрокаТаб.Расхождение = флРасхождения;
					
				Исключение
					
					мСообщениеПользователю("" + ТекущаяДата() + "Ошибка записи документа Перемещения: " + ОписаниеОшибки(), ТекстЛога);
					
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ИмпортВозвратТовараСоСкладаЛоджиклайнНаСервере(МассивФайлов)
	
	ТекстЛога = ЛогированиеФайлЛога();
	
	//+Обход массива файлов
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС ;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		КолвоСтрокExcel = 1;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
		ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Истина);	
		ИмпортНакладных = Объект.ИмпортНакладныхПриходаТовараНаСкладЛоджикЛайн;
		ИмпортНакладных.Очистить();
		Для каждого Строка из  ТабЗнач Цикл				
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",(СокрЛП(Строка.KodTMC)));
			Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных = ИмпортНакладных.Добавить();
				СтрокаИмпортаНакладных.Номенклатура = Номенклатура;
			Иначе	
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				Продолжить
			КонецЕсли;
			
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СокрЛП(Строка.EdIzm), , , Номенклатура);
			Если Не ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = ЕдиницаИзмерения;
			Иначе	
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица """ + Строка.EdIzm + """по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				//Продолжить
			КонецЕсли;
			
			СерияСтрока = СокрЛП(Строка.KodPart);
			СерияСтрока = Лев(СерияСтрока,2) + "." + Сред(СерияСтрока,4,2) + "." + Сред(СерияСтрока,7,4);
			Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СерияСтрока, Истина, , Номенклатура);
			Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных.Серия = Серия;
			Иначе	
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + Строка.KodPart + """по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				//Продолжить
			КонецЕсли;
			
			СтрокаИмпортаНакладных.DateDoc = ПолучитьДатуИзСтроки(Строка.DateDoc);
			СтрокаИмпортаНакладных.NumDoc = СокрЛП(Строка.NumDoc);
			СтрокаИмпортаНакладных.KodKontr = СокрЛП(Строка.KodKontr);
			СтрокаИмпортаНакладных.MarkirData = ПолучитьДатуИзСтроки(Строка.MarkirData);
			СтрокаИмпортаНакладных.KodPart = СокрЛП(Строка.KodPart);
			СтрокаИмпортаНакладных.KodTMC = СокрЛП(Строка.KodTMC);
			СтрокаИмпортаНакладных.NameTMC = СокрЛП(Строка.NameTMC);
			СтрокаИмпортаНакладных.EdIzm = СокрЛП(Строка.EdIzm);
			СтрокаИмпортаНакладных.Kol = Число(Строка.Kol);
			СтрокаИмпортаНакладных.Price = Число(Строка.Price);
			
		КонецЦикла;
		
		ТЗ_ДокВозврата = ИмпортНакладных.Выгрузить(,"Kol,DateDoc,NumDoc");
		ТЗ_ДокВозврата.Свернуть("DateDoc,NumDoc","Kol");
		
		Если ТЗ_ДокВозврата.Количество()>0 Тогда
			Для каждого ДокВозврата из ТЗ_ДокВозврата Цикл   
				ОтборПоДокВозврат = Новый Структура;
				ОтборПоДокВозврат.Вставить("NumDoc", ДокВозврата.NumDoc);
				СтрокиПоДокВозврат = ИмпортНакладных.Выгрузить(ОтборПоДокВозврат,"Номенклатура,Kol,ЕдиницаИзмерения,Серия");
				СтрокиПоДокВозврат.Свернуть("Номенклатура,ЕдиницаИзмерения,Серия","Kol");
				
				//ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.НайтиПоРеквизиту("абс_НомерЛЛ",ДокВозврата.NumDoc); 
				//ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.НайтиПоНомеру(ДокВозврата.NumDoc, ДокВозврата.DateDoc); 
				//СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				//СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				//Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				//ДокументВозвратаТовараСоСклада = ПолучитьДокументПеремещенияТоваров(ДокВозврата.NumDoc, ДокВозврата.DateDoc, СкладОтправитель, СкладПолучатель, Организация);
				//  
				//Если ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
				//	ДокументВозвратаТовараСоСклада = НайтиДокументПеремещения(ДокВозврата.NumDoc, ДокВозврата.DateDoc, Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции); 
				//	Если ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда						
				//		Сообщить("Не найден документ Перемещение № " + ДокВозврата.NumDoc + " от " + ДокВозврата.DateDoc);
				//		Если Объект.ФормироватьНовыеДокументы Тогда
				//			ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.СоздатьДокумент();
				//		Иначе
				//			Продолжить;
				//		КонецЕсли;
				//	Иначе
				//		ДокументВозвратаТовараСоСклада = ДокументВозвратаТовараСоСклада.ПолучитьОбъект();							
				//	КонецЕсли;
				//Иначе	
				//	ДокументВозвратаТовараСоСклада = ДокументВозвратаТовараСоСклада.ПолучитьОбъект();
				//КонецЕсли;
				
				Если Объект.ФормироватьНовыеДокументы Тогда
					ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.СоздатьДокумент();
				Иначе
					Продолжить;
				КонецЕсли;
				
				//ДокументВозвратаТовараСоСклада.Номер = ДокВозврата.NumDoc;
				Если НЕ ЗначениеЗаполнено(ДокументВозвратаТовараСоСклада.абс_НомерЛЛ) тогда
					ДокументВозвратаТовараСоСклада.абс_НомерЛЛ = ДокВозврата.NumDoc;
				КонецЕсли;
				//+Леовит Сафонов ЕА 22.07.2014
				//Просьба склада изменить дату на 8.00 
				ДокументВозвратаТовараСоСклада.Дата = КонецДня(ДокВозврата.DateDoc) - 57599;
				//-Леовит Сафонов ЕА 22.07.2014
				ДокументВозвратаТовараСоСклада.Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				
				ДокументВозвратаТовараСоСклада.СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				ДокументВозвратаТовараСоСклада.СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				ДокументВозвратаТовараСоСклада.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
				ДокументВозвратаТовараСоСклада.ОтражатьВУправленческомУчете = Истина;
				ДокументВозвратаТовараСоСклада.Товары.Очистить();
				Для каждого СтрокаНоменклатура из СтрокиПоДокВозврат Цикл
					СтрокаТабЧасти = ДокументВозвратаТовараСоСклада.Товары.Добавить();
					СтрокаТабЧасти.Номенклатура 	= СтрокаНоменклатура.Номенклатура;
					СтрокаТабЧасти.Количество 		= СтрокаНоменклатура.Kol;
					СтрокаТабЧасти.ЕдиницаИзмерения = СтрокаНоменклатура.ЕдиницаИзмерения;
					СтрокаТабЧасти.СерияНоменклатуры= СтрокаНоменклатура.Серия;						
					СтрокаТабЧасти.Коэффициент		= СтрокаНоменклатура.ЕдиницаИзмерения.Коэффициент;
					СтрокаТабЧасти.ЕдиницаИзмеренияМест	= СтрокаНоменклатура.Номенклатура.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабЧасти, ДокументВозвратаТовараСоСклада);
				КонецЦикла;	
				
				////проверим на расхождения
				флРасхождения = ЛОЖЬ;
				//
				//СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				//СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				//Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				//ДокументПолученияТовараСоСклада = ПолучитьДокументПеремещенияТоваров(ДокВозврата.NumDoc, ДокВозврата.DateDoc, СкладОтправитель, СкладПолучатель, Организация);
				//
				//тзОтгружено = ДокументПолученияТовараСоСклада.Товары.Выгрузить();
				//Если ДокументПолученияТовараСоСклада.Товары.Количество()<>ДокументВозвратаТовараСоСклада.Товары.Количество() Тогда
				//	флРасхождения = Истина;
				//КонецЕсли;
				//
				//тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
				//СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
				//Для Каждого СтрокаТовары Из ДокументВозвратаТовараСоСклада.Товары Цикл
				//	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
				//	мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
				//	Если мСтроки.Количество() = 0 Тогда
				//		флРасхождения = Истина;
				//	ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
				//		флРасхождения = Истина;
				//	КонецЕсли;						
				//	Если флРасхождения Тогда
				//		Прервать;
				//	КонецЕсли;
				//КонецЦикла;
				//Если флРасхождения Тогда
				//	ТекстСтроки = "" + ТекущаяДата() + " По документу " + ДокументВозвратаТовараСоСклада + " зафиксированы расхождения!";
				//	ТекстЛога.Записать(ТекстСтроки);
				//	Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				//КонецЕсли;
				
				Попытка
					ДокументВозвратаТовараСоСклада.Записать(РежимЗаписиДокумента.Запись);
					ТекстСтроки = "" + ТекущаяДата() + "Записан документ " + ДокументВозвратаТовараСоСклада;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					СтрокаТаб.СсылкаДокумент  = ДокументВозвратаТовараСоСклада.Ссылка;
					СтрокаТаб.Расхождение = флРасхождения;
				Исключение
					ТекстСтроки = "" + ТекущаяДата() + "Ошибка записи документа Перемещение" + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументПеремещенияТоваров(НомерЛЛ, ДатаЛЛ, СкладОтправитель, СкладПолучатель, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	|	И ПеремещениеТоваров.абс_НомерЛЛ = &НомерЛЛ
	|	И ПеремещениеТоваров.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, ДЕНЬ) = &ДатаЛЛ";
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("НомерЛЛ", НомерЛЛ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаЛЛ", НачалоДня(ДатаЛЛ));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОтгрузкиЛоджикЛайн(МассивФайлов) Экспорт
	
	ТекстЛога = ЛогированиеФайлЛога ();
	
	//+Обход массива файлов
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		КолвоСтрокExcel = 1;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
		ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Истина) ;
		Для каждого Строка из  ТабЗнач Цикл
			Строка.SalesId = СокрЛП(Строка.SalesId);
			Строка.DateDoc = ПолучитьДатуИзСтроки(Строка.DateDoc);
			Строка.NumDoc = СокрЛП(Строка.NumDoc);
			Строка.KodKontr = СокрЛП(Строка.KodKontr);
			//Строка.MarkirData = ПолучитьДатуИзСтроки(Строка.MarkirData);
			Строка.KodPart = СокрЛП(Строка.KodPart);
			Строка.KodTMC = СокрЛП(Строка.KodTMC);
			//Строка.NameTMC = СокрЛП(Строка.NameTMC);
			Строка.EdIzm = СокрЛП(Строка.EdIzm);
			Строка.Kol = Число(Строка.Kol);
			//Строка.Price = Число(Строка.Price);
			//Строка.SumBezNDS = Число(Строка.SumBezNDS);
			//Строка.SumNDS = Число(Строка.SumNDS);
			Строка.Cost = Число(Строка.Cost);
			//Строка.NGTD"
			Строка.IdCountry = СокрЛП(Строка.IdCountry);
		КонецЦикла;
		
		ТабЗначДок = ТабЗнач.Скопировать(,"SalesId,DateDoc,NumDoc,KodKontr,Cost");
		ТабЗначДок.Свернуть("SalesId,DateDoc,NumDoc,KodKontr","Cost");
		
		
		//+Сгруппированная таблица  ТабЗначДок. (список документов в файле)
		Для Каждого СтрокаДок из ТабЗначДок Цикл
			ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
			
			ОтборПоДокументуЗаказа = Новый Структура;
			ОтборПоДокументуЗаказа.Вставить("SalesId", СтрокаДок.SalesId);
			СтрокиТабЧастиДокументаИзФайла = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"KodTMC,EdIzm,KodPart,Kol");
			СтрокиТабЧастиДокументаИзФайла.Свернуть("KodTMC,EdIzm,KodPart","Kol");
			//СтрокиТабЧастиДокументаИзФайла.Колонки.Добавить("Обработано");
			
			ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.SalesId,СтрокаДок.DateDoc);
			
			Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
				ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Заказ клиента"" по номеру заказа. Номер заказа " + СтрокаДок.SalesId + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
			|	И РеализацияТоваровУслуг.Сделка = &Заказ";
			
			Запрос.УстановитьПараметр("Заказ", ДокументЗаказ);
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДокументРеализация = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
			
			Если   ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
				ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Реализация товаров и услуг"" по документу ""Заказ клиента"". Номер заказа " + СтрокаДок.SalesId + Символы.ПС  ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				
				Продолжить;		
			КонецЕсли;
			
			//Проверка документа
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДок.KodKontr,"/");
			КонтрагентИНН = МассивПодстрок[0];
			НомерТТП =  МассивПодстрок[1];
			ОбъектЗаказ = ДокументЗаказ.ПолучитьОбъект() ;
			ОбъектРеализация = ДокументРеализация.ПолучитьОбъект();
			
			Если НЕ ДокументРеализация.Контрагент.ИНН = КонтрагентИНН Тогда
				ТекстСтроки = "" + ТекущаяДата() + " В документе " + ДокументРеализация + " ИНН контрагента не совпадает с данными файла. ИНН" + КонтрагентИНН + Символы.ПС;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				Продолжить;
			КонецЕсли;
			
			ТаблицаОтгружено = ОбъектРеализация.абс_Отгружено;
			ТаблицаОтгружено.Очистить();
			
			Для каждого СтрокаИзФайла из СтрокиТабЧастиДокументаИзФайла Цикл
				Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.KodTMC);
				Если НЕ Номенклатура.Пустая() Тогда
					СтрокаОтгружено = ТаблицаОтгружено.Добавить();
					СтрокаОтгружено.Номенклатура = Номенклатура;
				Иначе
					ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + СтрокаИзФайла.KodTMC + "." + Символы.ПС ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.EdIzm), , , Номенклатура);
				Если Не ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка()Тогда
					СтрокаОтгружено.ЕдиницаИзмерения = ЕдиницаИзмерения;
				Иначе	
					СтрокаОтгружено.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
					ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица """ + Строка.EdIzm + """по Артикулу. Артикул в файле:" + СтрокаИзФайла.KodTMC + "." + Символы.ПС ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.Важное);
					//Продолжить
				КонецЕсли;
				
				Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.KodPart), Истина, , Номенклатура);
				Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
					СтрокаОтгружено.СерияНоменклатуры = Серия;
				Иначе	
					ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + СтрокаИзФайла.KodPart + """по Артикулу. Артикул в файле:" + СтрокаИзФайла.KodTMC + "." + Символы.ПС ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.Важное);
					//Продолжить
				КонецЕсли;
				
				СтрокаОтгружено.Количество = СтрокаИзФайла.Kol;
				
			КонецЦикла;
			
			//проверим на расхождения
			флРасхождения = ЛОЖЬ;
			тзОтгружено = ТаблицаОтгружено.Выгрузить();
			тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
			СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
			Для Каждого СтрокаТовары Из ОбъектРеализация.Товары Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
				мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
				Если мСтроки.Количество() = 0 Тогда
					флРасхождения = Истина;
				ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
					флРасхождения = Истина;
				КонецЕсли;						
				Если флРасхождения Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если флРасхождения Тогда
				ТекстСтроки = "" + ТекущаяДата() + " По документу " + ДокументРеализация + " зафиксированы расхождения!";
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
			КонецЕсли;
			
			Попытка
				ОбъектРеализация.Записать(РежимЗаписиДокумента.Запись);
				ТекстСтроки = "" + ТекущаяДата() + " Записан документ " + ДокументРеализация;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
				СтрокаТаб.СсылкаДокумент  = ОбъектРеализация.Ссылка;
				СтрокаТаб.Расхождение = флРасхождения;
			Исключение
				ТекстСтроки = "" + ТекущаяДата() + " Ошибка записи документа " + ДокументРеализация + "." + Символы.ПС + ОписаниеОшибки() ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
			КонецПопытки;
			
		КонецЦикла;
		//- Сгруппированная таблица  ТабЗначДок.
	КонецЦикла;
	//-Обход массива файлов
	ТекстЛога.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ИмпортОстатковНаСервере(МассивФайлов)
	
	Сообщение = Новый СообщениеПользователю;
	
	ТекстЛога = ЛогированиеФайлЛога ();
	
	Попытка
		ДатаЗагрузки = НачалоДня(ТекущаяДата());
		ДокументЗагрузки = Объект.ПараметрыПоУмолчанию.ОприходованиеОстатков.ПолучитьОбъект();
		ДокументЗагрузки.Заблокировать();
		
		АрхивныйДокумент = Неопределено;
		
		//ОстаткиНаДатуЗагрузки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный) КАК СтатусПартии,
		|	ЗНАЧЕНИЕ(Справочник.Качество.Новый) КАК Качество,
		|	-ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("ДатаЗагрузки", ДатаЗагрузки);
		Запрос.УстановитьПараметр("Склад", ДокументЗагрузки.Склад);
		
		Результат = Запрос.Выполнить();
		тзОстатки = Результат.Выгрузить();
		
		Если ДокументЗагрузки.Дата < ДатаЗагрузки Тогда
			//это вчерашний документ
			//нужно сделать с него архивную копию
			//и переместить на сегодня
			АрхивныйДокумент = ДокументЗагрузки.Скопировать();
			АрхивныйДокумент.Дата = ДокументЗагрузки.Дата;
			АрхивныйДокумент.Комментарий = "Документ загрузки остатков логоператора, перемещен в архив " + ТекущаяДата();
			
			ДокументЗагрузки.Дата = ДатаЗагрузки;
			ДокументЗагрузки.Комментарий = "Документ загрузки остатков логоператора, актуальный, обновлен " + ТекущаяДата();
		КонецЕсли;
		
		//сторно вчерашних остатков
		ДокументЗагрузки.Товары.Загрузить(тзОстатки);
		
	Исключение
		Сообщение.Текст = "Не удалось получить и заблокировать документ загрузки остатков.";
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ФайлОстатков = МассивФайлов[0]; 
	
	ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлОстатков.Имя + ")" + Символы.ПС ;
	ТекстЛога.Записать(ТекстСтроки);
	Сообщение.Текст = ТекстСтроки;
	Сообщение.Сообщить();
	
	ФайлEXCEL = ФайлОстатков.Имя ;
	КолвоСтрокExcel = 1;	
	//ТабЗнач = ЗагрузитьМетодом_MSADODB(ФайлEXCEL, ИмяЛиста,1,0,0, КолвоСтрокExcel, "MicrosoftACEOLEDB12") ;	
	//ТабЗнач = ЗагрузитьМетодом_MSADODB(ФайлEXCEL, ИмяЛиста,1,0,0, КолвоСтрокExcel, "MicrosoftJetOLEDB40") ;	
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлОстатков.Хранение);
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
	ДвоичныеДанные.Записать(ПутьКФайлу);
	
	ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Ложь, 4);
	
	Для каждого Строка из ТабЗнач Цикл	
				
		// 0 - артикул
		// 2 - единица измерения
		// 8 - серия (номер партии)
		// 14 - количество (исходящий остаток берем, т.к. файл будет готовиться в конце предыдущего дня)
		//		
		НомерКолонкиАртикул 			= 0;
		НомерКолонкиЕдиницаИзмерения 	= Неопределено; // В новом формате нет единицы измерения, грузим пустую колонку
		НомерКолонкиСерияНоменклатуры	= 3;
		НомерКолонкиКоличество			= 4;
		
		// АБС ВСТАВКА 16.06.2014 Новый старый формат с сериями
		НомерКолонкиАртикул 			= 0;
		НомерКолонкиЕдиницаИзмерения 	= Неопределено; // В новом формате нет единицы измерения, грузим пустую колонку
		НомерКолонкиСерияНоменклатуры	= 8;
		НомерКолонкиКоличество			= 14;
		// АБС ВСТАВКА КОНЕЦ
		
		
		ТекущиеДанные = ДокументЗагрузки.Товары.Добавить();
		
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",(СокрЛП(Строка[НомерКолонкиАртикул])));
		Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
			ТекущиеДанные.Номенклатура = Номенклатура;			
		Иначе	
			ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщение.Текст = ТекстСтроки;
			Сообщение.Сообщить();
			
			ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
			Продолжить;
		КонецЕсли;
		
		Если НЕ НомерКолонкиЕдиницаИзмерения = Неопределено Тогда
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СокрЛП(Строка[НомерКолонкиЕдиницаИзмерения]),,, ТекущиеДанные.Номенклатура);
			Если Не ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка()Тогда
				ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмерения;			
			Иначе	
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица измерения """ + СокрЛП(Строка[НомерКолонкиЕдиницаИзмерения])  + """ для номенклатуры:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщение.Текст = ТекстСтроки;
				Сообщение.Сообщить();
				
				ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
				Продолжить;
			КонецЕсли;
		Иначе
			ТекущиеДанные.ЕдиницаИзмерения = ТекущиеДанные.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения) Тогда
			ТекущиеДанные.Коэффициент = ТекущиеДанные.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		Если Объект.ИмпортОперативныхОстатковПоСериям Тогда
			
			НаименованиеСерииНоменклатуры = СтрЗаменить(СокрЛП(Строка[НомерКолонкиСерияНоменклатуры]), " ", ".");
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И ЗначениеЗаполнено(НаименованиеСерииНоменклатуры) Тогда
				Результат = Справочники.СерииНоменклатуры.НайтиПоНаименованию(НаименованиеСерииНоменклатуры,,, ТекущиеДанные.Номенклатура);
			Иначе
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + НаименованиеСерииНоменклатуры + """ для номенклатуры:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщение.Текст = ТекстСтроки;
				Сообщение.Сообщить();
				
				Результат = Справочники.СерииНоменклатуры.ПустаяСсылка();
			КонецЕсли;
		Иначе
			Результат = Справочники.СерииНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		ТекущиеДанные.СерияНоменклатуры = Результат;
		
		ТекущиеДанные.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;	
		
		сКоличество = СокрЛП(Строка[НомерКолонкиКоличество]);    
		сКоличество = СтрЗаменить(сКоличество, " ", "");
		сКоличество = СтрЗаменить(сКоличество, Символы.НПП, "");
		сКоличество = СтрЗаменить(сКоличество, ",", "");
		Попытка
			ТекущиеДанные.Количество = Число(сКоличество);
		Исключение
			ТекстСтроки = "" + ТекущаяДата() + " Не загружено колчиество """ + СокрЛП(Строка[НомерКолонкиКоличество])  + """ для номенклатуры:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщение.Текст = ТекстСтроки;
			Сообщение.Сообщить();
			
			ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
			Продолжить;
		КонецПопытки;	
		
		Если ТекущиеДанные.Количество = 0 ТОгда
			ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если АрхивныйДокумент <> Неопределено Тогда
		Попытка
			АрхивныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстСтроки = "" + ТекущаяДата() + "Ошибка проведения архивного документа переноса остатков." + Символы.ПС + ОписаниеОшибки() ;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщение.Текст = ТекстСтроки;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;	
	
	Попытка
		ДокументЗагрузки.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекстСтроки = "" + ТекущаяДата() + "Проведен документ " + ДокументЗагрузки;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщение.Текст = ТекстСтроки;
		Сообщение.Сообщить();
		//добавим в ТЧ обработки
		СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
		СтрокаТаб.СсылкаДокумент  = ДокументЗагрузки.Ссылка;
	Исключение
		ТекстСтроки = "" + ТекущаяДата() + "Ошибка проведения документа Оприходования." + Символы.ПС + ОписаниеОшибки() ;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщение.Текст = ТекстСтроки;
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция НайтиДокументПеремещения(НомерЛЛ, ДатаДокумента, НаправлениеПеремещения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.абс_НомерЛЛ = &Номер
	|	И НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
	|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель";
	
	Запрос.УстановитьПараметр("Дата", ДатаДокумента);
	Запрос.УстановитьПараметр("Номер", НомерЛЛ);
	Запрос.УстановитьПараметр("СкладПолучатель", НаправлениеПеремещения);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;		
	Иначе
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура мСообщениеПользователю(СтрокаСообщения, ТекстЛога = Неопределено)
	
	Если НЕ ТекстЛога = Неопределено Тогда	
		ТекстЛога.Записать(СтрокаСообщения);
	КонецЕсли;
	
	Сообщить(СтрокаСообщения, СтатусСообщения.Важное);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Склад = Объект.Организация.абс_ОсновнойСклад;
	
	Объект.ВыгрузкаЛефЭкспо = Объект.Организация.Наименование = "ЛефЭкспо";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ФормироватьНовыеДокументы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеMetroMGL(Команда)
	
	сАдресВременногоХранилища = ПолучитьДанныеВыгрузкиMetroMGLНаСервере();
	
	Если сАдресВременногоХранилища <> Неопределено Тогда
		//формируем имя файла
		сИмяФайла = "MGL" + Формат(ТекущаяДата(), "ДФ=ddMMyy_HHmm") + ".swr";
		//открываем форму открытия/сохранения файла
		ПолучитьФайл(сАдресВременногоХранилища, сИмяФайла);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВыгрузкиMetroMGLНаСервере()
	
	КонтрагентМетро = Константы.абс_КонтрагентМетро.Получить();
	
	СпРеализаций = Новый Массив();
	
	Для Каждого СтрЗаказа из Объект.СписокЗаказов Цикл
		
		Если НЕ СтрЗаказа.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтрЗаказа.ДокументРеализация.Контрагент = КонтрагентМетро Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В документе " + СтрЗаказа.ДокументРеализация + " выбран контрагент отличный от """ + КонтрагентМетро + """!");
			Продолжить;
		КонецЕсли;
		
		СпРеализаций.Добавить(СтрЗаказа.ДокументРеализация);
		
	КонецЦикла;
	
	ВыгруженныйФайл = абс_ОбменДаннымиСервер.ВыгрузитьДанныеМетро(СпРеализаций);
	
	Возврат ВыгруженныйФайл;
	
КонецФункции


&НаКлиенте
Процедура ВыгрузитьУведомленияОбОтгрузке(Команда)
	
	ВыгрузитьУведомленияОбОтгрузкеНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьУведомленияОбОтгрузкеНаСервере()
	
	Для Каждого СтрЗаказа из Объект.СписокЗаказов Цикл
		
		Если НЕ СтрЗаказа.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		
		абс_ОбменДаннымиСервер.ВыгрузитьУведомлениеОбОтгрузке(СтрЗаказа.ДокументРеализация, ЕстьОшибки);
		
		Если НЕ ЕстьОшибки Тогда
			Сообщить("Выгружено уведомление об отгрузке по документу: " + СтрЗаказа.ДокументРеализация);
		Иначе
			Сообщить("Уведомление об отгрузке по документу: " + СтрЗаказа.ДокументРеализация + " не выгружено!", СтатусСообщения.ОченьВажное);
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ИмпортПодбораОВХПоОтгрузкам(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуПодбораОВХ;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	Сообщение = Новый СообщениеПользователю;
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	//+Обход массива файлов
	//загружаем первый видимый (там могут быть экселевские "копии" типа ~$имяфайла.xslx)
	ФайлОстатков = Неопределено;
	Для Каждого Файл Из МассивФайлов Цикл
		Если НЕ Файл.ПолучитьНевидимость() Тогда
			ФайлОстатков = Файл;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ФайлОстатков = Неопределено Тогда
		Сообщение.Текст = "Не найден файл для загрузки!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлОстатков.ПолноеИмя));		
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортПодбораОВХПоОтгрузкамНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	КонецЕсли;
	
	//переместим файл загрузки в архив
	Если Прав(Каталог, 1) <> "\" ТОгда
		Каталог = Каталог + "\";
	КонецЕсли;
	Каталог = Каталог + "Arhiv\";
	Попытка
		ПереместитьФайл(ФайлОстатков.ПолноеИмя,Каталог + ФайлОстатков.Имя);
	Исключение
		Сообщение.Текст = "Не удалось переместить файл загрузки в архив, сделайте это вручную!";
		Сообщение.Сообщить();
	КонецПопытки;

КонецПроцедуры

Процедура ИмпортПодбораОВХПоОтгрузкамНаСервере(МассивФайлов)
	
	ТекстЛога = ЛогированиеФайлЛога ();
	
	//+Обход массива файлов
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		КолвоСтрокExcel = 1;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
		ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Истина);
		Для каждого Строка из  ТабЗнач Цикл
			
			НомерЗаказаEDI 		= СокрЛП(Строка[11]);
			НомерЗаказаEDI = СтрЗаменить(НомерЗаказаEDI, Символы.НПП,"");
			ДатаПоставкиСтр 	= СокрЛП(Строка[0]);
			НомерЗаказа 		= СокрЛП(Строка[1]);
			НомерЗаказа = СтрЗаменить(НомерЗаказа, Символы.НПП,"");
			НомерНакладной 		= СокрЛП(Строка[2]);
			НомерНакладной = СтрЗаменить(НомерНакладной, Символы.НПП,"");
			НомерМагазинаМетро	= СокрЛП(Строка[14]);
			НомерМагазинаМетро = СтрЗаменить(НомерМагазинаМетро, Символы.НПП,"");
			КоличествоПаллетСтр	= СокрЛП(Строка[15]);
			КоличествоКоробовСтр= СокрЛП(Строка[16]);
			ОбъемФактическийСтр	= СокрЛП(Строка[17]);
			ВесФактическийСтр	= СокрЛП(Строка[18]);
			
			Попытка
				ДатаПоставки = Дата(Число(Сред(ДатаПоставкиСтр, 7, 4)), Число(Сред(ДатаПоставкиСтр, 4, 2)), Число(Сред(ДатаПоставкиСтр, 1, 2)));
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения даты поставки: " + ДатаПоставкиСтр);
			КонецПопытки;
			
			КоличествоПаллет = 0;
			КоличествоКоробов = 0;
			ОбъемФактический = 0;
			ВесФактический = 0;
			
			Попытка
				Если КоличествоПаллет<>"" Тогда
					КоличествоПаллет = Число(КоличествоПаллетСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + КоличествоПаллетСтр);
			КонецПопытки;			
			
			Попытка
				Если КоличествоКоробов<>"" Тогда
					КоличествоКоробов = Число(КоличествоКоробовСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + КоличествоКоробовСтр);
			КонецПопытки;
			
			Попытка
				Если ОбъемФактический<>"" Тогда
					ОбъемФактический = Число(ОбъемФактическийСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + ОбъемФактическийСтр);
			КонецПопытки;
			
			Попытка
				Если ВесФактический<>"" Тогда
					ВесФактический = Число(ВесФактическийСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + ВесФактическийСтр);
			КонецПопытки;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
			|	ЗначенияСвойствОбъектов.Значение КАК НомерМагазина
			|ПОМЕСТИТЬ ВТ_ДокументыНомерМагазина
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|		ПО РеализацияТоваровУслуг.Грузополучатель = ЗначенияСвойствОбъектов.Объект
			|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина))
			|ГДЕ
			|	РеализацияТоваровУслуг.Сделка.абс_НомерЗаказаEDI = &НомерЗаказаEDI
			|	И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПоставки, ДЕНЬ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДокументыНомерМагазина.РеализацияСсылка
			|ИЗ
			|	ВТ_ДокументыНомерМагазина КАК ВТ_ДокументыНомерМагазина
			|ГДЕ
			|	ВТ_ДокументыНомерМагазина.НомерМагазина = &НомерМагазина");
			
			Запрос.УстановитьПараметр("НомерЗаказаEDI"	, НомерЗаказаEDI);
			Запрос.УстановитьПараметр("ДатаПоставки"	, ДатаПоставки);
			Запрос.УстановитьПараметр("НомерМагазина"	, НомерМагазинаМетро);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				РеализацияОбъект = Выборка.РеализацияСсылка.ПолучитьОбъект();
				РеализацияОбъект.абс_КоличествоПаллет = КоличествоПаллет;
				РеализацияОбъект.абс_КоличествоТранспортныхКоробов = КоличествоКоробов;
				РеализацияОбъект.абс_ФактическийОбъем = ОбъемФактический;
				РеализацияОбъект.абс_ФактическийВес = ВесФактический;
				
				РеализацияОбъект.ОбменДанными.Загрузка = Истина;
				РеализацияОбъект.Записать();
			Иначе
				Сообщить("Не найдена реализация № " + НомерНакладной + " от " + ДатаПоставки + " Номер магазина метро " + НомерМагазинаМетро + " Номер заказа EDI " + НомерЗаказаEDI);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	//-Обход массива файлов
	ТекстЛога.Закрыть();
	
	
КонецПроцедуры



&НаКлиенте
Процедура ВыгрузитьНоменклатуруДля77(Команда)
	Каталог = "\\december\1C_Exchange\Obmen77";
	ИмяФайла = СформироватьИмяФайла ("НоменклатураДля77",Каталог,ТекущаяДата());
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;

	ТабДок = ВыгрузкаНоменклатуруДля77Сервер ();

	Попытка
        ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
    Исключение 
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ВыгрузкаНоменклатуруДля77Сервер ();
	Если Объект.СписокНоменклатур.Количество()> 0 Тогда
		//Выгружаем номенклатуру из списка
		спНоменклатура = новый Массив;
		Для каждого СтрокаТЧ из Объект.СписокНоменклатур Цикл
			спНоменклатура.Добавить(СтрокаТЧ.Номенклатура);		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Номенклатура.Артикул,
		|	Номенклатура.Наименование,
		|	Номенклатура.НаименованиеПолное,
		|	Номенклатура.СтавкаНДС,
		|	ЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	Штрихкоды.Штрихкод,
		|	ЕдиницыИзмерения.Вес,
		|	ЕдиницыИзмерения.ВесНетто
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО Номенклатура.Ссылка = Штрихкоды.Владелец
		|			И Номенклатура.ЕдиницаХраненияОстатков = Штрихкоды.ЕдиницаИзмерения
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И Номенклатура.Артикул <> """"";	
			

		Запрос.УстановитьПараметр("СписокНоменклатуры", спНоменклатура);
					
	Иначе
		//Выгружаем всю номенклатуру
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Артикул,
			|	Номенклатура.Наименование,
			|	Номенклатура.НаименованиеПолное,
			|	Номенклатура.СтавкаНДС,
			|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмерения,
			|	Штрихкоды.Штрихкод,
			|	ЕдиницыИзмерения.Вес,
			|	ЕдиницыИзмерения.ВесНетто
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
			|		ПО Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
			|		ПО Номенклатура.Ссылка = Штрихкоды.Владелец
			|			И Номенклатура.ЕдиницаХраненияОстатков = Штрихкоды.ЕдиницаИзмерения
			|ГДЕ
			|	Номенклатура.ЭтоГруппа = ЛОЖЬ
			|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
			|	И Номенклатура.Артикул <> """"";

		
	КонецЕсли;	
		
	Результат = Запрос.Выполнить();
 	ТзAssort = Результат.Выгрузить();
	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ВыгрузкаВ77");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
    ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого Стр Из ТзAssort Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
    Возврат ТабДок;	

КонецФункции

