
&НаКлиенте
// Процедура предназначена для получения файла выгрузки по выбранным реализациям
//
// Параметры:
//  ПараметрКоманды - (ДокументСсылка.РеализацияТоваровУслуг, Массив), выбранные реализации
//  ПараметрыВыполненияКоманды - (ПараметрыВыполненияКоманды), структура, передаваемая в обработчик
//
// Возвращаемое значение:
//  Нет.
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//получаем адрес временного хранилища с файлом
	сАдресВременногоХранилища = абс_ОбменДаннымиСервер.ВыгрузитьДанныеМетро(ПараметрКоманды);
	Если сАдресВременногоХранилища <> Неопределено Тогда
		//формируем имя файла
		сИмяФайла = "MGL" + Формат(ТекущаяДата(), "ДФ=ddMMyy_HHmm") + ".swr";
		//открываем форму открытия/сохранения файла
		ПолучитьФайл(сАдресВременногоХранилища, сИмяФайла);
	КонецЕсли;
	
КонецПроцедуры
