
&НаКлиенте
Процедура ТорговаяМаркаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.ЗначенияСвойствОбъектов.ПолучитьФормуВыбора(,);
	ФормаВыбора.ПараметрОтборПоВладельцу = ПланыВидовХарактеристик.СвойстваОбъектов.ТорговаяМарка;
	ФормаВыбора.РежимВыбора=Истина;
	Результат = ФормаВыбора.ОткрытьМодально();
	Запись.ТорговаяМарка = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	ФормаСписка = Справочники.ЗначенияСвойствОбъектов.ПолучитьФормуСписка();
	ФормаСписка.Обновить();
	
КонецПроцедуры
