
&НаКлиенте
Процедура ТипГруппировкиПриИзменении(Элемент)

	Элементы.БизнесРегион.Видимость = Отчет.ТипГруппировки =	"БизнесРегион" ;
	Элементы.Контрагент.Видимость = Отчет.ТипГруппировки =	"Контрагент" ;
	Элементы.Канал.Видимость = Отчет.ТипГруппировки =	"Канал" ;
	Элементы.Отдел.Видимость = Отчет.ТипГруппировки =	"Отдел" ;
	Отчет.БизнесРегион.Очистить();
	Отчет.Отдел.Очистить();
	Отчет.Контрагент.Очистить();
	Отчет.Канал = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.ТипГруппировки =	"Контрагент";	
	
	Элементы.БизнесРегион.Видимость = Отчет.ТипГруппировки =	"БизнесРегион" ;
	Элементы.Контрагент.Видимость = Отчет.ТипГруппировки =	"Контрагент" ;
	Элементы.Канал.Видимость = Отчет.ТипГруппировки =	"Канал" ;
	Элементы.Отдел.Видимость = Отчет.ТипГруппировки =	"Отдел" ;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Элементы.Результат.ОтображатьЗаголовки = Истина;
	СформироватьСервер();
	//Элементы.Результат.ФиксацияСлева = 3;
    Элементы.Результат.ФиксацияВТаблице = ФиксацияВТаблице.Лево
КонецПроцедуры


&НаСервере
Процедура СформироватьСервер()
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	ТекОбъект.СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипыСписка = "СправочникСсылка.Контрагенты";
  	ДоступныеТипы = Новый ОписаниеТипов(ТипыСписка);
    Отчет.Контрагент.ТипЗначения = ДоступныеТипы;
		
	ТипыСписка = "СправочникСсылка.Регионы";
  	ДоступныеТипы = Новый ОписаниеТипов(ТипыСписка);
    Отчет.БизнесРегион.ТипЗначения = ДоступныеТипы;
	Отчет.Отдел.ТипЗначения = ДоступныеТипы;	
КонецПроцедуры
