#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	ИначеЕсли ДанныеОтчета.Количество() = 0 Тогда
		
		НоваяСтрока = ДанныеОтчета.Добавить();
		НоваяСтрока.ТипДанных = "Стратегические цели продаж";
		
		НоваяСтрока = ДанныеОтчета.Добавить();
		НоваяСтрока.ТипДанных = "Фактические продажи";
		
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьТекстЗапроса();
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.Проект", "Проект", "Проект", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Проекты);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.Подразделение", "Подразделение", "Подразделение", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Подразделения);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.Контрагент", "Контрагент", "Контрагент", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.Договор", "Договор", "Договор", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.Заказ", "Заказ", "Заказ", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.НоменклатурнаяГруппа", "НоменклатурнаяГруппа", "Номенклатурная группа", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_НоменклатурныеГруппы);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("РезультатАнализа.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипДанных", "Источник данных");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Регион", "Регион");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоТочекПродаж", "Количество точек продаж");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоТочекПродажОтклонение", "Отклонение количества ТП");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоТочекПродажОтклонениеПроцент", "Отклонение количества ТП (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("АКБ", "Активная клиентская база");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("АКБОтклонение", "Отклонение АКБ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("АКБОтклонениеПроцент", "Отклонение АКБ (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоАртикулов", "Количество артикулов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоАртикуловОтклонение", "Отклонение количества артикулов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоАртикуловОтклонениеПроцент", "Отклонение количества артикулов (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоЧисленнойДистрибуции", "Цель по численной дистрибуции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоЧисленнойДистрибуцииОтклонение", "Отклонение цели по численной дистрибуции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоЧисленнойДистрибуцииОтклонениеПроцент", "Отклонение цели по численной дистрибуции (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА1", "Цель по дистрибуции фокусного ассортимента 1");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА1Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 1");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА1ОтклонениеПроцент", "Отклонение цели по дистрибуции фокусного ассортимента 1 (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА2", "Цель по дистрибуции фокусного ассортимента 2");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА2Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 2");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА2ОтклонениеПроцент", "Отклонение цели по дистрибуции фокусного ассортимента 2 (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА3", "Цель по дистрибуции фокусного ассортимента 3");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА3Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 3");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА3ОтклонениеПроцент", "Отклонение цели по дистрибуции фокусного ассортимента 3 (%)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА4", "Цель по дистрибуции фокусного ассортимента 4");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА4Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 4");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЦельПоДистрибуцииФА4ОтклонениеПроцент", "Отклонение цели по дистрибуции фокусного ассортимента 4 (%)");
	
	// Добавление показателей
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоТочекПродаж", "Количество точек продаж", Ложь, "ЧЦ=15; ЧДЦ=0", "КоличествоТочекПродаж", "Количество точек продаж");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоТочекПродажОтклонение", "Отклонение количества ТП", Ложь, "ЧЦ=15; ЧДЦ=0", "ОтклонениеКоличестваТочекПродаж", "Отклонение количества ТП");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоТочекПродажОтклонениеПроцент", "%", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеКоличестваТочекПродаж");
	
	УниверсальныйОтчет.ДобавитьПоказатель("АКБ", "Активная клиентская база", Ложь, "ЧЦ=15; ЧДЦ=0", "АКБ", "Активная клиентская база");
	УниверсальныйОтчет.ДобавитьПоказатель("АКБОтклонение", "Отклонение АКБ", Ложь, "ЧЦ=15; ЧДЦ=0", "ОтклонениеАКБ", "Отклонение АКБ");
	УниверсальныйОтчет.ДобавитьПоказатель("АКБОтклонениеПроцент", "%", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеАКБ");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоАртикулов", "Количество артикулов", Ложь, "ЧЦ=15; ЧДЦ=0", "КоличествоАртикулов", "Количество артикулов");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоТочекПродажОтклонение", "Отклонение количества артикулов", Ложь, "ЧЦ=15; ЧДЦ=0", "ОтклонениеКоличестваАртикулов", "Отклонение количества артикулов");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоТочекПродажОтклонениеПроцент", "%", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеКоличестваАртикулов");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоЧисленнойДистрибуции", "Цель по численной дистрибуции", Истина, "ЧЦ=15; ЧДЦ=0", "ЦельПоЧисленнойДистрибуции", "Цель по численной дистрибуции");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоЧисленнойДистрибуцииОтклонение", "Отклонение цели по численной дистрибуции", Истина, "ЧЦ=15; ЧДЦ=0", "ОтклонениеЦелиПоЧисленнойДистрибуции", "Отклонение цели по численной дистрибуции");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоЧисленнойДистрибуцииОтклонениеПроцент", "%", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеЦелиПоЧисленнойДистрибуции");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА1", "Цель по дистрибуции фокусного ассортимента 1", Истина, "ЧЦ=15; ЧДЦ=0", "ЦельПоДистрибуцииФА1", "Цель по дистрибуции фокусного ассортимента 1");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА1Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 1", Истина, "ЧЦ=15; ЧДЦ=0", "ОтклонениеЦелиПоДистрибуцииФА1", "Отклонение цели по дистрибуции фокусного ассортимента 1");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА1ОтклонениеПроцент", "%", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеЦелиПоДистрибуцииФА1");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА2", "Цель по дистрибуции фокусного ассортимента 2", Истина, "ЧЦ=15; ЧДЦ=0", "ЦельПоДистрибуцииФА2", "Цель по дистрибуции фокусного ассортимента 2");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА2Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 2", Истина, "ЧЦ=15; ЧДЦ=0", "ОтклонениеЦелиПоДистрибуцииФА2", "Отклонение цели по дистрибуции фокусного ассортимента 2");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА2ОтклонениеПроцент", "%", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеЦелиПоДистрибуцииФА2");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА3", "Цель по дистрибуции фокусного ассортимента 3", Истина, "ЧЦ=15; ЧДЦ=0", "ЦельПоДистрибуцииФА3", "Цель по дистрибуции фокусного ассортимента 3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА3Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 3", Истина, "ЧЦ=15; ЧДЦ=0", "ОтклонениеЦелиПоДистрибуцииФА3", "Отклонение цели по дистрибуции фокусного ассортимента 3");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА3ОтклонениеПроцент", "%", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеЦелиПоДистрибуцииФА3");

	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА4", "Цель по дистрибуции фокусного ассортимента 4", Истина, "ЧЦ=15; ЧДЦ=0", "ЦельПоДистрибуцииФА4", "Цель по дистрибуции фокусного ассортимента 4");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА4Отклонение", "Отклонение цели по дистрибуции фокусного ассортимента 4", Истина, "ЧЦ=15; ЧДЦ=0", "ОтклонениеЦелиПоДистрибуцииФА4", "Отклонение цели по дистрибуции фокусного ассортимента 4");
	УниверсальныйОтчет.ДобавитьПоказатель("ЦельПоДистрибуцииФА4ОтклонениеПроцент", "%", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеЦелиПоДистрибуцииФА4");

	// Добавление предопределенных группировок строк отчета.
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Регион");
	
	// Добавление предопределенных группировок колонок отчета.
	УниверсальныйОтчет.ДобавитьИзмерениеКолонки("ТипДанных");
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Регион");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

Функция ПолучитьТекстЗапроса() Экспорт
	
	ТекстЗапроса = "";
	
	ЭталонныйТипДанных = ДанныеОтчета[0].ТипДанных;
	
	Для каждого СравниваемыеДанные из ДанныеОтчета Цикл
		
		СравниваемыйТипДанных = СравниваемыеДанные.ТипДанных;
		
		ДобавитьПлан_План(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
		//Если ЭталонныйТипДанных = "Планы продаж" И СравниваемыйТипДанных = "Фактические продажи" Тогда
		//	
		//	ДобавитьФакт_План(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
		//	
		//ИначеЕсли ЭталонныйТипДанных = "Фактические продажи" И СравниваемыйТипДанных = "Планы продаж" Тогда
		//	
		//	ДобавитьПлан_Факт(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
		//	
		//ИначеЕсли ЭталонныйТипДанных = "Планы продаж" И СравниваемыйТипДанных = "Планы продаж" Тогда
		//	
		//	ДобавитьПлан_План(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
		//	
		//ИначеЕсли ЭталонныйТипДанных = "Фактические продажи" И СравниваемыйТипДанных = "Фактические продажи" Тогда
		//	
		//	ДобавитьФакт_Факт(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|{УПОРЯДОЧИТЬ ПО
	|	ТипДанных,
	|	Регион.*,
	|	Территория.*,
	|	Город.*,
	|	Канал.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	КоличествоТочекПродаж,
	|	КоличествоТочекПродажОтклонение,
	|	КоличествоТочекПродажОтклонениеПроцент,
	|	ЦельПоЧисленнойДистрибуции,
	|	ЦельПоЧисленнойДистрибуцииОтклонение,
	|	ЦельПоЧисленнойДистрибуцииОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА1,
	|	ЦельПоДистрибуцииФА1Отклонение,
	|	ЦельПоДистрибуцииФА1ОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА2,
	|	ЦельПоДистрибуцииФА2Отклонение,
	|	ЦельПоДистрибуцииФА2ОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА3,
	|	ЦельПоДистрибуцииФА3Отклонение,
	|	ЦельПоДистрибуцииФА3ОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА4,
	|	ЦельПоДистрибуцииФА4Отклонение,
	|	ЦельПоДистрибуцииФА4ОтклонениеПроцент,
	|	АКБ,
	|	АКБОтклонение,
	|	АКБОтклонениеПроцент,
	|	КоличествоАртикулов,
	|	КоличествоАртикуловОтклонение,
	|	КоличествоАртикуловОтклонениеПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	СУММА(КоличествоТочекПродаж),
	|	СУММА(КоличествоТочекПродажОтклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(КоличествоТочекПродажОтклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(КоличествоТочекПродаж), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(КоличествоТочекПродаж) - СУММА(КоличествоТочекПродажОтклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(КоличествоТочекПродажОтклонение) * 100 / (СУММА(КоличествоТочекПродаж) - СУММА(КоличествоТочекПродажОтклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК КоличествоТочекПродажОтклонениеПроцент,
	|	СУММА(ЦельПоЧисленнойДистрибуции),
	|	СУММА(ЦельПоЧисленнойДистрибуцииОтклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоЧисленнойДистрибуцииОтклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоЧисленнойДистрибуции), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(ЦельПоЧисленнойДистрибуции) - СУММА(ЦельПоЧисленнойДистрибуцииОтклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(ЦельПоЧисленнойДистрибуцииОтклонение) * 100 / (СУММА(ЦельПоЧисленнойДистрибуции) - СУММА(ЦельПоЧисленнойДистрибуцииОтклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЦельПоЧисленнойДистрибуцииОтклонениеПроцент,
	|	СУММА(ЦельПоДистрибуцииФА1),
	|	СУММА(ЦельПоДистрибуцииФА1Отклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА1Отклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА1), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(ЦельПоДистрибуцииФА1) - СУММА(ЦельПоДистрибуцииФА1Отклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(ЦельПоДистрибуцииФА1Отклонение) * 100 / (СУММА(ЦельПоДистрибуцииФА1) - СУММА(ЦельПоДистрибуцииФА1Отклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА1ОтклонениеПроцент,
	|	СУММА(ЦельПоДистрибуцииФА2),
	|	СУММА(ЦельПоДистрибуцииФА2Отклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА2Отклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА2), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(ЦельПоДистрибуцииФА2) - СУММА(ЦельПоДистрибуцииФА2Отклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(ЦельПоДистрибуцииФА2Отклонение) * 100 / (СУММА(ЦельПоДистрибуцииФА2) - СУММА(ЦельПоДистрибуцииФА2Отклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА2ОтклонениеПроцент,
	|	СУММА(ЦельПоДистрибуцииФА3),
	|	СУММА(ЦельПоДистрибуцииФА3Отклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА3Отклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА3), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(ЦельПоДистрибуцииФА3) - СУММА(ЦельПоДистрибуцииФА3Отклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(ЦельПоДистрибуцииФА3Отклонение) * 100 / (СУММА(ЦельПоДистрибуцииФА3) - СУММА(ЦельПоДистрибуцииФА3Отклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА3ОтклонениеПроцент,
	|	СУММА(ЦельПоДистрибуцииФА4),
	|	СУММА(ЦельПоДистрибуцииФА4Отклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА4Отклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(ЦельПоДистрибуцииФА4), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(ЦельПоДистрибуцииФА4) - СУММА(ЦельПоДистрибуцииФА4Отклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(ЦельПоДистрибуцииФА4Отклонение) * 100 / (СУММА(ЦельПоДистрибуцииФА4) - СУММА(ЦельПоДистрибуцииФА4Отклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА4ОтклонениеПроцент,
	|	СУММА(АКБ),
	|	СУММА(АКБОтклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(АКБОтклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(АКБ), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(АКБ) - СУММА(АКБОтклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(АКБОтклонение) * 100 / (СУММА(АКБ) - СУММА(АКБОтклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК АКБОтклонениеПроцент,
	|	СУММА(КоличествоАртикулов),
	|	СУММА(КоличествоАртикуловОтклонение),
	|	ВЫБОР КОГДА ЕСТЬNULL(СУММА(КоличествоАртикуловОтклонение), 0) = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		ВЫБОР КОГДА ЕСТЬNULL(СУММА(КоличествоАртикулов), 0) = 0 ТОГДА
	|			- 100
	|		ИНАЧЕ
	|			ВЫБОР КОГДА (СУММА(КоличествоАртикулов) - СУММА(КоличествоАртикуловОтклонение)) = 0 ТОГДА
	|				""-""
	|			ИНАЧЕ
	|				СУММА(КоличествоАртикуловОтклонение) * 100 / (СУММА(КоличествоАртикулов) - СУММА(КоличествоАртикуловОтклонение))
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК КоличествоАртикуловОтклонениеПроцент
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	ТипДанных,
	|	Регион.*,
	|	Территория.*,
	|	Город.*,
	|	Канал.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
		
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапроса()

// Эталонные данные - "Факт", текущие данные - "План"
Процедура ДобавитьПлан_Факт(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	Если НомерСтроки > 1 Тогда
			
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
			
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Проект КАК Проект,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Проект) КАК ПроектПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппаПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	РезультатАнализа.Ответственный КАК Ответственный,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Ответственный) КАК ОтветственныйПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.Количество КАК Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Проект.*,
	|	Подразделение.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Заказ.*,
	|	НоменклатурнаяГруппа.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Ответственный.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Проект КАК Проект,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		АнализируемыеДанные.Ответственный КАК Ответственный,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличество) КАК Количество,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличество) - СУММА(АнализируемыеДанные.ПродажиКоличество) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоБазовыхЕдиниц) - СУММА(АнализируемыеДанные.ПродажиКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоЕдиницОтчетов) - СУММА(АнализируемыеДанные.ПродажиКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажСтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ПланыПродажНДС) КАК НДС,
	|		СУММА(АнализируемыеДанные.ПланыПродажСтоимостьСНДС) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ПланыПродажСтоимостьБезНДС) - СУММА(АнализируемыеДанные.ПродажиСтоимостьБезНДС) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажНДС) - СУММА(АнализируемыеДанные.ПродажиНДС) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажСтоимостьСНДС) - СУММА(АнализируемыеДанные.ПродажиСтоимостьСНДС) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПланыПродажОбороты.Проект КАК Проект,
	|			ПланыПродажОбороты.Подразделение КАК Подразделение,
	|			ПланыПродажОбороты.Контрагент КАК Контрагент,
	|			ПланыПродажОбороты.Договор КАК Договор,
	|			ПланыПродажОбороты.Заказ КАК Заказ,
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ПланыПродажОбороты.Номенклатура.НоменклатурнаяГруппа
	|					ИНАЧЕ ПланыПродажОбороты.Номенклатура
	|				КОНЕЦ КАК Справочник.НоменклатурныеГруппы) КАК НоменклатурнаяГруппа,
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Номенклатура ССЫЛКА Справочник.НоменклатурныеГруппы
	|						ТОГДА &СправочникНоменклатураПустаяСсылка
	|					ИНАЧЕ ПланыПродажОбороты.Номенклатура
	|				КОНЕЦ КАК Справочник.Номенклатура) КАК Номенклатура,
	|			ПланыПродажОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПланыПродажОбороты.ДокументПланирования.Ответственный КАК Ответственный,
	|			ПланыПродажОбороты.Регистратор КАК Регистратор,
	|			ПланыПродажОбороты.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ГОД) КАК ПериодГод,
	|			ПланыПродажОбороты.КоличествоОборот КАК ПланыПродажКоличество,
	|			ПланыПродажОбороты.КоличествоОборот * ПланыПродажОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПланыПродажКоличествоБазовыхЕдиниц,
	|			ПланыПродажОбороты.КоличествоОборот * ПланыПродажОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЕСТЬNULL(ПланыПродажОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК ПланыПродажКоличествоЕдиницОтчетов,
	|			0 КАК ПродажиКоличество,
	|			0 КАК ПродажиКоличествоБазовыхЕдиниц,
	|			0 КАК ПродажиКоличествоЕдиницОтчетов,
	|			ПланыПродажОбороты.СтоимостьОборот КАК ПланыПродажСтоимостьБезНДС,
	|			ПланыПродажОбороты.НДСОборот КАК ПланыПродажНДС,
	|			ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот КАК ПланыПродажСтоимостьСНДС,
	|			0 КАК ПродажиСтоимостьБезНДС,
	|			0 КАК ПродажиНДС,
	|			0 КАК ПродажиСтоимостьСНДС
	|		ИЗ
	|			РегистрНакопления.ПланыПродаж.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ВЫБОР КОГДА &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " КОНЕЦ {Проект.* КАК Проект, Подразделение.* КАК Подразделение, Контрагент.* КАК Контрагент, Договор.* КАК Договор, Заказ.* КАК Заказ, ДокументПланирования.* КАК ДокументПланирования, ВЫРАЗИТЬ((ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа ИНАЧЕ Номенклатура КОНЕЦ) КАК Справочник.НоменклатурныеГруппы).* КАК НоменклатурнаяГруппа, ВЫРАЗИТЬ(Номенклатура КАК Справочник.Номенклатура).* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПланирования.Ответственный.* КАК Ответственный, ВариантРаспределения.* КАК ВариантРаспределения}) КАК ПланыПродажОбороты
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПродажиОбороты.Проект КАК Проект,
	|			ПродажиОбороты.Подразделение КАК Подразделение,
	|			ПродажиОбороты.Контрагент КАК Контрагент,
	|			ПродажиОбороты.ДоговорКонтрагента КАК Договор,
	|			ПродажиОбороты.ЗаказПокупателя КАК Заказ,
	|			ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ПродажиОбороты.Номенклатура КАК Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.ДокументПродажи.Ответственный КАК Ответственный,
	|			ПродажиОбороты.Регистратор КАК Регистратор,
	|			ПродажиОбороты.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ГОД) КАК ПериодГод,
	|			0 КАК ПланыПродажКоличество,
	|			0 КАК ПланыПродажКоличествоБазовыхЕдиниц,
	|			0 КАК ПланыПродажКоличествоЕдиницОтчетов,
	|			ПродажиОбороты.КоличествоОборот КАК ПродажиКоличество,
	|			ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПродажиКоличествоБазовыхЕдиниц,
	|			ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК ПродажиКоличествоЕдиницОтчетов,
	|			0 КАК ПланыПродажСтоимостьБезНДС,
	|			0 КАК ПланыПродажНДС,
	|			0 КАК ПланыПродажСтоимостьСНДС,
	|			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК ПродажиСтоимостьБезНДС,
	|			ПродажиОбороты.НДСОборот КАК ПродажиНДС,
	|			ПродажиОбороты.СтоимостьОборот КАК ПродажиСтоимостьСНДС
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, {Организация.* КАК Организация, Проект.* КАК Проект, Подразделение.* КАК Подразделение, Контрагент.* КАК Контрагент, ДоговорКонтрагента.* КАК Договор, ЗаказПокупателя.* КАК Заказ, ДокументПродажи.* КАК ДокументПродажи, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПродажи.Ответственный.* КАК Ответственный}) КАК ПродажиОбороты) КАК АнализируемыеДанные
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Проект,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.НоменклатурнаяГруппа,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ХарактеристикаНоменклатуры,
	|		АнализируемыеДанные.Ответственный,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.Количество КАК Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}";
		
КонецПроцедуры // ДобавитьПлан_Факт()

// Эталонные данные - "План", текущие данные - "Факт"
Процедура ДобавитьФакт_План(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	Если НомерСтроки > 1 Тогда
			
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
			
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Проект КАК Проект,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Проект) КАК ПроектПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппаПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	РезультатАнализа.Ответственный КАК Ответственный,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Ответственный) КАК ОтветственныйПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.Количество КАК Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Проект.*,
	|	Подразделение.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Заказ.*,
	|	НоменклатурнаяГруппа.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Ответственный.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Проект КАК Проект,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		АнализируемыеДанные.Ответственный КАК Ответственный,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		СУММА(АнализируемыеДанные.ПродажиКоличество) КАК Количество,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ПродажиКоличество) - СУММА(АнализируемыеДанные.ПланыПродажКоличество) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоБазовыхЕдиниц) - СУММА(АнализируемыеДанные.ПланыПродажКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоЕдиницОтчетов) - СУММА(АнализируемыеДанные.ПланыПродажКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьБезНДС) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ПродажиНДС) КАК НДС,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьСНДС) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьБезНДС) - СУММА(АнализируемыеДанные.ПланыПродажСтоимостьБезНДС) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиНДС) - СУММА(АнализируемыеДанные.ПланыПродажНДС) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьСНДС) - СУММА(АнализируемыеДанные.ПланыПродажСтоимостьСНДС) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОбороты.Проект КАК Проект,
	|			ПродажиОбороты.Подразделение КАК Подразделение,
	|			ПродажиОбороты.Контрагент КАК Контрагент,
	|			ПродажиОбороты.ДоговорКонтрагента КАК Договор,
	|			ПродажиОбороты.ЗаказПокупателя КАК Заказ,
	|			ПродажиОбороты.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ПродажиОбороты.Номенклатура КАК Номенклатура,
	|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОбороты.ДокументПродажи.Ответственный КАК Ответственный,
	|			ПродажиОбороты.Регистратор КАК Регистратор,
	|			ПродажиОбороты.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ГОД) КАК ПериодГод,
	|			ПродажиОбороты.КоличествоОборот КАК ПродажиКоличество,
	|			ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПродажиКоличествоБазовыхЕдиниц,
	|			ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК ПродажиКоличествоЕдиницОтчетов,
	|			0 КАК ПланыПродажКоличество,
	|			0 КАК ПланыПродажКоличествоБазовыхЕдиниц,
	|			0 КАК ПланыПродажКоличествоЕдиницОтчетов,
	|			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК ПродажиСтоимостьБезНДС,
	|			ПродажиОбороты.НДСОборот КАК ПродажиНДС,
	|			ПродажиОбороты.СтоимостьОборот КАК ПродажиСтоимостьСНДС,
	|			0 КАК ПланыПродажСтоимостьБезНДС,
	|			0 КАК ПланыПродажНДС,
	|			0 КАК ПланыПродажСтоимостьСНДС
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, {Организация.* КАК Организация, Проект.* КАК Проект, Подразделение.* КАК Подразделение, Контрагент.* КАК Контрагент, ДоговорКонтрагента.* КАК Договор, ЗаказПокупателя.* КАК Заказ, ДокументПродажи.* КАК ДокументПродажи, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПродажи.Ответственный.* КАК Ответственный}) КАК ПродажиОбороты
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПланыПродажОбороты.Проект КАК Проект,
	|			ПланыПродажОбороты.Подразделение КАК Подразделение,
	|			ПланыПродажОбороты.Контрагент КАК Контрагент,
	|			ПланыПродажОбороты.Договор КАК Договор,
	|			ПланыПродажОбороты.Заказ КАК Заказ,
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура
	|						ТОГДА ПланыПродажОбороты.Номенклатура.НоменклатурнаяГруппа
	|					ИНАЧЕ ПланыПродажОбороты.Номенклатура
	|				КОНЕЦ КАК Справочник.НоменклатурныеГруппы) КАК НоменклатурнаяГруппа,
	|			ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Номенклатура ССЫЛКА Справочник.НоменклатурныеГруппы
	|						ТОГДА &СправочникНоменклатураПустаяСсылка
	|					ИНАЧЕ ПланыПродажОбороты.Номенклатура
	|				КОНЕЦ КАК Справочник.Номенклатура) КАК Номенклатура,
	|			ПланыПродажОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПланыПродажОбороты.ДокументПланирования.Ответственный КАК Ответственный,
	|			ПланыПродажОбороты.Регистратор КАК Регистратор,
	|			ПланыПродажОбороты.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ГОД) КАК ПериодГод,
	|			0 КАК ПродажиКоличество,
	|			0 КАК ПродажиКоличествоБазовыхЕдиниц,
	|			0 КАК ПродажиКоличествоЕдиницОтчетов,
	|			ПланыПродажОбороты.КоличествоОборот КАК ПланыПродажКоличество,
	|			ПланыПродажОбороты.КоличествоОборот * ПланыПродажОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПланыПродажКоличествоБазовыхЕдиниц,
	|			ПланыПродажОбороты.КоличествоОборот * ПланыПродажОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЕСТЬNULL(ПланыПродажОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК ПланыПродажКоличествоЕдиницОтчетов,
	|			0 КАК ПродажиСтоимостьБезНДС,
	|			0 КАК ПродажиНДС,
	|			0 КАК ПродажиСтоимостьСНДС,
	|			ПланыПродажОбороты.СтоимостьОборот КАК ПланыПродажСтоимостьБезНДС,
	|			ПланыПродажОбороты.НДСОборот КАК ПланыПродажНДС,
	|			ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот КАК ПланыПродажСтоимостьСНДС
	|		ИЗ
	|			РегистрНакопления.ПланыПродаж.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ВЫБОР КОГДА &Сценарий1 = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий1 КОНЕЦ {Проект.* КАК Проект, Подразделение.* КАК Подразделение, Контрагент.* КАК Контрагент, Договор.* КАК Договор, Заказ.* КАК Заказ, ДокументПланирования.* КАК ДокументПланирования, ВЫРАЗИТЬ((ВЫБОР КОГДА Номенклатура ССЫЛКА Справочник.Номенклатура ТОГДА Номенклатура.НоменклатурнаяГруппа ИНАЧЕ Номенклатура КОНЕЦ) КАК Справочник.НоменклатурныеГруппы).* КАК НоменклатурнаяГруппа, ВЫРАЗИТЬ(Номенклатура КАК Справочник.Номенклатура).* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПланирования.Ответственный.* КАК Ответственный, ВариантРаспределения.* КАК ВариантРаспределения}) КАК ПланыПродажОбороты) КАК АнализируемыеДанные
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Проект,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.НоменклатурнаяГруппа,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ХарактеристикаНоменклатуры,
	|		АнализируемыеДанные.Ответственный,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.Количество КАК Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}";
	
КонецПроцедуры // ДобавитьФакт_План()

// Эталонные данные - "План", текущие данные - "План"
Процедура ДобавитьПлан_План(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
	
	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	Если НомерСтроки > 1 Тогда
			
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
			
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Регион КАК Регион,
	|	РезультатАнализа.Территория КАК Территория,
	|	РезультатАнализа.Город КАК Город,
	|	РезультатАнализа.Канал КАК Канал,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регион) КАК РегионПредставление,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Территория) КАК ТерриторияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Город) КАК ГородПредставление,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Канал) КАК КаналПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.КоличествоТочекПродаж КАК КоличествоТочекПродаж,
	|	РезультатАнализа.КоличествоТочекПродажОтклонение КАК КоличествоТочекПродажОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоТочекПродажОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.КоличествоТочекПродаж = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.КоличествоТочекПродаж - РезультатАнализа.КоличествоТочекПродажОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоТочекПродажОтклонение * 100 / РезультатАнализа.КоличествоТочекПродаж - РезультатАнализа.КоличествоТочекПродажОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоТочекПродажОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоЧисленнойДистрибуции КАК ЦельПоЧисленнойДистрибуции,
	|	РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение КАК ЦельПоЧисленнойДистрибуцииОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоЧисленнойДистрибуции = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоЧисленнойДистрибуции - РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение * 100 / РезультатАнализа.ЦельПоЧисленнойДистрибуции - РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоЧисленнойДистрибуцииОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА1 КАК ЦельПоДистрибуцииФА1,
	|	РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение КАК ЦельПоДистрибуцииФА1Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА1 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА1 - РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА1 - РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА1ОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА2 КАК ЦельПоДистрибуцииФА2,
	|	РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение КАК ЦельПоДистрибуцииФА2Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА2 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА2 - РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА2 - РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА2ОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА3 КАК ЦельПоДистрибуцииФА3,
	|	РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение КАК ЦельПоДистрибуцииФА3Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА3 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА3 - РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА3 - РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА3ОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА4 КАК ЦельПоДистрибуцииФА4,
	|	РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение КАК ЦельПоДистрибуцииФА4Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА4 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА4 - РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА4 - РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА4ОтклонениеПроцент,
	|	РезультатАнализа.АКБ КАК АКБ,
	|	РезультатАнализа.АКБОтклонение КАК АКБОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.АКБОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.АКБ = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.АКБ - РезультатАнализа.АКБОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.АКБОтклонение * 100 / РезультатАнализа.АКБ - РезультатАнализа.АКБОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК АКБОтклонениеПроцент,
	|	РезультатАнализа.КоличествоАртикулов КАК КоличествоАртикулов,
	|	РезультатАнализа.КоличествоАртикуловОтклонение КАК КоличествоАртикуловОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоАртикуловОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.КоличествоАртикулов = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.КоличествоАртикулов - РезультатАнализа.КоличествоАртикуловОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоАртикуловОтклонение * 100 / РезультатАнализа.КоличествоАртикулов - РезультатАнализа.КоличествоАртикуловОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоАртикуловОтклонениеПроцент
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Регион.*,
	|	Территория.*,
	|	Город.*,
	|	Канал.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	КоличествоТочекПродаж,
	|	КоличествоТочекПродажОтклонение,
	|	КоличествоТочекПродажОтклонениеПроцент,
	|	ЦельПоЧисленнойДистрибуции,
	|	ЦельПоЧисленнойДистрибуцииОтклонение,
	|	ЦельПоЧисленнойДистрибуцииОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА1,
	|	ЦельПоДистрибуцииФА1Отклонение,
	|	ЦельПоДистрибуцииФА1ОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА2,
	|	ЦельПоДистрибуцииФА2Отклонение,
	|	ЦельПоДистрибуцииФА2ОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА3,
	|	ЦельПоДистрибуцииФА3Отклонение,
	|	ЦельПоДистрибуцииФА3ОтклонениеПроцент,
	|	ЦельПоДистрибуцииФА4,
	|	ЦельПоДистрибуцииФА4Отклонение,
	|	ЦельПоДистрибуцииФА4ОтклонениеПроцент,
	|	АКБ,
	|	АКБОтклонение,
	|	АКБОтклонениеПроцент,
	|	КоличествоАртикулов,
	|	КоличествоАртикуловОтклонение,
	|	КоличествоАртикуловОтклонениеПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Регион КАК Регион,
	|		АнализируемыеДанные.Территория КАК Территория,
	|		АнализируемыеДанные.Город КАК Город,
	|		АнализируемыеДанные.Канал КАК Канал,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоТочекПродажТекущие) КАК КоличествоТочекПродаж,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоТочекПродажТекущие) - СУММА(АнализируемыеДанные.ПланыПродажКоличествоТочекПродажЭталонные) КАК КоличествоТочекПродажОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоЧисленнойДистрибуцииТекущие) КАК ЦельПоЧисленнойДистрибуции,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоЧисленнойДистрибуцииТекущие) - СУММА(АнализируемыеДанные.ПланыПродажЦельПоЧисленнойДистрибуцииЭталонные) КАК ЦельПоЧисленнойДистрибуцииОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА1Текущие) КАК ЦельПоДистрибуцииФА1,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА1Текущие) - СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА1Эталонные) КАК ЦельПоДистрибуцииФА1Отклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА2Текущие) КАК ЦельПоДистрибуцииФА2,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА2Текущие) - СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА2Эталонные) КАК ЦельПоДистрибуцииФА2Отклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА3Текущие) КАК ЦельПоДистрибуцииФА3,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА3Текущие) - СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА3Эталонные) КАК ЦельПоДистрибуцииФА3Отклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА4Текущие) КАК ЦельПоДистрибуцииФА4,
	|		СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА4Текущие) - СУММА(АнализируемыеДанные.ПланыПродажЦельПоДистрибуцииФА4Эталонные) КАК ЦельПоДистрибуцииФА4Отклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажАКБТекущие) КАК АКБ,
	|		СУММА(АнализируемыеДанные.ПланыПродажАКБТекущие) - СУММА(АнализируемыеДанные.ПланыПродажАКБЭталонные) КАК АКБОтклонение,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоАртикуловТекущие) КАК КоличествоАртикулов,
	|		СУММА(АнализируемыеДанные.ПланыПродажКоличествоАртикуловТекущие) - СУММА(АнализируемыеДанные.ПланыПродажКоличествоАртикуловЭталонные) КАК КоличествоАртикуловОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПланыПродажОборотыТекущие.Регион КАК Регион,
	|			ПланыПродажОборотыТекущие.Территория КАК Территория,
	|			ПланыПродажОборотыТекущие.Город КАК Город,
	|			ПланыПродажОборотыТекущие.Канал КАК Канал,
	|			ПланыПродажОборотыТекущие.Регистратор КАК Регистратор,
	|			ПланыПродажОборотыТекущие.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыТекущие.Период, ГОД) КАК ПериодГод,
	|			ПланыПродажОборотыТекущие.КоличествоТочекПродажОборот КАК ПланыПродажКоличествоТочекПродажТекущие,
	|			0 КАК ПланыПродажКоличествоТочекПродажЭталонные,
	|			ПланыПродажОборотыТекущие.ЦельПоЧисленнойДистрибуцииОборот КАК ПланыПродажЦельПоЧисленнойДистрибуцииТекущие,
	|			0 КАК ПланыПродажЦельПоЧисленнойДистрибуцииЭталонные,
	|			ПланыПродажОборотыТекущие.ЦельПоДистрибуцииФА1Оборот КАК ПланыПродажЦельПоДистрибуцииФА1Текущие,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА1Эталонные,
	|			ПланыПродажОборотыТекущие.ЦельПоДистрибуцииФА2Оборот КАК ПланыПродажЦельПоДистрибуцииФА2Текущие,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА2Эталонные,
	|			ПланыПродажОборотыТекущие.ЦельПоДистрибуцииФА3Оборот КАК ПланыПродажЦельПоДистрибуцииФА3Текущие,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА3Эталонные,
	|			ПланыПродажОборотыТекущие.ЦельПоДистрибуцииФА4Оборот КАК ПланыПродажЦельПоДистрибуцииФА4Текущие,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА4Эталонные,
	|			ПланыПродажОборотыТекущие.АКБОборот КАК ПланыПродажАКБТекущие,
	|			0 КАК ПланыПродажАКБЭталонные,
	|			ПланыПродажОборотыТекущие.КоличествоАртикуловОборот КАК ПланыПродажКоличествоАртикуловТекущие,
	|			0 КАК ПланыПродажКоличествоАртикуловЭталонные
	|		ИЗ
	|			РегистрНакопления.абс_ЦелиПродаж.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ВЫБОР КОГДА &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " КОНЕЦ {Регион.* КАК Регион}) КАК ПланыПродажОборотыТекущие
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПланыПродажОборотыЭталонные.Регион КАК Регион,
	|			ПланыПродажОборотыЭталонные.Территория КАК Территория,
	|			ПланыПродажОборотыЭталонные.Город КАК Город,
	|			ПланыПродажОборотыЭталонные.Канал КАК Канал,
	|			ПланыПродажОборотыЭталонные.Регистратор КАК Регистратор,
	|			ПланыПродажОборотыЭталонные.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПланыПродажОборотыЭталонные.Период, ГОД) КАК ПериодГод,
	|			0 КАК ПланыПродажКоличествоТочекПродажТекущие,
	|			ПланыПродажОборотыЭталонные.КоличествоТочекПродажОборот КАК ПланыПродажКоличествоТочекПродажЭталонные,
	|			0 КАК ПланыПродажЦельПоЧисленнойДистрибуцииТекущие,
	|			ПланыПродажОборотыЭталонные.ЦельПоЧисленнойДистрибуцииОборот КАК ПланыПродажЦельПоЧисленнойДистрибуцииЭталонные,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА1екущие,
	|			ПланыПродажОборотыЭталонные.ЦельПоДистрибуцииФА1Оборот КАК ПланыПродажЦельПоДистрибуцииФА1Эталонные,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА2екущие,
	|			ПланыПродажОборотыЭталонные.ЦельПоДистрибуцииФА2Оборот КАК ПланыПродажЦельПоДистрибуцииФА2Эталонные,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА3екущие,
	|			ПланыПродажОборотыЭталонные.ЦельПоДистрибуцииФА3Оборот КАК ПланыПродажЦельПоДистрибуцииФА3Эталонные,
	|			0 КАК ПланыПродажЦельПоДистрибуцииФА4екущие,
	|			ПланыПродажОборотыЭталонные.ЦельПоДистрибуцииФА4Оборот КАК ПланыПродажЦельПоДистрибуцииФА4Эталонные,
	|			0 КАК ПланыПродажАКБТекущие,
	|			ПланыПродажОборотыЭталонные.АКБОборот КАК ПланыПродажАКБЭталонные,
	|			0 КАК ПланыПродажКоличествоАртикуловТекущие,
	|			ПланыПродажОборотыЭталонные.КоличествоАртикуловОборот КАК ПланыПродажКоличествоАртикуловЭталонные
	|		ИЗ
	|			РегистрНакопления.абс_ЦелиПродаж.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ВЫБОР КОГДА &Сценарий1 = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий1 КОНЕЦ {Регион.* КАК Регион}) КАК ПланыПродажОборотыЭталонные) КАК АнализируемыеДанные
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Регион,
	|		АнализируемыеДанные.Территория,
	|		АнализируемыеДанные.Город,
	|		АнализируемыеДанные.Канал,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.КоличествоТочекПродаж КАК КоличествоТочекПродаж,
	|	РезультатАнализа.КоличествоТочекПродажОтклонение КАК КоличествоТочекПродажОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоТочекПродажОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.КоличествоТочекПродаж = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.КоличествоТочекПродаж - РезультатАнализа.КоличествоТочекПродажОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоТочекПродажОтклонение * 100 / РезультатАнализа.КоличествоТочекПродаж - РезультатАнализа.КоличествоТочекПродажОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоТочекПродажОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоЧисленнойДистрибуции КАК ЦельПоЧисленнойДистрибуции,
	|	РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение КАК ЦельПоЧисленнойДистрибуцииОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоЧисленнойДистрибуции = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоЧисленнойДистрибуции - РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение * 100 / РезультатАнализа.ЦельПоЧисленнойДистрибуции - РезультатАнализа.ЦельПоЧисленнойДистрибуцииОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоЧисленнойДистрибуцииОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА1 КАК ЦельПоДистрибуцииФА1,
	|	РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение КАК ЦельПоДистрибуцииФА1Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА1 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА1 - РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА1 - РезультатАнализа.ЦельПоДистрибуцииФА1Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА1ОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА2 КАК ЦельПоДистрибуцииФА2,
	|	РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение КАК ЦельПоДистрибуцииФА2Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА2 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА2 - РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА2 - РезультатАнализа.ЦельПоДистрибуцииФА2Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА2ОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА3 КАК ЦельПоДистрибуцииФА3,
	|	РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение КАК ЦельПоДистрибуцииФА3Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА3 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА3 - РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА3 - РезультатАнализа.ЦельПоДистрибуцииФА3Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА3ОтклонениеПроцент,
	|	РезультатАнализа.ЦельПоДистрибуцииФА4 КАК ЦельПоДистрибуцииФА4,
	|	РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение КАК ЦельПоДистрибуцииФА4Отклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.ЦельПоДистрибуцииФА4 = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.ЦельПоДистрибуцииФА4 - РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение * 100 / РезультатАнализа.ЦельПоДистрибуцииФА4 - РезультатАнализа.ЦельПоДистрибуцииФА4Отклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦельПоДистрибуцииФА4ОтклонениеПроцент,
	|	РезультатАнализа.АКБ КАК АКБ,
	|	РезультатАнализа.АКБОтклонение КАК АКБОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.АКБОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.АКБ = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.АКБ - РезультатАнализа.АКБОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.АКБОтклонение * 100 / РезультатАнализа.АКБ - РезультатАнализа.АКБОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК АКБОтклонениеПроцент,
	|	РезультатАнализа.КоличествоАртикулов КАК КоличествоАртикулов,
	|	РезультатАнализа.КоличествоАртикуловОтклонение КАК КоличествоАртикуловОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоАртикуловОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.КоличествоАртикулов = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.КоличествоАртикулов - РезультатАнализа.КоличествоАртикуловОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоАртикуловОтклонение * 100 / РезультатАнализа.КоличествоАртикулов - РезультатАнализа.КоличествоАртикуловОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоАртикуловОтклонениеПроцент
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}";
	
КонецПроцедуры // ДобавитьПлан_План()

// Эталонные данные - "Факт", текущие данные - "Факт"
Процедура ДобавитьФакт_Факт(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)

	НомерСтроки = СравниваемыеДанные.НомерСтроки;
	
	Если НомерСтроки > 1 Тогда
			
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
			
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
	|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
	|	РезультатАнализа.Проект КАК Проект,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Проект) КАК ПроектПредставление,
	|	РезультатАнализа.Подразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
	|	РезультатАнализа.Контрагент КАК Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
	|	РезультатАнализа.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
	|	РезультатАнализа.Заказ КАК Заказ,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
	|	РезультатАнализа.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппаПредставление,
	|	РезультатАнализа.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
	|	РезультатАнализа.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	|	РезультатАнализа.Ответственный КАК Ответственный,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Ответственный) КАК ОтветственныйПредставление,
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.Количество КАК Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Проект.*,
	|	Подразделение.*,
	|	Контрагент.*,
	|	Договор.*,
	|	Заказ.*,
	|	НоменклатурнаяГруппа.*,
	|	Номенклатура.*,
	|	ХарактеристикаНоменклатуры.*,
	|	Ответственный.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Количество,
	|	КоличествоБазовыхЕдиниц,
	|	КоличествоЕдиницОтчетов,
	|	КоличествоОтклонение,
	|	КоличествоБазовыхЕдиницОтклонение,
	|	КоличествоЕдиницОтчетовОтклонение,
	|	КоличествоОтклонениеПроцент,
	|	СтоимостьБезНДС,
	|	НДС,
	|	СтоимостьСНДС,
	|	СтоимостьБезНДСОтклонение,
	|	СтоимостьБезНДСОтклонениеПроцент,
	|	НДСОтклонение,
	|	НДСОтклонениеПроцент,
	|	СтоимостьСНДСОтклонение,
	|	СтоимостьСНДСОтклонениеПроцент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	(ВЫБРАТЬ
	|		АнализируемыеДанные.Проект КАК Проект,
	|		АнализируемыеДанные.Подразделение КАК Подразделение,
	|		АнализируемыеДанные.Контрагент КАК Контрагент,
	|		АнализируемыеДанные.Договор КАК Договор,
	|		АнализируемыеДанные.Заказ КАК Заказ,
	|		АнализируемыеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
	|		АнализируемыеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		АнализируемыеДанные.Ответственный КАК Ответственный,
	|		АнализируемыеДанные.Регистратор КАК Регистратор,
	|		АнализируемыеДанные.Период КАК Период,
	|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоТекущие) КАК Количество,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоБазовыхЕдиницТекущие) КАК КоличествоБазовыхЕдиниц,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоЕдиницОтчетовТекущие) КАК КоличествоЕдиницОтчетов,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоТекущие) - СУММА(АнализируемыеДанные.ПродажиКоличествоЭталонные) КАК КоличествоОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоБазовыхЕдиницТекущие) - СУММА(АнализируемыеДанные.ПродажиКоличествоБазовыхЕдиницЭталонные) КАК КоличествоБазовыхЕдиницОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиКоличествоЕдиницОтчетовТекущие) - СУММА(АнализируемыеДанные.ПродажиКоличествоЕдиницОтчетовЭталонные) КАК КоличествоЕдиницОтчетовОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьБезНДСТекущие) КАК СтоимостьБезНДС,
	|		СУММА(АнализируемыеДанные.ПродажиНДСТекущие) КАК НДС,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьСНДСТекущие) КАК СтоимостьСНДС,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьБезНДСТекущие) - СУММА(АнализируемыеДанные.ПродажиСтоимостьБезНДСЭталонные) КАК СтоимостьБезНДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиНДСТекущие) - СУММА(АнализируемыеДанные.ПродажиНДСЭталонные) КАК НДСОтклонение,
	|		СУММА(АнализируемыеДанные.ПродажиСтоимостьСНДСТекущие) - СУММА(АнализируемыеДанные.ПродажиСтоимостьСНДСЭталонные) КАК СтоимостьСНДСОтклонение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПродажиОборотыТекущие.Проект КАК Проект,
	|			ПродажиОборотыТекущие.Подразделение КАК Подразделение,
	|			ПродажиОборотыТекущие.Контрагент КАК Контрагент,
	|			ПродажиОборотыТекущие.ДоговорКонтрагента КАК Договор,
	|			ПродажиОборотыТекущие.ЗаказПокупателя КАК Заказ,
	|			ПродажиОборотыТекущие.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ПродажиОборотыТекущие.Номенклатура КАК Номенклатура,
	|			ПродажиОборотыТекущие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОборотыТекущие.ДокументПродажи.Ответственный КАК Ответственный,
	|			ПродажиОборотыТекущие.Регистратор КАК Регистратор,
	|			ПродажиОборотыТекущие.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыТекущие.Период, ГОД) КАК ПериодГод,
	|			ПродажиОборотыТекущие.КоличествоОборот КАК ПродажиКоличествоТекущие,
	|			ПродажиОборотыТекущие.КоличествоОборот * ПродажиОборотыТекущие.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПродажиКоличествоБазовыхЕдиницТекущие,
	|			ПродажиОборотыТекущие.КоличествоОборот * ПродажиОборотыТекущие.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ПродажиОборотыТекущие.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК ПродажиКоличествоЕдиницОтчетовТекущие,
	|			0 КАК ПродажиКоличествоЭталонные,
	|			0 КАК ПродажиКоличествоБазовыхЕдиницЭталонные,
	|			0 КАК ПродажиКоличествоЕдиницОтчетовЭталонные,
	|			ПродажиОборотыТекущие.СтоимостьОборот - ПродажиОборотыТекущие.НДСОборот КАК ПродажиСтоимостьБезНДСТекущие,
	|			ПродажиОборотыТекущие.НДСОборот КАК ПродажиНДСТекущие,
	|			ПродажиОборотыТекущие.СтоимостьОборот КАК ПродажиСтоимостьСНДСТекущие,
	|			0 КАК ПродажиСтоимостьБезНДСЭталонные,
	|			0 КАК ПродажиНДСЭталонные,
	|			0 КАК ПродажиСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, {Организация.* КАК Организация, Проект.* КАК Проект, Подразделение.* КАК Подразделение, Контрагент.* КАК Контрагент, ДоговорКонтрагента.* КАК Договор, ЗаказПокупателя.* КАК Заказ, ДокументПродажи.* КАК ДокументПродажи, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПродажи.Ответственный.* КАК Ответственный}) КАК ПродажиОборотыТекущие
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ПродажиОборотыЭталонные.Проект КАК Проект,
	|			ПродажиОборотыЭталонные.Подразделение КАК Подразделение,
	|			ПродажиОборотыЭталонные.Контрагент КАК Контрагент,
	|			ПродажиОборотыЭталонные.ДоговорКонтрагента КАК Договор,
	|			ПродажиОборотыЭталонные.ЗаказПокупателя КАК Заказ,
	|			ПродажиОборотыЭталонные.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ПродажиОборотыЭталонные.Номенклатура КАК Номенклатура,
	|			ПродажиОборотыЭталонные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			ПродажиОборотыЭталонные.ДокументПродажи.Ответственный КАК Ответственный,
	|			ПродажиОборотыЭталонные.Регистратор КАК Регистратор,
	|			ПродажиОборотыЭталонные.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ПродажиОборотыЭталонные.Период, ГОД) КАК ПериодГод,
	|			0 КАК ПродажиКоличествоТекущие,
	|			0 КАК ПродажиКоличествоБазовыхЕдиницТекущие,
	|			0 КАК ПродажиКоличествоЕдиницОтчетовТекущие,
	|			ПродажиОборотыЭталонные.КоличествоОборот КАК ПродажиКоличествоЭталонные,
	|			ПродажиОборотыЭталонные.КоличествоОборот * ПродажиОборотыЭталонные.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПродажиКоличествоБазовыхЕдиницЭталонные,
	|			ПродажиОборотыЭталонные.КоличествоОборот * ПродажиОборотыЭталонные.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ПродажиОборотыЭталонные.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК ПродажиКоличествоЕдиницОтчетовЭталонные,
	|			0 КАК ПродажиСтоимостьБезНДСТекущие,
	|			0 КАК ПродажиНДСТекущие,
	|			0 КАК ПродажиСтоимостьСНДСТекущие,
	|			ПродажиОборотыЭталонные.СтоимостьОборот - ПродажиОборотыЭталонные.НДСОборот КАК ПродажиСтоимостьБезНДСЭталонные,
	|			ПродажиОборотыЭталонные.НДСОборот КАК ПродажиНДСЭталонные,
	|			ПродажиОборотыЭталонные.СтоимостьОборот КАК ПродажиСтоимостьСНДСЭталонные
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, {Организация.* КАК Организация, Проект.* КАК Проект, Подразделение.* КАК Подразделение, Контрагент.* КАК Контрагент, ДоговорКонтрагента.* КАК Договор, ЗаказПокупателя.* КАК Заказ, ДокументПродажи.* КАК ДокументПродажи, Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа, Номенклатура.* КАК Номенклатура, ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры, ДокументПродажи.Ответственный.* КАК Ответственный}) КАК ПродажиОборотыЭталонные) КАК АнализируемыеДанные
	|	СГРУППИРОВАТЬ ПО
	|		АнализируемыеДанные.Проект,
	|		АнализируемыеДанные.Подразделение,
	|		АнализируемыеДанные.Контрагент,
	|		АнализируемыеДанные.Договор,
	|		АнализируемыеДанные.Заказ,
	|		АнализируемыеДанные.НоменклатурнаяГруппа,
	|		АнализируемыеДанные.Номенклатура,
	|		АнализируемыеДанные.ХарактеристикаНоменклатуры,
	|		АнализируемыеДанные.Ответственный,
	|		АнализируемыеДанные.Регистратор,
	|		АнализируемыеДанные.Период,
	|		АнализируемыеДанные.ПериодДень,
	|		АнализируемыеДанные.ПериодНеделя,
	|		АнализируемыеДанные.ПериодДекада,
	|		АнализируемыеДанные.ПериодМесяц,
	|		АнализируемыеДанные.ПериодКвартал,
	|		АнализируемыеДанные.ПериодПолугодие,
	|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	РезультатАнализа.Регистратор КАК Регистратор,
	|	РезультатАнализа.Период КАК Период,
	|	РезультатАнализа.ПериодДень КАК ПериодДень,
	|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
	|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
	|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
	|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
	|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
	|	РезультатАнализа.ПериодГод КАК ПериодГод,
	|	РезультатАнализа.Количество КАК Количество,
	|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
	|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
	|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
	|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
	|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.Количество = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	РезультатАнализа.НДС КАК НДС,
	|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
	|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
	|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.НДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.НДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НДСОтклонениеПроцент,
	|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
	|	ВЫБОР
	|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
	|					ТОГДА -100
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
	|							ТОГДА ""-""
	|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}";
	
КонецПроцедуры // ДобавитьФакт_Факт()

Функция ПолучитьПредставлениеДанных(Данные)
	
	Результат = Формат(Данные.НомерСтроки, "ЧГ=0") + ". ";
	
	Если Данные.НомерСтроки = 1 Тогда
		
		Результат = Результат + "Эталонный период.";
		
	Иначе
		
		Результат = Результат + "Сравниваемый период.";
		
	КонецЕсли;
	
	Результат = Результат + Символы.ПС + Данные.ТипДанных + ". " + Символы.ПС;
	
	Если НЕ Данные.Сценарий.Пустая() Тогда
		
		Результат = Результат + Строка(Данные.Сценарий) + Символы.ПС;
		
	КонецЕсли;
	
	Если Данные.ДатаНач = Дата('00010101') И Данные.ДатаКон = Дата('00010101') Тогда
		
		Если УниверсальныйОтчет.ДатаНач = Дата('00010101') И УниверсальныйОтчет.ДатаКон = Дата('00010101') Тогда
			
			Результат = Результат + "Без ограничения периода.";
			
		Иначе
			
			Результат = Результат + "С " + Формат(УниверсальныйОтчет.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(УниверсальныйОтчет.ДатаКон, "ДЛФ=Д; ДП = ""...""");
			
		КонецЕсли;
		
	Иначе
		
		Результат = Результат + "С " + Формат(Данные.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(Данные.ДатаКон, "ДЛФ=Д; ДП = ""...""");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПредставлениеДанных()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	Перем ТекущиеНастройкиОтчета;
	
	СформироватьСтруктуруДляСохраненияНастроек(ТекущиеНастройкиОтчета);
	УстановитьНачальныеНастройки();
	ВосстановитьНастройкиИзСтруктуры(ТекущиеНастройкиОтчета);
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СправочникНоменклатураПустаяСсылка", Справочники.Номенклатура.ПустаяСсылка());
	
	Для каждого Данные из ДанныеОтчета Цикл
		
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТипДанных" + Формат(Данные.НомерСтроки, "ЧГ=0"), ПолучитьПредставлениеДанных(Данные));
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Сценарий" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(Данные.Сценарий.Пустая(), Неопределено, Данные.Сценарий));
		
		Если Данные.ДатаНач = Дата('00010101') И Данные.ДатаКон = Дата('00010101') Тогда
			
			УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(УниверсальныйОтчет.ДатаНач = Дата('00010101'), УниверсальныйОтчет.ДатаНач, Новый Граница(НачалоДня(УниверсальныйОтчет.ДатаНач), ВидГраницы.Включая)));
			УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(УниверсальныйОтчет.ДатаКон = Дата('00010101'), УниверсальныйОтчет.ДатаКон, Новый Граница(КонецДня(УниверсальныйОтчет.ДатаКон), ВидГраницы.Включая)));
			
		Иначе
			
			УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(Данные.ДатаНач = Дата('00010101'), Данные.ДатаНач, Новый Граница(НачалоДня(Данные.ДатаНач), ВидГраницы.Включая)));
			УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(Данные.ДатаКон = Дата('00010101'), Данные.ДатаКон, Новый Граница(КонецДня(Данные.ДатаКон), ВидГраницы.Включая)));
			
		КонецЕсли;
		
	КонецЦикла;
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);
	
	ОбластьЭталонныйПериод = Неопределено;
	
	Пока Истина Цикл
		
		ОбластьЭталонныйПериод = ТабличныйДокумент.НайтиТекст(ПолучитьПредставлениеДанных(ДанныеОтчета[0]), ОбластьЭталонныйПериод);
		
		Если ОбластьЭталонныйПериод = Неопределено Тогда
			
			Прервать;
			
		Иначе
			
			Для каждого Показатель из УниверсальныйОтчет.Показатели.Строки Цикл
						
				Если (Показатель.Имя = "ОтклонениеКоличестваТочекПродаж" 
					ИЛИ Показатель.Имя = "ОтклонениеАКБ" 
					ИЛИ Показатель.Имя = "ОтклонениеКоличестваАртикулов"
					ИЛИ Показатель.Имя = "ОтклонениеЦелиПоЧисленнойДистрибуции"
					ИЛИ Показатель.Имя = "ОтклонениеЦелиПоДистрибуцииФА1"
					ИЛИ Показатель.Имя = "ОтклонениеЦелиПоДистрибуцииФА2"
					ИЛИ Показатель.Имя = "ОтклонениеЦелиПоДистрибуцииФА3"
					ИЛИ Показатель.Имя = "ОтклонениеЦелиПоДистрибуцииФА4")
					И Показатель.Использование Тогда
							
					Результат = ТабличныйДокумент.НайтиТекст(Показатель.ПредставлениеВОтчете,, ТабличныйДокумент.Область(ОбластьЭталонныйПериод.Верх, ОбластьЭталонныйПериод.Лево, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
					
					Если Результат <> Неопределено Тогда
						
						Индекс = 0;
						
						Для каждого ТекущийПоказатель из Показатель.Строки Цикл
							
							Если ТекущийПоказатель.Использование Тогда
								
								ТабличныйДокумент.Область(, Результат.Лево + Индекс,, Результат.Лево + Индекс).Видимость = Ложь;
								Индекс = Индекс + 1;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
						
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: // (-1) - не выбирать период, 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
