
&НаКлиенте
Процедура СформироватьАкт(Команда)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ОтображатьСетку = ложь;
	Макет = Обработки.Лео_АктОКК.ПолучитьМакет("АктОКК");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
	                   |	МАКСИМУМ(СписаниеТоваров.Номер) КАК НомерДок
	                   |ИЗ
	                   |	Документ.СписаниеТоваров КАК СписаниеТоваров
	                   |ГДЕ
	                   |	СписаниеТоваров.абс_ХозяйственнаяОперация = &ХозОперация
	                   |	И СписаниеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                   |	И СписаниеТоваров.Проведен = ИСТИНА
	                   |
	                   |УПОРЯДОЧИТЬ ПО
	                   |	НомерДок";
				  
	ЗапросШапка.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	ЗапросШапка.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	ЗапросШапка.УстановитьПараметр("ХозОперация", Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000023"));
	
	Шапка = ЗапросШапка.Выполнить().Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТЧ");
	ОбластьСтрокаТабЧасти = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	Если Шапка.Следующий() Тогда		
	
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Шапка);
		ОбластьШапка.Параметры.ДатаИзъятия  = Формат(Объект.КонецПериода, "ДФ=dd.MM.yyyy"); 
		ОбластьШапка.Параметры.ПериодОтбора = "с " + Формат(Объект.НачалоПериода, "ДЛФ=DD") + "по " + Формат(Объект.КонецПериода, "ДЛФ=DD");
		ТабДокумент.Вывести(ОбластьШапка);                      		
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	
	КонецЕсли;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеТоваровТовары.Номенклатура.Наименование КАК Номенклатура,
	               |	СписаниеТоваровТовары.СерияНоменклатуры.Наименование КАК Серия,
	               |	СписаниеТоваровТовары.ЕдиницаИзмерения.Наименование КАК ЕдИзм,
	               |	СписаниеТоваровТовары.Количество КАК Количество,
	               |	СписаниеТоваровТовары.Ссылка.Склад.Наименование КАК МестоИзъятия,
	               |	СписаниеТоваровТовары.Ссылка.Дата КАК ДатаИзъятия,
	               |	СписаниеТоваровТовары.Ссылка.абс_ХозяйственнаяОперация КАК ВидКонтроля,
	               |	СписаниеТоваровТовары.Ссылка.Ответственный КАК Исполнитель
	               |ИЗ
	               |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	               |ГДЕ
	               |	СписаниеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И СписаниеТоваровТовары.Ссылка.Проведен = ИСТИНА
	               |	И СписаниеТоваровТовары.Ссылка.абс_ХозяйственнаяОперация = &ХозОперация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИзъятия";
				   
				   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ХозОперация", Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000023"));
	
	ЗапросТовары = Запрос.Выполнить().Выбрать();
	
	ОбластьСтрокаТабЧасти = Макет.ПолучитьОбласть("СтрокаТЧ");	
	НомерСтроки = 0;
	
	Пока ЗапросТовары.Следующий() Цикл
		
		ВыводимыеОбласти = Новый Массив;                 	    		
		ВыводимыеОбласти.Добавить(ОбластьЗаголовокТаблицы); 
		
		НомерСтроки = НомерСтроки + 1;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТабЧасти.Параметры, ЗапросТовары);
		
		ОбластьСтрокаТабЧасти.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрокаТабЧасти.Параметры.Исполнитель = Объект.ОтвественныйОКК;
		
		ВывестиЗаголовок = Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДокумент, ВыводимыеОбласти); 
		Если ВывестиЗаголовок Тогда 
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			ТабДокумент.Вывести(ОбластьЗаголовокТаблицы); 
			ВыводимыеОбласти = Новый Массив; 
		КонецЕсли;  
		
		ТабДокумент.Вывести(ОбластьСтрокаТабЧасти);
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьПодвал);

	ТабДокумент.Показать();
	
КонецПроцедуры
