
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_СкидкиОтБазовыеЦены.Записывать = Истина;
	Движения.Лео_СкидкиОтБазовыеЦены.Очистить();
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.Лео_СкидкиОтБазовыеЦены.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Период = ТекСтрокаСкидки.ДатаНачалаПериода;
		Движение.ОкончаниеПериода = ТекСтрокаСкидки.ОкончаниеПериода;
		Движение.БазовыйТипЦен = ТекСтрокаСкидки.БазовыйТипЦен;
		Движение.СтатуснаяСкидка = ТекСтрокаСкидки.СтатуснаяСкидка;
		Движение.ДополнительнаяСкидка = ТекСтрокаСкидки.ДополнительнаяСкидка;
		Движение.СкидкаКомпенсирующаяПремию = ТекСтрокаСкидки.СкидкаКомпенсирующаяПремию;
		Движение.СкидкаЗаУслугиЛогистики = ТекСтрокаСкидки.СкидкаЗаУслугиЛогистики;
		Движение.СкидкаЗаУслугиТорговогоМаркетинга = ТекСтрокаСкидки.СкидкаЗаУслугиТорговогоМаркетинга;
		Движение.СкидкаЗаУслугиМерчендайзинга = ТекСтрокаСкидки.СкидкаЗаУслугиМерчендайзинга;
		Движение.СкидкаЗаПрочиеУслугиПоДоговору = ТекСтрокаСкидки.СкидкаЗаПрочиеУслугиПоДоговору;
		Движение.ТипЦенСоСкидкой = ТекСтрокаСкидки.ТипЦенСоСкидкой;
		Движение.СтатусныйТипЦен = ТекСтрокаСкидки.СтатусныйТипЦен;
		Движение.Комментарий = ТекСтрокаСкидки.Комментарий;

	КонецЦикла;

КонецПроцедуры
