&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("УстановкаЦенНоменклатуры_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатурыТипыЦен.ТипЦен,
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка КАК Док
		|ПОМЕСТИТЬ ТипыЦен
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТовары.Цена,
		|	УстановкаЦенНоменклатурыТовары.Номенклатура.Артикул КАК Артикул,
		|	УстановкаЦенНоменклатурыТовары.Номенклатура.Наименование КАК Номенклатура
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыЦен КАК ТипыЦен
		|		ПО УстановкаЦенНоменклатурыТовары.ТипЦен = ТипыЦен.ТипЦен
		|			И УстановкаЦенНоменклатурыТовары.Ссылка = ТипыЦен.Док";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

