


&НаКлиенте
Процедура ЗаполнитьЗаголовкиКН()
	
	перваянеделя=НеделяГода(Объект.ДатаПланирования)-1;
	
	
	ЭтаФорма.Элементы.КН1.Заголовок=Строка(перваянеделя)+" КН";
	
	ЭтаФорма.Элементы.КН2.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+7*24*60*60)-1))+" КН";	
	//ЭтаФорма.Элементы.КН2.Заголовок=строка(перваянеделя+1)+" КН";
	ЭтаФорма.Элементы.КН3.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*2)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН4.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*3)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН5.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*4)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН6.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*5)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН7.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*6)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН8.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*7)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН9.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*8)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН10.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*9)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН11.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*10)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН12.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*11)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН13.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*12)*24*60*60)-1))+" КН";
	ЭтаФорма.Элементы.КН14.Заголовок=Строка((НеделяГода(Объект.ДатаПланирования+(7*13)*24*60*60)-1))+" КН";
	
	
	//ЭтаФорма.Элементы.КН3.Заголовок=строка(перваянеделя+2)+" КН";
	//ЭтаФорма.Элементы.КН4.Заголовок=строка(перваянеделя+3)+" КН";
	//ЭтаФорма.Элементы.КН5.Заголовок=строка(перваянеделя+4)+" КН";
	//ЭтаФорма.Элементы.КН6.Заголовок=строка(перваянеделя+5)+" КН";
	//ЭтаФорма.Элементы.КН7.Заголовок=строка(перваянеделя+6)+" КН";
	//ЭтаФорма.Элементы.КН8.Заголовок=строка(перваянеделя+7)+" КН";
	//ЭтаФорма.Элементы.КН9.Заголовок=строка(перваянеделя+8)+" КН";
	//ЭтаФорма.Элементы.КН10.Заголовок=строка(перваянеделя+9)+" КН";
	//ЭтаФорма.Элементы.КН11.Заголовок=строка(перваянеделя+10)+" КН";
	//ЭтаФорма.Элементы.КН12.Заголовок=строка(перваянеделя+11)+" КН";
	//ЭтаФорма.Элементы.КН13.Заголовок=строка(перваянеделя+12)+" КН";
	//ЭтаФорма.Элементы.КН14.Заголовок=строка(перваянеделя+13)+" КН";
	//
	//
КонецПроцедуры




&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	//// Вставить содержимое обработчика.
	////Датаначала=получитьДатуначала();
	//перваянеделя=НеделяГода(Объект.ДатаПланирования);
	//
	//
	//ЭтаФорма.Элементы.КН1.Заголовок=Строка(перваянеделя)+" КН";	
	//ЭтаФорма.Элементы.КН2.Заголовок=строка(перваянеделя+1)+" КН";
	//ЭтаФорма.Элементы.КН3.Заголовок=строка(перваянеделя+2)+" КН";
	//ЭтаФорма.Элементы.КН4.Заголовок=строка(перваянеделя+3)+" КН";
	//ЭтаФорма.Элементы.КН5.Заголовок=строка(перваянеделя+4)+" КН";
	//ЭтаФорма.Элементы.КН6.Заголовок=строка(перваянеделя+5)+" КН";
	//ЭтаФорма.Элементы.КН7.Заголовок=строка(перваянеделя+6)+" КН";
	//ЭтаФорма.Элементы.КН8.Заголовок=строка(перваянеделя+7)+" КН";
	//ЭтаФорма.Элементы.КН9.Заголовок=строка(перваянеделя+8)+" КН";
	//ЭтаФорма.Элементы.КН10.Заголовок=строка(перваянеделя+9)+" КН";
	//ЭтаФорма.Элементы.КН11.Заголовок=строка(перваянеделя+10)+" КН";
	//ЭтаФорма.Элементы.КН12.Заголовок=строка(перваянеделя+11)+" КН";
	//ЭтаФорма.Элементы.КН13.Заголовок=строка(перваянеделя+12)+" КН";
	//ЭтаФорма.Элементы.КН14.Заголовок=строка(перваянеделя+13)+" КН";
	
    ЗаполнитьЗаголовкиКН();	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	
	мПолейИкл = Новый Массив;
	мПолейИкл.Добавить("СоставПланаартикул");
	мПолейИкл.Добавить("СоставПланаменеджер");
	мПолейИкл.Добавить("СоставПланаНомерСтроки");
	мПолейИкл.Добавить("СоставПлананоменклатура");
	мПолейИкл.Добавить("СоставПланаконтрагент");
	
	
	
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.Лео_ПланЗакупок.Форма.ФормаФормированиеЗаказовПоставщикам1", СтруктураПараметров, Объект.Ссылка);
	
	Если ТекущийЭлемент.Имя = "СоставПлана" тогда
		НомерНедели = ТекущийЭлемент.ТекущийЭлемент.Имя;
		Если мПолейИкл.Найти(НомерНедели) = неопределено тогда
			ЗаполнитьСоставПлана(ФормаЗагрузки.СоставПлана_1,НомерНедели);
			ЗаполнитьПлан(ФормаЗагрузки.ПланЗакупок);
			
			ФормаЗагрузки.НомерНедели = НомерНедели;
			ФормаЗагрузки.Открыть();
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите КН(календарную неделю) !!!");
		КонецЕсли;
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите КН(календарную неделю) !!!");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСоставПлана(СоставПлана_1,НомерНедели)
	
	
	// Обработаем ТЗ, выберем только нужные	данные (колонки недель)  
	НеделяСтрока = Прав(СтрЗаменить(НомерНедели,"Неделя",""),2);
	Если НЕ ЭтоЧисло(Лев(НеделяСтрока,1)) тогда
		НеделяЧисло = Число(Прав(НеделяСтрока,1));
	иначе
		НеделяЧисло = Число(НеделяСтрока);
	КонецЕсли;
	
	
	
	СоставПлана_1 = Объект.СоставПлана.Выгрузить();
	Для каждого сс из СоставПлана_1 цикл
		Для кол = 1 по 14 цикл 
			Если сс["Заказ"+кол+"Неделя"] = сс["Заказ"+НеделяЧисло+"Неделя"] тогда иначе сс["Заказ"+кол+"Неделя"] = 0 КонецЕсли;
			Если сс["КЗаказу"+кол+"Неделя"] = сс["КЗаказу"+НеделяЧисло+"Неделя"] тогда иначе сс["КЗаказу"+кол+"Неделя"] = 0 КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НомерНедели = НеделяЧисло;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПлан(ПланЗакупок)
	
	ПланЗакупок = Объект.Ссылка;
	ЗаполнитьДатыНаСервере();
	
КонецПроцедуры



Функция ЭтоЧисло(Слово)
	
	Цифры = "1234567890";
	
	Для НомСимвола = 1 По СтрДлина(Слово) Цикл
		
		Если Найти(Цифры, Сред(Слово, НомСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	
	ЗаполнитьЗаголовкиКН();
//	Объект.Дата = ТекущаяДата();
	ОбновитьПоЗаказамПоставщикуСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОформитьСтроки()
	
	
	УсловноеОформление.Элементы.Очистить();
	
	ЗеленыйФон = Новый Цвет(255, 255, 190); // Светол-желтый
	
	_ЗеленыйФон = Новый Цвет(220, 255, 220); // Светол-зеленый
	
	СерыйФон = Новый Цвет(179, 172, 134); // Цвет рамки
	
	
	Для сч = 1 по 14 цикл
		
		//
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставПланаЗаказ2Неделя");
		//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставПлана" + ПолеСостав);
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставПланаЗаказ" + СокрЛП(сч) + "Неделя");
		
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставПлана.Заказ2НеделяФлаг");
		//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставПлана." + ПолеФлаг);
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставПлана.Заказ" + СокрЛП(сч) + "НеделяФлаг");
		
		ЭлементОтбора.ПравоеЗначение = 1;
		ЭлементОтбора.Использование = Истина;
		//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
		
		
		
		// Есть поступление
		//ЭлементОформления.Оформление.ЦветТекста.Значение = WebЦвета.Красный;
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставПланаЗаказ" + СокрЛП(сч) + "Неделя");
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставПлана.Заказ" + СокрЛП(сч) + "НеделяФлаг");
		ЭлементОтбора.ПравоеЗначение = 2;
		ЭлементОтбора.Использование = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);	
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
		
		
		
		
	КонецЦикла;
	      ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставПланаИзменения");
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставПлана.Изменения");
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Цветфона", WebЦвета.Зеленый);	

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДатыНаСервере()
	перваянеделя=НеделяГода(Объект.ДатаПланирования);
	Для каждого с из  Объект.СоставПлана Цикл
	 с.Дата1= НачалоНедели(Объект.ДатаПланирования);
	 с.Дата2=с.Дата1+86400*7; 
	 с.Дата3=с.Дата2+86400*7; 
	 с.Дата4=с.Дата3+86400*7; 
	 с.Дата5=с.Дата4+86400*7; 
	 с.Дата6=с.Дата5+86400*7; 
	 с.Дата7=с.Дата6+86400*7; 
	 с.Дата8=с.Дата7+86400*7; 
	 с.Дата9=с.Дата8+86400*7; 
	 с.Дата10=с.Дата9+86400*7;
	 с.Дата11=с.Дата10+86400*7; 
	 с.Дата12=с.Дата11+86400*7; 
	 с.Дата13=с.Дата12+86400*7; 
	 с.Дата14=с.Дата13+86400*7; 
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПоПрошлымДанным(Команда)
	
	      ОбновитьПоПрошлымДаннымСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоПрошлымДаннымСервер()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПланыЗакупокСрезПоследних.Период,
		|	Лео_ПланыЗакупокСрезПоследних.Регистратор,
		|	Лео_ПланыЗакупокСрезПоследних.НомерСтроки,
		|	Лео_ПланыЗакупокСрезПоследних.Активность,
		|	Лео_ПланыЗакупокСрезПоследних.ДатаПланирования,
		|	Лео_ПланыЗакупокСрезПоследних.Номенклатура,
		|	Лео_ПланыЗакупокСрезПоследних.Контрагент,
		|	Лео_ПланыЗакупокСрезПоследних.Менеджер,
		|	Лео_ПланыЗакупокСрезПоследних.План,
		|	Лео_ПланыЗакупокСрезПоследних.Заказ
		|ИЗ
		|	РегистрСведений.Лео_ПланыЗакупок.СрезПоследних(&ДатаКон, ) КАК Лео_ПланыЗакупокСрезПоследних";

	Запрос.УстановитьПараметр("ДатаКон", НачалоДня(Объект.Дата) - 1);


	Результат = Запрос.Выполнить();
    ТЗ = Результат.Выгрузить();
	
	ТЗ_МенНомКонт = ТЗ.Скопировать();
	ТЗ_МенНомКонт.Свернуть("Менеджер,Номенклатура,Контрагент");
	ТЗ_МенНомКонт.Сортировать("Менеджер,Контрагент,Номенклатура");
	
	ТЗ.Сортировать("Менеджер,Контрагент,Номенклатура");

	Таб  = Объект.СоставПлана;
	//Таб.Очистить();
	
	Для каждого ии из Таб цикл
		Для сч = 1 по 14 цикл 
		 ии["Заказ" + сч + "Неделя"]   = 0;
	    КонецЦикла;	
	КонецЦикла;
	
	кНеделя = НеделяГода(Объект.ДатаПланирования);
	
	Если ТЗ.Количество() > 0 тогда
		
		//Для каждого мм из ТЗ_МенНомКонт цикл	
		Для каждого мм из ТЗ цикл	
			
			Кн = НеделяГода(мм.ДатаПланирования);
			
			Если Кн >= кНеделя тогда
				
				сч = ?(Кн = кНеделя, 1, Кн - кНеделя + 1 );
				
				
				_ДатаПланирования = "Дата" + СокрЛП(сч);
				
				мСтрок = Таб.НайтиСтроки(Новый Структура("Менеджер,Контрагент,Номенклатура," + _ДатаПланирования,мм.Менеджер,мм.Контрагент,мм.Номенклатура,мм.ДатаПланирования));
				
			//КонецЕсли;
			//ст = Таб.Добавить();
			//ст.Номенклатура = мм.Номенклатура;
			//ст.менеджер = мм.менеджер;
			//ст.контрагент = мм.контрагент;
			
			Если мСтрок.Количество() > 0 тогда
				мСтрок[0]["Заказ" + сч + "Неделя"]   = мм.Заказ;
			КонецЕсли;
			
			
			КонецЕсли;

			//Для каждого сс из мСтрок цикл
			//	
			//	//Кн = НеделяГода(сс.ДатаПланирования);
			//	
			//	//Если Кн >= кНеделя тогда
			//	
			//	//сч = ?(Кн = кНеделя, 1, Кн - кНеделя + 1 );
			//	
			//	
			//	//ст["КЗаказу" + сч+"неделя"] = сс.План;	
			//	//сс["Заказ" + сч+"неделя"]   = мм.Заказ;
			//	
			//	//КонецЕсли;
			//КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоЗаказамПоставщику(Команда)
		ОбновитьПоЗаказамПоставщикуСервер();
КонецПроцедуры


&НаСервере
Процедура ОбновитьПоЗаказамПоставщикуСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОбороты.ЗаказПоставщику КАК Документ,
	|	ЗаказыПоставщикамОбороты.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ЗаказыПоставщикамОбороты.ЗаказПоставщику.Ответственный КАК Менеджер,
	|	ЗаказыПоставщикамОбороты.Номенклатура.Артикул КАК Артикул,
	|	ЗаказыПоставщикамОбороты.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОбороты.КоличествоПриход КАК КоличествоПоЗаказу,
	|	ЗаказыПоставщикамОбороты.СуммаУпрПриход КАК СуммаСНДС,
	|	ЗаказыПоставщикамОбороты.КоличествоРасход КАК КоличествоПоПоступлению,
	|	ЗаказыПоставщикамОбороты.ЗаказПоставщику.ДатаПоступления КАК ДатаПоступленияПоЗаказу,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоступленияЗаказаОС
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Обороты(&НачалоПериода,, , ) КАК ЗаказыПоставщикамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Документ,
	|	ТЗ.Контрагент,
	|	ТЗ.Менеджер,
	|	ТЗ.Артикул,
	|	ТЗ.Номенклатура,
	|	СУММА(ТЗ.КоличествоПоЗаказу) КАК КоличествоПоЗаказу,
	|	СУММА(ТЗ.КоличествоПоПоступлению) КАК КоличествоПоПоступлению,
	|	СУММА(ТЗ.СуммаСНДС) КАК СуммаСНДС,
	|	ТЗ.ДатаПоступленияПоЗаказу КАК ДатаПоступленияПоЗаказу,
	|	ВЫБОР
	|		КОГДА ТЗ.ДатаПоступленияПоЗаказу <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕДЕЛЯ(ТЗ.ДатаПоступленияПоЗаказу)
	|	КОНЕЦ КАК НеделяДатаПоступленияПоЗаказу,
	|	ТЗ.ДатаПоступленияЗаказаОС КАК ДатаПоступленияЗаказаОС,
	|	ВЫБОР
	|		КОГДА ТЗ.ДатаПоступленияЗаказаОС <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕДЕЛЯ(ТЗ.ДатаПоступленияЗаказаОС)
	|	КОНЕЦ КАК НеделяДатаПоступленияЗаказаОС
	|ИЗ
	|	ТЗ КАК ТЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Документ,
	|	ТЗ.Контрагент,
	|	ТЗ.Менеджер,
	|	ТЗ.Артикул,
	|	ТЗ.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТЗ.ДатаПоступленияЗаказаОС <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕДЕЛЯ(ТЗ.ДатаПоступленияЗаказаОС)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТЗ.ДатаПоступленияПоЗаказу <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НЕДЕЛЯ(ТЗ.ДатаПоступленияПоЗаказу)
	|	КОНЕЦ,
	|	ТЗ.ДатаПоступленияЗаказаОС,
	|	ТЗ.ДатаПоступленияПоЗаказу";
	
	
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ДатаПланирования));
	//Запрос.УстановитьПараметр("НачалоПериода", (Объект.ДатаПланирования-((7*3)*24*60*60)));
	//Запрос.УстановитьПараметр("НачалоПериода", (Объект.ДатаПланирования-((7*3)*24*60*60)));

	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Объект.ДатаПланирования));

	//Запрос.УстановитьПараметр("КонецПериода", КонецГода(Объект.ДатаПланирования));
	
	
	//Результат = Запрос.Выполнить();
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	кНеделя = НеделяГода(Объект.ДатаПланирования);
	Таб  = Объект.СоставПлана;
	
	Если ТЗ.Количество() > 0 тогда
		Для каждого мм из ТЗ цикл	
			мСтрок = Таб.НайтиСтроки(Новый Структура("Менеджер,Контрагент,Номенклатура",мм.Менеджер,мм.Контрагент,мм.Номенклатура));
			Для каждого сс из мСтрок цикл
				Для гг = 1 по 14 цикл	
					Кн = НеделяГода(сс["Дата" + гг]);
					Если Кн >= кНеделя тогда
						сч = ?(Кн = кНеделя, 1, Кн - кНеделя + 1 );
						//ст["КЗаказу" + сч+"неделя"] = сс.План;	
						
						Если Кн = мм.НеделяДатаПоступленияПоЗаказу тогда
							//сс["Заказ" + сч+"неделя"]   = ?(сс["Заказ" + сч+"неделя"] > 0,сс["Заказ" + сч+"неделя"],мм.КоличествоПоЗаказу);
							сс["Заказ" + сч + "Неделя"]   = мм.КоличествоПоЗаказу;
							
							Если мм.КоличествоПоЗаказу > 0 тогда
								ПолеФлаг = "Заказ" + сч + "Неделя" + "Флаг";
								сс[ПолеФлаг] = 1;	
								сс[ПолеФлаг] = ЕстьПоступление(мм.Документ,мм.Номенклатура);								
							КонецЕсли;	
						КонецЕсли;	
					Иначе
						      сч =  (53 - кНеделя) + (Кн-1) ;    //53 всего недель в 2020 году
						//ст["КЗаказу" + сч+"неделя"] = сс.План;	
						
						Если Кн = мм.НеделяДатаПоступленияПоЗаказу тогда
							//сс["Заказ" + сч+"неделя"]   = ?(сс["Заказ" + сч+"неделя"] > 0,сс["Заказ" + сч+"неделя"],мм.КоличествоПоЗаказу);
							сс["Заказ" + сч + "Неделя"]   = мм.КоличествоПоЗаказу;
							
							Если мм.КоличествоПоЗаказу > 0 тогда
								ПолеФлаг = "Заказ" + сч + "Неделя" + "Флаг";
								сс[ПолеФлаг] = 1;	
								сс[ПолеФлаг] = ЕстьПоступление(мм.Документ,мм.Номенклатура);								
							КонецЕсли;	
						КонецЕсли;	

						
						
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ОформитьСтроки();
	
КонецПроцедуры

Функция ЕстьПоступление(Документ,Номенклатура)
	Флаг = 1;
	дПоступление = Документы.ПоступлениеТоваровУслуг.НайтиПоРеквизиту("Сделка",Документ);
	Если НЕ дПоступление.Пустая() тогда
		мСтрок = дПоступление.Товары.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
		Если мСтрок.Количество() > 0 тогда
			Флаг = 2;
		КонецЕсли;	   
	КонецЕсли;	
	возврат Флаг;
КонецФункции



            
&НаКлиенте
Процедура ЗаполнитьКомментарий(Команда)
	// Вставить содержимое обработчика.
	      ЗаполнитьКомментарийСервер()
	
КонецПроцедуры

          &НаСервере
Процедура ЗаполнитьКомментарийСервер()
         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПланЗакупокСоставПлана.номенклатура,
		|	Лео_ПланЗакупокСоставПлана.КомментарийОС,
		|	Лео_ПланЗакупокСоставПлана.контрагент
		|ИЗ
		|	Документ.Лео_ПланЗакупок.СоставПлана КАК Лео_ПланЗакупокСоставПлана
		|ГДЕ
		|	Лео_ПланЗакупокСоставПлана.Ссылка.Дата < &Дата
		|	И Лео_ПланЗакупокСоставПлана.Ссылка.Проведен = ИСТИНА";

	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата) - 1);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    Таб  = Объект.СоставПлана;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		 
		
		//Для  каждого строка Из  Таб  Цикл            \
		сПоиск = Объект.СоставПлана.НайтиСтроки(Новый Структура("номенклатура,контрагент",ВыборкаДетальныеЗаписи.номенклатура,ВыборкаДетальныеЗаписи.контрагент));
		
			Если  сПоиск.Количество() > 0  Тогда
			//	сообщить(ВыборкаДетальныеЗаписи.КомментарийОС);
				сПоиск[0].КомментарийОС = ВыборкаДетальныеЗаписи.КомментарийОС;
		    КонеЦЕсли;
			
			
		//КонецЦикла;
		
		
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
        ОформитьСтроки();
		
КонецПроцедуры



