// Сохраненнве настройки
Перем мТекущаяНастройка Экспорт;
Перем мВосстанавливатьНастройкиПриОткрытии Экспорт;
Перем мФормироватьОтчетПриОткрытии Экспорт;
Перем ДополнительныеСвойства Экспорт;




Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	// Заголовок
	КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы[11].Значение = "ОТЧЕТ по запасам ГП " + Формат(ТекущаяДата(),"ДФ=dd_MM_yyyy");
	
	Сообщить("Текущая дата: " + СокрЛП(КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение));
	
	
	
КонецПроцедуры

// Сохраненнве настройки
ДополнительныеСвойства = Новый Структура;
мФормироватьОтчетПриОткрытии = Ложь;
