
&НаКлиенте
Перем мЗначениеСоставБюджетаПередИзменением;

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЦФО(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЦФО.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	ЗаполнитьПоЦФОСервер();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЦФОСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиБюджетаПоЦФО();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыручку(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьВыручкуСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыручкуСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиВыручки();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСебестоимость(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
    ЗаполнитьСебестоимостьСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСебестоимостьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиСебестоимости();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРетро(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
    ЗаполнитьРетроСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРетроСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиРетро();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриАктивизацииЯчейки(Элемент)
	СтрокаТЧ=Элементы.СоставБюджета.ТекущиеДанные;
	//Если Не СтрокаТЧ=Неопределено Тогда
	//	//Элементы.СоставБюджета.ТолькоПросмотр=СтрокаТЧ.Автозаполнение;
	//	Элементы.СоставБюджета.ТекущийЭлемент.ТолькоПросмотр=СтрокаТЧ.Автозаполнение;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспорт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
    ЗаполнитьТранспортСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТранспортСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиТранспорта();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	абс_СогласованиеДокументов.УстановитьДоступностьРедактирования(Объект,ЭтаФорма);

	ОбновитьНадписиИтоговПоСтатье(Элементы.СоставБюджета.ТекущиеДанные);
	
	Элементы.БДДС.Пометка = Истина;
	
	УстановитьВидимостьБДДС(Элементы.БДДС.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзМакета(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли; 
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.абс_ВводБюджета.Форма.ФормаЗагрузки", СтруктураПараметров, Объект.Ссылка);
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "абс_ВводБюджета_ЗагрузкаИзEXCEL" Тогда
		Если Объект.СоставБюджета.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Заменить данные в документе?";
			Ответ = Вопрос(Текст, Режим, 0);    
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.СоставБюджета.Очистить();			
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли; 
		ЗаполнитьТЧДокументаПоТаблицеСервер(Параметр); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблице(ТабДок);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.СоставБюджета.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СоставБюджета.Очистить();			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = "";
	
	Если ПоместитьВоВременноеХранилище(ВнешнийФайл, АдресФайлаВХранилище) Тогда
	
		ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище)
	
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриИзменении(Элемент)
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;	
	
	Если Найти(ИмяТекКолонки, "Сумма") > 0 Тогда
		
		СуммаВключаетНДС = Истина;
		
		Если Найти(ИмяТекКолонки, "СуммаБезНДС") > 0 Тогда
			СуммаВключаетНДС = Ложь;
		КонецЕсли;
		
		ИндексТекКолонки = СтрЗаменить(ИмяТекКолонки		, "СоставБюджета"	, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СуммаБезНДС"		, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "Сумма"			, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СНДС"			, "");
		
		ПрефиксКолонкиДанные = ?(СуммаВключаетНДС, "Сумма", "СуммаБезНДС");
		
		СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ТекДанные[ПрефиксКолонкиДанные + ИндексТекКолонки], Истина, СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(ТекДанные.СтатьяОборотовПоБюджетам.абс_СтавкаНДС));
		
		Если СуммаВключаетНДС Тогда
			ТекДанные["СуммаБезНДС" + ИндексТекКолонки] = ТекДанные["Сумма" + ИндексТекКолонки] - СуммаНДС;
		Иначе
			ТекДанные["Сумма" + ИндексТекКолонки] = ТекДанные["СуммаБезНДС" + ИндексТекКолонки] + СуммаНДС;
		КонецЕсли;
		
		ТекДанные["Автозаполнение" + ИндексТекКолонки] = Ложь;
		
	КонецЕсли;
	                          
	Если Найти(ИмяТекКолонки, "Сумма") > 0 ИЛИ Найти(ИмяТекКолонки, "Количество") > 0 Тогда
		
		ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные);
		
	КонецЕсли;
	
	ОбновитьНадписиИтоговПоСтатье(Элементы.СоставБюджета.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогКоличество 	= 0;
	ИтогСуммаБезНДС = 0;
	ИтогСумма 		= 0;
	
	Для Н = 1 По 12 Цикл
		
		ИтогКоличество 	= ИтогКоличество 	+ ТекДанные["Количество" 	+ Н];
		ИтогСуммаБезНДС = ИтогСуммаБезНДС 	+ ТекДанные["СуммаБезНДС" 	+ Н];
		ИтогСумма 		= ИтогСумма 		+ ТекДанные["Сумма" 		+ Н];
		
	КонецЦикла;
	
	ТекДанные.КоличествоИтог 	= ИтогКоличество;
	ТекДанные.СуммаБезНДСИтог 	= ИтогСуммаБезНДС;
	ТекДанные.СуммаИтог 		= ИтогСумма;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьНадписиИтоговПоСтатье(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "";
		
		Возврат;
	КонецЕсли;
	
	РассчитыватьИтогПоМесяц = Ложь;
	
	Если НЕ Элементы.СоставБюджета.ТекущийЭлемент = Неопределено Тогда
		
		ИндексТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;	
		
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СоставБюджета"	, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СуммаБезНДС"		, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "Сумма"			, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СНДС"			, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "Количество"		, "");
		
		Попытка
			ИндексТекКолонки 		= Число(ИндексТекКолонки);
			РассчитыватьИтогПоМесяц = Истина;
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
		
	СтрокиПоСтатье = Объект.СоставБюджета.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", ТекДанные.СтатьяОборотовПоБюджетам));
	
	КоличествоИтогМесяц 	= 0; СуммаБезНДСИтогМесяц 	= 0; СуммаИтогМесяц = 0;
	КоличествоИтогГод 		= 0; СуммаБезНДСИтогГод		= 0; СуммаИтогГод	= 0;
	
	Для Каждого СтрокаПоСтатье Из СтрокиПоСтатье Цикл
		
		КоличествоИтогГод 	= КоличествоИтогГод 	+ СтрокаПоСтатье.КоличествоИтог;
		СуммаБезНДСИтогГод 	= СуммаБезНДСИтогГод 	+ СтрокаПоСтатье.СуммаБезНДСИтог;
		СуммаИтогГод 		= СуммаИтогГод	 		+ СтрокаПоСтатье.СуммаИтог;
		
		Если РассчитыватьИтогПоМесяц Тогда
			КоличествоИтогМесяц 	= КоличествоИтогМесяц 	+ СтрокаПоСтатье["Количество" 	+ ИндексТекКолонки];
			СуммаБезНДСИтогМесяц 	= СуммаБезНДСИтогМесяц 	+ СтрокаПоСтатье["СуммаБезНДС" 	+ ИндексТекКолонки];
			СуммаИтогМесяц 			= СуммаИтогМесяц 		+ СтрокаПоСтатье["Сумма" 		+ ИндексТекКолонки];
		КонецЕсли;		
		
	КонецЦикла;
	
	Если РассчитыватьИтогПоМесяц Тогда
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "Итого по статье за месяц: " + "Количество: " + Формат(КоличествоИтогМесяц, "ЧЦ=18; ЧН=0") + ", Сумма без НДС: " + Формат(СуммаБезНДСИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб." + ", Сумма с НДС: " + Формат(СуммаИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб. ";
		
	Иначе
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "";
		
	КонецЕсли;
	
	Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + "Итого по статье за год: " + "Количество: " + Формат(КоличествоИтогГод, "ЧЦ=18; ЧН=0") + ", Сумма без НДС: " + Формат(СуммаБезНДСИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб." + ", Сумма с НДС: " + Формат(СуммаИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСтрокуБДДС(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиБДДСПоСтатье = Объект.СоставБюджетаДДС.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам, Контрагент, ДоговорКонтрагента", ТекДанные.СтатьяОборотовПоБюджетам, ТекДанные.Контрагент, ТекДанные.ДоговорКонтрагента));
	
	Если СтрокиБДДСПоСтатье.Количество() > 0 Тогда
		
		Элементы.СоставБюджетаДДС.ТекущаяСтрока = СтрокиБДДСПоСтатье[0].ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриАктивизацииСтроки(Элемент)
	
	ОбновитьНадписиИтоговПоСтатье(Элементы.СоставБюджета.ТекущиеДанные);
	
	АктивироватьСтрокуБДДС(Элементы.СоставБюджета.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьСкрытьБДДС(Команда)
	
	Элементы.БДДС.Пометка = НЕ Элементы.БДДС.Пометка;
	
	УстановитьВидимостьБДДС(Элементы.БДДС.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьБДДС(ВидимостьБДДС)
	
	Элементы.СоставБюджетаДДС.Видимость = ВидимостьБДДС;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнтьБДДС(Команда)
	
	Если Объект.СоставБюджетаДДС.Количество()>0 Тогда
		Если НЕ Вопрос("Перезаполнить БДДС?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Объект.СоставБюджетаДДС.Очистить();
	ЗаполнитьБДДССервер();
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБДДССервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьБДДС();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Элементы.СоставБюджета.ТекущиеДанные.ЦФО = Объект.ЦФО;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаДДСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Элементы.СоставБюджетаДДС.ТекущиеДанные.ЦФО = Объект.ЦФО;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПередНачаломИзменения(Элемент, Отказ)

	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПередУдалением(Элемент, Отказ)
	
	Если Вопрос("Удалить строку?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаДДСПередУдалением(Элемент, Отказ)
	
	Если Вопрос("Удалить строку?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьРольФинансист = РольДоступна("абс_Финансист");
	
	Элементы.ЗакрытыйПериод.ТолькоПросмотр 	= НЕ ЕстьРольФинансист;
	
	Элементы.ОтразитьЛимитыДДС.Видимость 	= ЕстьРольФинансист;
	
	Если НЕ ЕстьРольФинансист Тогда
		УстановитьДоступностьЭлементовФормыПользователюВводБюджета();
	КонецЕсли;
	
	Элементы.КомандаУстановитьСостояниеПодготовка.Видимость = Объект.Состояние = Перечисления.СостоянияОбъектов.Отклонен;		
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыПользователюВводБюджета()
	
	ВозможноРедактированиеШапки = Объект.ЗакрытыйПериод < Объект.ДатаПланирования;
	
	Элементы.Дата.ТолькоПросмотр 				= НЕ ВозможноРедактированиеШапки;
	Элементы.Номер.ТолькоПросмотр 				= НЕ ВозможноРедактированиеШапки;
	Элементы.ЦФО.ТолькоПросмотр 				= НЕ ВозможноРедактированиеШапки;
	Элементы.Организация.ТолькоПросмотр 		= НЕ ВозможноРедактированиеШапки;
	Элементы.ДатаПланирования.ТолькоПросмотр 	= НЕ ВозможноРедактированиеШапки;
	Элементы.ВидОперации.ТолькоПросмотр 		= НЕ ВозможноРедактированиеШапки;
	Элементы.СценарийПланирования.ТолькоПросмотр= НЕ ВозможноРедактированиеШапки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьРедактированияСтокиБюджета(СтрокаБюджета, ЗакрытыйПериод, ИмяКолонки, Отказ)
	
	Если РольДоступна("абс_Финансист") Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЗакрытыйПериод) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрытыйПериод < Объект.ДатаПланирования Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(Объект.ДатаПланирования)) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Запрещено редактировать данные в закрытом периоде!", Отказ);
		Возврат;
	КонецЕсли;
	
	ТекПериод 			= ЗакрытыйПериод;
	ИндексТекПериода 	= Месяц(ТекПериод);
	
	ИндексКолонкиСтр = СтрЗаменить(ИмяКолонки, "СоставБюджета"				, "");
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "СоставБюджетаДДС"		, "");
	
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "Количество"			, "");
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "СуммаБезНДС"			, "");
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "Сумма"				, "");
	
	ИндексКолонки = ОбщегоНазначения.ПривестиСтрокуКЧислу(ИндексКолонкиСтр, Истина);
	
	// Если в закрытом периоде есть данные по бюджетам, то запретим редактировать сроку целиком
	Если ИндексКолонки = Неопределено Тогда
		//В случае редактировании колонки - месяца
		//Если указан номер колонки, то проверим просто по индексу периода
		Если ИндексКолонки <= ИндексТекПериода Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Запрещено редактировать данные в закрытом периоде!", Отказ);
			Возврат;
		КонецЕсли;		
	Иначе
		//В случае редактирования прочих данных или удаления данных
		//Если номер колонки не указан, то запретим редактировать строку целиком если в ней заполнены данные в закрытом периоде
		Для Н = 1 по ИндексТекПериода Цикл
			Если ЗначениеЗаполнено(СтрокаБюджета["Количество" + Н]) ИЛИ
				 ЗначениеЗаполнено(СтрокаБюджета["Сумма" + Н]) ИЛИ
				 ЗначениеЗаполнено(СтрокаБюджета["СуммаБезНДС" + Н]) Тогда
				 
				ОбщегоНазначения.СообщитьОбОшибке("Запрещено редактировать данные в закрытом периоде!", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытыйПериодПриИзменении(Элемент)
	
	Объект.ЗакрытыйПериод = НачалоМесяца(Объект.ЗакрытыйПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаДДСПередНачаломИзменения(Элемент, Отказ)
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСостояниеПодготовка(Команда)
	
	Объект.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.КомандаУстановитьСостояниеПодготовка.Видимость = Объект.Состояние = Перечисления.СостоянияОбъектов.Отклонен;			
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБДДСПоПланамИЗадолженности(Команда)
	
	//Если Объект.СоставБюджетаДДС.Количество()>0 Тогда
	//	Если НЕ Вопрос("Перезаполнить БДДС?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Выбрать период перезаполнения
	ФормаНастройкиПериода = Новый НастройкаПериода;
	ФормаНастройкиПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	ФормаНастройкиПериода.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
	ФормаНастройкиПериода.ДатаОкончания	= КонецМесяца(ТекущаяДата());
	
	ФормаНастройкиПериода.РедактироватьКакИнтервал 	= Ложь;
	ФормаНастройкиПериода.РедактироватьКакПериод 	= Истина;
	
	Если НЕ ФормаНастройкиПериода.Редактировать() Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим выбранный период
	НекорректныйПериод = Ложь;
	Если ФормаНастройкиПериода.ДатаНачала 		> КонецГода(Объект.ДатаПланирования) ИЛИ
		 ФормаНастройкиПериода.ДатаОкончания 	> КонецГода(Объект.ДатаПланирования) ИЛИ
		 ФормаНастройкиПериода.ДатаНачала 		< НачалоГода(Объект.ДатаПланирования) ИЛИ
		 ФормаНастройкиПериода.ДатаОкончания 	< НачалоГода(Объект.ДатаПланирования) Тогда
		 
		НекорректныйПериод = Истина;
		
	КонецЕсли;
	
	Если НекорректныйПериод Тогда
		Сообщить("Выбран некорректный период!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьБДДСПоПланамИЗадолженностиСервер(ФормаНастройкиПериода.ДатаНачала, ФормаНастройкиПериода.ДатаОкончания);
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

Процедура ЗаполнитьБДДСПоПланамИЗадолженностиСервер(Знач НачПериода, Знач КонПериода)
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьБДДСПоПланамИЗадолженности(НачПериода, КонПериода);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыручкуОперФакт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьВыручкуОперФактСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСебестоимостьОперФакт(Команда)

	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьСебестоимостьОперФактСервер();
	ЭтаФорма.Модифицированность=Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРетроОперФакт(Команда)

	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьРетроОперФактСерверСервер();
	ЭтаФорма.Модифицированность=Истина;	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспортОперФакт(Команда)

	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьТранспортОперФактСервер();
	ЭтаФорма.Модифицированность=Истина;	

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВыручкуОперФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиВыручкиОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСебестоимостьОперФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиСебестоимостиОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРетроОперФактСерверСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиРетроОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТранспортОперФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиТранспортаОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

	



