
&НаКлиенте
Процедура ЗаполнитьПоПараметрамРасчетаПремии(Команда)
	
	ТзНастройкиПремрования = ЗапросПолучитьНастройкиПремии(Объект.Дата);
	Если ТзНастройкиПремрования.Количество() > 0 Тогда
		ЗаполнитьТЧ (ТзНастройкиПремрования)
		//Для каждого СтрокаТзНастройкиПремрования  Из ТзНастройкиПремрования Цикл
		//КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗапросПолучитьНастройкиПремии (ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.НачалоПериода,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Контрагент КАК Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Сеть КАК Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность КАК Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ГодовойТоварооборот КАК Товарооборот
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам.СрезПоследних(&ДатаСреза, Действует = ИСТИНА) КАК Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
		|			ВложенныйЗапрос.Периодичность КАК Периодичность
		|		ИЗ
		|			(ВЫБРАТЬ
		|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК НачалоПериода,
		|				ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц) КАК Периодичность
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) И КОНЕЦПЕРИОДА(&ДатаСреза, ГОД)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, КВАРТАЛ),
		|				ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) И КОНЕЦПЕРИОДА(&ДатаСреза, ГОД)
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, ПОЛУГОДИЕ),
		|				ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
		|			ИЗ
		|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|			ГДЕ
		|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаСреза, ГОД) И КОНЕЦПЕРИОДА(&ДатаСреза, ГОД)) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.НачалоПериода,
		|			ВложенныйЗапрос.Периодичность) КАК Периоды
		|		ПО Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность = Периоды.Периодичность
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	Сеть,
		|	Периодичность";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);

	Результат = Запрос.Выполнить();

	ТзНастройкиПремрования = Результат.Выгрузить();

	Возврат ТзНастройкиПремрования
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧ (Таблицазагрузки)
	ТчПлан = Объект.План;
	ТчПлан.Загрузить(Таблицазагрузки);	
КонецПроцедуры

&НаКлиенте
Процедура ПланТоварооборотПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.Элементы.План.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтроки(ТекСтрока)
	
	Если  ТекСтрока.Товарооборот > 0 Тогда
		Если ТекСтрока.ПроцентПремии  > 0 Тогда
			ТекСтрока.Премия =  ТекСтрока.Товарооборот / 100 *  ТекСтрока.ПроцентПремии +  ТекСтрока.ФиксированнаяСумма;
		Иначе
			ТекСтрока.Премия = ТекСтрока.ФиксированнаяСумма;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПроцентПремииПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.Элементы.План.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ПланФиксированнаяСуммаПриИзменении(Элемент)
	
	ТекСтрока = ЭтаФорма.Элементы.План.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);

КонецПроцедуры


