
&НаКлиенте
Процедура ТоварыПодбор(Команда)
	СтруктураПараметров=Новый Структура();
	СтруктураПараметров.Вставить("ПодбиратьУслуги", Ложь);
	
	ОткрытьФормуМодально("ОбщаяФорма.абс_ФормаПодбораНоменклатуры", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("Номенклатура") Тогда
			Для Каждого Номенклатура из ВыбранноеЗначение.Номенклатура Цикл
				//если номенклатура уже выбрана в ТЧ, то ее добавлять не будем
				МассивСтрок=Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
				Если МассивСтрок.Количество()=0 Тогда
					СтрокаТЧ=Объект.Товары.Добавить();
					СтрокаТЧ.Номенклатура=Номенклатура;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
