
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	//231030 Степан ++
	//Если ЭтотОбъект.Модифицированность() Тогда 
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	Пользователи.Код КАК ИмяВхода,
	//	|	НастройкиПользователей.Настройка,
	//	|	НастройкиПользователей.Значение
	//	|ИЗ
	//	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	//	|		ПО НастройкиПользователей.Пользователь = Пользователи.Ссылка
	//	|ГДЕ
	//	|	НастройкиПользователей.Настройка.Код = ""00140"" И НастройкиПользователей.Значение = Истина И Пользователь.Ссылка = &ТекущийПользователь";
	//	Запрос.УстановитьПараметр("ТекущийПользователь",ПараметрыСеанса.ТекущийПользователь);
	//	Если Запрос.Выполнить().Пустой() Тогда
	//		Отказ = Истина;
	//	Иначе	
	//    	//абс_РегламентныеЗадания.лео_ИзменениеСпецификацийИТехкарт(ЭтотОбъект); 
	//	КонецЕсли;
	//	
	//КонецЕсли
	
КонецПроцедуры // ПередЗаписью()
