
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерсоналПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
	
	ДокументОснование = Объект.ДокументОснование;
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		Если НоваяСтрока и НЕ Копирование тогда
			
			Элемент.ТекущиеДанные.Смена = Справочники.Лео_сменыПереработчиков.НайтиПоКоду("000000002"); //8 часов
			Элемент.ТекущиеДанные.Подразделение = ДокументОснование.Подразделение;
			Элемент.ТекущиеДанные.ВидОборудования = ДокументОснование.Лео_оборудование;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерсоналПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
	
	ФизЛицо = Элемент.ТекущиеДанные.ФизЛицо;
	Если ЗначениеЗаполнено(ФизЛицо) и НоваяСтрока тогда
		Элемент.ТекущиеДанные.Должность = ФизЛицо.Лео_Должность;
		
		Если ФизЛицо.Родитель.Код = "БП00002643" тогда
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0010883"); //Группа линейного персонала ООО	
			//переработчики	
		ИначеЕсли ФизЛицо.Родитель.Код = "БП00000960" тогда
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0007666"); //ПРОФЕССИОНАЛ СТАФФ ООО
			
		иначе
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("К00000011"); //ЛЕОВИТ нутрио
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
