
&НаКлиенте
Процедура СоздатьТипЦен(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала необходимо записать элемент справочника!");
		Возврат;
	КонецЕсли;

	Для каждого  СтрокаТч из  Объект.Скидки  Цикл
		Если СтрокаТч.СоздатьТипыЦен Тогда
			
			
			// 1.ТипЦенСоСкидкой
			ПроцентСкидкиНаценки = (100-(100-СтрокаТч.СтатуснаяСкидка)*((100-СтрокаТч.ДополнительнаяСкидка)/100));
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаКомпенсирующаяПремию; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаУслугиЛогистики; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаУслугиТорговогоМаркетинга; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаУслугиМерчендайзинга; 
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки + СтрокаТч.СкидкаЗаПрочиеУслугиПоДоговору;
			//ПроцентСкидкиНаценки = Окр(ПроцентСкидкиНаценки, 2);
			ПроцентСкидкиНаценки = Окр(ПроцентСкидкиНаценки, 3);
			
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки *-1;
			
			БазовыйТипЦен = СтрокаТч.БазовыйТипЦен;
			Если ПроцентСкидкиНаценки <> 0 Тогда
				ТипЦен =  НайтиСуществующийТипЦен(БазовыйТипЦен,ПроцентСкидкиНаценки);
			Иначе
				ТипЦен =  СтрокаТч.БазовыйТипЦен;
			КонецЕсли;
			
			
			Если ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда
				Попытка
					ТипЦен = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
					ТипЦен.Наименование = "" + БазовыйТипЦен.Наименование + " " + ?(ПроцентСкидкиНаценки > 0,"+" + ПроцентСкидкиНаценки,ПроцентСкидкиНаценки)+ "%";
					ТипЦен.ВалютаЦены = БазовыйТипЦен.ВалютаЦены;
					ТипЦен.БазовыйТипЦен = БазовыйТипЦен;
					ТипЦен.Рассчитывается = Истина;
					ТипЦен.ПроцентСкидкиНаценки = ПроцентСкидкиНаценки;
					ТипЦен.ЦенаВключаетНДС = БазовыйТипЦен.ЦенаВключаетНДС;
					ТипЦен.ПорядокОкругления = БазовыйТипЦен.ПорядокОкругления;
					ТипЦен.ОкруглятьВБольшуюСторону = БазовыйТипЦен.ОкруглятьВБольшуюСторону;
	                ТипЦен.СпособРасчетаЦены = Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип;
					ТипЦен.Записать();
					
					Сообщить("Создан новый вид цен: " + ТипЦен);
				Исключение
					Сообщить("Не удалось создать тип цен");
                    Возврат
				КонецПопытки;
					
				СтрокаТч.ТипЦенСоСкидкой = 	ТипЦен.Ссылка;
			Иначе
				СтрокаТч.ТипЦенСоСкидкой = 	ТипЦен;
			КонецЕсли;
			
			// 2.СтатусныйТипЦен
			ПроцентСкидкиНаценки = (100-(100-СтрокаТч.СтатуснаяСкидка)*((100-СтрокаТч.ДополнительнаяСкидка)/100));
			ПроцентСкидкиНаценки = Окр(ПроцентСкидкиНаценки, 3);
			
			ПроцентСкидкиНаценки = ПроцентСкидкиНаценки *-1;
			
			БазовыйТипЦен = СтрокаТч.БазовыйТипЦен;
			Если ПроцентСкидкиНаценки <> 0 Тогда
				ТипЦен =  НайтиСуществующийТипЦен(БазовыйТипЦен,ПроцентСкидкиНаценки);
			Иначе
				ТипЦен =  СтрокаТч.БазовыйТипЦен;
			КонецЕсли;
			
			
			Если ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда
				Попытка
					ТипЦен = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();
					ТипЦен.Наименование = "" + БазовыйТипЦен.Наименование + " " + ?(ПроцентСкидкиНаценки > 0,"+" + ПроцентСкидкиНаценки,ПроцентСкидкиНаценки)+ "%";
					ТипЦен.ВалютаЦены = БазовыйТипЦен.ВалютаЦены;
					ТипЦен.БазовыйТипЦен = БазовыйТипЦен;
					ТипЦен.Рассчитывается = Истина;
					ТипЦен.ПроцентСкидкиНаценки = ПроцентСкидкиНаценки;
					ТипЦен.ЦенаВключаетНДС = БазовыйТипЦен.ЦенаВключаетНДС;
					ТипЦен.ПорядокОкругления = БазовыйТипЦен.ПорядокОкругления;
					ТипЦен.ОкруглятьВБольшуюСторону = БазовыйТипЦен.ОкруглятьВБольшуюСторону;
	                ТипЦен.СпособРасчетаЦены = Перечисления.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип;
					ТипЦен.Записать();
					
					Сообщить("Создан новый вид цен: " + ТипЦен);
				Исключение
					Сообщить("Не удалось создать тип цен");
                    Возврат
				КонецПопытки;
					
				СтрокаТч.СтатусныйТипЦен = 	ТипЦен.Ссылка;
			Иначе
				СтрокаТч.СтатусныйТипЦен = 	ТипЦен;
			КонецЕсли;
			
			
			
			
		КонецЕсли;
	КонецЦикла
КонецПроцедуры

Функция НайтиСуществующийТипЦен(БазовыйТипЦен,ПроцентСкидкиНаценки)
	ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦен
		|ИЗ
		|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|ГДЕ
		|	ТипыЦенНоменклатуры.БазовыйТипЦен = &БазовыйТипЦен
		|	И ТипыЦенНоменклатуры.ПроцентСкидкиНаценки = &ПроцентСкидкиНаценки
		|	И ТипыЦенНоменклатуры.Рассчитывается = ИСТИНА
		|	И ТипыЦенНоменклатуры.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("БазовыйТипЦен", БазовыйТипЦен);
	Запрос.УстановитьПараметр("ПроцентСкидкиНаценки", ПроцентСкидкиНаценки);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипЦен = ВыборкаДетальныеЗаписи.ТипЦен; 
	КонецЦикла;
	
	Возврат ТипЦен
КонецФункции

&НаКлиенте
Процедура ПривязатьТипЦенКДоговору(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала необходимо записать элемент справочника!");
		Возврат;
	КонецЕсли;
	
	Для каждого  СтрокаТч из  Объект.Скидки  Цикл
		Если СтрокаТч.СоздатьПривязкуТипаЦенКДоговору  и СтрокаТч.ДокументУстановкаТиповЦенПоГруппам = Документы.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.ПустаяСсылка() Тогда
			Если СтрокаТч.ТипЦенСоСкидкой = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка() Тогда
				Сообщить ("Не указан тип цен с учетом скидки");
				Возврат
			КонецЕсли;
			
			РегистраторПривязки = ПривязатьТипЦенКДоговоруНаСервере(СтрокаТч.ТипЦенСоСкидкой,СтрокаТч.ДатаНачалаПериода,Объект.Договор);
			СтрокаТч.ДокументУстановкаТиповЦенПоГруппам = РегистраторПривязки;
			
    	КонецЕсли;
	КонецЦикла
КонецПроцедуры

Функция ПривязатьТипЦенКДоговоруНаСервере (ТипЦен,ДатаНачала,Договор)
	ДокументРегистратор = Документы.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.ПустаяСсылка();
	
	УстановкаТиповЦен = Документы.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.СоздатьДокумент();	
	УстановкаТиповЦен.Контрагент = Договор.Владелец;
    УстановкаТиповЦен.абс_ДоговорКонтрагента = Договор;
	УстановкаТиповЦен.Дата = ДатаНачала;
	УстановкаТиповЦен.ДатаНачала = ДатаНачала;
	УстановкаТиповЦен.ВидОперации = Перечисления.ВидыОперацийУстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей.абс_ПоДоговору;
	УстановкаТиповЦен.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	СтрокаТч = УстановкаТиповЦен.НоменклатурныеЦеновыеГруппы.Добавить();
	СтрокаТч.ТипЦен = ТипЦен;
	
	Попытка
  	 	УстановкаТиповЦен.Записать(РежимЗаписиДокумента.Проведение);
		ДокументРегистратор = УстановкаТиповЦен.Ссылка;
		Сообщить("Создан новый документ привязки типа цен к договору");
	Исключение
		Сообщить ("Не удалось провести документ привязки типа цен к договору.");
	КонецПопытки;

	Возврат ДокументРегистратор
КонецФункции

Функция ПолучитьДоступнуюРольИсполнителя(Роль) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Исполнитель
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Исполнитель = &Исполнитель
		|	И РолиИИсполнители.Роль = &Роль";
	Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Роль", Роль);  
	Результат = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = Результат.Выбрать();  
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
    Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура СкидкиСтатуснаяСкидкаПриИзменении(Элемент)
	
    Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СтатуснаяСкидка < -10 или ТекСтрока.СтатуснаяСкидка > 25 Тогда
		Сообщить("Значение не входит в диапазон значений от -10 до 25.");	
		ТекСтрока.СтатуснаяСкидка = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкиДополнительнаяСкидкаПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.ДополнительнаяСкидка < 0 или ТекСтрока.ДополнительнаяСкидка > 5 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 5.");	
		ТекСтрока.ДополнительнаяСкидка = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаКомпенсирующаяПремиюПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаКомпенсирующаяПремию < 0 или ТекСтрока.СкидкаКомпенсирующаяПремию > 10 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 10.");	
		ТекСтрока.СкидкаКомпенсирующаяПремию = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаУслугиЛогистикиПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаУслугиЛогистики < -15 или ТекСтрока.СкидкаЗаУслугиЛогистики > 15 Тогда
		Сообщить("Значение не входит в диапазон значений от -15 до 15.");	
		ТекСтрока.СкидкаЗаУслугиЛогистики = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаУслугиТорговогоМаркетингаПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаУслугиТорговогоМаркетинга < 0 или ТекСтрока.СкидкаЗаУслугиТорговогоМаркетинга > 15 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 15.");	
		ТекСтрока.СкидкаЗаУслугиТорговогоМаркетинга = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаУслугиМерчендайзингаПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаУслугиМерчендайзинга < 0 или ТекСтрока.СкидкаЗаУслугиМерчендайзинга > 5 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 5.");	
		ТекСтрока.СкидкаЗаУслугиМерчендайзинга = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкидкаЗаПрочиеУслугиПоДоговоруПриИзменении(Элемент)
	
	Если абс_Дистрибуция.ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.Лео_СкидкиОтБазовыеЦеныБезОграничения) Тогда
		Возврат ;
	КонецЕСлИ; 
	ТекСтрока = ЭтаФорма.Элементы.Скидки.ТекущиеДанные;
	Если ТекСтрока.СкидкаЗаПрочиеУслугиПоДоговору < 0 или ТекСтрока.СкидкаЗаПрочиеУслугиПоДоговору > 5 Тогда
		Сообщить("Значение не входит в диапазон значений от 0 до 5.");	
		ТекСтрока.СкидкаЗаПрочиеУслугиПоДоговору = 0;
	КонецЕсли;
	
КонецПроцедуры
	
	
