Процедура абс_УстановитьПодменюХозОперацийДокумента(ПодменюДействия, ДокументОбъект) Экспорт
	
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	
	ХозОперацияПоУмолчанию = абс_ПроцедурыСПовторнымВызовом.ПолучитьХозяйственнуюОперациюДляДокументаПоУмолчанию(ИмяДокумента);
	
	Если ДокументОбъект.ЭтоНовый() И НЕ ЗначениеЗаполнено(ДокументОбъект.абс_ХозяйственнаяОперация) Тогда
		
		ДокументОбъект.абс_ХозяйственнаяОперация = ХозОперацияПоУмолчанию;
		
	КонецЕсли;
	
	Если ПодменюДействия.Кнопки.Найти("ПодменюУстановитьХозОперацию") = Неопределено Тогда	
		
		Обработчик = Новый Действие("абс_ДействияФормыУстановитьХозОперацию");
		
		ПодменюДействия.Кнопки.Добавить("РазделительУстановитьХозОперацию", ТипКнопкиКоманднойПанели.Разделитель);
		
		ПодменюХозОперация = ПодменюДействия.Кнопки.Добавить("ПодменюУстановитьХозОперацию", ТипКнопкиКоманднойПанели.Подменю, "Хоз. операция");
		
		СписокХозОпераций = ПолучитьСписокХозОперацийПоТипуДокумента(ИмяДокумента);
		
		ТекНомерКнопки = 0;
		
		Для Каждого ТекХозОперация Из СписокХозОпераций Цикл
			
			ТекНомерКнопки = ТекНомерКнопки + 1;
			
			ТекКнопка = ПодменюХозОперация.Кнопки.Добавить("ПодменюУстановитьХозОперациюКнопка" + Строка(ТекНомерКнопки), ТипКнопкиКоманднойПанели.Действие, Строка(ТекХозОперация), Обработчик);
			
			ТекКнопка.Пометка = ДокументОбъект.абс_ХозяйственнаяОперация = ТекХозОперация;
			
			ТекКнопка.ИзменяетДанные = Истина;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСписокХозОперацийПоТипуДокумента(ИмяДокумента)
	
	ТипДокумента = Тип("ДокументСсылка." + ИмяДокумента);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ХозяйственныеОперацииПУБ77.Ссылка
	|ИЗ
	|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
	|ГДЕ
	|	абс_ХозяйственныеОперацииПУБ77.ТипМетаданных.ТипМетаданныхСсылка = &ТипЗначенияПустаяСсылка");
	
	Запрос.УстановитьПараметр("ТипЗначенияПустаяСсылка", Новый(Тип("ДокументСсылка." + ИмяДокумента)));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
