#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	//УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	//УниверсальныйОтчет.ИмяРегистра = "ЗаказыПоставщикам";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	УниверсальныйОтчет.ДобавитьПолеГруппировка("Контрагент", "ДоговорКонтрагента", "Владелец", "Контрагент", новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИсточникДанных.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ДоговорКонтрагента) КАК ДоговорКонтрагентаПредставление,
	               |	ИсточникДанных.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ЗаказПоставщику) КАК ЗаказПоставщикуПредставление,
	               |	ИсточникДанных.СтатусПартии КАК СтатусПартии,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтатусПартии) КАК СтатусПартииПредставление,
	               |	ИсточникДанных.Номенклатура КАК Номенклатура,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Номенклатура) КАК НоменклатураПредставление,
	               |	ИсточникДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
	               |	ИсточникДанных.Цена КАК Цена,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Цена) КАК ЦенаПредставление,
	               |	ИсточникДанных.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	               |	ИсточникДанных.СтавкаНДС КАК СтавкаНДС,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтавкаНДС) КАК СтавкаНДСПредставление,
	               |	ИсточникДанных.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ДоговорКонтрагента.Владелец) КАК КонтрагентПредставление,
	               |	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	               |	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	               |	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
	               |	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	               |	ИсточникДанных.КоличествоОборот КАК КоличествоОборот,
	               |	ИсточникДанных.СуммаВзаиморасчетовНачальныйОстаток КАК СуммаВзаиморасчетовНачальныйОстаток,
	               |	ИсточникДанных.СуммаВзаиморасчетовПриход КАК СуммаВзаиморасчетовПриход,
	               |	ИсточникДанных.СуммаВзаиморасчетовРасход КАК СуммаВзаиморасчетовРасход,
	               |	ИсточникДанных.СуммаВзаиморасчетовКонечныйОстаток КАК СуммаВзаиморасчетовКонечныйОстаток,
	               |	ИсточникДанных.СуммаВзаиморасчетовОборот КАК СуммаВзаиморасчетовОборот,
	               |	ИсточникДанных.СуммаУпрНачальныйОстаток КАК СуммаУпрНачальныйОстаток,
	               |	ИсточникДанных.СуммаУпрПриход КАК СуммаУпрПриход,
	               |	ИсточникДанных.СуммаУпрРасход КАК СуммаУпрРасход,
	               |	ИсточникДанных.СуммаУпрКонечныйОстаток КАК СуммаУпрКонечныйОстаток,
	               |	ИсточникДанных.СуммаУпрОборот КАК СуммаУпрОборот,
	               |	ИсточникДанных.Регистратор КАК Регистратор,
	               |	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Регистратор) КАК РегистраторПредставление,
	               |	ИсточникДанных.Период КАК Период,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ) КАК ПериодДень,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА) КАК ПериодДекада,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ) КАК ПериодМесяц,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ) КАК ПериодКвартал,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	               |	НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД) КАК ПериодГод,
	               |	ВложенныйЗапрос.ТранспортныхКоробов КАК ТранспортныхКоробов,
	               |	ВложенныйЗапрос.Паллет КАК Паллет,
	               |	ВложенныйЗапрос.Ссылка КАК ЗаявкаНаТранспорт,
	               |	ВложенныйЗапрос.ТранспортныйМаршрут КАК ТранспортныйМаршрут,
	               |	ВложенныйЗапрос.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ВложенныйЗапрос.ТранспортнаяКомпания КАК ТранспортнаяКомпания,
	               |	"""" КАК ВремяПрибытия,
	               |	"""" КАК ВремяУбытия,
	               |	"""" КАК ПроверкаСД,
	               |	"""" КАК НаличиеМК,
	               |	"""" КАК НаличиеСОТС
	               |{ВЫБРАТЬ
	               |	ДоговорКонтрагента.*,
	               |	ЗаказПоставщику.*,
	               |	СтатусПартии.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	Цена,
	               |	ЕдиницаИзмерения.*,
	               |	СтавкаНДС.*,
	               |	Контрагент.*,
	               |	КоличествоНачальныйОстаток,
	               |	КоличествоПриход,
	               |	КоличествоРасход,
	               |	КоличествоКонечныйОстаток,
	               |	КоличествоОборот,
	               |	СуммаВзаиморасчетовНачальныйОстаток,
	               |	СуммаВзаиморасчетовПриход,
	               |	СуммаВзаиморасчетовРасход,
	               |	СуммаВзаиморасчетовКонечныйОстаток,
	               |	СуммаВзаиморасчетовОборот,
	               |	СуммаУпрНачальныйОстаток,
	               |	СуммаУпрПриход,
	               |	СуммаУпрРасход,
	               |	СуммаУпрКонечныйОстаток,
	               |	СуммаУпрОборот,
	               |	Регистратор.* КАК Регистратор,
	               |	Период КАК Период,
	               |	ПериодДень,
	               |	ПериодНеделя,
	               |	ПериодДекада,
	               |	ПериодМесяц,
	               |	ПериодКвартал,
	               |	ПериодПолугодие,
	               |	ПериодГод,
	               |	Паллет,
	               |	ТранспортныхКоробов,
	               |	ЗаявкаНаТранспорт.*,
	               |	ТранспортныйМаршрут.*,
	               |	ТранспортноеСредство.*,
	               |	ТранспортнаяКомпания.*,
	               |	ВремяПрибытия,
	               |	ВремяУбытия,
	               |	ПроверкаСД,
	               |	НаличиеМК,
	               |	НаличиеСОТС}
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(ДоговорКонтрагента).* КАК ДоговорКонтрагента, (ЗаказПоставщику).* КАК ЗаказПоставщику, (СтатусПартии).* КАК СтатусПартии, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (Цена) КАК Цена, (ЕдиницаИзмерения).* КАК ЕдиницаИзмерения, (СтавкаНДС).* КАК СтавкаНДС, (ДоговорКонтрагента.Владелец).* КАК Контрагент}) КАК ИсточникДанных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			абс_ЗаявкаНаТранспорт.Ссылка КАК Ссылка,
	               |			абс_ЗаявкаНаТранспорт.ДокументОснование КАК ДокументОснование,
	               |			абс_ЗаявкаНаТранспорт.ВсегоКоличествоКоробов КАК ТранспортныхКоробов,
	               |			абс_ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК Паллет,
	               |			абс_ТранспортныйМаршрутЗадания.Ссылка КАК ТранспортныйМаршрут,
	               |			абс_ТранспортныйМаршрутЗадания.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
	               |			абс_ТранспортныйМаршрутЗадания.Ссылка.ТКПеревозчик КАК ТранспортнаяКомпания
	               |		ИЗ
	               |			Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	               |				ПО (абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт = абс_ЗаявкаНаТранспорт.Ссылка)
	               |		ГДЕ
	               |			абс_ЗаявкаНаТранспорт.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
	               |			И абс_ЗаявкаНаТранспорт.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО ИсточникДанных.ЗаказПоставщику = ВложенныйЗапрос.ДокументОснование
	               |{ГДЕ
	               |	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	               |	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	               |	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
	               |	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	               |	ИсточникДанных.КоличествоОборот КАК КоличествоОборот,
	               |	ИсточникДанных.СуммаВзаиморасчетовНачальныйОстаток КАК СуммаВзаиморасчетовНачальныйОстаток,
	               |	ИсточникДанных.СуммаВзаиморасчетовПриход КАК СуммаВзаиморасчетовПриход,
	               |	ИсточникДанных.СуммаВзаиморасчетовРасход КАК СуммаВзаиморасчетовРасход,
	               |	ИсточникДанных.СуммаВзаиморасчетовКонечныйОстаток КАК СуммаВзаиморасчетовКонечныйОстаток,
	               |	ИсточникДанных.СуммаВзаиморасчетовОборот КАК СуммаВзаиморасчетовОборот,
	               |	ИсточникДанных.СуммаУпрНачальныйОстаток КАК СуммаУпрНачальныйОстаток,
	               |	ИсточникДанных.СуммаУпрПриход КАК СуммаУпрПриход,
	               |	ИсточникДанных.СуммаУпрРасход КАК СуммаУпрРасход,
	               |	ИсточникДанных.СуммаУпрКонечныйОстаток КАК СуммаУпрКонечныйОстаток,
	               |	ИсточникДанных.СуммаУпрОборот КАК СуммаУпрОборот,
	               |	ИсточникДанных.Регистратор.* КАК Регистратор,
	               |	ИсточникДанных.Период КАК Период,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕНЬ)) КАК ПериодДень,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ДЕКАДА)) КАК ПериодДекада,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, МЕСЯЦ)) КАК ПериодМесяц,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, КВАРТАЛ)) КАК ПериодКвартал,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	               |	(НАЧАЛОПЕРИОДА(ИсточникДанных.Период, ГОД)) КАК ПериодГод}
	               |{УПОРЯДОЧИТЬ ПО
	               |	ДоговорКонтрагента.*,
	               |	ЗаказПоставщику.*,
	               |	СтатусПартии.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	Цена,
	               |	ЕдиницаИзмерения.*,
	               |	СтавкаНДС.*,
	               |	Контрагент.*,
	               |	КоличествоНачальныйОстаток,
	               |	КоличествоПриход,
	               |	КоличествоРасход,
	               |	КоличествоКонечныйОстаток,
	               |	КоличествоОборот,
	               |	СуммаВзаиморасчетовНачальныйОстаток,
	               |	СуммаВзаиморасчетовПриход,
	               |	СуммаВзаиморасчетовРасход,
	               |	СуммаВзаиморасчетовКонечныйОстаток,
	               |	СуммаВзаиморасчетовОборот,
	               |	СуммаУпрНачальныйОстаток,
	               |	СуммаУпрПриход,
	               |	СуммаУпрРасход,
	               |	СуммаУпрКонечныйОстаток,
	               |	СуммаУпрОборот,
	               |	Регистратор.*,
	               |	Период,
	               |	ПериодДень,
	               |	ПериодНеделя,
	               |	ПериодДекада,
	               |	ПериодМесяц,
	               |	ПериодКвартал,
	               |	ПериодПолугодие,
	               |	ПериодГод,
	               |	ЗаявкаНаТранспорт.*,
	               |	ВремяПрибытия,
	               |	ВремяУбытия,
	               |	ПроверкаСД,
	               |	НаличиеМК,
	               |	НаличиеСОТС,
	               |	Паллет,
	               |	ТранспортныхКоробов,
	               |	ТранспортныйМаршрут.*,
	               |	ТранспортноеСредство.*,
	               |	ТранспортнаяКомпания.*}
	               |ИТОГИ
	               |	СУММА(КоличествоНачальныйОстаток),
	               |	СУММА(КоличествоПриход),
	               |	СУММА(КоличествоРасход),
	               |	СУММА(КоличествоКонечныйОстаток),
	               |	СУММА(КоличествоОборот),
	               |	СУММА(СуммаВзаиморасчетовНачальныйОстаток),
	               |	СУММА(СуммаВзаиморасчетовПриход),
	               |	СУММА(СуммаВзаиморасчетовРасход),
	               |	СУММА(СуммаВзаиморасчетовКонечныйОстаток),
	               |	СУММА(СуммаВзаиморасчетовОборот),
	               |	СУММА(СуммаУпрНачальныйОстаток),
	               |	СУММА(СуммаУпрПриход),
	               |	СУММА(СуммаУпрРасход),
	               |	СУММА(СуммаУпрКонечныйОстаток),
	               |	СУММА(СуммаУпрОборот),
	               |	МАКСИМУМ(ТранспортныхКоробов),
	               |	МАКСИМУМ(Паллет),
	               |	МАКСИМУМ(ЗаявкаНаТранспорт),
	               |	МАКСИМУМ(ТранспортныйМаршрут),
	               |	МАКСИМУМ(ТранспортноеСредство),
	               |	МАКСИМУМ(ТранспортнаяКомпания)
	               |ПО
	               |	ОБЩИЕ
	               |{ИТОГИ ПО
	               |	ДоговорКонтрагента.*,
	               |	ЗаказПоставщику.*,
	               |	СтатусПартии.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	Цена,
	               |	ЕдиницаИзмерения.*,
	               |	СтавкаНДС.*,
	               |	Контрагент.*,
	               |	Регистратор.*,
	               |	Период,
	               |	ПериодДень,
	               |	ПериодНеделя,
	               |	ПериодДекада,
	               |	ПериодМесяц,
	               |	ПериодКвартал,
	               |	ПериодПолугодие,
	               |	ПериодГод,
	               |	ЗаявкаНаТранспорт.*,
	               |	Паллет,
	               |	ТранспортныхКоробов,
	               |	ТранспортныйМаршрут.*,
	               |	ТранспортноеСредство.*,
	               |	ТранспортнаяКомпания.*}";
	 
	 УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	
	// Заполнение начальных настроек универсального отчета
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗаказПоставщику");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("ЗаказПоставщику");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("СтатусПартии");
	УниверсальныйОтчет.ДобавитьОтбор("ДоговорКонтрагента");
	
	
	
	
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДоговорКонтрагента",                    "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ЗаказПоставщику",                       "Заказ поставщику");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтатусПартии",                          "Статус партии");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ХарактеристикаНоменклатуры",            "ХарактеристикаНоменклатуры");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ЕдиницаИзмерения",                      "Единица измерения");
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СтавкаНДС",                             "Ставка НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоНачальныйОстаток",            "Количество (нач. ост.)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоПриход",                      "Количество (приход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоРасход",                      "Количество (расход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоКонечныйОстаток",             "Количество (кон. ост.)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоОборот",                      "Количество (оборот)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаВзаиморасчетовНачальныйОстаток",   "Сумма взаиморасчетов (нач. ост.)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаВзаиморасчетовПриход",             "Сумма взаиморасчетов (приход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаВзаиморасчетовРасход",             "Сумма взаиморасчетов (расход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаВзаиморасчетовКонечныйОстаток",    "Сумма взаиморасчетов (кон. ост.)");
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаВзаиморасчетовОборот",             "Сумма взаиморасчетов (оборот)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаУпрНачальныйОстаток",              "Сумма упр. учета (нач. ост.)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаУпрПриход",                        "Сумма упр. учета (приход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаУпрРасход",                        "Сумма упр. учета (расход)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаУпрКонечныйОстаток",               "Сумма упр. учета (кон. ост.)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "СуммаУпрОборот",                        "Сумма упр. учета (оборот)");
    УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Периодичность",                         "Периодичность итогов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Регистратор",                           "Документ движения (регистратор)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодДень",                            "По дням");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодНеделя",                          "По неделям");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодДекада",                          "По декадам");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодМесяц",                           "По месяцам");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодКвартал",                         "По кварталам");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодПолугодие",                       "По полугодиям");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПериодГод",                             "По годам");
	
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНачальныйОстаток", "Нач. остаток",         Истина, "ЧЦ=15; ЧДЦ=2", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПриход",           "Приход",               Истина, "ЧЦ=15; ЧДЦ=2", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоРасход",           "Расход",               Истина, "ЧЦ=15; ЧДЦ=2", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоКонечныйОстаток",  "Кон. остаток",         Истина, "ЧЦ=15; ЧДЦ=2", "Количество", "Количество");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОборот",           "Оборот",               Истина, "ЧЦ=15; ЧДЦ=2", "Количество", "Количество");
	
	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаВзаиморасчетовНачальныйОстаток", "Нач. остаток",         Истина, "ЧЦ=15; ЧДЦ=2", "СуммаВзаиморасчетов", "Сумма взаиморасчетов");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаВзаиморасчетовПриход",           "Приход",               Истина, "ЧЦ=15; ЧДЦ=2", "СуммаВзаиморасчетов", "Сумма взаиморасчетов");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаВзаиморасчетовРасход",           "Расход",               Истина, "ЧЦ=15; ЧДЦ=2", "СуммаВзаиморасчетов", "Сумма взаиморасчетов");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаВзаиморасчетовКонечныйОстаток",  "Кон. остаток",         Истина, "ЧЦ=15; ЧДЦ=2", "СуммаВзаиморасчетов", "Сумма взаиморасчетов");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаВзаиморасчетовОборот",           "Оборот",               Истина, "ЧЦ=15; ЧДЦ=2", "СуммаВзаиморасчетов", "Сумма взаиморасчетов");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрНачальныйОстаток", "Нач. остаток",         Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма упр. учета");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрПриход",           "Приход",               Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма упр. учета");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрРасход",           "Расход",               Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма упр. учета");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрКонечныйОстаток",  "Кон. остаток",         Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма упр. учета");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрОборот",           "Оборот",               Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма упр. учета");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ВремяПрибытия",        	"Время Прибытия",  Истина, "ЧЦ=15; ЧДЦ=2", 		"ВремяПрибытия", "Дополнительная информация");
	УниверсальныйОтчет.ДобавитьПоказатель("ВремяУбытия",        	"Время Убытия",  Истина, "ЧЦ=15; ЧДЦ=2", 		"ВремяПрибытия", "Дополнительная информация");
	УниверсальныйОтчет.ДобавитьПоказатель("ПроверкаСД",        		"Проверка сопр. докум",  Истина, "ЧЦ=15; ЧДЦ=2","ВремяПрибытия", "Дополнительная информация");
	УниверсальныйОтчет.ДобавитьПоказатель("НаличиеМК",        		"Наличие мед. книжки",  Истина, "ЧЦ=15; ЧДЦ=2", "ВремяПрибытия", "Дополнительная информация");
	УниверсальныйОтчет.ДобавитьПоказатель("НаличиеСОТС",        	"Наличие сан.обр. ТС",  Истина, "ЧЦ=15; ЧДЦ=2", "ВремяПрибытия", "Дополнительная информация");
	
	УниверсальныйОтчет.ДобавитьПоказатель("ЗаявкаНаТранспорт",        "Заявка на транспорт",  Истина, "ЧЦ=15; ЧДЦ=2", "ЗаявкаНаТранспорт", "Заявка на транспорт");
	УниверсальныйОтчет.ДобавитьПоказатель("ТранспортныхКоробов",      "Транспортных коробов", Истина, "ЧЦ=15; ЧДЦ=2", "ЗаявкаНаТранспорт", "Заявка на транспорт");
	УниверсальныйОтчет.ДобавитьПоказатель("Паллет",                   "Паллет",               Истина, "ЧЦ=15; ЧДЦ=2", "ЗаявкаНаТранспорт", "Заявка на транспорт");

	УниверсальныйОтчет.ДобавитьПоказатель("ТранспортныйМаршрут",       "Транспортный маршрут",  Истина, "ЧЦ=15; ЧДЦ=2", "ТранспортныйМаршрут", "Транспортный маршрут");
	УниверсальныйОтчет.ДобавитьПоказатель("ТранспортнаяКомпания",      "Транспортная компания", Истина, "ЧЦ=15; ЧДЦ=2", "ТранспортныйМаршрут", "Транспортный маршрут");
 	УниверсальныйОтчет.ДобавитьПоказатель("ТранспортноеСредство",      "ТранспортноеСредство",  Истина, "ЧЦ=15; ЧДЦ=2", "ТранспортныйМаршрут", "Транспортный маршрут");

	

	
	
	
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);

	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	
	//КонДата = Дата(УниверсальныйОтчет.ДатаКон);
	//КонДата = КонецДня(?(КонДата = Дата('00010101000000'), Дата('39991231235959'), КонДата));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаНач", Дата(УниверсальныйОтчет.ДатаНач));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить( "ДатаКон", Дата(УниверсальныйОтчет.ДатаКон));

	
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
