Процедура СформироватьОтчет() Экспорт
	
	ЕстьОшибки = Ложь;
	Если Не ЗначениеЗаполнено(ДатаС) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала периода");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания периода");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Очистить();
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");

	
	УстановитьПривилегированныйРежим(Истина); 
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_БизнесРегион КАК Регион,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_Территория КАК Территория,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_Отдел КАК Отдел,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Сеть.НаименованиеПолное КАК НазваниеСети,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Премия КАК СуммаСчета,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.НачалоПериода,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.КонецПериода,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Договор,
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.Контрагент.абс_БизнесРегион.абс_Менеджер КАК ОтветственныйТМ
		|ИЗ
		|	Документ.Лео_РасчетПремииНепрямымКлиентам.Расчет КАК Лео_РасчетПремииНепрямымКлиентамРасчет
		|ГДЕ
		|	Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.НачалоПериода МЕЖДУ &ДатаС И &ДатаПо
		|	И Лео_РасчетПремииНепрямымКлиентамРасчет.Ссылка.КонецПериода МЕЖДУ &ДатаС И &ДатаПо";

	Запрос.УстановитьПараметр("ДатаС", ДатаС);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(ДатаПо));

	РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат.Вывести(ОбластьШапка);



	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьСтрока.Параметры.ОтчетныйПериод = "" + Формат (ВыборкаДетальныеЗаписи.НачалоПериода,"ДЛФ=D") + "-" + Формат (ВыборкаДетальныеЗаписи.КонецПериода,"ДЛФ=D");
		
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;	
	
	Результат.ОтображатьЗаголовки = Истина;	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//Результат.ФиксацияСверху = 14;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
    


