
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура возвращает общие данные для печати универсального передаточного документа
// по всем документам-основаниям
// 
Функция ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(ДанныеСчетФактуры) Экспорт
	
	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	
	//никитин
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(ДанныеСчетФактуры.Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	  //       СобратьДанныеДляПечатиСчетФактурыВыданногоУПД
		//	 УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданногоУПД(ДанныеСчетФактуры.Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат Неопределено;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("ДатаСчетФактуры",			ДанныеСчетФактуры.Дата);
	ДанныеДляПечати.Вставить("ВидСчетаФактуры", 		ДанныеСчетФактуры.ВидСчетаФактуры);
	ДанныеДляПечати.Вставить("Исправление", 	 		ДанныеСчетФактуры.Исправление);
	ДанныеДляПечати.Вставить("НомерИсправления", 		ДанныеСчетФактуры.НомерИсправления);
	ДанныеДляПечати.Вставить("ДоговорКонтрагента", 		ДанныеСчетФактуры.ДоговорКонтрагента);
	ДанныеДляПечати.Вставить("СчетФактураБезНДС", 		ДанныеСчетФактуры.СчетФактураБезНДС);
	ДанныеДляПечати.Вставить("КППКонтрагента", 	 		ДанныеСчетФактуры.КППКонтрагента);
	ДанныеДляПечати.Вставить("ДокументОснование", 	 	ДанныеСчетФактуры.ДокументОснование);
	ДанныеДляПечати.Вставить("ВидАгентскогоДоговора",   
	ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДанныеСчетФактуры.ДоговорКонтрагента, "ВидАгентскогоДоговора"));
	//никитин
	ДанныеДляПечати.Вставить("ИдентификаторГосКонтракта", ДанныеСчетФактуры.ИдентификаторГосКонтракта);
	
	УчетНДС.СформироватьФИОКладовщикаДляПечатиУниверсальногоПередаточногоДокумента(ДанныеДляПечати);
	
	ТипОснования = ТипЗнч(ДанныеДляПечати.ДокументОснование);
	Если ДанныеСчетФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
		
		ТекстСообщения = "";
		
		Если ТипОснования = Тип("ДокументСсылка.НачислениеНДСпоСМРхозспособом") Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется при начисления НДС по СМР";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется для документа ""Отражение начисления НДС""";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется при оформлении счетов-фактур по отчетам комиссионеров о продажах";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("СтатусУПД", 				1);
	
	Основание = Строка(ДанныеСчетФактуры.ДоговорКонтрагента);
	Если ДанныеСчетФактуры.Свойство("Доверенность") И ЗначениеЗаполнено(ДанныеСчетФактуры.Доверенность) Тогда
		ДанныеДляПечати.Вставить("Основание", Основание + ?(ПустаяСтрока(Основание), "", "; ") + ДанныеСчетФактуры.Доверенность);
	Иначе
		ДанныеДляПечати.Вставить("Основание", Основание);
	КонецЕсли;
	
	// Дата совершения факта хозяйственной жизни. Не может быть ранее даты составления УПД.
	ДанныеДляПечати.Вставить("ДатаОтгрузкиПередачи", 	ДанныеСчетФактуры.Дата);
	
	Возврат ДанныеДляПечати;
	
КонецФункции


// Процедура формирует печатную форму универсального передаточного документа
//
Процедура ПечатьУниверсальногоПередаточногоДокумента(ДанныеДляПечати, ТабДокумент) Экспорт
	
	//{Катанович
	//Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
	//534
	Если ДанныеДляПечати.ДатаСчетФактуры  >= '20241001' Тогда
	     Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент1096");
	     ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент534";
	ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры  >= '20210701' Тогда
	     Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент534");
	     ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент534";
    ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры < '20171001' Тогда
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
	Иначе
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент981";
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент981");
	КонецЕсли;
    //Катанович}	
	 ДокументыОбОтгрузкеУПД=СтрЗаменить(ДанныеДляПечати.ДокументыОбОтгрузке, ДанныеДляПечати.ДокументОтгрузки, ДанныеДляПечати.Номер);
	 ДанныеДляПечати.удалить("ДокументыОбОтгрузке");

	 ДанныеДляПечати.Вставить("ДокументыОбОтгрузке", ДокументыОбОтгрузкеУПД);

	УчетНДС.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	УчетНДС.ВывестиПодвалУниверсальногоПередаточногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки)
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в которой был выведен объект)
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура283") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура283", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура84")  Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура84", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура575") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура575", "Счет фактура", ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент", 
		"Универсальный передаточный документ", ПечатьУниверсальныхПередаточныхДокументов(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

// Проверяет правильность заполнения шапки документа.
// проставляет прочерки в незаполненных полях печатной формы счета-фактуры
//
Процедура ПроставитьПрочеркиВПустыеПоля(ОбластьМакета)
	
	Для т = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(т);
		
		Если (Найти(ТекПараметр, "Продавец:") <> 0)
			и (СокрЛП(ТекПараметр) = "Продавец:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Продавец: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Адрес:") <> 0)
			и (СокрЛП(ТекПараметр) = "Адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Адрес: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Идентификационный номер продавца (ИНН):") <> 0)
			и (СокрЛП(ТекПараметр) = "Идентификационный номер продавца (ИНН):") Тогда
			ОбластьМакета.Параметры.Установить(т, "Идентификационный номер продавца (ИНН): -");
			
		ИначеЕсли (Найти(ТекПараметр, "ИНН/КПП продавца:") <> 0)
			и (СокрЛП(ТекПараметр) = "ИНН/КПП продавца:") Тогда
			ОбластьМакета.Параметры.Установить(т, "ИНН/КПП продавца: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Грузоотправитель и его адрес:") <> 0)
			и (СокрЛП(ТекПараметр) = "Грузоотправитель и его адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Грузоотправитель и его адрес: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Грузополучатель и его адрес:") <> 0)
			и (СокрЛП(ТекПараметр) = "Грузополучатель и его адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Грузополучатель и его адрес: --");
			
		ИначеЕсли (Найти(ТекПараметр, "К платежно-расчетному документу №") <> 0)
			и (СокрЛП(ТекПараметр) = "К платежно-расчетному документу №  от") Тогда
			ОбластьМакета.Параметры.Установить(т, "К платежно-расчетному документу № -- от --");
			
		ИначеЕсли (Найти(ТекПараметр, "Покупатель:") <> 0)
			и (СокрЛП(ТекПараметр) = "Покупатель:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Покупатель: --");
			
		ИначеЕсли (Найти(ТекПараметр, "Идентификационный номер покупателя (ИНН):") <> 0)
			и (СокрЛП(ТекПараметр) = "Идентификационный номер покупателя (ИНН):") Тогда
			ОбластьМакета.Параметры.Установить(т, "Идентификационный номер покупателя (ИНН): --");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(т, "--");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроставитьПрочеркиВПустыеПоля()

// ПЕЧАТЬ

Функция ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 13;
	ТабДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	ВыводитьКолонтитул = МассивОбъектов.Количество() = 1;
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Корректировочный    = Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
		ВерсияПостановления = УчетНДС.ПолучитьВерсиюПостановления(Ссылка.Дата);
		Если ВерсияПостановления = 1 Тогда
			Если Корректировочный Тогда
				ПечатьКорректировочногоСчетаФактуры(Ссылка, ТабДокумент);
			Иначе
				ПечатьСчетаФактуры914(Ссылка, ТабДокумент);
			КонецЕсли;
		Иначе
			Если Корректировочный Тогда
				ПечатьКорректировочногоСчетаФактуры1137(Ссылка, ТабДокумент);
			Иначе
				ПечатьСчетаФактуры1137(Ссылка, ТабДокумент);
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.ВерхнийКолонтитул.Выводить = ВыводитьКолонтитул;
		Если ВыводитьКолонтитул Тогда
			ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница     = 2;
			ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
			ЗаголовокДляПечати = ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка, "Счет-фактура") + " г.";
			ТабДокумент.ВерхнийКолонтитул.ТекстСлева  = ЗаголовокДляПечати;
			ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "Лист [&НомерСтраницы]";
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ПечатьСчетаФактуры1137(Ссылка, ТабДокумент)
	
	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, 
	"Дата, ВидСчетаФактуры, Исправление, НомерИсправления, ДоговорКонтрагента, СчетФактураБезНДС, КППКонтрагента, ИдентификаторГосКонтракта");
	ДанныеДляПечати.Вставить("ДатаСчетФактуры", 	 	РеквизитыСФ.Дата);
	ДанныеДляПечати.Вставить("ВидСчетаФактуры", 		РеквизитыСФ.ВидСчетаФактуры);
	ДанныеДляПечати.Вставить("Исправление", 	 		РеквизитыСФ.Исправление);
	ДанныеДляПечати.Вставить("НомерИсправления", 		РеквизитыСФ.НомерИсправления);
	ДанныеДляПечати.Вставить("ДоговорКонтрагента", 		РеквизитыСФ.ДоговорКонтрагента);
	ДанныеДляПечати.Вставить("СчетФактураБезНДС", 		РеквизитыСФ.СчетФактураБезНДС);
	ДанныеДляПечати.Вставить("КППКонтрагента", 	 		РеквизитыСФ.КППКонтрагента);
	ДанныеДляПечати.Вставить("ВидАгентскогоДоговора",   
	ОбщегоНазначения.ПолучитьЗначениеРеквизита(РеквизитыСФ.ДоговорКонтрагента, "ВидАгентскогоДоговора"));
	
	//{Лео Катанович
	// Определяем макет
	//Макет = ПолучитьОбщийМакет("СчетФактура1137");
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура1137";
    Если ДанныеДляПечати.ДатаСчетФактуры >= '20241001' Тогда	
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура534";
		Макет = ПолучитьОбщийМакет("СчетФактура1096");
    ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры >= '20210701' Тогда	
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура534";
		Макет = ПолучитьОбщийМакет("СчетФактура534");
    ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры < '20171001' Тогда
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура1137";
		Макет = ПолучитьОбщийМакет("СчетФактура1137");
	Иначе
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура981";
		Макет = ПолучитьОбщийМакет("СчетФактура981");
	КонецЕсли;
    //Лео Катанович}

	//АБС ВСТАВКА   16.07.2014 14:49:41  Балашенко
	СтруктураПодписи = абс_Дистрибуция.ЛеоПолучитьПодписьОтветственногоХардкод( , Ссылка);
	
	ДанныеДляПечати.ФИОРуководителя = СтруктураПодписи.РасшифровкаПодписи;
	ДанныеДляПечати.ФИОГлавногоБухгалтера = СтруктураПодписи.РасшифровкаПодписи;
	//АБС ВСТАВКА  КОНЕЦ
	
    //{Лео Катанович
	ДанныеДляПечати.Вставить("ИдентификаторГосКонтракта", 	 			РеквизитыСФ.ИдентификаторГосКонтракта);
    //Лео Катанович}
	УчетНДС.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
КонецПроцедуры

Процедура ПечатьКорректировочногоСчетаФактуры1137(Ссылка, ТабДокумент)
	
	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, 
	"Номер,Дата,
	|Исправление,НомерИсправления,
	|НомерИсправляемогоКорректировочногоДокумента,ДатаИсправляемогоКорректировочногоДокумента,
	|СчетФактураБезНДС, КППКонтрагента, ИдентификаторГосКонтракта"); //никитин
	
	ЗапросРеквизитовОснований = Новый Запрос();
	ЗапросРеквизитовОснований.Параметры.Вставить("Ссылка", Ссылка);
	ЗапросРеквизитовОснований.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента КАК НомерСчетаФактуры,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента КАК ДатаСчетаФактуры,
	|	СчетФактураВыданныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.НомерИсправленияИсходногоДокумента КАК НомерИсправления,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсправленияИсходногоДокумента КАК ДатаИсправления,
	|	МИНИМУМ(СчетФактураВыданныйДокументыОснования.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.НомерИсправленияИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.ДатаИсправленияИсходногоДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	КорректируемыеСчетаФактуры = ЗапросРеквизитовОснований.Выполнить().Выгрузить();
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, РеквизитыСФ.Дата);
	СведенияОПоставщике  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, РеквизитыСФ.Дата);
	
	СведенияОПодразделенииПокупателя = Неопределено;
	Если ТипЗнч(ДанныеДляПечати.Покупатель) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ДанныеДляПечати.Покупатель) Тогда
		РеквизитыПокупателя = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДанныеДляПечати.Покупатель, "ГоловнойКонтрагент, ОбособленноеПодразделение");
		Если РеквизитыПокупателя.ОбособленноеПодразделение И ЗначениеЗаполнено(РеквизитыПокупателя.ГоловнойКонтрагент) Тогда
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(РеквизитыПокупателя.ГоловнойКонтрагент, РеквизитыСФ.Дата);
			СведенияОПодразделенииПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, РеквизитыСФ.Дата);	
		КонецЕсли;
	КонецЕсли;
	
	// Определяем макет
	Если УчетНДС.ВерсияПостановленияНДС1137(РеквизитыСФ.Дата) > 1 Тогда
		Если  РеквизитыСФ.Дата >= '20241001' Тогда	
			Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура1096");
			ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировочныйСчетФактура534";
	     ИначеЕсли  РеквизитыСФ.Дата >= '20210701' Тогда	
			Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура534");
			ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировочныйСчетФактура534";
		ИначеЕсли РеквизитыСФ.Дата < '20171001' Тогда
			Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура952");
			Если ДанныеДляПечати.Покупатель.ИНН = "7704218694" Тогда
				Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура952_метро");
					ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_КорректировочныйСчетФактура1137";

			КонецЕсли;	
		Иначе
			Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура981");
				ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_КорректировочныйСчетФактура1137";

		КонецЕсли;
	Иначе
		
		Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура1137");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировочныйСчетФактура11371";

		Если ДанныеДляПечати.Покупатель.ИНН = "7704218694" Тогда  
			Если РеквизитыСФ.Дата >= '20241001' Тогда 
				Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура1096_метро");

			Иначе
				Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура1137_метро");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
   	 ПечатьСФ_Постановление534 =  ?(РеквизитыСФ.Дата  >= '20210701', Истина, Ложь); 

	
	Если ДанныеДляПечати.Покупатель.ИНН = "7704218694" Тогда
		ДанныеДляПечати.Вставить("НомерЗаказаМетро", Ссылка.ДокументОснование.ДокументРеализации.Сделка.НомерПоДаннымПокупателя);
		Отбор = Новый Структура;
		Отбор.Вставить("Объект", ссылка.Контрагент);
		Отбор.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.абс_КодПоставщика);
		Структура = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор);
		ДанныеДляПечати.Вставить("НомерПоставщикаМетро", СокрЛП(Структура.Значение));		
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",ссылка.ДокументОснование.Грузополучатель);
		Отбор.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина);
		Структура = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор);
		ДанныеДляПечати.Вставить("НомерМагазинаМетро", СокрЛП(Структура.Значение));
		ДанныеДляПечати.Вставить("GLNМагазинаМетро", СокрЛП(ссылка.ДокументОснование.Грузополучатель.абс_GLN));	
		ДанныеДляПечати.Вставить("НомерПриемкиТовара", ссылка.ДокументОснование.ИсправляемыйДокументРеализации.абс_НомерУведомленияОПриемке);
		//+Лео Сафонов ЕА 
		ДанныеДляПечати.Вставить("ПредставлениеГрузополучателя", ссылка.ДокументОснование.Грузополучатель.НаименованиеПолное);
		СведенияОГрузоотправителе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(?(ссылка.ДокументОснование.Грузоотправитель = "он же", Неопределено, ссылка.ДокументОснование.Грузоотправитель), Ссылка.Дата);
		ПредставлениеГрузоотправителя =  ?(НЕ ЗначениеЗаполнено(ссылка.ДокументОснование.Грузоотправитель), "--", ?(ссылка.ДокументОснование.Грузоотправитель = "он же", ссылка.ДокументОснование.Грузоотправитель, ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование,ФактическийАдрес,")));
		ДанныеДляПечати.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);
		//-Лео Сафонов ЕА
	КонецЕсли;
//{Катанович Метка1 Шапка
	 Если РеквизитыСФ.Дата < '20171001' Тогда
		 
		 Если РеквизитыСФ.Дата  >='20170701' Тогда
			 ОбластьМакета = Макет.ПолучитьОбласть("ШапкаИнформация1137_625"); 
		 Иначе
			 ОбластьМакета = Макет.ПолучитьОбласть("ШапкаИнформация1137"); 
		 КонеЦесли;
		 ТабДокумент.Вывести(ОбластьМакета);
		 
	 КонецЕсли;
	 //Катанович}
	

	// ///Никитин  28.06.2017
	//Если ДанныеДляПечати.ДатаСчетФактуры  >='20170701' Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта"); 
	//	ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения): %1'");
	//	ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	ШаблонЗаголовкаГосконтракт, ДанныеДляПечати.ИдентификаторГосКонтракта);
	//	ТабДокумент.Вывести(ОбластьМакета);
	//КонеЦесли;

	
	
	
	
	// Выводим шапку
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	
	Если РеквизитыСФ.Исправление Тогда
		ОбластьМакета.Параметры.Номер = РеквизитыСФ.НомерИсправляемогоКорректировочногоДокумента;
		ОбластьМакета.Параметры.Дата  = Формат(РеквизитыСФ.ДатаИсправляемогоКорректировочногоДокумента, "ДФ='дд ММММ гггг'") + " г.";
	Иначе
		ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка);
		ОбластьМакета.Параметры.Дата  = Формат(РеквизитыСФ.Дата, "ДФ='дд ММММ гггг'") + " г.";
	КонецЕсли;
	
	РеквизитыОснований = "";
	Для Каждого РеквизитыСчетаФактуры Из КорректируемыеСчетаФактуры Цикл
		Если НЕ РеквизитыСчетаФактуры.УчитыватьИсправлениеИсходногоДокумента 
			ИЛИ РеквизитыСчетаФактуры.НомерИсправления = 0 Тогда
			НомерИсправленияСчетаФактуры = "--";
		Иначе
			НомерИсправленияСчетаФактуры = Формат(РеквизитыСчетаФактуры.НомерИсправления, "ЧЦ=3; ЧГ=0");
		КонецЕсли;
		РеквизитыОснований = РеквизитыОснований + ?(РеквизитыОснований = "", "", ", ") 
		+ "№ "+РеквизитыСчетаФактуры.НомерСчетаФактуры+" от "+Формат(РеквизитыСчетаФактуры.ДатаСчетаФактуры,"ДЛФ=ДД; ДП=--")+", с учетом исправления № "
		+НомерИсправленияСчетаФактуры+" от "+Формат(РеквизитыСчетаФактуры.ДатаИсправления, "ДЛФ=ДД; ДП=--");
		
	КонецЦикла;
	
	ОбластьМакета.Параметры.РеквизитыОснований = РеквизитыОснований;
	
	Если РеквизитыСФ.НомерИсправления = 0 
		ИЛИ НЕ РеквизитыСФ.Исправление Тогда
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = "--";
	Иначе
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = РеквизитыСФ.НомерИсправления;
	КонецЕсли;
	Если НЕ РеквизитыСФ.Исправление Тогда
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = "--";
	Иначе
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = Формат(РеквизитыСФ.Дата, "ДФ='дд ММММ гггг'") + " г.";
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаименованиеПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПоставщике,  "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПоставщике,  "ЮридическийАдрес,");
	
	ОбластьМакета.Параметры.НаименованиеПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПокупателе, "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПокупателе, "ЮридическийАдрес,");
	
	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППродавца = ""
	+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
	
	
	// +Лео Сафонов ЕА

	//Если ЗначениеЗаполнено(РеквизитыСФ.КППКонтрагента) Тогда
	//	КПП = РеквизитыСФ.КППКонтрагента;
	//ИначеЕсли СведенияОПодразделенииПокупателя <> Неопределено Тогда
	//	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПодразделенииПокупателя, "КПП,", Ложь);
	//Иначе
	//	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	//КонецЕсли;	
	//
	//Если ЗначениеЗаполнено(КПП) Тогда
	//	КПП = "/" + КПП;
	//КонецЕсли;
	//ОбластьМакета.Параметры.ИННКПППокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	//СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	
	
	Если ДанныеДляПечати.Покупатель.ИНН = "7704218694" Тогда
		
		Если ЗначениеЗаполнено(ссылка.ДокументОснование.Грузополучатель) Тогда
			КПП = "/" + ссылка.ДокументОснование.Грузополучатель.КПП;
			ОбластьМакета.Параметры.ИННКПППокупателя = ссылка.ДокументОснование.Грузополучатель.ИНН + КПП;
		КонецЕсли;
	Иначе		
		Если ЗначениеЗаполнено(РеквизитыСФ.КППКонтрагента) Тогда
			КПП = РеквизитыСФ.КППКонтрагента;
		ИначеЕсли СведенияОПодразделенииПокупателя <> Неопределено Тогда
			КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПодразделенииПокупателя, "КПП,", Ложь);
		Иначе
			КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННКПППокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	КонецЕсли;
	// -Лео Сафонов ЕА
	
	ОбластьМакета.Параметры.Валюта = ?(ЗначениеЗаполнено(ДанныеДляПечати.Валюта), 
	"Валюта: наименование, код " + ДанныеДляПечати.Валюта.НаименованиеПолное + ", " + ДанныеДляПечати.Валюта.Код, 
	"Валюта: наименование, код");
	
	Если ДанныеДляПечати.Покупатель.ИНН = "7704218694" Тогда
		ОбластьМакета.Параметры.НомерПоставщикаМетро = ДанныеДляПечати.НомерПоставщикаМетро;		
		ОбластьМакета.Параметры.НомерМагазинаМетро = ДанныеДляПечати.НомерМагазинаМетро;    		
		ОбластьМакета.Параметры.НомерЗаказаМетро = ДанныеДляПечати.НомерЗаказаМетро;
		ОбластьМакета.Параметры.НомерПриемкиТовара = ДанныеДляПечати.НомерПриемкиТовара;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ДанныеДляПечати.ПредставлениеГрузополучателя;
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ДанныеДляПечати.ПредставлениеГрузоотправителя;
	КонецЕсли;	
	
	ТабДокумент.Вывести(ОбластьМакета);
		///Никитин  28.06.2017
	Если  РеквизитыСФ.Дата  >='20170701'  Тогда
		ИГК=Ссылка.ИдентификаторГосКонтракта;
		Если ПустаяСтрока(Ссылка.ИдентификаторГосКонтракта) Тогда
		     ИГК="--";	
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта"); 
		//{Катанович  Метка 2 Госконтракт
		   Если  РеквизитыСФ.Дата  >='20171001' Тогда
			    ШаблонЗаголовкаГосконтракт = ?(ПечатьСФ_Постановление534,"",НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'"));
			Иначе
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения): %1'");
			КонецЕсли;
		//Катанович}	
		
		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовкаГосконтракт, ИГК);
		ТабДокумент.Вывести(ОбластьМакета);
    КонеЦесли;


	
	
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	КоличествоСтрок = ДанныеДляПечати.ТабличнаяЧасть.Количество();
	НомерСтроки = 0;
	
	Для каждого СтрокаТабличнойЧасти Из ДанныеДляПечати.ТабличнаяЧасть Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
		
		
		//+Лео Сафонов ЕА
		Если ДанныеДляПечати.Покупатель.ИНН = "7704218694" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства
				|ИЗ
				|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
				|ГДЕ
				|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Свойство = &Свойство
				|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент = &Контрагент
				|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура = &Номенклатура";

			Запрос.УстановитьПараметр("Контрагент", ДанныеДляПечати.Покупатель);
			Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
			Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя);

			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			ОбластьМакета.Параметры.АртикулКонтрагента = ВыборкаДетальныеЗаписи.ЗначениеСвойства;
		КонецЕсли;
		//-Лео Сафонов ЕА

		// {Лео Катанович // 27.05.2016 (По заявке Глуховой С. Возврат стандартного вывода на печать)
		////<< Горбунов согласно письму Барковой, откорректировал отображение номенклатуры, а не серий в сч-фак корр.
		//// есть одна недоработка: если в корректирующей реализации используются различные серии одной номенклатуры, то группировки не произойдет.
		//СтруктураОтбора = Новый Структура;
		//СтруктураОтбора.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		//ТЗ = Ссылка.ДокументОснование.ДокументРеализации.Товары.Выгрузить(СтруктураОтбора, "Номенклатура, Количество, Сумма, СуммаНДС");
		//ТЗ.Свернуть("Номенклатура", "Количество, Сумма, СуммаНДС");
		////+Лео Сафонов Правка кода: Если корректируется из 0 в большую сторону то возникает ошибка. т.к. в реализации нет новой позиции
		//////коррекция табличной части макета
		////СтавкаНДС = Число(СтрЗаменить(СтрокаТабличнойЧасти.СтавкаНДС, "%",""))/100;
		////Если СтрокаТабличнойЧасти.КоличествоДоИзменения > СтрокаТабличнойЧасти.КоличествоПослеИзменения Тогда
		////	ИзмененноеКоличество = СтрокаТабличнойЧасти.КоличествоПослеИзменения - СтрокаТабличнойЧасти.КоличествоДоИзменения;//выдает отрицательное число, если уменьшилось количество
		////Иначе
		////	ИзмененноеКоличество = СтрокаТабличнойЧасти.КоличествоПослеИзменения - СтрокаТабличнойЧасти.КоличествоДоИзменения;
		////КонецЕсли;
		////СуммаНДСПослеИзм = (ТЗ[0].Количество + ИзмененноеКоличество)*СтрокаТабличнойЧасти.ЦенаПослеИзменения*СтавкаНДС;
		////
		////ОбластьМакета.Параметры.КоличествоДоИзменения = ТЗ[0].Количество;//кол-во до изменения.		
		////ОбластьМакета.Параметры.КоличествоПослеИзменения = ТЗ[0].Количество + ИзмененноеКоличество;//кол-во после изменения.
		////
		////ОбластьМакета.Параметры.СтоимостьБезНДСДоИзменения = ТЗ[0].Сумма;//сумма до изменения без НСД
		////ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = ТЗ[0].Сумма + ИзмененноеКоличество*СтрокаТабличнойЧасти.ЦенаПослеИзменения;
		////
		////ОбластьМакета.Параметры.СуммаНДСДоИзменения = ТЗ[0].СуммаНДС;
		////ОбластьМакета.Параметры.СуммаНДСПослеИзменения = СуммаНДСПослеИзм;
		////
		////ОбластьМакета.Параметры.СтоимостьСНДСДоИзменения = ТЗ[0].Количество*СтрокаТабличнойЧасти.ЦенаДоИзменения + ТЗ[0].СуммаНДС;
		////ОбластьМакета.Параметры.СтоимостьСНДСПослеИзменения = (ТЗ[0].Количество + ИзмененноеКоличество)*СтрокаТабличнойЧасти.ЦенаПослеИзменения + СуммаНДСПослеИзм;
		//
		////коррекция табличной части макета
		//Если ТЗ.Количество()> 0 Тогда
		//	СтавкаНДС = Число(СтрЗаменить(СтрокаТабличнойЧасти.СтавкаНДС, "%",""))/100;
		//	Если СтрокаТабличнойЧасти.КоличествоДоИзменения > СтрокаТабличнойЧасти.КоличествоПослеИзменения Тогда
		//		ИзмененноеКоличество = СтрокаТабличнойЧасти.КоличествоПослеИзменения - СтрокаТабличнойЧасти.КоличествоДоИзменения;//выдает отрицательное число, если уменьшилось количество
		//	Иначе
		//		ИзмененноеКоличество = СтрокаТабличнойЧасти.КоличествоПослеИзменения - СтрокаТабличнойЧасти.КоличествоДоИзменения;
		//	КонецЕсли;
		//	СуммаНДСПослеИзм = (ТЗ[0].Количество + ИзмененноеКоличество)*СтрокаТабличнойЧасти.ЦенаПослеИзменения*СтавкаНДС;
		//	
		//	ОбластьМакета.Параметры.КоличествоДоИзменения = ТЗ[0].Количество;//кол-во до изменения.		
		//	ОбластьМакета.Параметры.КоличествоПослеИзменения = ТЗ[0].Количество + ИзмененноеКоличество;//кол-во после изменения.
		//	
		//	ОбластьМакета.Параметры.СтоимостьБезНДСДоИзменения = ТЗ[0].Сумма;//сумма до изменения без НСД
		//	ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = ТЗ[0].Сумма + ИзмененноеКоличество*СтрокаТабличнойЧасти.ЦенаПослеИзменения;
		//	
		//	ОбластьМакета.Параметры.СуммаНДСДоИзменения = ТЗ[0].СуммаНДС;
		//	ОбластьМакета.Параметры.СуммаНДСПослеИзменения = СуммаНДСПослеИзм;
		//	
		//	ОбластьМакета.Параметры.СтоимостьСНДСДоИзменения = ТЗ[0].Количество*СтрокаТабличнойЧасти.ЦенаДоИзменения + ТЗ[0].СуммаНДС;
		//	ОбластьМакета.Параметры.СтоимостьСНДСПослеИзменения = (ТЗ[0].Количество + ИзмененноеКоличество)*СтрокаТабличнойЧасти.ЦенаПослеИзменения + СуммаНДСПослеИзм;
		//Иначе
		//	СтавкаНДС = Число(СтрЗаменить(СтрокаТабличнойЧасти.СтавкаНДС, "%",""))/100;
		//	Если СтрокаТабличнойЧасти.КоличествоДоИзменения > СтрокаТабличнойЧасти.КоличествоПослеИзменения Тогда
		//		ИзмененноеКоличество = СтрокаТабличнойЧасти.КоличествоПослеИзменения - СтрокаТабличнойЧасти.КоличествоДоИзменения;//выдает отрицательное число, если уменьшилось количество
		//	Иначе
		//		ИзмененноеКоличество = СтрокаТабличнойЧасти.КоличествоПослеИзменения - СтрокаТабличнойЧасти.КоличествоДоИзменения;
		//	КонецЕсли;
		//	СуммаНДСПослеИзм = ИзмененноеКоличество*СтрокаТабличнойЧасти.ЦенаПослеИзменения*СтавкаНДС;
		//	
		//	ОбластьМакета.Параметры.КоличествоПослеИзменения =  ИзмененноеКоличество;//кол-во после изменения.
		//	ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = ИзмененноеКоличество*СтрокаТабличнойЧасти.ЦенаПослеИзменения;
		//	ОбластьМакета.Параметры.СуммаНДСПослеИзменения = СуммаНДСПослеИзм;
		//	ОбластьМакета.Параметры.СтоимостьСНДСПослеИзменения = ИзмененноеКоличество*СтрокаТабличнойЧасти.ЦенаПослеИзменения + СуммаНДСПослеИзм;
		//КонецЕсли;
		////>> Горбунов
		// Лео Катанович}
		
		// {Лео Катанович   ТН ВЭД
		
		//Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеТовара) Тогда
		//	ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.НаименованиеТовара;               
		//Иначе
		//	ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.Номенклатура;               
		//КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеТовара) Тогда
		//	НаименованиеНоменклатуры = СтрокаТабличнойЧасти.НаименованиеТовара; 
		//Иначе
		//	НаименованиеНоменклатуры = СтрокаТабличнойЧасти.Номенклатура;  
		//КонецЕсли;
		//
		//Если РеквизитыСФ.Дата >= Дата('20160701') Тогда
		//	 Если  СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС0
		//			   И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД) Тогда
		//			 НаименованиеНоменклатуры = НаименованиеНоменклатуры + ", код ТН ВЭД " + СокрЛП(СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД.Код);
		//	 КонецЕсли;
		// КонецЕсли;	
		//ОбластьМакета.Параметры.НаименованиеНоменклатуры = НаименованиеНоменклатуры;

		 //{Катанович  Метка 3 Код вида товара
		ОбластьМакета.Параметры.НаименованиеНоменклатуры = СокрЛП(СтрокаТабличнойЧасти.Номенклатура.НаименованиеПолное) + " (" + СтрокаТабличнойЧасти.Серия + ")";
		Если РеквизитыСФ.Дата >= Дата('20171001') Тогда
             Если  СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС0
					   И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД) Тогда
        		       ОбластьМакета.Параметры.ТоварКодТНВЭД = СокрЛП(СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД.Код);
			 Иначе
			           ОбластьМакета.Параметры.ТоварКодТНВЭД = "--";
			 КонецЕсли;
	
		ИначеЕсли РеквизитыСФ.Дата >= Дата('20160701') Тогда
			 Если  СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС0
					   И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД) Тогда
        		     ОбластьМакета.Параметры.НаименованиеНоменклатуры = СокрЛП(СтрокаТабличнойЧасти.Номенклатура.НаименованиеПолное) + ", код ТН ВЭД " + СокрЛП(СтрокаТабличнойЧасти.Номенклатура.КодТНВЭД.Код);
			 КонецЕсли;
		 КонецЕсли;	
		//Катанович}  
		// Лео Катанович}
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КоличествоДоИзменения) Тогда
			ОбластьМакета.Параметры.КоличествоДоИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КоличествоПослеИзменения) Тогда
			ОбластьМакета.Параметры.КоличествоПослеИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЦенаДоИзменения) Тогда
			ОбластьМакета.Параметры.ЦенаДоИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЦенаПослеИзменения) Тогда
			ОбластьМакета.Параметры.ЦенаПослеИзменения = "--";
		КонецЕсли;	
		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
			ОбластьМакета.Параметры.СуммаНДСДоИзменения = "без НДС";
			ОбластьМакета.Параметры.СуммаНДСПослеИзменения = "без НДС";
			ОбластьМакета.Параметры.РазницаНДСУвеличение = "--";
			ОбластьМакета.Параметры.РазницаНДСУменьшение = "--";
		КонецЕсли;
		
		// Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		
		Если НомерСтроки = КоличествоСтрок Тогда
			// Если последняя строка, то должен поместится итог и подвал
			СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
		КонецЕсли;
		
		Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		
		ОбластьМакета.Параметры.СтавкаНДС = СтрокаТабличнойЧасти.СтавкаНДС;
		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
			ОбластьМакета.Параметры.СуммаНДС  = "без НДС";
		Иначе
			СчетФактураБезНДС = Ложь;
		КонецЕсли;
 		
		
		//Если РеквизитыСФ.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАванс Тогда
			ОбластьМакета.Параметры.Акциз = "без акциза";
		//КонецЕсли;	
		
		//Если Строка(СтрокаТабличнойЧасти.ПредставлениеСтраны) = "Россия" 
		//	ИЛИ Строка(СтрокаТабличнойЧасти.ПредставлениеСтраны) = "Российская Федерация"
		//	ИЛИ СтрокаТабличнойЧасти.СтранаПроисхождения = Справочники.КлассификаторСтранМира.РОССИЯ Тогда			
		//	ОбластьМакета.Параметры.ПредставлениеСтраны    = "";
		//	ОбластьМакета.Параметры.СтранаПроисхожденияКод = "";
		//КонецЕсли; 
	
		//// Проставляем прочерки в незаполненные графы в соответствии с Постановлением
		//Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс Тогда
		//	
		//	ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
		//	ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		//	
		//	ОбластьМакета.Параметры.Количество = "--";
		//	ОбластьМакета.Параметры.Цена       = "--";
		//	ОбластьМакета.Параметры.Стоимость  = "--";
		//	ОбластьМакета.Параметры.Акциз      = "--";
		//	
		//	ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
		//	ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
		//	ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		//	
		//Иначе
		//	
		//										
		//КонецЕсли;

		
		
		
		
		
		// ++ Жигалев - 20220818  
		ОбластьМакета.Параметры.СтрокаДо 			= "А (до изменения)";
		ОбластьМакета.Параметры.СтрокаПосле 		= "Б (после изменения)";
		ОбластьМакета.Параметры.СтрокаУвеличение 	= "В (увеличение)";
		ОбластьМакета.Параметры.СтрокаУменьшение 	= "Г (уменьшение)";
		
		мПоиска = Ссылка.ДокументОснование.Товары.НайтиСтроки(Новый Структура("Номенклатура,КоличествоДоИзменения,Количество",СтрокаТабличнойЧасти.Номенклатура,
		СтрокаТабличнойЧасти.КоличествоДоИзменения,СтрокаТабличнойЧасти.КоличествоПослеИзменения));
		Если мПоиска.Количество() > 0 тогда
		ОбластьМакета.Параметры.НомерСтроки = мПоиска[0].НомерСтроки;	
		КонецЕсли;
		// -- Жигалев - 20220818
		
		
		
		
		
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;	
	
	
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУменьшение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУвеличение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУвеличение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУменьшение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУвеличение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУвеличение");
	Если РеквизитыСФ.СчетФактураБезНДС Тогда
		ОбластьМакетаИтого.Параметры.РазницаНДСУменьшение = "без НДС";
		ОбластьМакетаИтого.Параметры.РазницаНДСУвеличение = "без НДС";
	Иначе
		ОбластьМакетаИтого.Параметры.РазницаНДСУменьшение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУменьшение");
		ОбластьМакетаИтого.Параметры.РазницаНДСУвеличение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУвеличение");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакетаИтого);
	
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);	
	ОбластьМакетаПодвал.Параметры.Свидетельство = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,");
	
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);
	
	//АБС ВСТАВКА   16.07.2014 14:49:41  Балашенко
	СтруктураПодписи = абс_Дистрибуция.ЛеоПолучитьПодписьОтветственногоХардкод( , Ссылка);
	
	ОбластьМакетаПодвал.Параметры.ФИОРуководителя = СтруктураПодписи.РасшифровкаПодписи;
	ОбластьМакетаПодвал.Параметры.ФИОГлавногоБухгалтера = СтруктураПодписи.РасшифровкаПодписи;
	//АБС ВСТАВКА  КОНЕЦ
	
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	

	
КонецПроцедуры

Процедура ПечатьСчетаФактуры914(Ссылка, ТабДокумент)
	
	Если Ссылка.Дата < '20040216' Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура575");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура575";
	ИначеЕсли Ссылка.Дата < '20060530' Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура84");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура84";
	ИначеЕсли Ссылка.Дата < '20090609' Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура283");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура283";
	Иначе
		Макет = ПолучитьОбщийМакет("СчетФактура451");
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура451";
	КонецЕсли;
	
	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, Ссылка.Дата);
	СведенияОПоставщике  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, Ссылка.Дата);
	СведенияОГрузоотправителе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(
	?(ДанныеДляПечати.Грузоотправитель = "он же", Неопределено, ДанныеДляПечати.Грузоотправитель), Ссылка.Дата);
	СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Грузополучатель, Ссылка.Дата);
	
	Если ДанныеДляПечати.Свойство("АдресДоставки") 
		И Не ПустаяСтрока(ДанныеДляПечати.АдресДоставки) Тогда
		ПредставлениеГрузополучателя = ?(Не ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), 
		ДанныеДляПечати.АдресДоставки,
		ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование") 
		+ ", " + ДанныеДляПечати.АдресДоставки);
		
	Иначе
		ПредставлениеГрузополучателя = ?(Не ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель), 
		"",
		ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОГрузополучателе, "ПолноеНаименование, ФактическийАдрес,"));
	КонецЕсли;
	
	ВыборкаПоТоварам = ДанныеДляПечати.ТабличнаяЧасть.Скопировать();
	
	Если ВыборкаПоТоварам.Количество() > 0 Тогда
		ТолькоУслуги = Истина;
		Для Каждого СтрокаТовар Из ВыборкаПоТоварам Цикл
			Если (ТипЗнч(СтрокаТовар.Товар) = Тип("СправочникСсылка.Номенклатура")
				И Не СтрокаТовар.Товар.Услуга)
				ИЛИ ТипЗнч(СтрокаТовар.Товар) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				ТолькоУслуги = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТолькоУслуги = Ложь;
	КонецЕсли;
	
	ЗаголовокДляПечати = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДанныеДляПечати, "Счет-фактура") + " г.";
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	ОбластьМакета.Параметры.Номер = ЗаголовокДляПечати;
	
	ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре = глЗначениеПеременной("ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре");
	Если ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре <> '00010101'
		И ДатаНачалаУказанияСокращенногоНаименованияПродавцаВСчетеФактуре <= Ссылка.Дата 
		И Не Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " 
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,") 
		+ " (" + ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеСокращенное,") + ")";
	Иначе
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " 
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;
	
	ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " 
	+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,");
	
	Строка_ПоДокументу = "";
	Для Каждого ПараметрыДокументаОплаты Из ДанныеДляПечати.ТаблицаДатОплат Цикл
		Строка_ПоДокументу = Строка_ПоДокументу 
		+ ?(ПустаяСтрока(Строка_ПоДокументу), "К платежно-расчетному документу № ",", ")
		+ ПараметрыДокументаОплаты.НомерПлатежноРасчетногоДокумента 
		+ " от " + Формат(ПараметрыДокументаОплаты.ДатаПлатежноРасчетногоДокумента, "ДФ=dd.MM.yyyy");
	КонецЦикла; 
	Если ПустаяСтрока(Строка_ПоДокументу) Тогда
		Строка_ПоДокументу = "К платежно-расчетному документу № -- от --"
	КонецЕсли; 
	ОбластьМакета.Параметры.ПоДокументу = Строка_ПоДокументу;
	
	ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " 
	+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " 
	+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
	
	Если ТолькоУслуги Тогда
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + "--";
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: "  + "--";
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " 
		+ ?(НЕ ЗначениеЗаполнено(ДанныеДляПечати.Грузоотправитель), 
		"", 
		?(ДанныеДляПечати.Грузоотправитель = "он же", 
		ДанныеДляПечати.Грузоотправитель, 
		ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
		СведенияОГрузоотправителе,  "ПолноеНаименование,ФактическийАдрес,")));
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: " + ПредставлениеГрузополучателя;
	КонецЕсли;
	
	Если Ссылка.Дата < '20040216' Тогда
		ОбластьМакета.Параметры.ИННпоставщика = "Идентификационный номер продавца (ИНН): "
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике,  "ИНН,", Ложь); 
		ОбластьМакета.Параметры.ИННПокупателя = "Идентификационный номер покупателя (ИНН): " 
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь);
	Иначе
		КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННпоставщика = "ИНН/КПП продавца: "
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
		
		Если не ТолькоУслуги 
			и ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель) 
			и не ДанныеДляПечати.Грузополучатель = ДанныеДляПечати.Покупатель
			и ДанныеДляПечати.Грузополучатель.ГоловнойКонтрагент = ДанныеДляПечати.Покупатель
			Тогда
			КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "КПП,", Ложь);
			Если не ЗначениеЗаполнено(КПП) Тогда
				КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
			КонецЕсли;
		Иначе
			КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: "
		+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	КонецЕсли;
	
	ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывод заголовка таблицы
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьМакетаЗаголовокТаблицы.Параметры.Заполнить(ДанныеДляПечати);
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
	
	// Вывод строк таблицы
	ОбластьМакета 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого 	= Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ИтогоСуммаНДС = 0;
	ИтогоВсего    = 0;
	
	ВыборкаСтрокТовары = ДанныеДляПечати.ТабличнаяЧасть;
	ВыборкаСтрокТовары.Колонки.Добавить("СуммаБезНДС");
	ВыборкаСтрокТовары.Колонки.Добавить("СуммаСНДС");
	
	Для Каждого Строчка Из ВыборкаСтрокТовары Цикл
		
		Строчка.СуммаСНДС = Строчка.Сумма + ?(Строчка.СуммаВключаетНДС, 0, Строчка.СуммаНДС);
		Строчка.СуммаБезНДС = Строчка.СуммаСНДС - Строчка.СуммаНДС;
		
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию И 
			(Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
			ИЛИ Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
			ИЛИ Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110
			ИЛИ Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105
			ИЛИ Строчка.СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107) Тогда
			Если (НЕ Строчка.СуммаВключаетНДС) ИЛИ Строчка.Цена = 0 Тогда
				Строчка.Цена = Окр(Строчка.СуммаСНДС / Строчка.Количество, 2);
			КонецЕсли;
		Иначе
			Если Строчка.СуммаВключаетНДС Тогда
				Строчка.Цена = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если Строчка.Цена = 0 Тогда
			Строчка.Цена = ?(Строчка.Количество = 0, 0, Строчка.СуммаБезНДС / Строчка.Количество);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаСтрокТовары.Свернуть("Товар, ТоварНаименование, СтранаПроисхождения, ПредставлениеСтраны,
	|НомерГТД, ПредставлениеГТД, ЕдиницаИзмерения, Цена, СтавкаНДС", 
	"Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаБезНДС");
	
	НомерСтроки     = 0;
	КоличествоСтрок = ВыборкаСтрокТовары.Количество();
	
	Для Каждого Строчка Из ВыборкаСтрокТовары Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(Строчка);
		
		Если Не ЗначениеЗаполнено(Строчка.ТоварНаименование) Тогда
			ОбластьМакета.Параметры.ТоварНаименование = Строчка.Товар;
		КонецЕсли;
		ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(ОбластьМакета.Параметры.ТоварНаименование);
		
		Если Строка(Строчка.ПредставлениеСтраны) = "Россия" 
			Или Строка(Строчка.ПредставлениеСтраны) = "Российская Федерация"
			Или Строчка.СтранаПроисхождения = Справочники.КлассификаторСтранМира.РОССИЯ Тогда			
			ОбластьМакета.Параметры.ПредставлениеСтраны  = "--";
		КонецЕсли; 
		
		ОчищатьКоличество = Неопределено;
		ОчищатьКоличество = ?(ДанныеДляПечати.Свойство("ОчищатьКоличество", ОчищатьКоличество), 
		ОчищатьКоличество, Истина);
		
		Если ОчищатьКоличество И ТипЗнч(ОбластьМакета.Параметры.Товар) <> Тип("СправочникСсылка.ОсновныеСредства") 
			И (ОбластьМакета.Параметры.ЕдиницаИзмерения = "--" 
			Или Не ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмерения)) Тогда
			Строчка.Количество = 0;
		КонецЕсли;
		
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс 
			ИЛИ Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
			Или Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу 
			Или Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент
			Тогда
			Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
				ОбластьМакета.Параметры.Стоимость  = Строчка.СуммаБезНДС;
			Иначе
				// В счетах-фактурах на аванс колонка 5 не выводится
				ОбластьМакета.Параметры.Стоимость  = 0;
			КонецЕсли;
			ОбластьМакета.Параметры.Количество = 0;
			ОбластьМакета.Параметры.Цена       = 0;
		Иначе
			ОбластьМакета.Параметры.Стоимость  = Строчка.СуммаБезНДС;
			ОбластьМакета.Параметры.Цена   = Строчка.Цена;
		КонецЕсли;	
		
		ОбластьМакета.Параметры.Всего      = Строчка.СуммаСНДС;
		ОбластьМакета.Параметры.СтавкаНДС  = Строчка.СтавкаНДС;
		
		ИтогоСуммаНДС = ИтогоСуммаНДС + Строчка.СуммаНДС;
		ИтогоВсего    = ИтогоВсего    + Строчка.СуммаСНДС;
		
		ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
		
		// Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		Если НомерСтроки = КоличествоСтрок Тогда
			// Если последняя строка, то должен поместится итог и подвал
			СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
		КонецЕсли;
		
		Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Если ВыборкаСтрокТовары.Количество()>0 Тогда
		ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ВместеСоСледующим = Истина;
	КонецЕсли; 
	
	// Вывод строки Итого
	ОбластьМакетаИтого.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
	ОбластьМакетаИтого.Параметры.ИтогоВсего    = ИтогоВСего;
	
	ПроставитьПрочеркиВПустыеПоля(ОбластьМакетаИтого);
	ТабДокумент.Вывести(ОбластьМакетаИтого);
	
	// Вывод подвала
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);
	Если не Ссылка.Дата < '20040216' Тогда
		Если Ссылка.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
			ОбластьМакетаПодвал.Параметры.Свидетельство = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
			СведенияОПокупателе, "Свидетельство,");
		Иначе
			ОбластьМакетаПодвал.Параметры.Свидетельство = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
			СведенияОПоставщике, "Свидетельство,");
		КонецЕсли;
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
КонецПроцедуры

Процедура ПечатьКорректировочногоСчетаФактуры(Ссылка, ТабДокумент)
	
	Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура");
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_КорректировочныйСчетФактура";
	
	ДанныеДляПечати = Неопределено;
	УчетнаяПолитика = Неопределено;
	
	УчетНДС.СобратьДанныеДляПечатиСчетФактурыВыданного(Ссылка, ДанныеДляПечати, УчетнаяПолитика);
	
	Если ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат;
	ИначеЕсли ДанныеДляПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Номер,
	|	СчетФактураВыданный.Дата,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.НомерИсходногоДокумента, """") КАК НомерИсходногоДокумента,
	|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.ДатаИсходногоДокумента, """") КАК ДатаИсходногоДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО СчетФактураВыданный.Ссылка = СчетФактураВыданныйДокументыОснования.Ссылка
	|			И (СчетФактураВыданныйДокументыОснования.НомерСтроки = 1)
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	РеквизитыСФ = Новый Структура("Номер,Дата,НомерИсходногоДокумента,ДатаИсходногоДокумента");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСФ, Выборка);
	КонецЕсли;
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, РеквизитыСФ.Дата);
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, РеквизитыСФ.Дата);
	
	// Выводим шапку
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	
	ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка);
	ОбластьМакета.Параметры.Дата  = Формат(РеквизитыСФ.Дата, "ДФ='дд ММММ гггг'") + " г.";
	
	ОбластьМакета.Параметры.НомерСчетаФактуры = РеквизитыСФ.НомерИсходногоДокумента;
	ОбластьМакета.Параметры.ДатаСчетаФактуры  = Формат(РеквизитыСФ.ДатаИсходногоДокумента, "ДФ='дд ММММ гггг'") + " г.";
	
	ОбластьМакета.Параметры.НаименованиеПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПоставщике,  "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПродавца = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПоставщике,  "ЮридическийАдрес,");
	
	ОбластьМакета.Параметры.НаименованиеПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПокупателе, "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПокупателе, "ЮридическийАдрес,");
	
	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППродавца = ""
	+ ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
	
	КПП = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННКПППокупателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(
	СведенияОПокупателе, "ИНН,", Ложь) + КПП;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывод заголовка таблицы
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
	
	// Вывод строк таблицы
	ОбластьМакета 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого 	= Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	НомерСтроки     = 0;
	КоличествоСтрок = ДанныеДляПечати.ТабличнаяЧасть.Количество();
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеДляПечати.ТабличнаяЧасть Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеТовара) Тогда
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.НаименованиеТовара;               
		Иначе
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.Номенклатура;               
		КонецЕсли;	
		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "Без налога (НДС)";
		КонецЕсли;
		
		// Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		Если НомерСтроки = КоличествоСтрок Тогда
			// Если последняя строка, то должен поместится итог и подвал
			СтрокаСПодвалом.Добавить(ОбластьМакетаИтого);
			СтрокаСПодвалом.Добавить(ОбластьМакетаПодвал);
		КонецЕсли;
		
		Если НЕ ФормированиеПечатныхФормСервер.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;	
	
	// Вывод строки Итого
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУменьшение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаБезНДСУвеличение = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаБезНДСУвеличение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУменьшение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаСНДСУвеличение   = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаСНДСУвеличение");
	ОбластьМакетаИтого.Параметры.РазницаНДСУменьшение    = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУменьшение");
	ОбластьМакетаИтого.Параметры.РазницаНДСУвеличение    = ДанныеДляПечати.ТабличнаяЧасть.Итог("РазницаНДСУвеличение");
	
	ТабДокумент.Вывести(ОбластьМакетаИтого);
	
	//Вывод подвала
	ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДляПечати);
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
КонецПроцедуры

Функция ПечатьУниверсальныхПередаточныхДокументов(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Устанавливаем параметры печати и колонтитулы
	ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху 			= 12;
	ТабДокумент.ПолеСлева  			= 0;
	ТабДокумент.ПолеСнизу  			= 0;
	ТабДокумент.ПолеСправа 			= 0;
	ТабДокумент.АвтоМасштаб 		= Истина;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	
	ПервыйДокумент 		  = Истина;
	ВыводитьКолонтитул 	  = МассивОбъектов.Количество() = 1;
	НапечатеноДокументов  = 0;
	ТекстСообщения		  = "";
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		сообщить(Ссылка);
		РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Ссылка, ПометкаУдаления, Дата, ВидСчетаФактуры, 
		|Исправление, НомерИсправления,	ДоговорКонтрагента, СчетФактураБезНДС, ДокументОснование, КППКонтрагента, ИдентификаторГосКонтракта");//никитин
		
		Если РеквизитыСФ.Дата < '20130101' Тогда
			ТекстСообщения = НСтр("ru = 'Применение формы универсального передаточного документа возможно только с 01 января 2013 года'");
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ПометкаУдаления Тогда
			ТекстСообщения = НСтр("ru = 'Форма универсального передаточного документа не предназначена для помеченных на удаление документов'");
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется для счетов-фактур на аванс";
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент Тогда
			ТекстСообщения = "Форма универсального передаточного документа не применяется при исполнении обязанностей налогового агента";
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда
			ТекстСообщения = НСтр("ru = 'Форма универсального передаточного документа не применяется для корректировочных счетов-фактур'");
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу Тогда
			ТекстСообщения = НСтр("ru = 'Форма универсального передаточного документа не применяется для счетов-фактур на суммовые разницы'");
			Продолжить;
		КонецЕсли;
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(РеквизитыСФ);
		Если ДанныеДляПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатьУниверсальногоПередаточногоДокумента(ДанныеДляПечати, ТабДокумент);
		
		ТабДокумент.ВерхнийКолонтитул.Выводить = ВыводитьКолонтитул;
		Если ВыводитьКолонтитул Тогда
			ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница     = 2;
			ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
			НомерНаПечатьСтрокой = ОбщегоНазначения.ПолучитьНомерНаПечать(ДанныеДляПечати);
			ДатаНаПечатьСтрокой  = Формат(ДанныеДляПечати.Дата, "ДФ='дд ММММ гггг'") + " г.";
			ЗаголовокДляПечати 	 = "Универсальный передаточный документ № " + НомерНаПечатьСтрокой + " от " +  ДатаНаПечатьСтрокой;
			ТабДокумент.ВерхнийКолонтитул.ТекстСлева  = ЗаголовокДляПечати;
			ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "Лист [&НомерСтраницы]";
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
		НапечатеноДокументов = НапечатеноДокументов + 1;
		
	КонецЦикла;
	
	Если НапечатеноДокументов = 0 Тогда
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
		ОбластьМакета = Макет.ПолучитьОбласть("Ошибка");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьУниверсальногоКорректировочногоДокумента(ДанныеДляПечати) Экспорт
	
	Таблица = ДанныеДляПечати.ТабличнаяЧасть;
	
	СуммаУменьшения = Таблица.Итог("РазницаБезНДСУменьшение") + Таблица.Итог("РазницаСНДСУменьшение") + Таблица.Итог("РазницаНДСУменьшение");
	СуммаУвеличения = Таблица.Итог("РазницаБезНДСУвеличение") + Таблица.Итог("РазницаСНДСУвеличение") + Таблица.Итог("РазницаНДСУвеличение");
	
	Если СуммаУменьшения = 0 И СуммаУвеличения = 0 Тогда
		ТекстСообщения = "Печать универсального корректировочного документа без изменения суммовых показателей не возможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Устанавливаем параметры печати и колонтитулы
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 12;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	Если ДанныеДляПечати.ДатаСчетФактуры >= '20241001' Тогда
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент534";
		Макет = ПолучитьОбщийМакет("УниверсальныйКорректировочныйДокумент1096");
	ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры > '20210701' Тогда
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент534";
		Макет = ПолучитьОбщийМакет("УниверсальныйКорректировочныйДокумент534");
    ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры < '20171001' Тогда
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент";
		Макет = ПолучитьОбщийМакет("УниверсальныйКорректировочныйДокумент");
	Иначе
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент981";
		Макет = ПолучитьОбщийМакет("УниверсальныйКорректировочныйДокумент981");
	КонецЕсли;
	
	УчетНДС.ВывестиКорректировочныйСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	УчетНДС.ВывестиПодвалУниверсальногоКорректировочногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	Возврат ТабДокумент;

КонецФункции

Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина)
	
	#Если Сервер ИЛИ ВнешнееСоединение Тогда
		Возврат ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СписокСведений, Список, СПрефиксом);
	#ИначеЕсли ТолстыйКлиентОбычноеПриложение Тогда	
		Возврат ФормированиеПечатныхФорм.ОписаниеОрганизации(СписокСведений, Список, СПрефиксом);		
	#КонецЕсли
	
КонецФункции

