&НаКлиенте
Перем мТекущийПериодДоИзменения;

&НаКлиенте
Процедура КомандаТекущийМесяц(Команда)
	
	Элементы.ФормаКомандаТекущийМесяц.Пометка = НЕ Элементы.ФормаКомандаТекущийМесяц.Пометка;
	
	УстановитьВидимостьМесяцев(Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьМесяцев(ТолькоТекущийМесяц)
	
	Для Сч = 1 По 12 Цикл
		
		ВидимостьТекМесяца = (ТолькоТекущийМесяц И Сч = Месяц(Объект.ТекущийПериод)) ИЛИ НЕ ТолькоТекущийМесяц; 
		
		ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаПланСумма"+Сч].Видимость			= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПланСумма"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость;
		
		ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС"+Сч].Видимость	= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаОперФактСумма"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаОперФактСумма"+Сч].Видимость;	
		ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость	= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость;
		
		ЭтаФорма.Элементы["СоставБюджетаБухФактСуммаБезНДС"+Сч].Видимость	= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаБухФактСуммаБезНДС"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаБухФактСумма"+Сч].Видимость			= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаБухФактСумма"+Сч].Видимость;				
		ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество"+Сч].Видимость	= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество"+Сч].Видимость;
		
		ЭтаФорма.Элементы["СоставБюджетаФактСуммаБезНДС"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаФактСуммаБезНДС"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаФактСумма"+Сч].Видимость			= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаФактСумма"+Сч].Видимость;						
		ЭтаФорма.Элементы["СоставБюджетаФактКоличество"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаФактКоличество"+Сч].Видимость;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоМесяцам(Параметр)
	
	Для Сч = 1 По 12 Цикл
		ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость		= Ложь;
		ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость	= Ложь;
		ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество"+Сч].Видимость	= Ложь;
		ЭтаФорма.Элементы["СоставБюджетаФактКоличество"+Сч].Видимость		= Ложь;
	КонецЦикла;
	
	
	Для Сч = 1 По 12 Цикл
		
		ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС"+Сч].Видимость		= Параметр.ПланСуммаБезНДС;
		ЭтаФорма.Элементы["СоставБюджетаПланСумма"+Сч].Видимость			= Параметр.ПланСумма;
		Если Параметр.Свойство("ПланКоличество") Тогда
			ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость		= Параметр.ПланКоличество;
		Иначе
			ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость		= Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС"+Сч].Видимость	= Параметр.ОперФактСуммаБезНДС;
		ЭтаФорма.Элементы["СоставБюджетаОперФактСумма"+Сч].Видимость		= Параметр.ОперФактСумма;
		Если Параметр.Свойство("ОперФактКоличество") Тогда
			ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость	= Параметр.ОперФактКоличество;
		Иначе
			ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость	= Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы["СоставБюджетаБухФактСуммаБезНДС"+Сч].Видимость	= Параметр.БухФактСуммаБезНДС;
		ЭтаФорма.Элементы["СоставБюджетаБухФактСумма"+Сч].Видимость			= Параметр.БухФактСумма;
		Если Параметр.Свойство("БухФактКоличество") Тогда
			ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество"+Сч].Видимость	= Параметр.БухФактКоличество;
		Иначе
			ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество"+Сч].Видимость	= Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы["СоставБюджетаФактСуммаБезНДС"+Сч].Видимость		= Параметр.ФактСуммаБезНДС;
		ЭтаФорма.Элементы["СоставБюджетаФактСумма"+Сч].Видимость			= Параметр.ФактСумма;		
		Если Параметр.Свойство("ФактКоличество") Тогда
			ЭтаФорма.Элементы["СоставБюджетаФактКоличество"+Сч].Видимость		= Параметр.ФактКоличество;
		Иначе
			ЭтаФорма.Элементы["СоставБюджетаФактКоличество"+Сч].Видимость		= Ложь;
		КонецЕсли;

		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ИндексТекМесяца = Месяц(Объект.ТекущийПериод);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ПланСуммаБезНДС"			, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланСумма"				, ЭтаФорма.Элементы["СоставБюджетаПланСумма" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланКоличество"			, ЭтаФорма.Элементы["СоставБюджетаПланКоличество" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ОперФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("БухФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаБухФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("БухФактСумма"				, ЭтаФорма.Элементы["СоставБюджетаБухФактСумма" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("БухФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ФактСуммаБезНДС"			, ЭтаФорма.Элементы["СоставБюджетаФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ФактСумма"				, ЭтаФорма.Элементы["СоставБюджетаФактСумма" + ИндексТекМесяца].Видимость);	
	СтруктураПараметров.Вставить("ФактКоличество"			, ЭтаФорма.Элементы["СоставБюджетаФактКоличество" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ТолькоТекущийМесяц"		, ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	ФормаНастроекПараметров = ПолучитьФорму("Документ.абс_ПодтверждениеФакта.Форма.ФормаНастроек", СтруктураПараметров,ЭтаФорма);
	ФормаНастроекПараметров.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()

	КлючНастроек = "абс_ПодтверждениеФактаВидимостьРеквизитов";
	
	ИндексТекМесяца = Месяц(Объект.ТекущийПериод);
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПланСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" 		+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ПланСумма"				, ЭтаФорма.Элементы["СоставБюджетаПланСумма" 			+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ПланКоличество"			, ЭтаФорма.Элементы["СоставБюджетаПланКоличество" 		+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("ОперФактСуммаБезНДС"	, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" 	+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ОперФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" 		+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ОперФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество" 	+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("БухФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаБухФактСуммаБезНДС" 	+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("БухФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаБухФактСумма" 		+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("БухФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаБухФактКоличество" 	+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("ФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаФактСуммаБезНДС" 		+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ФактСумма"				, ЭтаФорма.Элементы["СоставБюджетаФактСумма" 			+ ИндексТекМесяца].Видимость);	
	Настройки.Вставить("ФактКоличество"			, ЭтаФорма.Элементы["СоставБюджетаФактКоличество" 		+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("ТолькоТекущийМесяц"		, ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Объект.Ссылка, КлючНастроек, Настройки);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()

	КлючНастроек = "абс_ПодтверждениеФактаВидимостьРеквизитов";

	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Объект.Ссылка, КлючНастроек);
	
	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда
		
		Если ЗначениеНастроек.Свойство("ТолькоТекущийМесяц") = Неопределено Тогда
			ЗначениеНастроек.Вставить("ТолькоТекущийМесяц", Ложь);
		КонецЕсли;
		
		Попытка
			УстановитьВидимостьПоМесяцам(ЗначениеНастроек);
		Исключение
			
		КонецПопытки;
		
		Элементы.ФормаКомандаТекущийМесяц.Пометка 	= ЗначениеНастроек.ТолькоТекущийМесяц;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановитьВидимость" Тогда
		
		УстановитьВидимостьПоМесяцам(Параметр);
		
		УстановитьВидимостьМесяцев(ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьМесяцев(Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	мТекущийПериодДоИзменения = Объект.ТекущийПериод;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	
	Объект.ДатаПланирования = НачалоГода(Объект.ДатаПланирования);

КонецПроцедуры

&НаКлиенте
Процедура ТекущийПериодПриИзменении(Элемент)
	
	Объект.ТекущийПериод = НачалоМесяца(Объект.ТекущийПериод);
	
	ИндексТекМесяца = Месяц(мТекущийПериодДоИзменения);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ПланСуммаБезНДС"			, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланСумма"				, ЭтаФорма.Элементы["СоставБюджетаПланСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ОперФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("БухФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаБухФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("БухФактСумма"				, ЭтаФорма.Элементы["СоставБюджетаБухФактСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ФактСуммаБезНДС"			, ЭтаФорма.Элементы["СоставБюджетаФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ФактСумма"				, ЭтаФорма.Элементы["СоставБюджетаФактСумма" + ИндексТекМесяца].Видимость);	
	
	СтруктураПараметров.Вставить("ТолькоТекущийМесяц"		, ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	УстановитьВидимостьПоМесяцам(СтруктураПараметров);
	
	УстановитьВидимостьМесяцев(СтруктураПараметров.ТолькоТекущийМесяц);
	
	мТекущийПериодДоИзменения = Объект.ТекущийПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьДаннымиНаГод(Команда)
	
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СоставБюджета.Очистить();
		КонецЕсли;
	КонецЕсли;
	
    КомандаЗаполнитьДаннымиНаГодСервер();
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьДаннымиНаГодСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьДаннымиЗаГод(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗаполнитьДаннымиНаТекущийМесяц(Команда)

	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
   	КомандаЗаполнитьДаннымиНаТекущийМесяцСервер();
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьДаннымиНаТекущийМесяцСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьДаннымиНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаВнестиВручную(Команда)
	
	ИндексКолонки = Месяц(Объект.ТекущийПериод);
	
	ВыделенныеСтроки = Элементы.СоставБюджета.ВыделенныеСтроки;
	
	СтруктураПараметров = Новый Структура("ФактСумма, ФактСуммаБезНДС, ФактКоличество", 0, 0, 0);
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		
		СтруктураПараметров.ФактСумма 		= Объект.СоставБюджета[ВыделенныеСтроки[0]]["ФактСумма" + ИндексКолонки];
		СтруктураПараметров.ФактСуммаБезНДС = Объект.СоставБюджета[ВыделенныеСтроки[0]]["ФактСуммаБезНДС" + ИндексКолонки];
		СтруктураПараметров.ФактКоличество	= Объект.СоставБюджета[ВыделенныеСтроки[0]]["ФактКоличество" + ИндексКолонки];

	КонецЕсли;
	
	ФормаНастроекПараметров = ПолучитьФорму("Документ.абс_ПодтверждениеФакта.Форма.ФормаВводаФакта", СтруктураПараметров, ЭтаФорма);
	СтруктураФакта = ФормаНастроекПараметров.ОткрытьМодально();
	
	Если НЕ ЗначениеЗаполнено(СтруктураФакта) Тогда
		Возврат;
	КонецЕсли;
		
	МассивСтрок = Новый Массив();
	
	Для Каждого ТекСтр Из Элементы.СоставБюджета.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ТекСтр);
	КонецЦикла;	
	
	КомандаСоставБюджетаКонтекстноеМенюКнопкаВнестиВручнуюСервер(МассивСтрок, СтруктураФакта);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаОтменить(Команда)	
	
	МассивСтрок = Новый Массив();
	
	Для Каждого ТекСтр Из Элементы.СоставБюджета.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ТекСтр);
	КонецЦикла;	
	
	КомандаСоставБюджетаКонтекстноеМенюКнопкаОтменитьСервер(МассивСтрок);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаБухФакт(Команда)
		
	МассивСтрок = Новый Массив();
	
	Для Каждого ТекСтр Из Элементы.СоставБюджета.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ТекСтр);
	КонецЦикла;	
	
	КомандаСоставБюджетаКонтекстноеМенюКнопкаБухФактСервер(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаОперФакт(Команда)
	
	МассивСтрок = Новый Массив();
	
	Для Каждого ТекСтр Из Элементы.СоставБюджета.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ТекСтр);
	КонецЦикла;
	
	КомандаСоставБюджетаКонтекстноеМенюКнопкаОперФактСервер(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаВнестиВручнуюСервер(МассивВыделенныхСтрок, СтруктураФакта)
	
	ИндексКолонки = Месяц(Объект.ТекущийПериод);
	
	Для Каждого ТекСтрока Из МассивВыделенныхСтрок Цикл
		
		Объект.СоставБюджета[ТекСтрока]["ФактСуммаБезНДС" + ИндексКолонки] 	= СтруктураФакта.ФактСуммаБезНДС;
		Объект.СоставБюджета[ТекСтрока]["ФактСумма" + ИндексКолонки] 		= СтруктураФакта.ФактСумма;
		Объект.СоставБюджета[ТекСтрока]["ФактКоличество" + ИндексКолонки] 	= СтруктураФакта.ФактКоличество;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаОтменитьСервер(МассивВыделенныхСтрок)
	
	ИндексКолонки = Месяц(Объект.ТекущийПериод);
	
	Для Каждого ТекСтрока Из МассивВыделенныхСтрок Цикл
		
		Объект.СоставБюджета[ТекСтрока]["ФактСуммаБезНДС" + ИндексКолонки] 	= 0;
		Объект.СоставБюджета[ТекСтрока]["ФактСумма" + ИндексКолонки] 		= 0;
		Объект.СоставБюджета[ТекСтрока]["ФактКоличество" + ИндексКолонки] 	= 0;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаБухФактСервер(МассивВыделенныхСтрок)
	
	ИндексКолонки = Месяц(Объект.ТекущийПериод);
	
	Для Каждого ТекСтрока Из МассивВыделенныхСтрок Цикл
		
		Объект.СоставБюджета[ТекСтрока]["ФактСуммаБезНДС" + ИндексКолонки] 	= Объект.СоставБюджета[ТекСтрока]["БухФактСуммаБезНДС" + ИндексКолонки];
		Объект.СоставБюджета[ТекСтрока]["ФактСумма" + ИндексКолонки] 		= Объект.СоставБюджета[ТекСтрока]["БухФактСумма" + ИндексКолонки];
		Объект.СоставБюджета[ТекСтрока]["ФактКоличество" + ИндексКолонки] 	= Объект.СоставБюджета[ТекСтрока]["БухФактКоличество" + ИндексКолонки];
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура КомандаСоставБюджетаКонтекстноеМенюКнопкаОперФактСервер(МассивВыделенныхСтрок)
	
	ИндексКолонки = Месяц(Объект.ТекущийПериод);
	
	Для Каждого ТекСтрока Из МассивВыделенныхСтрок Цикл
		
		Объект.СоставБюджета[ТекСтрока]["ФактСуммаБезНДС" + ИндексКолонки] 	= Объект.СоставБюджета[ТекСтрока]["ОперФактСуммаБезНДС" + ИндексКолонки];
		Объект.СоставБюджета[ТекСтрока]["ФактСумма" + ИндексКолонки] 		= Объект.СоставБюджета[ТекСтрока]["ОперФактСумма" + ИндексКолонки];
		Объект.СоставБюджета[ТекСтрока]["ФактКоличество" + ИндексКолонки] 	= Объект.СоставБюджета[ТекСтрока]["ОперФактКоличество" + ИндексКолонки];
		
	КонецЦикла;	
	
КонецПроцедуры




&НаКлиенте
Процедура КомандаСортироватьПоСтатье(Команда)
	
	КомандаСортироватьПоСтатьеСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаСортироватьПоСтатьеСервер() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.СортироватьСоставБюджетаПоСтатье(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьПоКонтрагенту(Команда)
	
	КомандаСортироватьПоКонтрагентуСервер();
	
КонецПроцедуры

&НаСервере
Процедура КомандаСортироватьПоКонтрагентуСервер() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.СортироватьСоставБюджетаПоКонтрагенту(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры







