Процедура ОбработкаЗаполнения(ДанныеЗаполнения)
	
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр абс_НормыРасходовНаТранспорт
	Движения.абс_НормыРасходовНаТранспорт.Записывать = Истина;
	Движения.абс_НормыРасходовНаТранспорт.Очистить();
	Для Каждого ТекСтрокаРегионы Из Регионы Цикл
		Движение = Движения.абс_НормыРасходовНаТранспорт.Добавить();
		Движение.Период = Дата;
		Движение.Регион = ТекСтрокаРегионы.Регион;
		Движение.Сумма = ТекСтрокаРегионы.Сумма;
	КонецЦикла;

КонецПроцедуры
