#Область НастройкиАвторизации

Процедура СохранитьНастройкиАвторизации(НастройкаИнтеграции, Токен) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(НастройкаИнтеграции, Токен, ИмяТокена());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПрочитатьНастройкиАвторизации(НастройкаИнтеграции)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(НастройкаИнтеграции, ИмяТокена());
КонецФункции

Функция ИмяТокена()
	Возврат "Токен_Версия_1_4";
КонецФункции

Функция ИнтеграцияНастроена(НастройкаИнтеграции) Экспорт
	Возврат ЗначениеЗаполнено(ПрочитатьНастройкиАвторизации(НастройкаИнтеграции));
КонецФункции 

#КонецОбласти

#Область РаботаСОтчетами

Функция ПрочитатьОтчет(ПараметрыОтчета, СообщенияОбОшибках) Экспорт
	
	ТаблицаТоваров = ЭлектронноеВзаимодействиеБП.ПодготовитьТаблицуТоваровМаркетплейс();
	
	ПараметрыЗапроса = НовыйПараметрыЗапросаОтчетОпродажахWildberries();
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
	
	ПараметрыЗапроса.НастройкиПодключения = НастройкиПодключения;
	ПараметрыЗапроса.ВерсияМетодаAPI = ВерсияМетодаОтчетОПродажахAPIWildberries(ПараметрыОтчета.НачалоПериода);
	ПараметрыЗапроса.НачалоПериода        = ПараметрыОтчета.НачалоПериода;
	ПараметрыЗапроса.ОкончаниеПериода     = ПараметрыОтчета.ОкончаниеПериода;
	
	ПараметрыЗапроса.ПределВыборкиОдногоЗапроса = 10000;
	
	ПоследняяЗагруженнаяСтрока = 0;
	
	ВыполнятьСЗадержкой = Ложь;
	
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		Логирование = РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(ПараметрыОтчета.НастройкаИнтеграции);
	КонецЕсли;
	//Конец Логирование

	МассивЗагрузок = Новый Массив;
	Пока Истина Цикл
		
		Если ВыполнятьСЗадержкой Тогда
			Приостановить(61);
		КонецЕсли;
		
		ПараметрыЗапроса.НачалоВыборки = ПоследняяЗагруженнаяСтрока;
		РезультатЗапроса = ЗапросОтчетОпродажахWildberries(ПараметрыЗапроса, СообщенияОбОшибках, Логирование);
		
		Если ЗначениеЗаполнено(СообщенияОбОшибках) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		КодОтвета = РезультатЗапроса.КодСостояния;
		Если КодОтвета <> 200 Тогда
			
			Если КодОтвета = 502 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Сервер API Wildberries недоступен. Попробуйте позже'");
			ИначеЕсли КодОтвета = 400 или КодОтвета = 401 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries.
					|Возможно, ваш токен API устарел: срок действия токена - 180 дней от даты создания.
					|Получите токен API с типом ""Статистика"" в личном кабинете Профиль-Настройки-Доступ к API'");
			ИначеЕсли КодОтвета = 403 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries. Проверьте в настройках ключ API'");
			ИначеЕсли КодОтвета = 429 Тогда
				
				Если ВыполнятьСЗадержкой Тогда
					СообщенияОбОшибках = НСтр("ru = 'Сервер API Wildberries ответил: слишком много запросов. Попробуйте позже'");
				Иначе
					ВыполнятьСЗадержкой = Истина;
					Продолжить;
				КонецЕсли;
				
			Иначе
				ПереченьОшибок = РезультатЗапроса.ПолучитьТелоКакСтроку();
				Если СтрНайти(ПереченьОшибок, "Record limit exceeded") > 0
					И ПараметрыЗапроса.ПределВыборкиОдногоЗапроса = 10000 Тогда
					ПараметрыЗапроса.ПределВыборкиОдногоЗапроса = 1000;
					ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось загрузить отчет о продажах. Получен ответ API Wildberries %1, код ошибки: %2'"),
						ПараметрыЗапроса.ВерсияМетодаAPI,
						ПереченьОшибок);
					ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(ТекстОшибки, Перечисления.ВидыМаркетплейсов.Wildberries);
					Продолжить;
				КонецЕсли;
				СообщенияОбОшибках = СтрШаблон(
					НСтр("ru = 'Не удалось загрузить отчет о продажах. Получен ответ API Wildberries %1, код ошибки: %2'"),
						ПараметрыЗапроса.ВерсияМетодаAPI,
						ПереченьОшибок);
			КонецЕсли;
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СообщенияОбОшибках) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			РезультатЧтения = ОбменСМаркетплейс.ПолучитьДанныеОтвета(РезультатЗапроса);
		Исключение
			ТекстОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
			Если ПустаяСтрока(ТекстОтвета) Тогда
				СообщенияОбОшибках = СтрШаблон(
				НСтр("ru = 'Не удалось загрузить отчет о продажах.
				|Получен ответ API Wildberries %1: <пустой ответ> - ответ не содержит данных. 
				|Обратитесь в техподдержку Wildberries с жалобой на ошибку в работе метода %2
				|при выполнении запроса за период с %3 по %4'"),
					ПараметрыЗапроса.ВерсияМетодаAPI,
					АдресЗапросаСтатистикиWildberries(ПараметрыЗапроса.ВерсияМетодаAPI),
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
			Иначе
				СообщенияОбОшибках = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецЕсли;
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
			Возврат Неопределено;
		КонецПопытки;
		
		//API вернул ответ null
		Если РезультатЧтения = Неопределено Тогда 
			
			СообщенияОбОшибках = СтрШаблон(
				НСтр("ru = 'Не удалось загрузить отчет о продажах.
				|Получен ответ API Wildberries %1: Отсутствует данные отчета за период с %2 по %3. Попробуйте загрузить отчет позже'"),
					ПараметрыЗапроса.ВерсияМетодаAPI,
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
					ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		ПрочитаноСтрок = РезультатЧтения.Количество(); 
		
		//API вернул ответ []
		Если ПрочитаноСтрок = 0 Тогда 
			
			СообщенияОбОшибках = СтрШаблон(
				НСтр("ru = 'Не удалось загрузить отчет о продажах.
				|Получен ответ API Wildberries %1: Отсутствует данные отчета за период с %2 по %3.'"),
					ПараметрыЗапроса.ВерсияМетодаAPI,
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		ПоследняяЗагруженнаяСтрока = Формат(РезультатЧтения[ПрочитаноСтрок-1].rrd_id, "ЧГ=0");
		
		ДополнитьТаблицуТоваровWildberries(РезультатЧтения, ТаблицаТоваров);
		
		РезультатЧтения = Неопределено;
		
		Если ПрочитаноСтрок < ПараметрыЗапроса.ПределВыборкиОдногоЗапроса Тогда
			//все выбрали, второй запрос не нужен
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;

КонецФункции

Функция ПродажаЧерезВыкупТовара(КодСтраны, НазваниеСтраны = "") Экспорт
	
	Код = Врег(КодСтраны);
	Название = Врег(НазваниеСтраны);
	Возврат Код = "KZ" ИЛИ Название = "КАЗАХСТАН" 
			ИЛИ Код = "BY" ИЛИ Название = "БЕЛАРУСЬ"
			ИЛИ Код = "KG" ИЛИ Название = "КИРГИЗИЯ"
			ИЛИ Код = "AM" ИЛИ Название = "АРМЕНИЯ";
	
КонецФункции

Функция СписаниеТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	ЭтоСписание = (Нрег(ВидДвижения) = "оплата потерянного товара" 
					ИЛИ Нрег(ВидДвижения) = "авансовая оплата за товар без движения" 
					ИЛИ Нрег(ВидДвижения) = "частичная компенсация брака"
					ИЛИ Нрег(ВидДвижения) = "компенсация потерянного товара"
					ИЛИ Нрег(ВидДвижения) = "компенсация подмененного товара"
					ИЛИ Нрег(ВидДвижения) = "компенсация ущерба"
					ИЛИ Нрег(ВидДвижения) = "добровольная компенсация при возврате"
					ИЛИ Нрег(ВидДвижения) = "компенсация брака");
					
	ЭтоСторно   = (Нрег(ТипДокумента) = "возврат");
	
	Возврат ЭтоСписание И НЕ ЭтоСторно;
	
КонецФункции

Функция ПродажаТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	Возврат Нрег(ВидДвижения) = "продажа"
			ИЛИ Нрег(ВидДвижения) = "корректная продажа"
			ИЛИ Нрег(ВидДвижения) = "сторно возвратов"
			ИЛИ (Нрег(ВидДвижения) = "коррекция продаж"
				И Нрег(ТипДокумента) = "продажа");
	
КонецФункции

Функция ВозвратТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	Возврат Нрег(ВидДвижения) = "возврат"
			ИЛИ Нрег(ВидДвижения) = "сторно продаж"
			ИЛИ (Нрег(ВидДвижения) = "коррекция продаж"
				И Нрег(ТипДокумента) = "возврат");
	
КонецФункции


Функция ПреобразоватьДанныеПрочитанногоОтчета(ПараметрыОтчета, ТаблицаТоваров)
	
	КолонкиТаблицыТоваров = ТаблицаТоваров.Колонки;
	Если КолонкиТаблицыТоваров.Найти("НатуральныйИД") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("НатуральныйИД", ОбщегоНазначения.ОписаниеТипаСтрока(300));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("КоличествоВозврат") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("КоличествоВозврат", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("СуммаВозврат") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("СуммаВозврат", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("СтавкаНДС") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("СуммаНДС") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("СуммаНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	КонецЕсли;
	
	КолонкаНаимТов = КолонкиТаблицыТоваров.Найти("НаимТов");
	КолонкаНаименование = КолонкиТаблицыТоваров.Найти("Наименование");
	Если КолонкаНаимТов <> Неопределено
		И КолонкаНаименование = Неопределено Тогда
		КолонкаНаимТов.Имя = "Наименование";
	КонецЕсли;
	
	ТаблицаПродажи  = ТаблицаТоваров.СкопироватьКолонки();
	ТаблицаВыкуп    = ТаблицаТоваров.СкопироватьКолонки();
	ТаблицаВыкупУСН = ТаблицаТоваров.СкопироватьКолонки();
	ТаблицаСписание = ТаблицаТоваров.СкопироватьКолонки();
	
	НастройкаИнтеграции     = ПараметрыОтчета.НастройкаИнтеграции;
	КонтрагентДоговор       = Справочники.НастройкиИнтеграцииМаркетплейс.КонтрагентДоговорНаДату(НастройкаИнтеграции, ПараметрыОтчета.ОкончаниеПериода);
	
	Организация             = НастройкаИнтеграции.Владелец;
	Контрагент              = КонтрагентДоговор.Контрагент;
	ДоговорКонтрагента      = КонтрагентДоговор.ДоговорКонтрагента;
	Дата                    = ПараметрыОтчета.ОкончаниеПериода;
	
	ИсключатьВыкупы = (Дата <= '20230901') Или (УчетнаяПолитика.ПлательщикНДС(Организация, Дата));
	
	СуммаПродаж = 0;
	СуммаВозвратов = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		Если СписаниеТовараМаркетплейсом(СтрокаТаблицы.ВидДвижения, "Продажа") Тогда
			НоваяСтрока = ТаблицаСписание.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ИначеЕсли ПродажаЧерезВыкупТовара(СтрокаТаблицы.КодСтраны, СтрокаТаблицы.КодСтраны)
			И (СтрокаТаблицы.ВидДвижения = "продажа" Или СтрокаТаблицы.ВидДвижения = "корректная продажа") Тогда
			Если ИсключатьВыкупы Тогда
				НоваяСтрока = ТаблицаВыкуп.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			Иначе
				Если СтрокаТаблицы.ТипОтчета = 2 Тогда
					НоваяСтрока = ТаблицаВыкупУСН.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				Иначе
					НоваяСтрока = ТаблицаПродажи.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					СуммаПродаж = СуммаПродаж + СтрокаТаблицы.Сумма;
				КонецЕсли;
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаПродажи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			Если СтрокаТаблицы.ВидДвижения = "возврат"
				Или СтрокаТаблицы.ВидДвижения = "сторно продаж" Тогда
				СуммаВозвратов = СуммаВозвратов + СтрокаТаблицы.Сумма;
			Иначе
				СуммаПродаж = СуммаПродаж + СтрокаТаблицы.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НастройкиСопоставления = Новый Структура;
	НастройкиСопоставления.Вставить("ОграничениеТипаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НастройкиСопоставления.Вставить("ОтключитьПоискПоСловарю",     Истина);
	НастройкиСопоставления.Вставить("ТочностьПоискаПоУмолчанию",   100);
	
	ДополнительныеПараметрыПоиска = Новый Структура;
	ДополнительныеПараметрыПоиска.Вставить("НатуральныеКлючи", "Артикул");
	ДополнительныеПараметрыПоиска.Вставить("Маркетплейс",      Перечисления.ВидыМаркетплейсов.Wildberries);
	НастройкиСопоставления.Вставить("ДополнительныеПараметрыПоиска", ДополнительныеПараметрыПоиска);
	
	НовыеКолонкиСопоставления = Новый Массив;
	ДополнительныйРеквизит = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыйДополнительныйРеквизитСопоставления();
	ДополнительныйРеквизит.Имя = "КодМагазина";
	ДополнительныйРеквизит.Представление = "Код маркетплейса";
	НовыеКолонкиСопоставления.Добавить(ДополнительныйРеквизит);
	НастройкиСопоставления.Вставить("ДополнительныеРеквизитыСопоставления", НовыеКолонкиСопоставления);
	
	ВидимостьКолонокСопоставления = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыеНастройкиВидимостиКолонокСопоставления();
	ВидимостьКолонокСопоставления.Вставить("ЕдиницаИзмерения", Ложь);
	ВидимостьКолонокСопоставления.Вставить("Упаковка", Ложь);
	ВидимостьКолонокСопоставления.Вставить("СтавкаНДС", Ложь);
	НастройкиСопоставления.Вставить("ВидимостьКолонокСопоставления", ВидимостьКолонокСопоставления);
	
	ДанныеФайлов = Новый Массив();
	
	Если ТаблицаПродажи.Количество() > 0 Тогда
		
		Описание = СтрШаблон(НСтр("ru='Отчет о продажах Wildberries от %1
			|Продажи: %2 Возвраты: %3'"), 
			Формат(Дата, "ДФ=dd.MM.yyyy"), 
			Формат(СуммаПродаж, "ЧДЦ=2; ЧН="), 
			Формат(СуммаВозвратов, "ЧДЦ=2; ЧН="));
			
		НомерВходящегоДокумента = ТаблицаПродажи[0].ИдентификаторОтчета;
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаПродажи);
		ДанныеДокумента.Вставить("ВидДокумента"  , ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный());
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
			
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаВыкупа",             0);
		Файл.Вставить("СуммаПродаж",             СуммаПродаж);
		Файл.Вставить("СуммаВозвратов",          СуммаВозвратов);
		Файл.Вставить("СуммаСписания",           0);
		Файл.Вставить("Загружать",               СуммаПродаж > 0 ИЛИ СуммаВозвратов > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаПродажи);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		
		ДанныеФайлов.Добавить(Файл);
		
	КонецЕсли; 
	
	Если ТаблицаСписание.Количество() > 0 Тогда 
		
		Описание = СтрШаблон(НСтр("ru='Отчет о списании Wildberries от %1
			|Сумма компенсации: %2'"),
			Формат(Дата, "ДФ=dd.MM.yyyy"),
			Формат(ТаблицаСписание.Итог("Сумма"), "ЧДЦ=2; ЧН="));
			
		НомерВходящегоДокумента = ТаблицаСписание[0].ИдентификаторОтчета;
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаСписание);
		ДанныеДокумента.Вставить("ВидДокумента"  , ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBСписание());
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBСписание());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаСписания",           ТаблицаСписание.Итог("Сумма"));
		Файл.Вставить("Загружать",               ТаблицаСписание.Итог("Сумма") > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаСписание);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		
		ДанныеФайлов.Добавить(Файл);
	
	КонецЕсли;
	
	Если ТаблицаВыкуп.Количество() > 0 Тогда 
		
		Описание = СтрШаблон(НСтр("ru='Уведомление о выкупе Wildberries от %1
			|Сумма выкупа: %2'"),
			Формат(Дата, "ДФ=dd.MM.yyyy"),
			Формат(ТаблицаВыкуп.Итог("Сумма"), "ЧДЦ=2; ЧН="));
			
		НомерВходящегоДокумента = ТаблицаВыкуп[0].ИдентификаторОтчета;
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаВыкуп);
		ДанныеДокумента.Вставить("Ссылка"        , Неопределено);
		ДанныеДокумента.Вставить("Договор"       , Неопределено);
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаWBУведомлениеВыкупа());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      Неопределено);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаВыкупа",             ТаблицаВыкуп.Итог("Сумма"));
		Файл.Вставить("Загружать",               ТаблицаВыкуп.Итог("Сумма") > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаВыкуп);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		Файл.Вставить("ЗаполнятьДоговор",        Ложь);
		
		ДанныеФайлов.Добавить(Файл);

	КонецЕсли;

	Если ТаблицаВыкупУСН.Количество() > 0 Тогда 
		
		Описание = СтрШаблон(НСтр("ru='Уведомление о выкупе Wildberries от %1
			|Сумма выкупа: %2'"),
			Формат(Дата, "ДФ=dd.MM.yyyy"),
			Формат(ТаблицаВыкупУСН.Итог("Сумма"), "ЧДЦ=2; ЧН="));
		
		Комментарий = СтрШаблон(НСтр("ru='Уведомление о выкупе Wildberries от %1'"), Формат(Дата, "ДФ=dd.MM.yyyy"));
		
		НомерВходящегоДокумента = ТаблицаВыкупУСН[0].ИдентификаторОтчета;
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаВыкупУСН);
		ДанныеДокумента.Вставить("ВидДокумента"  , ЭлектронноеВзаимодействиеБП.ВидДокументаWBУведомлениеВыкупа());
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаВыкупа",             ТаблицаВыкупУСН.Итог("Сумма"));
		Файл.Вставить("Загружать",               ТаблицаВыкупУСН.Итог("Сумма") > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаВыкупУСН);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		Файл.Вставить("Комментарий",             Комментарий);
		Файл.Вставить("ЗаполнятьДоговор",        Ложь);
		
		ДанныеФайлов.Добавить(Файл);
	КонецЕсли;
	
	Возврат ДанныеФайлов;

КонецФункции

#КонецОбласти

#Область РаботаСТоварами

Функция ПолучитьОстаткиТоваров(НастройкиИнтеграции, Отбор, Отказ) Экспорт
	ТаблицаОстатковТоваров = ОбменСМаркетплейс.НовыйТаблицаОстатковТоваров();
	Если НЕ ЗначениеЗаполнено(Отбор) Тогда
		Возврат ТаблицаОстатковТоваров;
	КонецЕсли;
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкиИнтеграции);
	НастройкиПодключения.АдресСервера = АдресСервераМаркетплейсWilberries();
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() ТОгда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкиИнтеграции));
	КонецЕсли;
	//Конец Логирование
	ИдентификаторСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиИнтеграции, "ИдентификаторСклада");
	Если НЕ ЗначениеЗаполнено(ИдентификаторСклада) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("skus", Новый Массив);
	
	АдресРесурса = "/api/v3/stocks/"+Формат(ИдентификаторСклада, "ЧГ=");
	
	ВыполнятьСЗадержкой = Ложь;
	
	ПорцииТоваров = ОбменСМаркетплейс.ПодготовитьПорцииДляОбмена(Отбор, 1000);
	Для каждого Порция Из ПорцииТоваров Цикл
		ПараметрыЗапроса.skus.Очистить();
		
		Для каждого СтрокаТовары Из Порция Цикл
			ПараметрыЗапроса.skus.Добавить(СтрокаТовары.Штрихкод);
		КонецЦикла;
		
		РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения);
		Если НЕ РезультатЗапроса.Результат 
			И РезультатЗапроса.ВыполнятьСЗадержкой 
			И НЕ ВыполнятьСЗадержкой тогда
			
			ВыполнятьСЗадержкой = Истина;
		ИначеЕсли НЕ РезультатЗапроса.Результат Тогда
			Отказ = Истина;
			Возврат Неопределено;
		КонецЕсли;
		
		Если ВыполнятьСЗадержкой Тогда
			Приостановить(61);
		КонецЕсли;
		
		ЗаполнитьТаблицуТовары(ТаблицаОстатковТоваров, ИдентификаторСклада, РезультатЗапроса.Данные);
	КонецЦикла;
	
	Возврат ТаблицаОстатковТоваров;
КонецФункции

Процедура ПередатьОстаткиТоваров(НастройкаИнтеграции, ТаблицаТоваров, СообщениеОбОшибке, Отказ, КодОтветаСервера = 0) Экспорт
	ИдентификаторСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ИдентификаторСклада");
	Если НЕ ЗначениеЗаполнено(ИдентификаторСклада) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	НастройкиПодключения.АдресСервера = АдресСервераМаркетплейсWilberries();
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции));
	КонецЕсли;
	//Конец Логирование
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("stocks", Новый Массив);
	
	АдресРесурса = "/api/v3/stocks/"+Формат(ИдентификаторСклада, "ЧГ=");
	
	ПорцииДляОбмена = ОбменСМаркетплейс.ПодготовитьПорцииДляОбмена(ТаблицаТоваров, 1000);
	
	ВыполнятьСЗадержкой = Ложь;
	Для каждого Порция Из ПорцииДляОбмена Цикл
		ПараметрыЗапроса.stocks.Очистить();
		Для каждого СтрокаТаблицыТовары Из Порция Цикл
			ОстатокТовара = Новый Структура;
			ОстатокТовара.Вставить("sku", СтрокаТаблицыТовары.Штрихкод);
			ОстатокТовара.Вставить("amount", СтрокаТаблицыТовары.Остаток);
			ПараметрыЗапроса.stocks.Добавить(ОстатокТовара);
		КонецЦикла;
		
		РезультатЗапроса = ВыполнитьPUTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения);
		Если НЕ РезультатЗапроса.Результат 
			И РезультатЗапроса.ВыполнятьСЗадержкой 
			И НЕ ВыполнятьСЗадержкой тогда
			
			ВыполнятьСЗадержкой = Истина;
		ИначеЕсли НЕ РезультатЗапроса.Результат Тогда
			СообщениеОбОшибке = РезультатЗапроса.СообщениеОбОшибке;
			Отказ = Истина;
			Прервать;
		Иначе
			ОбменСМаркетплейс.ОбновитьДанныеОбОстатках(НастройкаИнтеграции, Порция);
		КонецЕсли;
		
		Если ВыполнятьСЗадержкой Тогда
			Приостановить(61);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТоварыИзСервиса(НастройкаИнтеграции, СообщениеОбОшибке)
	// Размер получаемой порции, определяется wb
	РазмерПорции = 100;
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.АдресСервера = АдресСервераКонтентWildberries();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции));
	КонецЕсли;
	//Конец Логирование
	
	Параметры = Новый Структура;
	Параметры.Вставить("cursor", Новый Структура("limit", РазмерПорции));
	Параметры.Вставить("filter", Новый Структура("withPhoto", -1));
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("settings", Параметры);
	
	КарточкиТоваров = Новый Массив;
	Пока Истина Цикл
		РезультатЗапроса = ВыполнитьPOSTЗапрос("/content/v2/get/cards/list?locale=ru", ПараметрыЗапроса, НастройкиПодключения);
		Если НЕ РезультатЗапроса.Результат Тогда
			СообщениеОбОшибке = РезультатЗапроса.СообщениеОбОшибке;
			Возврат Неопределено;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КарточкиТоваров, РезультатЗапроса.Данные.cards);
		
		Пагинатор = РезультатЗапроса.Данные.cursor;
		Если Пагинатор.total < РазмерПорции Тогда
			Прервать;
		КонецЕсли;
		ПараметрыЗапроса.settings.Вставить("cursor", Пагинатор);
	КонецЦикла;
	
	Возврат КарточкиТоваров;
КонецФункции

Функция СписокТоваровМаркетплейс(НастройкиИнтеграции, СообщениеОбОшибке, Отказ) Экспорт
	СписокТоваровСервиса = ПолучитьТоварыИзСервиса(НастройкиИнтеграции, СообщениеОбОшибке); 
	Если ЗначениеЗаполнено(СообщениеОбОшибке) тогда
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Контрагент = Справочники.НастройкиИнтеграцииМаркетплейс.КонтрагентДоговорНаДату(НастройкиИнтеграции, ТекущаяДатаСеанса()).Контрагент;
	Владелец = СопоставлениеНоменклатурыКонтрагентовСлужебный.ВладелецНоменклатурыКонтрагента(Контрагент);
	
	СписокТоваров = Новый Массив;
	Для Каждого ИнформацияОТоваре Из СписокТоваровСервиса Цикл
		КодМагазина = Формат(ИнформацияОТоваре.nmID, "ЧГ=");
		
		Для каждого Размер Из ИнформацияОТоваре.sizes Цикл
			Для каждого Штрихкод Из Размер.skus Цикл // У wildberries штрихкод является ключевым полем
				НоменклатураМаркетплейса = ОбменСМаркетплейс.НовыйНоменклатураМаркетплейса(Перечисления.ВидыМаркетплейсов.Wildberries, Владелец);
				НоменклатураМаркетплейса.КодМагазина = КодМагазина;
				НоменклатураМаркетплейса.Наименование = СтрШаблон("%1/%2/%3",
					ИнформацияОТоваре.subjectname,
					ИнформацияОТоваре.brand,
					КодМагазина);
				НоменклатураМаркетплейса.Артикул = ИнформацияОТоваре.VendorCode;
				НоменклатураМаркетплейса.Штрихкоды.Добавить(Штрихкод);
				
				ОбменСМаркетплейс.ДобавитьНоменклатуруВСписок(СписокТоваров, НоменклатураМаркетплейса);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокТоваров;
КонецФункции

Процедура ЗаполнитьТаблицуТовары(ТаблицаОстатковТоваров, ИдентификаторСклада, РезультатЧтения)
	ДанныеМаркетплейса = Новый ТаблицаЗначений;
	ДанныеМаркетплейса.Колонки.Добавить("Sku",    ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеМаркетплейса.Колонки.Добавить("amount", ОбщегоНазначения.ОписаниеТипаЧисло(6,0));
	
	Для каждого ЭлементРезультата Из РезультатЧтения["stocks"] Цикл
		ЗаполнитьЗначенияСвойств(ДанныеМаркетплейса.Добавить(), ЭлементРезультата);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеМаркетплейса.sku КАК Штрихкод,
	|	ДанныеМаркетплейса.amount КАК Остаток
	|ПОМЕСТИТЬ ВТ_ДанныеМаркетплейса
	|ИЗ
	|	&ДанныеМаркетплейса КАК ДанныеМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураМаркетплейсов.ИдентификаторТовара КАК ИдентификаторТовара,
	|	&ИдентификаторСклада КАК ИдентификаторСклада,
	|	НоменклатураМаркетплейсов.Штрихкод КАК Штрихкод,
	|	ВТ_ДанныеМаркетплейса.Остаток КАК Остаток
	|ИЗ
	|	ВТ_ДанныеМаркетплейса КАК ВТ_ДанныеМаркетплейса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураМаркетплейсов КАК НоменклатураМаркетплейсов
	|		ПО ВТ_ДанныеМаркетплейса.Штрихкод = НоменклатураМаркетплейсов.Штрихкод
	|ГДЕ
	|	НЕ НоменклатураМаркетплейсов.Штрихкод ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДанныеМаркетплейса",  ДанныеМаркетплейса);
	Запрос.УстановитьПараметр("ИдентификаторСклада", ИдентификаторСклада);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОстатковТоваров.Добавить(), Выборка);
	КонецЦикла;
КонецПроцедуры

Функция ПодготовитьФайлОстатков(НастройкаИнтеграции, ТаблицаОстатки) Экспорт
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("ИмяФайла", "stocks.xlsx");
	СтруктураФайла.Вставить("Страницы", Новый Соответствие);
	
	Макет = РегистрыСведений.ОстаткиТоваровМаркетплейсов.ПолучитьМакет("ФормаОстатковWB");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОстаткиНаСкладе_Шапка"));
	
	ОбластьОстатки = Макет.ПолучитьОбласть("ОстаткиНаСкладе_Строка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОстатки", ТаблицаОстатки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Остаток КАК Остаток,
	|	ТаблицаОстатки.ИдентификаторТовара КАК ИдентификаторТовара
	|ПОМЕСТИТЬ ВТ_ОстаткиТоваров
	|ИЗ
	|	&ТаблицаОстатки КАК ТаблицаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураМаркетплейсов.Штрихкод КАК Штрихкод,
	|	ВТ_ОстаткиТоваров.Остаток КАК Остаток
	|ИЗ
	|	ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураМаркетплейсов КАК НоменклатураМаркетплейсов
	|		ПО ВТ_ОстаткиТоваров.ИдентификаторТовара = НоменклатураМаркетплейсов.ИдентификаторТовара";
	
	ВыборкаРезультатов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультатов.Следующий() Цикл
		ОбластьОстатки.Параметры.Заполнить(ВыборкаРезультатов);
		
		ТабличныйДокумент.Вывести(ОбластьОстатки);
	КонецЦикла;
	
	СтруктураФайла.Страницы.Вставить("Остатки", ПоместитьВоВременноеХранилище(ТабличныйДокумент));
	
	Возврат СтруктураФайла;
КонецФункции


#КонецОбласти

#Область РаботаСоСкладами

Функция СписокСкладов(НастройкаИнтеграции, Отказ) Экспорт
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	НастройкиПодключения.АдресСервера = АдресСервераМаркетплейсWilberries();
    //Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции));
	КонецЕсли;
	//КонецЛогирование
	РезультатЗапроса = ВыполнитьGETЗапрос("/api/v3/warehouses", НастройкиПодключения);
	Если НЕ РезультатЗапроса.Результат тогда
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	СписокСкладов = Новый СписокЗначений;
	Для каждого СтрокаСклад Из РезультатЗапроса.Данные Цикл
		СписокСкладов.Добавить(Формат(СтрокаСклад.id, "ЧГ="), СтрокаСклад.name);
	КонецЦикла;
	
	Возврат СписокСкладов;
	
КонецФункции

#КонецОбласти

#Область ОтчетОПродажах

Функция ПолучитьДанныеДокумента(ПараметрыОтчета, КодОтветаСервера, СообщениеОбОшибке) Экспорт
	РезультатЧтения = ПрочитатьОтчет(ПараметрыОтчета, СообщениеОбОшибке);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатЧтения) Тогда
		СообщениеОбОшибке = НСтр("ru = 'Не удалось разобрать ответ от маркетплейс. Попробуйте загрузить отчет позже'");
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПреобразоватьДанныеПрочитанногоОтчета(ПараметрыОтчета, РезультатЧтения);
КонецФункции

Процедура ДополнитьТаблицуТоваровWildberries(Источник, ТаблицаТоваров)
	
	Для Каждого СтрокаОтчета Из Источник Цикл
		
		Сумма        = СтрокаОтчета.retail_amount; 
		ВидДвижения  = НРег(СтрокаОтчета.supplier_oper_name);
		ТипДокумента = НРег(СтрокаОтчета.doc_type_name);
		КодСтраны    = СтрокаОтчета.site_country;
		
		Если ПродажаЧерезВыкупТовара(КодСтраны, КодСтраны)
			Или ПродажаТовараМаркетплейсом(ВидДвижения, ТипДокумента)
			Или ВозвратТовараМаркетплейсом(ВидДвижения, ТипДокумента) Тогда
		ИначеЕсли ВидДвижения = "компенсация подмененного товара" Тогда
			Сумма = СтрокаОтчета.ppvz_for_pay;
		ИначеЕсли СписаниеТовараМаркетплейсом(ВидДвижения, ТипДокумента) Тогда
			Сумма = СтрокаОтчета.ppvz_for_pay;
		Иначе
			Продолжить;
		КонецЕсли;
		
		ИдентификаторТовара = Формат(СтрокаОтчета.nm_id, "ЧГ=0");
		
		//По таким позициям, даже при наличии ШК, сопоставление невозможно
		Если Не ЗначениеЗаполнено(СтрокаОтчета.subject_name)
			И Не ЗначениеЗаполнено(СтрокаОтчета.brand_name)
			И Не ЗначениеЗаполнено(ИдентификаторТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		Артикул = СтрокаОтчета.sa_name;
		ЛеваяЧасть = Лев(Артикул, Стрдлина(Артикул)/2);
		ПраваяЧасть = Прав(Артикул, Стрдлина(Артикул)/2);
		Артикул = ?(ЛеваяЧасть = ПраваяЧасть, ЛеваяЧасть, Артикул);
		
		НаименованиеТовара = СтрШаблон("%1/%2/%3",
			СтрокаОтчета.subject_name,
			СтрокаОтчета.brand_name,
			ИдентификаторТовара);
		
		НоваяСтрокаТовара = ТаблицаТоваров.Добавить();
		НоваяСтрокаТовара.ИД                  = ИдентификаторТовара;
		НоваяСтрокаТовара.НаимТов             = НаименованиеТовара;
		НоваяСтрокаТовара.Артикул             = Артикул;
		НоваяСтрокаТовара.ВидДвижения         = ВидДвижения;
		НоваяСтрокаТовара.ТипДокумента        = СтрокаОтчета.doc_type_name;
		НоваяСтрокаТовара.ИдентификаторОтчета = Формат(СтрокаОтчета.realizationreport_id, "ЧГ=0");
		НоваяСтрокаТовара.ТипОтчета           = СтрокаОтчета.report_type;
		НоваяСтрокаТовара.Количество          = СтрокаОтчета.quantity;
		НоваяСтрокаТовара.Сумма               = Сумма;
		НоваяСтрокаТовара.КодСтраны           = КодСтраны;
		НоваяСтрокаТовара.НазваниеСтраны      = КодСтраны;
		НоваяСтрокаТовара.ШтрихКод            = СтрокаОтчета.barcode;
		НоваяСтрокаТовара.КодМагазина         = ИдентификаторТовара;
		
		Если ВидДвижения = "Возврат" Тогда
			//WB: Литера Z в конце строки означает часовой пояс UTC. При ее отсутствии время считается в часовом поясе МСК (UTC+3)
			//Приведем все часовые пояса к началу дня
			НоваяСтрокаТовара.ДатаПродажи = НачалоДня(ПрочитатьДатуJSON(СтрокаОтчета.sale_dt, ФорматДатыJSON.ISO));
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция АдресЗапросаСтатистикиWildberries(ВерсияМетодаAPI)
	
	Возврат СтрШаблон("/api/%1/supplier/reportDetailByPeriod", ВерсияМетодаAPI);
	
КонецФункции

Функция НомерОтчетаИзИмениФайла(ПолноеИмяФайла) Экспорт
	
	СтрокаЦифровыхСимволов = "0123456789";
	
	Номер = "";
	//Исключим символы до номера
	Для Индекс = 1 По СтрДлина(ПолноеИмяФайла) Цикл
		Символ = Сред(ПолноеИмяФайла, Индекс, 1);
		Если СтрНайти(СтрокаЦифровыхСимволов, Символ) > 0 Тогда
			Номер = Сред(ПолноеИмяФайла, Индекс);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Результат = "";
	//Отбросим символы после номера
	Для Индекс = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер, Индекс, 1);
		Если СтрНайти(СтрокаЦифровыхСимволов, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		Результат = Результат + Символ;
	КонецЦикла;
	
	Если Результат = "0" Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЗапросОтчетОпродажахWildberries(ПараметрыЗапроса, СообщениеОбОшибке, Логирование = Неопределено)
	
	НастройкиПодключения = ПараметрыЗапроса.НастройкиПодключения;
	
	АдресЗапроса = АдресЗапросаСтатистикиWildberries(ПараметрыЗапроса.ВерсияМетодаAPI);
	
	СписокПараметровМетода = Новый Структура;
	СписокПараметровМетода.Вставить("dateFrom", Формат(ПараметрыЗапроса.НачалоПериода,"ДФ=гггг-ММ-дд"));
	СписокПараметровМетода.Вставить("dateTo", Формат(ПараметрыЗапроса.ОкончаниеПериода,"ДФ=гггг-ММ-дд"));
	СписокПараметровМетода.Вставить("limit", Формат(ПараметрыЗапроса.ПределВыборкиОдногоЗапроса, "ЧГ=0"));
	СписокПараметровМетода.Вставить("rrdid", Формат(ПараметрыЗапроса.НачалоВыборки, "ЧН=0; ЧГ=0"));
	
	ПараметрыСтрокой = Новый Массив;
	Для Каждого Параметр Из СписокПараметровМетода Цикл
		ПараметрыСтрокой.Добавить(Параметр.Ключ+"="+Параметр.Значение);
	КонецЦикла;
	
	МетодЗапроса = АдресЗапроса+ "?" + СтрСоединить(ПараметрыСтрокой,"&");
	
	АдресСервера = АдресСервераСтатистикиWildberries();
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	HTTPСоединениеВайлдберризАпиСтатистики = Новый HTTPСоединение(
		АдресСервера,
		, , ,
		ИнтернетПрокси,
		,
		ЗащищенноеСоединение);
	
	ЗаголовкиHTTPЗапроса = Новый Соответствие();
	ЗаголовкиHTTPЗапроса.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗаголовкиHTTPЗапроса.Вставить("Authorization", НастройкиПодключения.Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодЗапроса, ЗаголовкиHTTPЗапроса);
	
	Попытка
		HTTPОтвет = HTTPСоединениеВайлдберризАпиСтатистики.Получить(HTTPЗапрос); // GET
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		ВызватьИсключение;
	КонецПопытки;
	
	//Логирование
	Если Не Логирование = Неопределено Тогда 
		Если HTTPСоединениеВайлдберризАпиСтатистики  = Неопределено Тогда
			Логирование.АдресСервера 	= АдресСервера;
		Иначе
			Логирование.АдресСервера 	= HTTPСоединениеВайлдберризАпиСтатистики.Сервер +":"+HTTPСоединениеВайлдберризАпиСтатистики.Порт;
			Логирование.Соединение 		= Истина;
			Логирование.Метод 			= "GET";
			Логирование.Запрос 			= HTTPЗапрос;
			Логирование.Ответ 			= HTTPОтвет;
		КонецЕсли;
		РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
	КонецЕсли;
	//Конец Логирование

	Возврат HTTPОтвет;
	
КонецФункции

Функция НовыйПараметрыЗапросаОтчетОпродажахWildberries() Экспорт
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("НастройкиПодключения");
	ПараметрыЗапроса.Вставить("ВерсияМетодаAPI","");
	ПараметрыЗапроса.Вставить("НачалоПериода", Дата(1,1,1));
	ПараметрыЗапроса.Вставить("ОкончаниеПериода", Дата(1,1,1));
	ПараметрыЗапроса.Вставить("ПределВыборкиОдногоЗапроса", 0);
	ПараметрыЗапроса.Вставить("НачалоВыборки", 0);
	
	Возврат ПараметрыЗапроса;

КонецФункции

// Приостанавливает работу программы на указанное количество секунд.
//
Процедура Приостановить(Секунд)
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ФайловаяСистема.ЗапуститьПрограмму("timeout " + Секунд, ПараметрыЗапускаПрограммы);
		
	Иначе
		
		МодульОбщегоНазначенияБТС = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБТС");
		МодульОбщегоНазначенияБТС.Пауза(Секунд);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЗапросами

Функция НовыйНастройкиПодключения()
	НастройкиПодключения = Новый Структура("АдресСервера, Токен");
	Возврат НастройкиПодключения;
КонецФункции

Функция ВерсияМетодаОтчетОПродажахAPIWildberries(ПериодДействия)
	Если ПериодДействия >= Дата(2024,1,29) Тогда
		Возврат "v5";
	Иначе
		Возврат "v1";
	КонецЕсли;
КонецФункции

Функция АдресСервераСтатистикиWildberries()
	Возврат "statistics-api.wildberries.ru";
КонецФункции

Функция АдресСервераМаркетплейсWilberries()
	Возврат "marketplace-api.wildberries.ru";
КонецФункции


Функция ВыполнитьPOSTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения, КодУспех = 200, ПолучитьДанные = Истина)
	Возврат ВыполнитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения,  "POST", КодУспех, ПолучитьДанные);
КонецФункции

Функция ВыполнитьPUTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения, КодУспех = 204, ПолучитьДанные = Ложь)
	Возврат ВыполнитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения,  "PUT", КодУспех, ПолучитьДанные);
КонецФункции

Функция ВыполнитьGETЗапрос(АдресРесурса, НастройкиПодключения, КодУспех = 200, ПолучитьДанные = Истина)
	Возврат ВыполнитьHTTPЗапрос(АдресРесурса, Неопределено, НастройкиПодключения,  "GET", КодУспех, ПолучитьДанные);
КонецФункции

Функция ВыполнитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения, МетодЗапроса, КодУспех, ПолучитьДанные)
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	HTTPСоединение = Новый HTTPСоединение(
		НастройкиПодключения.АдресСервера,
		, , ,
		ИнтернетПрокси,
		,
		ЗащищенноеСоединение);
	
	ЗаголовкиHTTPЗапроса = Новый Соответствие();
	ЗаголовкиHTTPЗапроса.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗаголовкиHTTPЗапроса.Вставить("Authorization", НастройкиПодключения.Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовкиHTTPЗапроса);
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		ТелоHTTPЗапроса = ОбменСМаркетплейс.ВJSON(ПараметрыЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоHTTPЗапроса, "UTF-8");
	КонецЕсли;
	Попытка	
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(МетодЗапроса, HTTPЗапрос);
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		ВызватьИсключение;
	КонецПопытки;
	//Логирование
	Если НастройкиПодключения.Свойство("Логирование") Тогда
		Логирование = НастройкиПодключения.Логирование;
		Если HTTPСоединение  = Неопределено Тогда
			Логирование.АдресСервера 	= НастройкиПодключения.АдресСервера;
		Иначе
			Логирование.АдресСервера 	= HTTPСоединение.Сервер +":"+HTTPСоединение.Порт;
			Логирование.Соединение 		= Истина;
			Логирование.Метод 			= МетодЗапроса;
			Логирование.Запрос 			= HTTPЗапрос;
			Логирование.Ответ 			= HTTPОтвет;
		КонецЕсли;
		РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
	КонецЕсли;
	//Конец Логирование
	КодСостояния = HTTPОтвет.КодСостояния;
	
	РезультатЗапроса = Новый Структура;
	РезультатЗапроса.Вставить("Результат",           КодСостояния = КодУспех);
	РезультатЗапроса.Вставить("ВыполнятьСЗадержкой", КодСостояния = 429);
	РезультатЗапроса.Вставить("СообщениеОбОшибке");
	РезультатЗапроса.Вставить("Данные");
	
	СообщениеОбОшибке = "";
	Если НЕ РезультатЗапроса.Результат Тогда
		СообщениеОбОшибке = СообщениеОбОшибкеПоКоду(HTTPОтвет);
	ИначеЕсли ПолучитьДанные Тогда
		Попытка
			ДанныеОтвета = ОбменСМаркетплейс.ПолучитьДанныеОтвета(HTTPОтвет);
			РезультатЗапроса.Вставить("Данные", ДанныеОтвета);
		Исключение
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка разбора данных, полученных от маркетплейса. Причина: %1'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
	КонецЕсли;
	
	Если КодСостояния = 500 ИЛИ КодСостояния = 401 ИЛИ КодСостояния = 403 Тогда
		РезультатЗапроса.СообщениеОбОшибке = СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции 

Функция СообщениеОбОшибкеПоКоду(HTTPОтвет)
	КодСостояния = HTTPОтвет.КодСостояния;
	Если КодСостояния = 500 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Внутренняя ошибка на сервере Wildberries. Попробуйте позже'");
	ИначеЕсли КодСостояния = 401 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries. Проверьте тип и срок действия токена.
			|Получить новый токен API можно в личном кабинете: Профиль-Настройки-Доступ к API'");
	ИначеЕсли КодСостояния = 403 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries. Проверьте в настройках ключ API'");
	ИначеЕсли КодСостояния = 429 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Сервер API Wildberries ответил: слишком много запросов. Попробуйте позже'");
	Иначе
		ПереченьОшибок = HTTPОтвет.ПолучитьТелоКакСтроку();
		СообщенияОбОшибках = СтрШаблон(НСтр("ru = 'Ошибка получения данных из маркетплейса. Ответ сервера: %1'"), ПереченьОшибок);
	КонецЕсли;

	Возврат СообщенияОбОшибках;
КонецФункции

Функция АдресСервераКонтентWildberries()
	Возврат "content-api.wildberries.ru";
КонецФункции 

#КонецОбласти