
&НаКлиенте
Процедура СпецификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	
	
	СтандартнаяОбработка    = Ложь;
	//ФормаВыбораСпецификации = Справочники.СпецификацииНоменклатуры.ПолучитьФормуВыбора(, ЭлементФормы);
	ФормаВыбораСпецификации = ПолучитьФорму("Справочник.СпецификацииНоменклатуры.ФормаВыбора",);

	ФормаВыбораСпецификации.Отбор.СпецификацииИзделийПоНоменклатуре.ВидСравнения  = ВидСравнения.Равно;
	ФормаВыбораСпецификации.Отбор.СпецификацииИзделийПоНоменклатуре.Значение      = Объект.Номенклатура;
	ФормаВыбораСпецификации.Отбор.СпецификацииИзделийПоНоменклатуре.Использование = Истина;
	
	ФормаВыбораСпецификации.Отбор.Активная.Установить(Истина);
	Объект.Спецификация = ФормаВыбораСпецификации.ОткрытьМодально();
	
	//ОткрытьФорму(
	
	
	ЗаполнитьТаьЧасть();
	
	
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьТаьЧасть()

	Для каждого сс из Объект.Спецификация.ИсходныеКомплектующие цикл
		стр = Объект.ТабЧасть.Добавить();
		стр.Номенклатура = сс.Номенклатура;
		стр.Рецептура = сс.Количество;
	КонецЦикла
	
КонецПроцедуры	

&НаКлиенте
Процедура ТабЧастьБелки100грПриИзменении(Элемент)
	
	
	   //ТекущийЭлемент.ТекущиеДанные.Белки100гр
	
	
	
КонецПроцедуры
