
&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПериодПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Элемент.Родитель.ТекущиеДанные.Период, Перечисления.Периодичность.Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзEXCEL(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли; 
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.абс_СтратегическиеЦелиПродаж.Форма.ФормаЗагрузки", СтруктураПараметров, Объект.Ссылка);
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "абс_СтратегическиеЦелиПродаж_ЗагрузкаИзEXCEL" Тогда
		Если Объект.СоставПлана.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Заменить данные в документе?";
			Ответ = Вопрос(Текст, Режим, 0);    
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.СоставПлана.Очистить();			
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТЧДокументаПоТаблицеСервер(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблице(ЭтотОбъект, ТабДок);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректный формат таблицы загрузки: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	абс_СогласованиеДокументов.УстановитьДоступностьРедактирования(Объект.Ссылка,ЭтаФорма);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_СтратегическиеЦелиПродаж")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.СоставПлана.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СоставПлана.Очистить();			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = "";
	
	Если ПоместитьВоВременноеХранилище(ВнешнийФайл, АдресФайлаВХранилище) Тогда
	
		ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище)
	
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_СтратегическиеЦелиПродаж")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СоставПланаТерриторияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставПлана.ТекущиеДанные;
	ТекущаяСтрока.Регион =  ПолучитьБизнесРегионПоУровню(ТекущаяСтрока.Территория, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаГородПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СоставПлана.ТекущиеДанные;
	ТекущаяСтрока.Территория = ПолучитьБизнесРегионПоУровню(ТекущаяСтрока.Город, 1);
	ТекущаяСтрока.Регион = ПолучитьБизнесРегионПоУровню(ТекущаяСтрока.Город, 0);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБизнесРегионПоУровню(ТекущийРегион, Уровень)
	
	Если ТекущийРегион.Пустая() Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	ТекущийУровень = ТекущийРегион.Уровень();
	Если ТекущийУровень<Уровень Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	БизнесРегион = ТекущийРегион;
	Сч = ТекущийУровень - Уровень;
	Пока Сч>0 Цикл
		БизнесРегион = БизнесРегион.Родитель;
		Сч = Сч - 1;
	КонецЦикла;
	
	Возврат БизнесРегион;
	
КонецФункции



