
&НаСервере
Процедура УстановитьОтборУслуг(ЗначениеОтбора)
    ЭлементОтбора = СписокНоменклатуры.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Услуга");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборУслуг(Параметры.ПодбиратьУслуги);
	ЭтаФорма.ЗакрыватьПриВыборе=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	СтруктураПодбора=Новый Структура;
	СтруктураПодбора.Вставить("Номенклатура",Элемент.ВыделенныеСтроки);
	ОповеститьОВыборе(СтруктураПодбора);
КонецПроцедуры
