////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Возвращает числовой код для печати штрихкода
//
//	Параметры:
//		Ссылка - ЛюбаяСсылка - ссылка на объект, по которому нужно получить код
//	Возвращаемое значение:
//		Строка - строка из чисел, соотвествующая переданной ссылке
//
Функция ЧисловойКодПоСсылке(Ссылка) Экспорт
	//+Лео Сафонов ЕА 
	//Добавляем к штрих коду последние 4 символа суммы документа для контроля
	//
	//ШестнадчатиричноеЧисло = СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()),"-","");
	//Возврат ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(ШестнадчатиричноеЧисло);
	
	ШестнадчатиричноеЧисло = СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()),"-","");
	ЧисловойКод = ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(ШестнадчатиричноеЧисло);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если Ссылка.дата > Дата("20180116") Тогда
			СтрокаСуммы = СтрЗаменить(Строка(формат(Ссылка.СуммаДокумента,"ЧДЦ=2")),",","");
			СтрокаСуммы = СтрЗаменить(СтрокаСуммы," ","");
			СтрокаСуммы = Прав(СтрокаСуммы, 6); 
			Пока СтрДлина(СтрокаСуммы) < 6 цикл
				СтрокаСуммы = "0" + СтрокаСуммы;	
			КонецЦикла;
			
			ЧисловойКод = ЧисловойКод +  СтрокаСуммы;
			//СтрДлина (ЧисловойКод)
			//СтрДлина (ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Число(ЧисловойКод)))
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЧисловойКод;
	//-Лео Сафонов ЕА
КонецФункции

Функция ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры = Неопределено) Экспорт
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Штрихкод, Ложь, Ложь) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	//+Лео Сафонов ЕА 
	//Добавляем к штрих коду последние 6 символа суммы документа для контроля

	//ШтрихкодВШестнаднадцатиричномВиде = ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Число(Штрихкод));
	//Пока СтрДлина(ШтрихкодВШестнаднадцатиричномВиде) < 32 Цикл
	//	ШтрихкодВШестнаднадцатиричномВиде = "0" + ШтрихкодВШестнаднадцатиричномВиде;
	//КонецЦикла;
	КонтролироватьПоСумме = Ложь;
	ШтрихкодВШестнаднадцатиричномВиде = ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Число(Штрихкод));
	Если СтрДлина(ШтрихкодВШестнаднадцатиричномВиде) > 32 тогда
		КонтролироватьПоСумме = Истина;
		КонтрольнаяСумма = Прав(Штрихкод,6);
		Штрихкод         = Лев(Штрихкод, СтрДлина(Штрихкод)-6); 
		
		ШтрихкодВШестнаднадцатиричномВиде = ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Число(Штрихкод));
	КонецЕсли;	
	Пока СтрДлина(ШтрихкодВШестнаднадцатиричномВиде) < 32 Цикл
		ШтрихкодВШестнаднадцатиричномВиде = "0" + ШтрихкодВШестнаднадцатиричномВиде;
	КонецЦикла;
    //-Лео Сафонов ЕА 
	
	Идентификатор =
	        Сред(ШтрихкодВШестнаднадцатиричномВиде, 1,  8)
	+ "-" + Сред(ШтрихкодВШестнаднадцатиричномВиде, 9,  4)
	+ "-" + Сред(ШтрихкодВШестнаднадцатиричномВиде, 13, 4)
	+ "-" + Сред(ШтрихкодВШестнаднадцатиричномВиде, 17, 4)
	+ "-" + Сред(ШтрихкодВШестнаднадцатиричномВиде, 21, 12);
	
	Если СтрДлина(Идентификатор) <> 36 Тогда		
		Возврат Новый Массив;
	КонецЕсли;
	
	//АБС ИЗМЕНЕНО Фролов 15.07.2014
	// Штрихкодирование только документов реализаций
	//Если Менеджеры = Неопределено Тогда
	//	МенеджерыОбъектов = Новый Массив();
	//	Для Каждого ЭлементМетаданных Из Метаданные.Документы Цикл
	//		МенеджерыОбъектов.Добавить(Документы[ЭлементМетаданных.Имя]);
	//	КонецЦикла;
	//Иначе
	//	МенеджерыОбъектов = Новый Массив();
	//	Для Каждого ПустаяСсылка Из Менеджеры Цикл
	//		ТипСсылки = ТипЗнч(ПустаяСсылка);
	//		
	//		Если Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
	//			МенеджерыОбъектов.Добавить(Документы[ПустаяСсылка.Метаданные().Имя]);
	//			
	//		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
	//			МенеджерыОбъектов.Добавить(Справочники[ПустаяСсылка.Метаданные().Имя]);
	//			
	//		ИначеЕсли Задачи.ТипВсеСсылки(ТипСсылки) Тогда	
	//			МенеджерыОбъектов.Добавить(Задачи[ПустаяСсылка.Метаданные().Имя]);
	//			
	//		ИначеЕсли БизнесПроцессы.ТипВсеСсылки(ТипСсылки) Тогда	
	//			МенеджерыОбъектов.Добавить(БизнесПроцессы[ПустаяСсылка.Метаданные().Имя]);
	//			
	//		ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки(ТипСсылки) Тогда
	//			МенеджерыОбъектов.Добавить(ПланыВидовХарактеристик[ПустаяСсылка.Метаданные().Имя]);
	//			
	//		Иначе
	//			ТекстИсключения = НСтр("ru = 'Ошибка распознавания штрихкода: тип ""%Тип%"" не поддерживается.'");
	//			ТекстИсключения = СтрЗаменить(ТекстИсключения,"%Тип%",ТипСсылки);
	//			
	//			ВызватьИсключение ТекстИсключения;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//КонецЕсли;
	
	МенеджерыОбъектов = Новый Массив();
	МенеджерыОбъектов.Добавить(Документы["РеализацияТоваровУслуг"]);
	
	Запрос = Новый Запрос;
	
	МассивСсылок = Новый Массив;
	ПервыйЗапрос = Истина;
	Для Каждого Менеджер Из МенеджерыОбъектов Цикл
		
		//+Лео Сафонов ЕА 
		//Добавляем к штрих коду последние 4 символа суммы документа для контроля
		
		//Попытка
		//	Ссылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
		//Исключение
		//	ОбщегоНазначения.СообщитьОбОшибке("Не найден документ по идентификатору: " + Идентификатор);
		//	Продолжить;
		//КонецПопытки;
		
		Попытка
			Ссылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") и  КонтролироватьПоСумме Тогда
				СтрокаСуммы = СтрЗаменить(Строка(формат(Ссылка.СуммаДокумента,"ЧДЦ=2")),",","");
				СтрокаСуммы = СтрЗаменить(СтрокаСуммы," ","");
				СтрокаСуммы = Прав(СтрокаСуммы, 6); 
				Пока СтрДлина(СтрокаСуммы) < 6 цикл
					СтрокаСуммы = "0" + СтрокаСуммы;	
				КонецЦикла;
				
				Если СтрокаСуммы <>  КонтрольнаяСумма  Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Документ не совподает по сумме : " + Ссылка);
					Продолжить;
	            КонецЕсли;
			КонецЕсли;
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Не найден документ по идентификатору: " + Идентификатор);
			Продолжить;
		КонецПопытки;
        //-Лео Сафонов ЕА
		
		МетаданныеСсылки = Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеСсылки) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСсылок.Добавить(Ссылка);
		
		Если НЕ ПервыйЗапрос Тогда
			Запрос.Текст = Запрос.Текст + 
			"ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ" + ?(ПервыйЗапрос," " + "РАЗРЕШЕННЫЕ" + " "," ") + "Таблица.Ссылка КАК Ссылка
		|ИЗ " + МетаданныеСсылки.ПолноеИмя() + " КАК Таблица
		|ГДЕ Ссылка В (&МассивСсылок)
		|";
		
		ПервыйЗапрос = Ложь;
		
	КонецЦикла;
	
	Если Не ПервыйЗапрос Тогда
		Запрос.Параметры.Вставить("МассивСсылок", МассивСсылок);
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции

Процедура ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, Знач ОбластьМакета, Ссылка) Экспорт
	
	ВыводитьШтрихкодВОтдельнуюОбласть = Ложь;
	Если Не ЕстьКартинкаШтрихкодаВОбластиМакета(ОбластьМакета) Тогда
		// Картинки штрихкода в этой области макета нет.
		
		Если Макет.Области.Найти("ОбластьШтрихкода") <> Неопределено Тогда
			
			// Проверить картинку штрихкода в области "Штрихкод"
			ОбластьМакетаШтрихкод = Макет.ПолучитьОбласть("ОбластьШтрихкода");
			Если ЕстьКартинкаШтрихкодаВОбластиМакета(ОбластьМакетаШтрихкод) Тогда
				ОбластьМакета = ОбластьМакетаШтрихкод;
				ВыводитьШтрихкодВОтдельнуюОбласть = Истина;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШтрихкодированиеПечатныхФормОбъектов") Тогда
	//	ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.КартинкаШтрихкода);
	//	Возврат;
	//КонецЕсли;
	
	Эталон = Обработки.ПечатьЭтикеток.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(ОбластьМакета.Рисунки.КартинкаШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(ОбластьМакета.Рисунки.КартинкаШтрихкода.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ЧисловойКодПоСсылке(Ссылка)));
	ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    6);
	
	ОбластьМакета.Рисунки.КартинкаШтрихкода.Картинка = ШтрихкодированиеПечатныхФормВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	Если ВыводитьШтрихкодВОтдельнуюОбласть Тогда
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Знач ДесятичноеЧисло)
	
	Результат = "";
	
	Пока ДесятичноеЧисло > 0 цикл
		ОстатокОтДеления = ДесятичноеЧисло % 16;
		ДесятичноеЧисло  = (ДесятичноеЧисло - ОстатокОтДеления) / 16;
		Результат        = Сред("0123456789abcdef", ОстатокОтДеления + 1, 1) + Результат;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(Знач Значение)
	
	Значение = НРег(Значение);
	ДлинаСтроки = СтрДлина(Значение);
	
	Результат = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Результат = Результат * 16 + Найти("0123456789abcdef", Сред(Значение, НомерСимвола, 1)) - 1;
	КонецЦикла;
	
	Возврат Формат(Результат, "ЧГ=0");
	
КонецФункции

Функция ЕстьКартинкаШтрихкодаВОбластиМакета(ОбластьМакета)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КартинкаШтрихкода", Новый УникальныйИдентификатор);
	СтароеЗначение = СтруктураПоиска.КартинкаШтрихкода;
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ОбластьМакета.Рисунки);
	
	Возврат Не СтруктураПоиска.КартинкаШтрихкода = СтароеЗначение;
	
КонецФункции
