Функция ОбработатьСогласованиеДокументов() Экспорт
	
	//Получим этапы согласования текущего пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК МаршрутСогласования
	               |ИЗ
	               |	Справочник.абс_МаршрутыСогласованияДокументов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь";
				   
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	ЭтапыТекущегоПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаршрутСогласования");
	СоответствиеСледующиеЭтапы = Новый Соответствие();
	
	ЕстьОшибки = Ложь;
	
	УспешноОбработанныеДокументы = Новый Массив;
	
	Для Каждого СтрокаТабличнойЧасти ИЗ ДокументыДляСогласования Цикл
		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Состояние)
		//	ИЛИ (СтрокаТабличнойЧасти.ПоследнийСогласующий = ТекущийПользователь
		//		И СтрокаТабличнойЧасти.ТекущееСостояние = СтрокаТабличнойЧасти.Состояние) Тогда
		//		
		//	УспешноОбработанныеДокументы.Добавить(СтрокаТабличнойЧасти);
		//	Продолжить;
		//КонецЕсли;

		Отказ = Ложь;
		
		
		//Если статус документа - отклонен, то обязательно должен быть заполнен комментарий
		Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен
			И СокрЛП(СтрокаТабличнойЧасти.Комментарий)="" Тогда
				ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "Комментарий");
				ТекстСообщения = НСтр("ru = 'Не указан комментарий для документа &Документ.
											|Состояние документа изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля, "Объект", Отказ);
				Продолжить;
		КонецЕсли;
			
		
		//Если СтрокаТабличнойЧасти.ПоследнийСогласующий = ТекущийПользователь
		//	ИЛИ НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Этап.Родитель) Тогда
		//	
		//	НовыйЭтап = СтрокаТабличнойЧасти.Этап;
		//	
		//Иначе
			
			//Определим новый этап - это может быть следующий этап (непосредственный родитель) 
			//	или один из вышестоящих этапов
			НовыйЭтап = Неопределено;
			ОпределитьСледующийЭтапСогласования(НовыйЭтап, СтрокаТабличнойЧасти.Этап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы);
			
			//Если новый этап не удалось определить - сообщим об ошибке
			//	Такой ситуации возникать не должно.
			Если НовыйЭтап = Неопределено Тогда
				ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
				ТекстСообщения = НСтр("ru = 'Не удалось определить следующий этап согласования документа &Документ.
											|Состояние документа изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				Продолжить;
			КонецЕсли;
		//КонецЕсли;
		
		Попытка
		   НовыйУровень = НовыйЭтап.Уровень() + 1;
		Исключение   
		   НовыйУровень = СтрокаТабличнойЧасти.Этап.Уровень() + 1;
		КонецПопытки;   
		
		Если ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда  
			//Степан сообщение на электропочту
			Если НЕ СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
				ОповеститьПоМаршруту(СтрокаТабличнойЧасти.ДокументДляСогласования);
			КонецЕсли; 
			//
			//проставим новое состояние в документе
			Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован
				И НовыйУровень = 1 Тогда
				
				НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
			Иначе
				НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			КонецЕсли;
			//Обработаем состояние Отказано
			Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен
				И СтрокаТабличнойЧасти.ДокументДляСогласования.Проведен Тогда
				
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось отменить проведение документа &Документ.
												|Состояние документа изменено не будет.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				КонецПопытки;
			КонецЕсли;
			
			// Обработаем изменение состояния с Отказано на другое
			Если СтрокаТабличнойЧасти.ТекущееСостояние = Перечисления.СостоянияОбъектов.Отклонен 
				И НЕ СтрокаТабличнойЧасти.ДокументДляСогласования.Проведен Тогда
				
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
												|Состояние документа изменено не будет'");
												
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.Лео_ФиксацияСкидокПоТрейдМаркетингу") Тогда
	        //проставим новое состояние в документе
			
			     Если НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() И СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован Тогда
				
				       НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
					//{Лео Катанович 
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Отказ = Истина;
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
												|Состояние документа изменено не будет'");
												
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);

				КонецПопытки;
				//Лео Катанович}

			     Иначе
				       НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			     КонецЕсли;
        //Лео Владимир
		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.Лео_ЗаявкаНаОбразцы") Тогда
			//проставим новое состояние в документе
			Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован И НовыйУровень = 1 Тогда
				НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
			Иначе
				НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			КонецЕсли;
			//Обработаем состояние Отказано
			Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен
				И СтрокаТабличнойЧасти.ДокументДляСогласования.Проведен Тогда
				
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось отменить проведение документа &Документ.
												|Состояние документа изменено не будет.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				КонецПопытки;
			КонецЕсли;
			Если НовоеСостояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
				 НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка(); 
			КонецЕсли;	
			// Обработаем изменение состояния с Отказано на другое
			Если СтрокаТабличнойЧасти.ТекущееСостояние = Перечисления.СостоянияОбъектов.Отклонен 
				И НЕ СтрокаТабличнойЧасти.ДокументДляСогласования.Проведен Тогда
				
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
												|Состояние документа изменено не будет'");
												
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				КонецПопытки;
			КонецЕсли;
			
		Иначе
			//проставим новое состояние в документе
			//{Лео Катанович
			Если ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") Тогда
                 Если НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() И СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован Тогда
				
				       НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
			     Иначе
				       НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			     КонецЕсли;

			
			Если НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
			     Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументДляСогласования.СтатьяБюджета) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументДляСогласования.ТипСкидкиНаценки) Тогда
				      ОбщегоНазначения.СообщитьОбОшибке("Необходимо заполнить ТИП СКИДКИ и СТАТЬЮ БЮДЖЕТА в документе " + СтрокаТабличнойЧасти.ДокументДляСогласования, Истина);
					  ЕстьОшибки = Истина;
					  Продолжить;
			     КонецЕсли;	
			КонецЕсли;
			
			Если НовоеСостояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
				 НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка(); 
			КонецЕсли;	

		//Лео Катанович}

				
			Иначе
				Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован
				И НовыйУровень = 1 Тогда
				
				  НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
			    Иначе
				   НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			    КонецЕсли;
			КонецЕсли;
			
			Попытка
				ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
				ДокОбъект.Заблокировать();
				ДокОбъект.Состояние=НовоеСостояние;
				Если НовоеСостояние=Перечисления.СостоянияОбъектов.Утвержден Тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					//{Лео Катанович
					Если ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") Тогда
						 Если НовоеСостояние = Перечисления.СостоянияОбъектов.Согласован И СтрокаТабличнойЧасти.Этап = Справочники.абс_МаршрутыСогласованияДокументов.НайтиПоНаименованию("Согласование трейдмаркетологом") И НЕ ЗначениеЗаполнено(ДокОбъект.НомерТМА) Тогда
				              ДокОбъект.НомерТМА = СформироватьНомерТМА(СтрокаТабличнойЧасти.ДокументДляСогласования);
			             КонецЕсли;
 					КонецЕсли;	
					//Лео Катанович}
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			Исключение
				ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
				|Состояние документа изменено не будет'");
				
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
			КонецПопытки;
	
		КонецЕсли;
		
		
		Если Отказ Тогда
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
	
		//Изменим состояние документа в регистре
		НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(СтрокаТабличнойЧасти.ДокументДляСогласования);
		НаборЗаписейСостояниеСогласования.Прочитать();
		
		//Проверим последнюю запись - если она относится к тому же пользователю и этапу, удалим ее
		Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
			ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
			Если ПоследняяЗапись.Пользователь = ТекущийПользователь
				И ПоследняяЗапись.Этап = НовыйЭтап Тогда
				
				НаборЗаписейСостояниеСогласования.Удалить(ПоследняяЗапись);
			КонецЕсли;
		КонецЕсли;

		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.ДокументДляСогласования= СтрокаТабличнойЧасти.ДокументДляСогласования;
		НоваяЗапись.Пользователь = ТекущийПользователь;
		НоваяЗапись.Состояние = НовоеСостояние;
		НоваяЗапись.Уровень= НовыйУровень;
		НоваяЗапись.Этап = НовыйЭтап;
		НоваяЗапись.Комментарий = СтрокаТабличнойЧасти.Комментарий;
		НоваяЗапись.ТекущийЭтап = СтрокаТабличнойЧасти.Этап;
 		НаборЗаписейСостояниеСогласования.Записать();
		
		УспешноОбработанныеДокументы.Добавить(СтрокаТабличнойЧасти);
		
		// {Лео Катанович
		СформироватьЗадачуСотруднику(НоваяЗапись.ДокументДляСогласования, НовыйЭтап, НовоеСостояние);
		// Лео Катанович}
		
	КонецЦикла;
	
	// Удалим из списка документы по которым удалось изменить состояние
	Для каждого ЭлКоллекции Из УспешноОбработанныеДокументы Цикл
		ДокументыДляСогласования.Удалить(ЭлКоллекции);
	КонецЦикла; 
	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции
        

//Процедура определяет этап согласования, который соответствует маршруту согласования и текущему пользователю
Процедура ОпределитьСледующийЭтапСогласования(НовыйЭтап, ТекущийЭтап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
	
	НовыйЭтап = ТекущийЭтап.Родитель;
	
	//НовыйЭтап = СоответствиеСледующиеЭтапы.Получить(ТекущийЭтап);
	//
	//Если НовыйЭтап = Неопределено Тогда
	//	Если ЭтапыТекущегоПользователя.Найти(ТекущийЭтап)<>Неопределено Тогда
	//		НовыйЭтап = ТекущийЭтап;
	//		СоответствиеСледующиеЭтапы.Вставить(ТекущийЭтап, НовыйЭтап);
	//	ИначеЕсли ЗначениеЗаполнено(ТекущийЭтап.Родитель) Тогда
	//		ОпределитьСледующийЭтапСогласования(НовыйЭтап, ТекущийЭтап.Родитель, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

 //{Катанович
Функция СформироватьНомерТМА(ТекДокумент)
    НовыйНомер = "";
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	МАКСИМУМ(Лео_ЗаявкаНаАкцию.НомерТМА) КАК НомерТМА
	                |ИЗ
	                |	Документ.Лео_ЗаявкаНаАкцию КАК Лео_ЗаявкаНаАкцию
	                |ГДЕ
	                |	Лео_ЗаявкаНаАкцию.ПометкаУдаления = ЛОЖЬ
	                |	И (Лео_ЗаявкаНаАкцию.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Согласован)
	                |			ИЛИ Лео_ЗаявкаНаАкцию.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Утвержден)
	                |			ИЛИ Лео_ЗаявкаНаАкцию.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Лео_ОтправленНаДоработку))
	                |	И Лео_ЗаявкаНаАкцию.ВидКомпенсации = &ВидКомпенсации
	                |	И Лео_ЗаявкаНаАкцию.Ссылка <> &СсылкаДок" ;
					Запрос.УстановитьПараметр("ВидКомпенсации", ТекДокумент.ВидКомпенсации);
					Запрос.УстановитьПараметр("СсылкаДок", ТекДокумент.Ссылка);

					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						// НовыйНомер = РегламентированнаяОтчетность.ДополнитьСтроку(Строка(Число(Лев(?(ЗначениеЗаполнено(Выборка.НомерТМА),Выборка.НомерТМА,"0000"),4)) + 1), 4, "0") + Лев(ТекДокумент.ВидКомпенсации,1);
						ДлинаНомера = СтрДлина(Выборка.НомерТМА);
						НовыйНомер = Строка(Число(Лев(Выборка.НомерТМА,ДлинаНомера-1))+1) + Лев(ТекДокумент.ВидКомпенсации,1);
						НовыйНомер = ОбработатьИмяКолонки(НовыйНомер);
						НовыйНомер = РегламентированнаяОтчетность.ДополнитьСтроку(НовыйНомер,5,"0");
							
					Иначе
		                НовыйНомер = "0001"+Лев(ТекДокумент.ВидКомпенсации,1);
                    КонецЕсли;	
 
 Возврат НовыйНомер;
КонецФункции


Функция ОбработатьИмяКолонки(ИмяКолонки) Экспорт 
	Результат = ИмяКолонки;
	Результат = СтрЗаменить(Результат," ","");
	Результат = СтрЗаменить(Результат,"-","");
	Результат = СтрЗаменить(Результат,"(","");
	Результат = СтрЗаменить(Результат,")","");
	//Результат = СтрЗаменить(Результат,",","");
	Результат = СтрЗаменить(Результат,"$","");	
	Результат = СтрЗаменить(Результат,"#","");
	Результат = СтрЗаменить(Результат,"/",""); 	
	Результат = СтрЗаменить(Результат,"№",""); 	
	Результат = СтрЗаменить(Результат,"+","");
	Результат = СтрЗаменить(Результат,"%",""); 	
	Результат = СтрЗаменить(Результат,".",""); 	
	Результат = СтрЗаменить(Результат,":",""); 	
	Результат = СтрЗаменить(Результат,";",""); 	
	Результат = СтрЗаменить(Результат,">",""); 	
	Результат = СтрЗаменить(Результат,"<",""); 	
	Результат = СтрЗаменить(Результат,"!",""); 		
	Результат = СтрЗаменить(Результат,"?",""); 		
	Результат = СтрЗаменить(Результат,"*",""); 		
	Результат = СтрЗаменить(Результат,"@",""); 		
	Результат = СтрЗаменить(Результат,"^","");
	Результат = СтрЗаменить(Результат,"`","");
	Результат = СтрЗаменить(Результат,"~","");
	Результат = СтрЗаменить(Результат,"=","");
	Результат = СтрЗаменить(Результат,"'","");
	Результат = СтрЗаменить(Результат,",","");
	Результат = СтрЗаменить(Результат,Символы.ВК,  "");
	Результат = СтрЗаменить(Результат,Символы.ВТаб,"");	
	Результат = СтрЗаменить(Результат,Символы.НПП, "");	
	Результат = СтрЗаменить(Результат,Символы.ПС,  "");
	Результат = СтрЗаменить(Результат,Символы.ПФ,  "");
	Результат = СтрЗаменить(Результат,Символы.Таб, "");
	Результат = СтрЗаменить(Результат,Символ(7),   ""); 
	Результат = СтрЗаменить(Результат,"¶",         ""); 
	
	Результат = ?(СокрЛП(Результат) = "","_",СокрЛП(Результат));
	Возврат Результат;
КонецФункции


Процедура СформироватьЗадачуСотруднику(ДокументСсылка, НовыйЭтап, НовоеСостояние) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лео_ФиксацияСкидокПоТрейдМаркетингу") ИЛИ  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лео_ЗаявкаНаОбразцы") Тогда
	//ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда  
	Иначе
		Возврат;
	КонецЕсли;
	   
	   Если НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() Тогда
		   Если НовоеСостояние =  Перечисления.СостоянияОбъектов.Утвержден Тогда
			   Попытка
			   Если ДокументСсылка.ВидКомпенсации = "Автоматическая скидка" Тогда // Только для автоматической скидки
			        НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.НайтиПоНаименованию("Установить скидки по ТМА"); 
			        Для Каждого СтрокаИсполнителя из НовыйЭтап.СогласующиеЛица Цикл
				         НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
				         НоваяЗадача.Дата			= ТекущаяДата();
				         НоваяЗадача.ВидЗадачи    = Справочники.ВидыЗадачПользователей.Исполнение;
				         НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
				         НоваяЗадача.Наименование	= "Отразить в учете скидки по документу:" + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование;
				         НоваяЗадача.Исполнитель  = СтрокаИсполнителя.Пользователь;
				         НоваяЗадача.Уровень      = НовыйЭтап.Уровень();
				         НоваяЗадача.Записать();
			         КонецЦикла;	
				 КонецЕсли;
			 Исключение
				 
			 КонецПопытки;	 
			ИначеЕсли НовоеСостояние =  Перечисления.СостоянияОбъектов.Отклонен Тогда
                НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
				НоваяЗадача.Дата			= ТекущаяДата();
				НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
				НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
		        НоваяЗадача.Наименование	= "Ознакомиться с результатом согласования документа: " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
				НоваяЗадача.Исполнитель	    = ДокументСсылка.Ответственный;
				//НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
				НоваяЗадача.Записать();
		   КонецЕсли;    				  
		   Возврат;	 
	   КонецЕсли;	 
	   
	   
	  // Если НовыйЭтап.СогласующиеЛица.Найти(ДокументСсылка.Ответственный) = Неопределено Тогда
	  
	  
	  
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лео_ФиксацияСкидокПоТрейдМаркетингу") Тогда
		    Для Каждого СтрокаИсполнителя из НовыйЭтап.СогласующиеЛица Цикл
				НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
				НоваяЗадача.Дата			= ТекущаяДата();
				НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
				НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
		        НоваяЗадача.Наименование	= "Согласовать документ " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
				НоваяЗадача.Исполнитель	    = СтрокаИсполнителя.Пользователь;
				НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
				НоваяЗадача.Записать();
			КонецЦикла;	

		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") Тогда	  
	   		Если НовыйЭтап.СогласующиеЛица.Найти(ДокументСсылка.МенеджерРег) = Неопределено Тогда
		   
		  		Для Каждого СтрокаИсполнителя из НовыйЭтап.СогласующиеЛица Цикл
					НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
					НоваяЗадача.Дата			= ТекущаяДата();
					НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
					НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
			        НоваяЗадача.Наименование	= "Согласовать документ " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
					НоваяЗадача.Исполнитель	    = СтрокаИсполнителя.Пользователь;
					НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
					НоваяЗадача.Записать();
				
				КонецЦикла;	
			Иначе   // Только ответственному менеджеру
			
				НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
				НоваяЗадача.Дата			= ТекущаяДата();
				НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
				НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
		        НоваяЗадача.Наименование	= "Согласовать документ " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
				НоваяЗадача.Исполнитель	    = ДокументСсылка.Ответственный;
				НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
				НоваяЗадача.Записать();
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Лео_ЗаявкаНаОбразцы") Тогда
		    Для Каждого СтрокаИсполнителя из НовыйЭтап.СогласующиеЛица Цикл
				НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
				НоваяЗадача.Дата			= ТекущаяДата();
				НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
				НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
		        НоваяЗадача.Наименование	= "Согласовать документ " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
				НоваяЗадача.Исполнитель	    = СтрокаИсполнителя.Пользователь;
				НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
				НоваяЗадача.Записать();
			КонецЦикла;
			
		КонецЕсли;	
КонецПроцедуры
//Лео Катанович}    
//Степан сообщение на электропочту
//////////////////////////////////////////////////////////////////////////
Функция ЭлектронныйАдресПользователя(Пользователь)
	
	ЭлектронныйАдрес = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Пользователь
	|	И КонтактнаяИнформация.Тип  = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) 
    |"; 
	Запрос.УстановитьПараметр("Пользователь",Пользователь); 
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда 
		ЭлектронныйАдрес = Рез[0].Представление;	
	КонецЕсли;
	Возврат ЭлектронныйАдрес;
	
КонецФункции

Процедура ОповеститьПоМаршруту(Док) 
	
	Если НЕ СтрокаСоединенияИнформационнойБазы() = "Srvr=""192.168.100.106"";Ref=""upp83"";"  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда				 
		Если НЕ РольДоступна("ПравоИспользованияЭлектроннойПочты") Тогда				 
			Возврат;
	 	КонецЕсли; 
 	КонецЕсли; 

	//СписокДоступныхЗаписей = УправлениеЭлектроннойПочтой.ПроверитьУчетныеЗаписиДляОтправкиПисем(глЗначениеПеременной("глТекущийПользователь"),Истина,Ложь);
	//Если СписокДоступныхЗаписей.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли; 
	
	//Если СтрокаСоединенияИнформационнойБазы() = "Srvr=""192.168.100.106"";Ref=""test_SD1"";"  Тогда
	//	сообщить("Это отправка из копии базы -> "+СтрокаСоединенияИнформационнойБазы());                 
	//КонецЕсли;

	МассивАдресов = Новый Массив;
	//СписокРассылки = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние,
	|	абс_СостоянияСогласованияДокументовСрезПоследних.Этап
	|ИЗ
	|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
	
	Запрос.УстановитьПараметр("Ссылка",Док);
	
	ТЗСостоянияСогласования = Запрос.Выполнить().Выгрузить();  
	
	Если ТЗСостоянияСогласования.Количество() > 0 Тогда 
		Если НЕ ТЗСостоянияСогласования[0].Состояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
			Для каждого Сотр из ТЗСостоянияСогласования[0].Этап.СогласующиеЛица Цикл
				Если Сотр.ДатаДействия = Дата(1, 1, 1) ИЛИ Сотр.ДатаДействия > Док.Дата Тогда 
					Если НЕ Сотр.Пользователь = глЗначениеПеременной("глТекущийПользователь") Тогда 
						ЭлектронныйАдрес = ЭлектронныйАдресПользователя(Сотр.Пользователь); 
						Если EmailValid(ЭлектронныйАдрес) И ИспользоватьНапоминания(Сотр.Пользователь) Тогда
							МассивАдресов.Добавить(ЭлектронныйАдрес);
						Иначе
							//сообщить("у пользователя " + Сотр.Пользователь + " нет электронного адреса!");                 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			//МассивАдресов.Добавить("ikatanovich@leovit.ru");
			//МассивАдресов.Добавить("sdekin@leovit.ru");
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если МассивАдресов.Количество() = 0 Тогда 
		Возврат; 
	КонецЕсли;
	
	ТемаПисьма = "ЗРС "+Док.Номер;
	Если УжеОтправленоСегодня(ТемаПисьма) Тогда  
		Возврат; 
	КонецЕсли;
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "ЗРС "+Док.Номер);
	
	ТекстПисьма = "";
	//ТекстПисьма = "Здравствуйте, коллеги! <BR> <BR>";
    ТекстПисьма = ТекстПисьма +  "Поступила заявка:" + Док.Номер + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Инициатор:       " + Док.Ответственный + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Контрагент:      " + Док.Контрагент + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Сумма:           " + Док.СуммаДокумента + " " + Док.ВалютаДокумента.Наименование + "<BR>"; 
	//Если абс_СверхЛимита Тогда  
	//    ТекстПисьма = ТекстПисьма +  "Сверх лимита <BR>";
	//КонецЕсли;
    ТекстПисьма = ТекстПисьма +  "Описание:        " + Док.Описание + "<BR>";
    ТекстПисьма = ТекстПисьма +  "из обработки согласования" + "<BR>";

	//Для каждого Адр Из СписокРассылки Цикл
	//    ТекстПисьма = ТекстПисьма + Адр + "<BR>";
	//КонецЦикла;
	
    СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	//	Если МассивФайлов.Количество()>0 Тогда
	//	
	//	СписокФайловВложений = Новый СписокЗначений;
	//	
	//	Для каждого Файл из МассивФайлов Цикл
	//		ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(Файл);
	//		
	//		ФайлВложения = СписокФайловВложений.Добавить();
	//		
	//		СтруктураВложения  = Новый Структура();
	//		
	//		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл);
	//		СтруктураВложения.Вставить("Хранилище", ДвоичныеДанныеФайла);
	//		
	//		СтруктураВложения.Вставить("ИмяФайла", ИмяФайла);
	//		
	//		ФайлВложения.Значение = СтруктураВложения;
	//	КонецЦикла;
	//	
	//	СтруктураПараметров.Вставить("СписокФайловВложений", СписокФайловВложений);
	//КонецЕсли;
	
	Попытка   
		
		УстановитьПривилегированныйРежим(Истина);
		СтруктураПисьма = НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
		ЭлектронныеПисьма = Новый Соответствие;
		
		ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		
		ИзмененныйСоставПисем = Новый Соответствие;	
		ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
		Для каждого Письмо Из ЭлектронныеПисьма Цикл
			Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
				ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
				
				ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
					
					ОбъектПисьмо.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			
				Попытка
					ОбъектПисьмо.Записать();
				Исключение
					Продолжить;;
				КонецПопытки;
			Иначе
				Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
					Письмо.Значение.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			КонецЕсли; 
		    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	
	Исключение
		Возврат;
	КонецПопытки;	
		
	ТекстОшибок = "";	
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ,,
		ИзмененныйСоставПисем, Истина , , Ложь,ТекстОшибок );
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
	КонецПопытки;	

КонецПроцедуры

Функция EmailValid(Адрес)
	
    //Адрес = "test@me@gmail.narod.am";

    ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";

    Цифры = "0123456789";

    //ищем крайний справа символ @ для правильного выделения локальной и доменной части

    ИндексСобаки = Найти(Адрес,"@");

    //1. строка адреса вообще не содержит разделителя

    Если ИндексСобаки = 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    УрезаемаяСтрока = Сред(Адрес, ИндексСобаки+1);

    Пока Найти(УрезаемаяСтрока,"@") > 0 Цикл

        ИндексСобаки = ИндексСобаки + Найти(УрезаемаяСтрока,"@");

        УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);

    КонецЦикла;

    ДоменнаяЧасть = Сред(Адрес, ИндексСобаки+1);

    ЛокальнаяЧасть = Лев(Адрес, ИндексСобаки-1);

    //2. Проверяем длину локальной части

    Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //3. Проверяем длину доменной части

    Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //4. Проверяем что локальная части не начинается и не заканчивается на "."

    Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //5. Локальная части не содержит 2 или более "." подряд

    Если Найти(ЛокальнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //Проверка доменной части

    //6. Доменная часть не начинается с точки

    Если Лев(ДоменнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //7. Доменная часть не содержит 2 или более "." подряд

    Если Найти(ДоменнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //8. Проверка частей доменной части

    //каждая часть начинается с буквы и заканчивается буквой или цифрой

    //каждая часть длиной не более 63 символов

    ИдентификаторыДоменнойЧасти = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДоменнаяЧасть, ".");

    Для Каждого ИдентификаторДомена ИЗ ИдентификаторыДоменнойЧасти Цикл

        Если СтрДлина(ИдентификаторДомена) > 63 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0

            //для доменов, нарушающих RFC 1035 п.2.3.1, например @1c.ru :)

            И Найти(Цифры, Лев(ИдентификаторДомена,1)) = 0

            Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

    КонецЦикла;

    Возврат ИСТИНА;

КонецФункции

Функция ИспользоватьНапоминания(Пользователь)
	
	ИспользоватьНапомининия = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	       Наименование,
		|	       ЗначениеНастроек.Значение
		|	   ИЗ
		|	       ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
		|	   ЛЕВОЕ СОЕДИНЕНИЕ
		|	       РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
		|	   ПО
		|	       ЗначениеНастроек.Настройка=Настройки.Ссылка
		|	       И  ЗначениеНастроек.Пользователь=&Пользователь
		|	   ГДЕ
		|	       НЕ ПометкаУдаления
		|	       И Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьНапоминания)
		|";
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		ИспользоватьНапомининия = ТЗ[0].Значение;
	КонецЕсли;
	Возврат ИспользоватьНапомининия;
	
КонецФункции

Функция УжеОтправленоСегодня(Тема)
	
	УжеОтправлено = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмо.ДатаОтправления,
	               |	ЭлектронноеПисьмо.СтатусПисьма,
	               |	ЭлектронноеПисьмо.Тема
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	               |ГДЕ
	               |	ЭлектронноеПисьмо.Тема = &Тема
	               |	И ЭлектронноеПисьмо.ДатаОтправления МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |	И ЭлектронноеПисьмо.СтатусПисьма = &СтатусПисьма";
	Запрос.УстановитьПараметр("Тема",Тема);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусПисьма",Перечисления.СтатусыПисем.Отправленное);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		УжеОтправлено = Истина;
	КонецЕсли;
	Возврат УжеОтправлено;
	
КонецФункции

// Функция обрабатывает пользовательское событие - создание нового электронного письма.
// 
// Параметры:
//  ТекущийПользователь          - СправочникСсылка.Пользователи, текущий пользователь
//  СтруктураНовогоПисьма        - Структура с данными нового письма
//    Ключи структуры:
//     Тело                 - строка, текст письма (прочтой текст, или текст в формате ХТМЛ)
//     Тема                 - Строка
//     ВидТекста            - ПеречислениеСсылка.ВидыТекстовЭлектронныхПисем, вид текста нового письма
//     СписокФайловВложений - СписокЗначений, где значения - структура параметров и знаяений для создания
//                            нового элемента справочника ВложенияЭлектронныхПисем, ключи структуры
//                            соответствуют именам реквизитов справочника ВложенияЭлектронныхПисем
//     УчетнаяЗапись        - СправочникСсылка.УчетнаяЗапись, учетная запись нового письма
//     Кому                 - Список значений, значение - адрес эл.почты, представление - представление получателя
//     Копии                - Список значений, значение - адрес эл.почты, представление - представление получателя
//     СкрытыеКопии         - Список значений, значение - адрес эл.почты, представление - представление получателя
//     Основание            - ДокументСсылка.ЭлектронноеПисьмо, ДокументСсылка.Событие
//     ГруппаУчетнойЗаписи  - элемент справочника ГруппыПисемЭлектроннойПочты, группа писем для нового письма
//     Ответственный        - элемент справочника Пользователи, ответственный для запоолнения в письме
//     КодировкаПисьма      - строка, задает кодировку письма, кроме ответов, переадресаций и скопированных писем,
//                            т.е. писем с определенным объектом-основанием
//
//  ПеренестиВложенияИзОснования - Булево, переносить ли аттачи письма из основания (действует для копирования и пересылки)
//  Копирование                  - булево, признак копирования электронного письма
//  ТекущийЭлементХТМЛ           - Булево, устанавливать в качестве активного элемента в открытой форме письма поле ХТМЛ(Текстового) документа
//  Дополнительно                - Строка, "Ответ", "Переадресация", вид действия при создании нового письма
//  ФормаВладелец                - Форма, владелец для открываемой формы нового письма
//  ПодписьПодТекстом            - Булево, устанавливать подпись в письме "после" или "перед" текстом.
//  ОткрыватьПисьмо              - Булево, открывать форму письма или записывать письмо и не открывать форму
//
//  ВозвращаемреЗначение
//   СтруктураПараметров - Структура
//     Ключи структуры:
//     Письмо       - ДокументОбъект.ЭлектронноеПисьмо, новое электронное письмо
//     Форма        - Форма, форма нового электронного письма
//     ПисьмоСсылка - ДокументСсылка.ЭлектронноеПисьмо, новое электронное письмо
//
Функция НаписатьПисьмо(ТекущийПользователь, СтруктураНовогоПисьма = Неопределено, ПеренестиВложенияИзОснования = Ложь, Копирование = Ложь,
					   ТекущийЭлементХТМЛ = Ложь, Дополнительно = Неопределено, ФормаВладелец = Неопределено, ПодписьПодТекстом = Ложь,
					   ОткрыватьПисьмо = Истина)

	Перем УчетнаяЗапись;
	Перем Тема;
	Перем Тело;
	Перем ВидТекста;
	Перем СписокФайловВложений;
	Перем ГруппаУчетнойЗаписи;
	Перем Кому;
	Перем Копии;
	Перем СкрытыеКопии;
	Перем Основание;
	Перем Ответственный;
	Перем ПредметКонтакта;
	Перем КодировкаПисьма;
	Перем ЗаявкаКандидата;
	
	Если СтруктураНовогоПисьма = Неопределено Тогда
		СтруктураНовогоПисьма = Новый Структура;
	КонецЕсли; 
	
	// Определим учетную запись для создания письма
	
	СписокДоступныхЗаписей = Новый СписокЗначений;
	СписокДоступныхЗаписей.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	//СписокДоступныхЗаписей = ПроверитьУчетныеЗаписиДляОтправкиПисем(ТекущийПользователь);
	Если СписокДоступныхЗаписей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("УчетнаяЗапись", УчетнаяЗапись);
	Если ЗначениеЗаполнено(УчетнаяЗапись) И СписокДоступныхЗаписей.НайтиПоЗначению(УчетнаяЗапись) = Неопределено Тогда
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяУчетнаяЗапись");
		Если СписокДоступныхЗаписей.НайтиПоЗначению(УчетнаяЗапись) = Неопределено Тогда
			УчетнаяЗапись = Неопределено;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = СписокДоступныхЗаписей[0].Значение;
	КонецЕсли;
	
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.Дата                             = ТекущаяДата();
	Письмо.УчетнаяЗапись                    = УчетнаяЗапись;
	Письмо.ОтправительИмя                   = УчетнаяЗапись.Наименование;
	Письмо.ОтправительАдресЭлектроннойПочты = УчетнаяЗапись.АдресЭлектроннойПочты;
	Письмо.ОтправительПредставление         = УчетнаяЗапись.Наименование + " <" + УчетнаяЗапись.АдресЭлектроннойПочты + ">";
	
	СтруктураНовогоПисьма.Свойство("СписокФайловВложений", СписокФайловВложений);
	
	ОписаниеТиповПредмета = Новый ОписаниеТипов("Строка");
	СтруктураНовогоПисьма.Свойство("Основание", Основание);
	ЕстьДокументОснование = Ложь;
	Если Основание <> Неопределено Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) Тогда
			ЕстьДокументОснование = Не Основание.Пустая();
		Иначе
			ЕстьДокументОснование = Не Основание.Ссылка.Пустая();
		КонецЕсли;
	КонецЕсли;
	Если ЕстьДокументОснование Тогда
		Письмо.ОснованиеПисьма = ?(Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)), Основание, Основание.Ссылка);
		Если ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			Письмо.мОбъектОснование = Основание;
		КонецЕсли; 
		Если Письмо.УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам Тогда
			СтруктураНовогоПисьма.Свойство("ПредметКонтакта", ПредметКонтакта);
			Если ЗначениеЗаполнено(ПредметКонтакта) И ОписаниеТиповПредмета.СодержитТип(ТипЗнч(ПредметКонтакта)) Тогда
				Письмо.ПредметКонтакта = ПредметКонтакта;
			Иначе
				Если Письмо.УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
					Письмо.ПредметКонтакта = Основание.ПредметКонтакта;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЕстьДокументОснование
	   И УчетнаяЗапись.ФорматПисьмаДляОтветовИПереадресацийБратьИзИсходного
	   И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
		ВидТекста = Основание.ВидТекстаПисьма;
	Иначе
		СтруктураНовогоПисьма.Свойство("ВидТекста", ВидТекста);
	КонецЕсли;
	
	Если ЕстьДокументОснование
	   И УчетнаяЗапись.КодировкуПисьмаДляОтветовБратьИзИсходного
	   И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
		КодировкаПисьма = Основание.КодировкаПисьма;
	Иначе
		СтруктураНовогоПисьма.Свойство("КодировкаПисьма", КодировкаПисьма);
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("ЗаявкаКандидата", ЗаявкаКандидата);
	Если ЗначениеЗаполнено(ЗаявкаКандидата) Тогда
		Письмо.ЗаявкаКандидата = ЗаявкаКандидата;
	ИначеЕсли ЕстьДокументОснование Тогда
		Письмо.ЗаявкаКандидата = Основание.ЗаявкаКандидата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидТекста) Тогда
		Письмо.ВидТекстаПисьма = УчетнаяЗапись.ФорматТекстаПисьмаПоУмолчанию;
		Если НЕ ЗначениеЗаполнено(Письмо.ВидТекстаПисьма) Тогда
			Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
		КонецЕсли;
	Иначе
		Письмо.ВидТекстаПисьма = ВидТекста;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодировкаПисьма) Тогда
		Письмо.КодировкаПисьма = КодировкаПисьма;
	Иначе
		Письмо.КодировкаПисьма = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "КодировкаПисьмаЭлектроннойПочтыПоУмолчанию");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Письмо.КодировкаПисьма) Тогда
		Письмо.КодировкаПисьма = "utf-8";
	КонецЕсли;
	
	Если Дополнительно = "Ответ" Тогда
		Письмо.Ответ         = Истина;
	ИначеЕсли Дополнительно = "Переадресация" Тогда
		Письмо.Переадресация = Истина;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Тело", Тело);
	Если ЗначениеЗаполнено(Тело) Тогда
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			Письмо.ТекстПисьма = "<HTML><HEAD>
								 |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + ?(ЗначениеЗаполнено(Письмо.КодировкаПисьма), Письмо.КодировкаПисьма, "utf-8") + """" + ">
								 |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
								 |<BODY><DIV>" + Тело + "</DIV></BODY></HTML>";
			
		Иначе
			Письмо.ТекстПисьма = Тело;
			
		КонецЕсли;
	Иначе
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			Письмо.ТекстПисьма = "<HTML><HEAD>
								 |<META http-equiv=Content-Type content=""text/html; charset=" + ?(ЗначениеЗаполнено(Письмо.КодировкаПисьма), Письмо.КодировкаПисьма, "utf-8") + """" + ">
								 |<META content=""MSHTML 6.00.2900.2912"" name=GENERATOR></HEAD>
								 |<BODY><DIV></DIV></BODY></HTML>";
			
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("Тема", Тема);
	Если ЗначениеЗаполнено(Тема) Тогда
		Письмо.Тема = Тема;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
			
			Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				Тело = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY>" + Основание.СодержаниеСобытия + "</BODY></HTML>";
			Иначе
				Тело = Основание.СодержаниеСобытия;
			КонецЕсли
			
		Иначе
			
			Тело = Основание.ТекстПисьма;
			
			Если ((Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками)
			   И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.HTML И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками)
			   ИЛИ ((Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Прочее)
			   И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.Текст И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.Прочее) Тогда

				Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
					
					Тело = "<HTML><HEAD>
								  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
								  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
								  |<BODY>" + Тело + "</BODY></HTML>";
					
				Иначе
					
					//Тело = ПреобразоватьТекстИзХТМЛФорматаВПростой(Тело);
					
				КонецЕсли; 
			
			КонецЕсли; 
			
		КонецЕсли; 
		
		Письмо.ТекстПисьма = Тело;
		
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("ГруппаУчетнойЗаписи", ГруппаУчетнойЗаписи);
	Если ЗначениеЗаполнено(ГруппаУчетнойЗаписи) И ГруппаУчетнойЗаписи.Владелец = УчетнаяЗапись Тогда
		Письмо.ГруппаУчетнойЗаписи = ГруппаУчетнойЗаписи;
	Иначе
		Письмо.УказатьГруппуПоУмолчанию();
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Ответственный", Ответственный);
	Если ЗначениеЗаполнено(Ответственный) Тогда
		Письмо.Ответственный = Ответственный;
	Иначе
		Письмо.Ответственный = ТекущийПользователь;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Кому", Кому);
	Если ТипЗнч(Кому) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из Кому Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.КомуТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.Кому) Тогда
				Письмо.Кому = Письмо.Кому + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.Кому = Письмо.Кому + ЭлементСписка.Значение;
			Иначе
				Письмо.Кому = Письмо.Кому + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	Письмо.КомуПредставление = ПолучитьПредставлениеПолучателей(Письмо.КомуТЧ);

	СтруктураНовогоПисьма.Свойство("Копии", Копии);
	Если ТипЗнч(Копии) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из Копии Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.КопииТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.Копии) Тогда
				Письмо.Копии = Письмо.Копии + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.Копии = Письмо.Копии + ЭлементСписка.Значение;
			Иначе
				Письмо.Копии = Письмо.Копии + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	Письмо.КопииПредставление = ПолучитьПредставлениеПолучателей(Письмо.КопииТЧ);

	СтруктураНовогоПисьма.Свойство("СкрытыеКопии", СкрытыеКопии);
	Если ТипЗнч(СкрытыеКопии) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из СкрытыеКопии Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.СкрытыеКопииТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.СкрытыеКопии) Тогда
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ЭлементСписка.Значение;
			Иначе
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ФормаВладелец <> Неопределено Тогда
		ФормаПисьма = Письмо.ПолучитьФорму(, ФормаВладелец);
	Иначе
		ФормаПисьма = Письмо.ПолучитьФорму();
	КонецЕсли; 
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТекСсылка"   , ?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо"), Основание, Основание.Ссылка));
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенияЭлектронныхПисем.ИмяФайла КАК ИмяФайла,
		|	ВложенияЭлектронныхПисем.Хранилище КАК Хранилище,
		|	ВложенияЭлектронныхПисем.Наименование КАК Наименование,
		|	ВложенияЭлектронныхПисем.ИДФайлаПочтовогоПисьма КАК ИДФайлаПочтовогоПисьма
		|ИЗ
		|	Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
		|ГДЕ
		|	ВложенияЭлектронныхПисем.Объект = &ТекСсылка
		|	И (НЕ ВложенияЭлектронныхПисем.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ПустаяСтрока(Выборка.ИДФайлаПочтовогоПисьма) Тогда
					Если ПеренестиВложенияИзОснования Тогда
						СтрокаТЗ = ФормаПисьма.ВложенияПисьмаТЗ.Добавить();
						СтрокаТЗ.ИмяФайла     = Выборка.ИмяФайла;
						СтрокаТЗ.Наименование = Выборка.Наименование;
						СтрокаТЗ.Данные       = Выборка.Хранилище;
					КонецЕсли; 
				Иначе
					СтрокаТЗ = ФормаПисьма.ВложенияПисьмаТЗСкрытые.Добавить();
					СтрокаТЗ.ИмяФайла               = Выборка.ИмяФайла;
					СтрокаТЗ.Наименование           = Выборка.Наименование;
					СтрокаТЗ.Данные                 = Выборка.Хранилище;
					СтрокаТЗ.ИДФайлаПочтовогоПисьма = Выборка.ИДФайлаПочтовогоПисьма;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли;
	#КонецЕсли
	
	// Сформируем текст письма для ответа или переадресации
	Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо"))
	   И НЕ Копирование Тогда
		
		ТекстПисьма = Письмо.ТекстПисьма;
		
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			НачалоТела = Найти(ТекстПисьма, "<BODY");
			
			ДатаИсходногоПисьма = Основание.Дата;
			Если (Основание.СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ Основание.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное) И ЗначениеЗаполнено(Основание.Дата) Тогда
				ДатаИсходногоПисьма = Основание.Дата;
			КонецЕсли;
			
			СтрокаОтправителя = "Отправитель: ";
			Если НЕ ПустаяСтрока(Основание.ОтправительИмя) Тогда
				СтрокаОтправителя = СтрокаОтправителя + СокрЛП(Основание.ОтправительИмя) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(Основание.ОтправительИмя, """", "")) + "<" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + "</A>&gt";
			Иначе
				СтрокаОтправителя = СтрокаОтправителя + "&lt<A href=" + """" + "mailto:" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + """" + ">" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + "</A>&gt";
			КонецЕсли;
			
			СтрокаКому = "";
			Для каждого СтрокаТЧ Из Основание.КомуТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					СтрокаКому = СтрокаКому + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКому = СтрокаКому + СокрЛП(СтрокаТЧ.Представление) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(СтрокаТЧ.Представление, """", "")) + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				Иначе
					СтрокаКому = СтрокаКому + "&lt<A href=" + """" + "mailto:" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКому) Тогда
				СтрокаКому = "Получатели: " + СтрокаКому;
			КонецЕсли; 
			
			СтрокаКопии = "";
			Для каждого СтрокаТЧ Из Основание.КопииТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					СтрокаКопии = СтрокаКопии + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКопии = СтрокаКопии + СокрЛП(СтрокаТЧ.Представление) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(СтрокаТЧ.Представление, """", "")) + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				Иначе
					СтрокаКопии = СтрокаКопии + "&lt<A href=" + """" + "mailto:" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
				СтрокаКопии = "Копии: " + СтрокаКопии;
			КонецЕсли; 
			
			Если НачалоТела > 0 Тогда
				
				// Ищем конец начала тела
				а = НачалоТела;
				КонецНачалаТела = 0;
				Пока Истина Цикл
					Если Сред(ТекстПисьма, а, 1) = ">" Тогда
						КонецНачалаТела = а;
						Прервать;
					Иначе
						а = а + 1;
						Продолжить;
					КонецЕсли; 
				КонецЦикла; 
				
				НовыйТекстПисьма = Лев(ТекстПисьма, КонецНачалаТела) + "<DIV><BR></DIV>" + 
								  "<BLOCKQUOTE dir=ltr style=" + """" + "PADDING-LEFT: 15px; MARGIN-LEFT: 5px; BORDER-LEFT: #000000 2px solid; MARGIN-RIGHT: 0px" + """" + ">" + 
								  "<P><A href="+ """" + Строка(?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо"), Основание.УникальныйИдентификатор(), Основание.Ссылка.УникальныйИдентификатор())) + """" + ">--- Исходное сообщение --- </A>" + 
								  "<BR>Дата: " + Формат(ДатаИсходногоПисьма, "ДЛФ=DT") +
								  "<BR>" + СтрокаОтправителя;
								  
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + СтрокаКому;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + СтрокаКопии;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Основание.Тема) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + "Тема: " + Основание.Тема;
				КонецЕсли;
				
				НовыйТекстПисьма = НовыйТекстПисьма + "</P><P><BR></P>";
				
				КонецТела = Найти(ТекстПисьма, "</BODY");
				Если КонецТела > 0 Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + Сред(ТекстПисьма, (КонецНачалаТела + 1), (КонецТела - КонецНачалаТела - 1)) + "</BLOCKQUOTE>" + Сред(ТекстПисьма, КонецТела);
					Письмо.ТекстПисьма = НовыйТекстПисьма;
				КонецЕсли;
			КонецЕсли; 
			
		Иначе
			
			НовыйТекстПисьма = Новый ТекстовыйДокумент;
			
			НовыйТекстПисьма.УстановитьТекст(ТекстПисьма);
			
			НовыйТекстПисьма.ВставитьСтроку(1, "--- Исходное сообщение ---");
			ПоследняяСтрока = 1;
			
			ДатаИсходногоПисьма = Основание.Дата;
			Если (Основание.СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ Основание.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное) И ЗначениеЗаполнено(Основание.Дата) Тогда
				ДатаИсходногоПисьма = Основание.Дата;
			КонецЕсли;
			НовыйТекстПисьма.ВставитьСтроку(2, "Дата: " + Формат(ДатаИсходногоПисьма, "ДЛФ=DT"));
			ПоследняяСтрока = 2;
			
			СтрокаОтправителя = "Отправитель: ";
			Если НЕ ПустаяСтрока(Основание.ОтправительИмя) Тогда
				СтрокаОтправителя = СтрокаОтправителя + СокрЛП(Основание.ОтправительИмя) + " <" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">";
			Иначе
				СтрокаОтправителя = СтрокаОтправителя + "<" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">";
			КонецЕсли;
			НовыйТекстПисьма.ВставитьСтроку(3, СтрокаОтправителя);
			ПоследняяСтрока = 3;
			
			СтрокаКому = "";
			Для каждого СтрокаТЧ Из Основание.КомуТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					СтрокаКому = СтрокаКому + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКому = СтрокаКому + СокрЛП(СтрокаТЧ.Представление) + " <" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				Иначе
					СтрокаКому = СтрокаКому + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКому) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Получатели: " + СтрокаКому);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли; 
			
			СтрокаКопии = "";
			Для каждого СтрокаТЧ Из Основание.КопииТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					СтрокаКопии = СтрокаКопии + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКопии = СтрокаКопии + СокрЛП(СтрокаТЧ.Представление) + " <" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				Иначе
					СтрокаКопии = СтрокаКопии + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Копии: " + СтрокаКопии);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли; 
			
			Если НЕ ПустаяСтрока(Основание.Тема) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Тема: " + Основание.Тема);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли;
				
			НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "");
			
			Для а = 1 по НовыйТекстПисьма.КоличествоСтрок() Цикл
				НовыйТекстПисьма.ЗаменитьСтроку(а, ("> " + НовыйТекстПисьма.ПолучитьСтроку(а)));
			КонецЦикла;
			
			НовыйТекстПисьма.ВставитьСтроку(1, "");
			НовыйТекстПисьма.ВставитьСтроку(1, "");
			
			Письмо.ТекстПисьма = НовыйТекстПисьма.ПолучитьТекст();
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// Проставим при необходимости подпись
	Если НЕ Копирование И ((УчетнаяЗапись.ДобавлятьПодписьКИсходящимПисьмам И Дополнительно = Неопределено)
	 ИЛИ ((Дополнительно = "Ответ" ИЛИ Дополнительно = "Переадресация") И УчетнаяЗапись.ДобавлятьПодписьКОтветамИПересылкам = Истина)) Тогда
	 
		Отказ = Ложь;
	
		НовыйКом = Новый COMОбъект("HtmlFile");
		НовыйКом.open("text/html");
		НовыйКом.write(УчетнаяЗапись.ТекстПодписи);
		НовыйКом.close();
		
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			ТекстПисьма = Письмо.ТекстПисьма;
			
			Если ПустаяСтрока(ТекстПисьма) Тогда
				ТекстПисьма = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY><DIV></DIV></BODY></HTML>";
			Иначе
				Если Найти(ТекстПисьма, "<BODY") = 0 тогда
				ТекстПисьма = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY>" + ТекстПисьма + "</BODY></HTML>";
				КонецЕсли; 
			КонецЕсли; 
			
			НачалоТела = Найти(ТекстПисьма, "<BODY");
			КонецНачалаТела = 0;
			а = НачалоТела;
			Пока Истина Цикл
				Если Сред(ТекстПисьма, а, 1) = ">" Тогда
					КонецНачалаТела = а;
					Прервать;
				Иначе
					а = а + 1;
				КонецЕсли; 
			КонецЦикла;
			
			Если НачалоТела = 0 ИЛИ КонецНачалаТела = 0 Тогда
				Отказ = Истина;
			КонецЕсли;
			
			ТегBODY = НовыйКом.all.Tags("BODY");
			Если ТегBODY.length > 0 Тогда
				ХТМЛПодписи = ТегBODY.item(0).innerHTML;
				Если ПустаяСтрока(ХТМЛПодписи) Тогда
					Отказ = Истина;
				Иначе
					ХТМЛПодписи = СтрЗаменить(ХТМЛПодписи, "<PRE>", "");
					ХТМЛПодписи = СтрЗаменить(ХТМЛПодписи, "</PRE>", "<BR>");
				КонецЕсли;
			Иначе
				Отказ = Истина;
			КонецЕсли; 
			
			Если НЕ Отказ Тогда
				Если ПодписьПодТекстом Тогда
					НачалоКонцаТела = Найти(ТекстПисьма, "</BODY");
					Если НачалоКонцаТела > 0 Тогда
						НовыйТекстПисьма = Лев(ТекстПисьма, НачалоКонцаТела - 1);
						НовыйТекстПисьма  = НовыйТекстПисьма + "<BR>" + ХТМЛПодписи + Сред(ТекстПисьма, НачалоКонцаТела);
						Письмо.ТекстПисьма = НовыйТекстПисьма;
					КонецЕсли; 
				Иначе
					НовыйТекстПисьма = Лев(ТекстПисьма, КонецНачалаТела);
					НовыйТекстПисьма  = НовыйТекстПисьма + "<DIV>&nbsp;</DIV>" + ХТМЛПодписи + Сред(ТекстПисьма, (КонецНачалаТела + 1));
					Письмо.ТекстПисьма = НовыйТекстПисьма;
				КонецЕсли; 
			КонецЕсли; 
			
		Иначе
			
			ТекстПодписи = Новый ТекстовыйДокумент;
			ТекстПодписи.УстановитьТекст(СтрЗаменить(НовыйКом.all.item(0).innerText, Символ(13), ""));
			
			Если ТекстПодписи.КоличествоСтрок() > 0 Тогда
				
				НовыйТекстПисьма = Новый ТекстовыйДокумент;
				НовыйТекстПисьма.УстановитьТекст(Письмо.ТекстПисьма);
				
				Если НовыйТекстПисьма.КоличествоСтрок() > 0 Тогда
					ПерваяСтрока = НовыйТекстПисьма.ПолучитьСтроку(1);
					Если ПустаяСтрока(ПерваяСтрока) Тогда
						НовыйТекстПисьма.УдалитьСтроку(1);
					КонецЕсли; 
				КонецЕсли; 
				
				Для а = 1 По ТекстПодписи.КоличествоСтрок() Цикл
					Если ПодписьПодТекстом Тогда
						НовыйТекстПисьма.ДобавитьСтроку(ТекстПодписи.ПолучитьСтроку(а));
					Иначе
						НовыйТекстПисьма.ВставитьСтроку(а, ТекстПодписи.ПолучитьСтроку(а));
					КонецЕсли;
				КонецЦикла;
				
				НовыйТекстПисьма.ВставитьСтроку(1, "");
				Письмо.ТекстПисьма = НовыйТекстПисьма.ПолучитьТекст();
				
			КонецЕсли; 
			
		КонецЕсли;
	
	КонецЕсли; 
	
	#Если Клиент Тогда
	Если ОткрыватьПисьмо Тогда
		
		Если ТипЗнч(СписокФайловВложений) = Тип("СписокЗначений") И СписокФайловВложений.Количество() > 0 Тогда
			
			ЗначениеСтруктурыВозврата = Неопределено;
			
			Для каждого ЭлементСписка Из СписокФайловВложений Цикл
				
				НовоеВложение = ФормаПисьма.ВложенияПисьмаТЗ.Добавить();
				
				ЭлементСписка.Значение.Свойство("Хранилище", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					Продолжить;
				Иначе
					Если ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ДвоичныеДанные") Тогда
						НовоеВложение.Данные = Новый ХранилищеЗначения(ЗначениеСтруктурыВозврата, Новый СжатиеДанных);
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ХранилищеЗначения") Тогда
						НовоеВложение.Данные = ЗначениеСтруктурыВозврата;
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("Строка") Тогда
						НовоеВложение.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеСтруктурыВозврата), Новый СжатиеДанных);
					Иначе
						Продолжить;
					КонецЕсли; 
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("ИмяФайла", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.ИмяФайла = "";
				Иначе
					НовоеВложение.ИмяФайла = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("Наименование", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.Наименование = "";
				Иначе
					НовоеВложение.Наименование = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
		ФормаПисьма.Открыть();
		
		// Установим удобный элемент управления в форме письма - текущим
		Если ТекущийЭлементХТМЛ Тогда
			Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.ПолеHTMLДокумента;
			Иначе
				ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.ПолеТекстовогоДокумента;
			КонецЕсли; 
		Иначе
			ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.Кому;
		КонецЕсли;
		
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Письмо, ФормаПисьма, Письмо.Ссылка);
		
	КонецЕсли;
	#КонецЕсли

	Если Не ОткрыватьПисьмо Тогда
		
		Попытка
			Письмо.Записать();
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
			
		Если ТипЗнч(СписокФайловВложений) = Тип("СписокЗначений") И СписокФайловВложений.Количество() > 0 Тогда
			
			ЗначениеСтруктурыВозврата = Неопределено;
			
			Для каждого ЭлементСписка Из СписокФайловВложений Цикл
			
				НовоеВложение = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент();
				НовоеВложение.Объект = Письмо.Ссылка;
				
				ЭлементСписка.Значение.Свойство("Хранилище", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					Продолжить;
				Иначе
					Если ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ДвоичныеДанные") Тогда
						НовоеВложение.Хранилище = Новый ХранилищеЗначения(ЗначениеСтруктурыВозврата, Новый СжатиеДанных);
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ХранилищеЗначения") Тогда
						НовоеВложение.Хранилище = ЗначениеСтруктурыВозврата;
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("Строка") Тогда
						НовоеВложение.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеСтруктурыВозврата), Новый СжатиеДанных);
					Иначе
						Продолжить;
					КонецЕсли; 
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("ИмяФайла", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.ИмяФайла = "";
				Иначе
					НовоеВложение.ИмяФайла = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("Наименование", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.Наименование = "";
				Иначе
					НовоеВложение.Наименование = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				Попытка
					НовоеВложение.Записать();
				Исключение
					Возврат ОписаниеОшибки();
				КонецПопытки;
			
			КонецЦикла; 
			
		КонецЕсли; 
		
		#Если Клиент Тогда
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Письмо, ФормаПисьма, Письмо.Ссылка);
		#Иначе
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Неопределено, Неопределено, Письмо.Ссылка);
		#КонецЕсли
	
	КонецЕсли; 
	
	Возврат СтруктураВозврата;

КонецФункции

// Получить строку с представлением списка получателей
//
// Параметры
//  КомуТЧ  – Таблица значений – список получателей
//
// Возвращаемое значение:
//   Строка   – Строка с представлением списка получателей
//
// Получить строку с представлением списка получателей
//
// Параметры
//  КомуТЧ  – Таблица значений – список получателей
//
// Возвращаемое значение:
//   Строка   – Строка с представлением списка получателей
//
Функция ПолучитьПредставлениеПолучателей(КомуТЧ)

	Представление = "";
	Для каждого СтрокаКому Из КомуТЧ Цикл
		Представление = Представление + ", " + ?(ПустаяСтрока(СтрокаКому.Представление), СтрокаКому.АдресЭлектроннойПочты, СтрокаКому.Представление);
	КонецЦикла;
	Если НЕ ПустаяСтрока(Представление) Тогда
		Представление = Сред(Представление, 3);
	КонецЕсли;
	
	Возврат Представление;

КонецФункции // ПолучитьПредставлениеПолучателей()  


//////////////////////////////////////////////////////////////////////////
