
&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если Параметры.Ключ.Пустая() или ЭтаФорма.Модифицированность  Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФормуМодально("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаДоработку(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
	ВурнутьНаПервыйЭтап()
КонецПроцедуры

&НаСервере
Процедура ВурнутьНаПервыйЭтап ()
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Объект.Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	
	
	МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
	Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования заявки", Отказ, Заголовок);
		Возврат;
	КонецЕсли;

	НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
	НоваяЗапись.Период 					= ТекущаяДата();
	НоваяЗапись.Активность 				= Истина;
	НоваяЗапись.ДокументДляСогласования = Объект.Ссылка;
	НоваяЗапись.Пользователь 			= Объект.Ответственный;
	НоваяЗапись.Этап 					= МаршрутСогласования;
	НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
	НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
		
	НаборЗаписейСостояниеСогласования.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры


&НаКлиенте
Процедура СкидкиПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Скидки.Итог("СуммаСкидки");
	ОбновитьНадписиИтогов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписиИтогов ()
	//Элементы.СуммаДокумента.Заголовок = "Сумма документа: " + Формат(Объект.СуммаДокумента, "ЧЦ=18; ЧДЦ=2; ЧН=0");	
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	
	Если Объект.ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.ПредоставлениеСкидки Тогда
		Элементы.СтраницаПодтверждение.Доступность = Ложь;
		Объект.ПодтвержениеФактаПредоставленияСкидки = Ложь;
		Объект.ДатаФактаПредоставленияСкидки = Дата("00010101000000");
		Объект.ДокуменПредоставленияСкидки = Неопределено;
	Иначе
		Элементы.СтраницаПодтверждение.Доступность = Истина;
		Объект.ПодтвержениеФактаПредоставленияСкидки = Истина;
	Конецесли

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  Объект.Комментарий = "Не открывать форму" Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		 Объект.Комментарий = "Период ТМА: " + Формат(Объект.ДокументОснование.ДатаНачалаАкции, "ДФ=дд.ММ.гг") + " - " +  Формат(Объект.ДокументОснование.ДатаОкончанияАкции, "ДФ=дд.ММ.гг");
	КонецЕсли;
	
	ЭтапСогласования = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	СостояниеСогласования = Перечисления.СостоянияОбъектов.Подготовлен;
   	ПолучитьРазрешениеНаИзменениеДокументаИзЭтаповСогласования(ЭтапСогласования, СостояниеСогласования);
	
	Если НЕ ЭтапСогласования = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() или не СостояниеСогласования = Перечисления.СостоянияОбъектов.Подготовлен Тогда
	    Если ЭтапСогласования.Лео_ЛицаСДоступомНаРедактирование.Количество()>0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование.Пользователь
				|ИЗ
				|	Справочник.абс_МаршрутыСогласованияДокументов.Лео_ЛицаСДоступомНаРедактирование КАК абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование
				|ГДЕ
				|	абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование.Ссылка = &ЭтапСогласования
				|	И абс_МаршрутыСогласованияДокументовЛео_ЛицаСДоступомНаРедактирование.Пользователь = &Пользователь";

			Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
			Запрос.УстановитьПараметр("ЭтапСогласования", ЭтапСогласования);

			Результат = Запрос.Выполнить();

			СписокПользователей = Результат.Выгрузить();
			Если СписокПользователей.Количество()= 0 Тогда
				ЭтаФорма.Доступность = Ложь;
			Иначе
				ЭтаФорма.Доступность = Истина;
			КонецЕсли;
			//ЭтаФорма.Доступность = Истина;  //Владимир
        КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьРазрешениеНаИзменениеДокументаИзЭтаповСогласования (ЭтапСогласования,СостояниеСогласования)
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние,
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Этап
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
	Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
    	ЭтапСогласования = Выборка.Этап;
		СостояниеСогласования = Выборка.Состояние;
	Иначе
		ЭтапСогласования = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
		СостояниеСогласования = Перечисления.СостоянияОбъектов.Подготовлен; 
	КонецЕсли;

КонецПроцедуры

//Функция определяет маршрут согласования документа по подразделению
Функция ОпределитьМаршрутСогласования(ТипДокументаДляСогласования)   
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования КАК МаршрутСогласования
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования");
	
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, ТипДокументаДляСогласования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Не Объект.Контрагент.Пустая() Тогда
		Если ПроверитьСтатусКонтрагента(Объект.Контрагент) Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();	
			Сообщить ("Контрагент: " + Объект.Контрагент + " в статусе ""Не активный""");
		Конецесли;
	Конецесли;
КонецПроцедуры

&НаСервере
Функция ПроверитьСтатусКонтрагента(Контрагент)
	//{Лео Катанович
	Если ЗначениеЗаполнено(Контрагент.абс_СтатусКонтрагента) Тогда
		Если Контрагент.абс_СтатусКонтрагента <> Перечисления.абс_СтатусыКонтрагентов.Активный Тогда
			Возврат Истина;	
		Иначе
			Возврат Ложь;
		Конецесли;
	Иначе
		 Возврат Истина;
	Конецесли;
	//Лео Катанович}
	
КонецФункции