&НаКлиенте
Перем мТекущийПериодДоИзменения;

&НаКлиенте
Перем мРежимВыбораАналитики;

&НаСервере
Перем мРежимВыбораАналитикиСервер;

&НаКлиенте
Процедура ЗаполнитьБюджет(Команда)
	
	ЕстьОшибки=Ложь;
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СоставБюджета.Очистить();
		КонецЕсли;
	КонецЕсли;
	
    КомандаЗаполнитьБюджетНаГодСервер();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьБюджетНаГодСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьБюджетНаГод(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ИндексТекМесяца = Месяц(Объект.ТекущийПериод);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ПланКоличество"			, ЭтаФорма.Элементы["СоставБюджетаПланКоличество" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланСуммаБезНДС"			, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланСумма"				, ЭтаФорма.Элементы["СоставБюджетаПланСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ОперФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("Подтверждено"				, ЭтаФорма.Элементы["СоставБюджетаПодтверждено" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ОтобразитьЗРС"			, ЭтаФорма.Элементы.ФормаКомандаОтобразитьЗРС.Пометка);
	СтруктураПараметров.Вставить("ТолькоТекущийМесяц"		, ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	ФормаНастроекПараметров = ПолучитьФорму("Документ.абс_ОперативныйБюджет.Форма.ФормаНастроек", СтруктураПараметров,ЭтаФорма);
	ФормаНастроекПараметров.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановитьВидимость" Тогда
		
		УстановитьВидимостьПоМесяцам(Параметр);
		
		УстановитьВидимостьМесяцев(ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоМесяцам(Параметр)
			
	Для Сч = 1 По 12 Цикл
		
		ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость		= Параметр.ПланКоличество;
		ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС"+Сч].Видимость		= Параметр.ПланСуммаБезНДС;
		ЭтаФорма.Элементы["СоставБюджетаПланСумма"+Сч].Видимость			= Параметр.ПланСумма;
		
		ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость	= Параметр.ОперФактКоличество;
		ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС"+Сч].Видимость	= Параметр.ОперФактСуммаБезНДС;
		ЭтаФорма.Элементы["СоставБюджетаОперФактСумма"+Сч].Видимость		= Параметр.ОперФактСумма;
		
		ЭтаФорма.Элементы["СоставБюджетаПодтверждено"+Сч].Видимость			= Истина;
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	
	Объект.ДатаПланирования = НачалоГода(Объект.ДатаПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФакт(Команда)
	
	Если Объект.СоставБюджета.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьФактСервер();
	
	ЭтаФорма.Модифицированность=Истина;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ОбновитьДанныеФакта(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()

	КлючНастроек = "абс_ОперативныйБюджетВидимостьРеквизитов";
	
	ИндексТекМесяца = Месяц(Объект.ТекущийПериод);
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПланКоличество"			, ЭтаФорма.Элементы["СоставБюджетаПланКоличество" 		+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ПланСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" 		+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ПланСумма"				, ЭтаФорма.Элементы["СоставБюджетаПланСумма" 			+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("ОперФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество" 	+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ОперФактСуммаБезНДС"	, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" 	+ ИндексТекМесяца].Видимость);
	Настройки.Вставить("ОперФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" 		+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("Подтверждено"			, ЭтаФорма.Элементы["СоставБюджетаПодтверждено" 		+ ИндексТекМесяца].Видимость);
	
	Настройки.Вставить("ОтобразитьЗРС"			, ЭтаФорма.Элементы.ФормаКомандаОтобразитьЗРС.Пометка);
	Настройки.Вставить("ТолькоТекущийМесяц"		, ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Объект.Ссылка, КлючНастроек, Настройки);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()

	КлючНастроек = "абс_ОперативныйБюджетВидимостьРеквизитов";

	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Объект.Ссылка, КлючНастроек);

	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда
		
		Если ЗначениеНастроек.Свойство("ОтобразитьЗРС") = Неопределено Тогда
			ЗначениеНастроек.Вставить("ОтобразитьЗРС", Ложь);
		КонецЕсли;		
		
		Если ЗначениеНастроек.Свойство("ТолькоТекущийМесяц") = Неопределено Тогда
			ЗначениеНастроек.Вставить("ТолькоТекущийМесяц", Ложь);
		КонецЕсли;
		
		Если ЗначениеНастроек.Свойство("Подтверждено") = Неопределено Тогда
			ЗначениеНастроек.Вставить("Подтверждено", Истина);
		КонецЕсли;
	
		УстановитьВидимостьПоМесяцам(ЗначениеНастроек);
		
		Элементы.ФормаКомандаОтобразитьЗРС.Пометка 	= ЗначениеНастроек.ОтобразитьЗРС;	
		Элементы.ФормаКомандаТекущийМесяц.Пометка 	= ЗначениеНастроек.ТолькоТекущийМесяц;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьОперФакт(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПлан(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗаполнитьБюджетНаГод(Команда)

	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СоставБюджета.Очистить();
			Объект.ЗаявкиНаРасходованиеСредств.Очистить();
		КонецЕсли;
	КонецЕсли;
	
    КомандаЗаполнитьБюджетНаГодСервер();
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОбновитьПланБюджетаНаТекущийМесяц(Команда)

	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
   	КомандаОбновитьПланБюджетаНаТекущийМесяцСервер();
	
	ЭтаФорма.Модифицированность = Истина;	

КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьПланБюджетаНаТекущийМесяцСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ОбновитьПланБюджетаНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОбновитьОперФактНаТекущийМесяц(Команда)
	
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЭтаФорма.Модифицированность = Истина;	
	
	КомандаОбновитьОперФактНаТекущийМесяцСервер();
	
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьОперФактНаТекущийМесяцСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ОбновитьОперФактНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПериодПриИзменении(Элемент)
	
	Объект.ТекущийПериод = НачалоМесяца(Объект.ТекущийПериод);
	
	ИндексТекМесяца = Месяц(мТекущийПериодДоИзменения);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ПланКоличество"			, ЭтаФорма.Элементы["СоставБюджетаПланКоличество" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланСуммаБезНДС"			, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ПланСумма"				, ЭтаФорма.Элементы["СоставБюджетаПланСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ОперФактКоличество"		, ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" + ИндексТекМесяца].Видимость);
	СтруктураПараметров.Вставить("ОперФактСумма"			, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("Подтверждено"				, ЭтаФорма.Элементы["СоставБюджетаПодтверждено" + ИндексТекМесяца].Видимость);
	
	СтруктураПараметров.Вставить("ОтобразитьЗРС"			, ЭтаФорма.Элементы.ФормаКомандаОтобразитьЗРС.Пометка);
	СтруктураПараметров.Вставить("ТолькоТекущийМесяц"		, ЭтаФорма.Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	УстановитьВидимостьПоМесяцам(СтруктураПараметров);
	
	УстановитьВидимостьМесяцев(СтруктураПараметров.ТолькоТекущийМесяц);
	
	мТекущийПериодДоИзменения = Объект.ТекущийПериод;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьЗРС(Команда)
	
	Элементы.ФормаКомандаОтобразитьЗРС.Пометка = НЕ Элементы.ФормаКомандаОтобразитьЗРС.Пометка;
	
	УстановитьВидимостьТЧЗРС(Элементы.ФормаКомандаОтобразитьЗРС.Пометка);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТЧЗРС(ВидимостьТЧЗРС)
	
	Элементы.ГруппаЗаявкиНаРасходованиеСредств.Видимость = ВидимостьТЧЗРС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьТЧЗРС(Элементы.ФормаКомандаОтобразитьЗРС.Пометка);
	
	УстановитьВидимостьМесяцев(Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
	мТекущийПериодДоИзменения = Объект.ТекущийПериод;
	
	Если МодальныйРежим Тогда
		
		мРежимВыбораАналитики = Истина;
		
		УстановитьРежимВыбораАналитики();
		
	Иначе 
		
		мРежимВыбораАналитики = Ложь;
		
	КонецЕсли;
	
	ВывестиАналитикиВТабличныйДокумент(ТабличноеПолеСоставБюджета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиАналитикиВТабличныйДокумент(Т)
	
	ВывестиАналитикиВТабличныйДокументСервер(Т);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиАналитикиВТабличныйДокументСервер(Т)
	
	Макет = Документы.абс_ОперативныйБюджет.ПолучитьМакет("МакетБюджетаДляВыбораАналитик");
	
	ОбластьШапкаАналитики 	= Макет.ПолучитьОбласть("Шапка|Аналитики");
	ОбластьШапкаМесяц 		= Макет.ПолучитьОбласть("Шапка|Месяц");
	ОбластьСтрокаАналитики 	= Макет.ПолучитьОбласть("Строка|Аналитики");
	ОбластьСтрокаМесяц 		= Макет.ПолучитьОбласть("Строка|Месяц");
	
	Т.Очистить();
	
	Т.Вывести(ОбластьШапкаАналитики);
	
	Для Н = 1 По 12 Цикл
		
		ОбластьШапкаМесяц.Параметры.НаименованиеМесяца = Формат(Дата(1, Н, 1), "ДФ=ММММ");	
		
		Т.Присоединить(ОбластьШапкаМесяц);
		
	КонецЦикла;
		
	Для Каждого СтрБюджет Из Объект.СоставБюджета Цикл
		
		ОбластьСтрокаАналитики.Параметры.Заполнить(СтрБюджет);
		
		ОбластьСтрокаАналитики.Параметры.КодБС = СтрБюджет.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		Т.Вывести(ОбластьСтрокаАналитики);
		
		Для Н = 1 По 12 Цикл
			
			ОбластьСтрокаМесяц.Параметры.ПланКоличество 		= СтрБюджет["ПланКоличество" 		+ Н];
			ОбластьСтрокаМесяц.Параметры.ПланСуммаБезНДС 		= СтрБюджет["ПланСуммаБезНДС" 		+ Н];
			ОбластьСтрокаМесяц.Параметры.ПланСумма 				= СтрБюджет["ПланСумма" 			+ Н];
			
			ОбластьСтрокаМесяц.Параметры.ОперФактКоличество 	= СтрБюджет["ОперФактКоличество" 	+ Н];
			ОбластьСтрокаМесяц.Параметры.ОперФактСуммаБезНДС 	= СтрБюджет["ОперФактСуммаБезНДС" 	+ Н];
			ОбластьСтрокаМесяц.Параметры.ОперФактСумма 			= СтрБюджет["ОперФактСумма" 		+ Н];
			ОбластьСтрокаМесяц.Параметры.Подтверждено 			= СтрБюджет["Подтверждено" 			+ Н];
			
			ОбластьСтрокаМесяц.Параметры.СтруктураРасшифровки	= ПолучитьСтруктуруРасшифровкиДляЯчейкиДокумента(СтрБюджет, Н);
			
			Т.Присоединить(ОбластьСтрокаМесяц);
			
		КонецЦикла;
			
	КонецЦикла;
	
	Т.ФиксацияСверху 	= 3;
	Т.ФиксацияСлева 	= 5;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруРасшифровкиДляЯчейкиДокумента(СтрБюджет, НомерМесяца)

	СтруктураРасшифровки = Новый Структура;

	СтруктураРасшифровки.Вставить("ИдентификаторСтрокиБюджета"	, СтрБюджет.ИдентификаторСтрокиБюджета);
	СтруктураРасшифровки.Вставить("СтатьяОборотовПоБюджетам"	, СтрБюджет.СтатьяОборотовПоБюджетам);
	СтруктураРасшифровки.Вставить("АналитикаБюджета"            , СтрБюджет.АналитикаБюджета);
	СтруктураРасшифровки.Вставить("Контрагент"              	, СтрБюджет.Контрагент);
	
	СтруктураРасшифровки.Вставить("ПланКоличество"              , СтрБюджет["ПланКоличество" 	+ НомерМесяца]);
	СтруктураРасшифровки.Вставить("ПланСуммаБезНДС"             , СтрБюджет["ПланСуммаБезНДС" 	+ НомерМесяца]);
	СтруктураРасшифровки.Вставить("ПланСумма"                   , СтрБюджет["ПланСумма" 		+ НомерМесяца]);
	
	СтруктураРасшифровки.Вставить("НомерМесяца"					, НомерМесяца);	

	Возврат СтруктураРасшифровки;

КонецФункции
	
&НаКлиенте
Процедура КомандаТекущийМесяц(Команда)
	
	Элементы.ФормаКомандаТекущийМесяц.Пометка = НЕ Элементы.ФормаКомандаТекущийМесяц.Пометка;
	
	УстановитьВидимостьМесяцев(Элементы.ФормаКомандаТекущийМесяц.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьМесяцев(ТолькоТекущийМесяц)
	
	Для Сч = 1 По 12 Цикл
		
		ВидимостьТекМесяца = (ТолькоТекущийМесяц И Сч = Месяц(Объект.ТекущийПериод)) ИЛИ НЕ ТолькоТекущийМесяц; 
		
		ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПланКоличество"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаПланСумма"+Сч].Видимость			= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПланСумма"+Сч].Видимость;
		
		ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость	= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаОперФактКоличество"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС"+Сч].Видимость	= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС"+Сч].Видимость;
		ЭтаФорма.Элементы["СоставБюджетаОперФактСумма"+Сч].Видимость		= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаОперФактСумма"+Сч].Видимость;		
		
		ЭтаФорма.Элементы["СоставБюджетаПодтверждено"+Сч].Видимость			= ВидимостьТекМесяца И ЭтаФорма.Элементы["СоставБюджетаПодтверждено"+Сч].Видимость;		
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриАктивизацииЯчейки(Элемент)
	
	ТаблицаЗаявокНаРасходованиеСредств.Очистить();
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//АБС ИЗМЕНЕНИЕ Добавление идентификатора строки бюджета  15.12.2014 Фролов
	//СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент, НомерМесяца");
	СтруктураАналитик = Новый Структура("ИдентификаторСтрокиБюджета, НомерМесяца");	
	//АБС ИЗМЕНЕНИЕ Добавление идентификатора строки бюджета КОНЕЦ 
	
	ЗаполнитьЗначенияСвойств(СтруктураАналитик, ТекСтрока);
	СтруктураАналитик.НомерМесяца = Месяц(Объект.ТекущийПериод);
		
	СтрокиПоАналитике = Объект.ЗаявкиНаРасходованиеСредств.НайтиСтроки(СтруктураАналитик);
	
	Для Каждого СтрПоАналитике Из СтрокиПоАналитике Цикл
		
		СтрокаЗРС = ТаблицаЗаявокНаРасходованиеСредств.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаЗРС, СтрПоАналитике);
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьПоСтатье(Команда)
	
	КомандаСортироватьПоСтатьеСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаСортироватьПоСтатьеСервер() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.СортироватьСоставБюджетаПоСтатье(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьПоКонтрагенту(Команда)
	
	КомандаСортироватьПоКонтрагентуСервер();
	
КонецПроцедуры

&НаСервере
Процедура КомандаСортироватьПоКонтрагентуСервер() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.СортироватьСоставБюджетаПоКонтрагенту(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеСредствВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекЗаявка = Элементы.ЗаявкиНаРасходованиеСредств.ТекущиеДанные.ЗаявкаНаРасходованиеСредств;	
	
	Если ТекЗаявка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаДокумента = ТекЗаявка.ПолучитьФорму("ФормаДокумента");
	
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриАктивизацииСтроки(Элемент)
	
	ОбновитьНадписиИтоговПоСтатье(Элементы.СоставБюджета.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписиИтоговПоСтатье(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "";
		
		Возврат;
	КонецЕсли;
	
	ИндексТекМесяца = Месяц(Объект.ТекущийПериод);
		
	СтрокиПоСтатье = Объект.СоставБюджета.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", ТекДанные.СтатьяОборотовПоБюджетам));
	
	ПланСуммаИтогМесяц 	= 0; ПланСуммаБезНДСИтогМесяц 	= 0; 	ОперФактСуммаИтогМесяц 	= 0; 	ОперФактСуммаБезНДСИтогМесяц = 0;
	ПланСуммаИтогГод 	= 0; ПланСуммаБезНДСИтогГод		= 0; 	ОперФактСуммаИтогГод	= 0;    ОперФактСуммаБезНДСИтогГод 	= 0;
	
	Для Каждого СтрокаПоСтатье Из СтрокиПоСтатье Цикл
				
		ПланСуммаИтогГод 				= ПланСуммаИтогГод 				+ СтрокаПоСтатье.ПланСуммаИтог;
		ПланСуммаБезНДСИтогГод 			= ПланСуммаБезНДСИтогГод 		+ СтрокаПоСтатье.ПланСуммаБезНДСИтог;
		ОперФактСуммаИтогГод 			= ОперФактСуммаИтогГод 			+ СтрокаПоСтатье.ОперФактСуммаИтог;
		ОперФактСуммаБезНДСИтогГод 		= ОперФактСуммаБезНДСИтогГод 	+ СтрокаПоСтатье.ОперФактСуммаБезНДСИтог;
		
		ПланСуммаИтогМесяц 				= ПланСуммаИтогМесяц 			+ СтрокаПоСтатье["ПланСумма" 			+ ИндексТекМесяца];
		ПланСуммаБезНДСИтогМесяц 		= ПланСуммаБезНДСИтогМесяц 		+ СтрокаПоСтатье["ПланСуммаБезНДС" 		+ ИндексТекМесяца];
		ОперФактСуммаИтогМесяц 			= ОперФактСуммаИтогМесяц 		+ СтрокаПоСтатье["ОперФактСумма" 		+ ИндексТекМесяца];
		ОперФактСуммаБезНДСИтогМесяц 	= ОперФактСуммаБезНДСИтогМесяц 	+ СтрокаПоСтатье["ОперФактСуммаБезНДС" 	+ ИндексТекМесяца];			
		
	КонецЦикла;
	
	НастройкиОтображенияКолонок = Новый Структура;
	НастройкиОтображенияКолонок.Вставить("ПланСуммаБезНДС"		, ЭтаФорма.Элементы["СоставБюджетаПланСуммаБезНДС" 		+ ИндексТекМесяца].Видимость);
	НастройкиОтображенияКолонок.Вставить("ПланСумма"			, ЭтаФорма.Элементы["СоставБюджетаПланСумма" 			+ ИндексТекМесяца].Видимость);
	
	НастройкиОтображенияКолонок.Вставить("ОперФактСуммаБезНДС"	, ЭтаФорма.Элементы["СоставБюджетаОперФактСуммаБезНДС" 	+ ИндексТекМесяца].Видимость);
	НастройкиОтображенияКолонок.Вставить("ОперФактСумма"		, ЭтаФорма.Элементы["СоставБюджетаОперФактСумма" 		+ ИндексТекМесяца].Видимость);
	
		
	Элементы.НадписьИтогПоСтатье.Заголовок = "Итого по статье за месяц: ";
	
	// Выводим итог за месяц:
	ЭтоПервыйИтогВСтроке = Истина;
	
	Если НастройкиОтображенияКолонок.ПланСумма Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "План сумма: " +  Формат(ПланСуммаИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;		
	
	Если НастройкиОтображенияКолонок.ПланСуммаБезНДС Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "План сумма без НДС: " +  Формат(ПланСуммаБезНДСИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;
	
	Если НастройкиОтображенияКолонок.ОперФактСумма Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "Опер. факт сумма: " +  Формат(ОперФактСуммаИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;		
	
	Если НастройкиОтображенияКолонок.ОперФактСуммаБезНДС Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "Опер. факт сумма без НДС: " +  Формат(ОперФактСуммаБезНДСИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;		
			
	// Выводим итог за год:
	Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + " Итого по статье за год: ";
	
	ЭтоПервыйИтогВСтроке = Истина;
	
	Если НастройкиОтображенияКолонок.ПланСумма Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "План сумма: " +  Формат(ПланСуммаИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;		
	
	Если НастройкиОтображенияКолонок.ПланСуммаБезНДС Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "План сумма без НДС: " +  Формат(ПланСуммаБезНДСИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;
	
	Если НастройкиОтображенияКолонок.ОперФактСумма Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "Опер. факт сумма: " +  Формат(ОперФактСуммаИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;		
	
	Если НастройкиОтображенияКолонок.ОперФактСуммаБезНДС Тогда
		Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + ?(НЕ ЭтоПервыйИтогВСтроке, ", ", "") + "Опер. факт сумма без НДС: " +  Формат(ОперФактСуммаБезНДСИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
		ЭтоПервыйИтогВСтроке = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПланСуммаБезНДСИтог 	= 0;
	ПланСуммаИтог 			= 0;
	ПланКоличествоИтог 		= 0;
	
	ОперФактСуммаБезНДСИтог = 0;
	ОперФактСуммаИтог 		= 0;
	ОперФактКоличествоИтог 	= 0;
	
	Для Н = 1 По 12 Цикл
		
		ПланСуммаБезНДСИтог 	= ПланСуммаБезНДСИтог 		+ ТекДанные["ПланСуммаБезНДС" 		+ Н];
		ПланСуммаИтог 			= ПланСуммаИтог 			+ ТекДанные["ПланСумма" 			+ Н];
		ПланКоличествоИтог 		= ПланКоличествоИтог 		+ ТекДанные["ПланКоличество" 		+ Н];
		
		ОперФактСуммаБезНДСИтог = ОперФактСуммаБезНДСИтог 	+ ТекДанные["ОперФактСуммаБезНДС" 	+ Н];
		ОперФактСуммаИтог 		= ОперФактСуммаИтог 		+ ТекДанные["ОперФактСумма" 		+ Н];
		ОперФактКоличествоИтог 	= ОперФактКоличествоИтог 	+ ТекДанные["ОперФактКоличество" 	+ Н];
		
	КонецЦикла;
	
	ТекДанные.ПланСуммаБезНДСИтог 		= ПланСуммаБезНДСИтог;
	ТекДанные.ПланСуммаИтог 			= ПланСуммаИтог;
	ТекДанные.ПланКоличествоИтог 		= ПланКоличествоИтог;
	
	ТекДанные.ОперФактСуммаБезНДСИтог 	= ОперФактСуммаБезНДСИтог;
	ТекДанные.ОперФактСуммаИтог 		= ОперФактСуммаИтог;
	ТекДанные.ОперФактКоличествоИтог 	= ОперФактКоличествоИтог;
		
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриИзменении(Элемент)
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	Если Найти(ИмяТекКолонки, "Сумма") > 0 ИЛИ Найти(ИмяТекКолонки, "Количество") > 0 Тогда
		
		ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные);
		
	КонецЕсли;
	
	Если Найти(ИмяТекКолонки, "ОперФактСуммаБезНДС") > 0 Тогда
		
		ИндексКолонки = СтрЗаменить(ИмяТекКолонки, "ОперФактСуммаБезНДС"	, "");
		ИндексКолонки = СтрЗаменить(ИндексКолонки, "СоставБюджета"			, "");
		
		ИндексКолонки = Число(ИндексКолонки);
		
		Если ТекДанные.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = Перечисления.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов Тогда
			
			ТекДанные["ОперФактСумма" + ИндексКолонки] = ТекДанные["ОперФактСуммаБезНДС" + ИндексКолонки] + УчетНДС.РассчитатьСуммуНДС(ТекДанные["ОперФактСуммаБезНДС" + ИндексКолонки], Истина, Ложь, 18);
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьВыручку(Команда)
		
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЭтаФорма.Модифицированность = Истина;	
	
	КомандаЗаполнитьВыручкуСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьВыручкуСервер()
			
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьВыручкуНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьУслугиРетро(Команда)
		
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЭтаФорма.Модифицированность = Истина;	
	
	КомандаЗаполнитьУслугиРетроСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьУслугиРетроСервер()
			
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьУслугиРетроНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСебестоимость(Команда)
		
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЭтаФорма.Модифицированность = Истина;	
	
	КомандаЗаполнитьСебестоимостьСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьСебестоимостьСервер()
			
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьСебестоимостьНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
			
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТранспортныеРасходы(Команда)
		
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата планирования", ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЭтаФорма.Модифицированность = Истина;	
	
	КомандаЗаполнитьТранспортныеРасходыСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьТранспортныеРасходыСервер()
			
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьТранспортныеРасходыНаТекущийМесяц(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
			
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если НЕ мРежимВыбораАналитики = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;	
	
	// Попробуем получить номер месяца
	НомерЯчейки = СтрЗаменить(ИмяТекКолонки	, "СоставБюджета"		, "");
	
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ПланСуммаБезНДС"		, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ПланСумма"			, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ПланКоличество"		, "");
	
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ОперФактСуммаБезНДС"	, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ОперФактСумма"		, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ОперФактКоличество"	, "");	
	
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "Подтверждено"		, "");	
	
	Попытка 
		НомерЯчейки = Число(НомерЯчейки);
	Исключение
		// Ячейка не выбрана
		Возврат;
	КонецПопытки;
	
	Если Вопрос("Добавить ЗРС в выбранную ячейку?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда 
		Закрыть(Неопределено);
	КонецЕсли;
	
	СтруктураВыбраннойАналитики = Новый Структура;
	
	СтруктураВыбраннойАналитики.Вставить("ИдентификаторСтрокиБюджета"	, ТекДанные.ИдентификаторСтрокиБюджета);
	СтруктураВыбраннойАналитики.Вставить("СтатьяОборотовПоБюджетам"		, ТекДанные.СтатьяОборотовПоБюджетам);
	СтруктураВыбраннойАналитики.Вставить("АналитикаБюджета"             , ТекДанные.АналитикаБюджета);
	СтруктураВыбраннойАналитики.Вставить("Контрагент"                   , ТекДанные.Контрагент);
	СтруктураВыбраннойАналитики.Вставить("НомерМесяца"					, НомерЯчейки);
	
	Закрыть(СтруктураВыбраннойАналитики);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимВыбораАналитики()
	
	Если мРежимВыбораАналитики = Истина Тогда
		
		ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.СоставБюджетаКнопкаВыбратьСтрокиВЗРС.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьСтрокиВЗРС_НеИсп(Команда)	

	Если НЕ мРежимВыбораАналитики = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ВыделенныеСтроки= Элементы.СоставБюджета.ВыделенныеСтроки;
	//ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;	
	
	// Попробуем получить номер месяца
	НомерЯчейки = СтрЗаменить(ИмяТекКолонки	, "СоставБюджета"		, "");
	
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ПланСуммаБезНДС"		, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ПланСумма"			, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ПланКоличество"		, "");
	
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ОперФактСуммаБезНДС"	, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ОперФактСумма"		, "");
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "ОперФактКоличество"	, "");	
	
	НомерЯчейки = СтрЗаменить(НомерЯчейки	, "Подтверждено"		, "");	
	
	Попытка 
		НомерЯчейки = Число(НомерЯчейки);
	Исключение
		// Ячейка не выбрана
		Возврат;
	КонецПопытки;
	
	Если Вопрос("Добавить ЗРС в выбранные ячейки?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда 
		Закрыть(Неопределено);
	КонецЕсли;
	
	МассивВыбранныхАналитик = Новый Массив;
	
	Для Каждого ТекВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекДанные = Объект.СоставБюджета[ТекВыделеннаяСтрока];
		
		СтруктураВыбраннойАналитики = Новый Структура;
	
		СтруктураВыбраннойАналитики.Вставить("ИдентификаторСтрокиБюджета"	, ТекДанные.ИдентификаторСтрокиБюджета);
		СтруктураВыбраннойАналитики.Вставить("СтатьяОборотовПоБюджетам"		, ТекДанные.СтатьяОборотовПоБюджетам);
		СтруктураВыбраннойАналитики.Вставить("АналитикаБюджета"             , ТекДанные.АналитикаБюджета);
		СтруктураВыбраннойАналитики.Вставить("Контрагент"                   , ТекДанные.Контрагент);
		
		СтруктураВыбраннойАналитики.Вставить("ПланКоличество"               , ТекДанные["ПланКоличество" 	+ НомерЯчейки]);
		СтруктураВыбраннойАналитики.Вставить("ПланСуммаБезНДС"              , ТекДанные["ПланСуммаБезНДС" 	+ НомерЯчейки]);
		СтруктураВыбраннойАналитики.Вставить("ПланСумма"                   	, ТекДанные["ПланСумма" 		+ НомерЯчейки]);
		
		СтруктураВыбраннойАналитики.Вставить("НомерМесяца"					, НомерЯчейки);	
		
		МассивВыбранныхАналитик.Добавить(СтруктураВыбраннойАналитики);
	КонецЦикла;
			
	Закрыть(МассивВыбранныхАналитик);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьСтрокиВЗРС(Команда)	

	Если НЕ мРежимВыбораАналитики = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеЯчейки = ТабличноеПолеСоставБюджета.ВыделенныеОбласти;
	
	МассивВыбранныхАналитик = Новый Массив;
	
	Для Каждого ВыделеннаяЯчейка Из ВыделенныеЯчейки Цикл
		
		Если ВыделеннаяЯчейка.Расшифровка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивВыбранныхАналитик.Добавить(ВыделеннаяЯчейка.Расшифровка);
		
	КонецЦикла;
	
	Если МассивВыбранныхАналитик.Количество() = 0 Тогда
		// Ячейки не выбраны
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Добавить ЗРС в выбранные ячейки?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда 
		Закрыть(Неопределено);
	КонецЕсли;

	Закрыть(МассивВыбранныхАналитик);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеСоставБюджетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


