////////////////////////////////////////////////////////////////////////////////
// Функции для переноса данных из ЗУП 2.5
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ВыполнитьАлгоритм(ИмяАлгоритма, Знач Алгоритмы,
	ИсходящиеДанные = "", ВходящиеДанные = "", Источник = "", Приемник = "", ТипПриемника = "", Значение = "", Выражение = "",
	Пусто = "", ВыборкаДанных = "", Объект = "", КоллекцияОбъектов = "", ОбъектКоллекции = "", ИмяПКО = "", ИмяПКОВидСубконто = "",
	НомерПКО = "", НомерПКС = "", Правило = "", КлючВыгружаемыхДанных = "", НеЗапоминатьВыгруженные = "", НеЗамещатьОбъектПриЗагрузке = "",
	ВсеОбъектыВыгружены = "", ТолькоПолучитьУзелСсылки = "", РежимЗаписи = "", РежимПроведения = "", СтандартнаяОбработка = "",
	НеЗамещать = "", НеОчищать = "", УзелСсылки = "", УзелКоллекцииОбъектов = "", УзелОбъектаКоллекции = "", УзелСвойства = "") Экспорт
	
	ВидСубконто	= Алгоритмы;
	Субконто	= Неопределено;
	
	Выполнить(Алгоритмы[ИмяАлгоритма]);
	
	Возврат Субконто;
	
КонецФункции

Функция Массив_Добавить(Массив, Элемент) Экспорт
	
	Массив.Добавить(Элемент);
	
КонецФункции

Функция Массив_Количество(Массив) Экспорт
	
	Возврат Массив.Количество();
	
КонецФункции

Функция Массив_Получить(Массив, Индекс) Экспорт
	
	Возврат Массив[Индекс - 1];
	
КонецФункции

Функция НовыйОбъект(ТипОбъекта) Экспорт
	
	Если ТипОбъекта = "Структура" Тогда
		Возврат Новый Структура;
		
	ИначеЕсли ТипОбъекта = "Массив" Тогда
		Возврат Новый Массив;
		
	ИначеЕсли ТипОбъекта = "ТаблицаЗначений" Тогда
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Структура_Получить(Структура, ИмяРеквизита) Экспорт
	
	Возврат Структура[ИмяРеквизита];
	
КонецФункции

Функция Структура_Установить(Структура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	Структура.Вставить(ИмяРеквизита, ЗначениеРеквизита);
	
КонецФункции

Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
	
КонецФункции

Функция ТаблицаЗначений_ДобавитьКолонку(ТаблицаЗначений, Колонка) Экспорт
	
	Возврат ТаблицаЗначений.Колонки.Добавить(Колонка);
	
КонецФункции

Функция ТаблицаЗначений_ДобавитьСтроку(ТаблицаЗначений) Экспорт
	
	Возврат ТаблицаЗначений.Добавить();
	
КонецФункции

Функция ТаблицаЗначений_Количество(ТаблицаЗначений) Экспорт
	
	Возврат ТаблицаЗначений.Количество();
	
КонецФункции

Функция ТаблицаЗначений_НайтиСтроки(ТаблицаЗначений, ИменаПолей, Значение1, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено, Значение5 = Неопределено) Экспорт
	
	Возврат ТаблицаЗначений.НайтиСтроки(Новый Структура(ИменаПолей, Значение1, Значение2, Значение3, Значение4, Значение5));
	
КонецФункции

Функция ТаблицаЗначений_Очистить(ТаблицаЗначений) Экспорт
	
	ТаблицаЗначений.Очистить();
	
КонецФункции
Функция ТаблицаЗначений_Получить(ТаблицаЗначений, Индекс) Экспорт
	
	Возврат ТаблицаЗначений[Индекс-1];
	
КонецФункции

