// Формат параметра ячейки:
// П_<НомерРаздела>_<НомерПодраздела>_<КодВидаБюджета>_<КодВидаИтога>_<НомерМесяца>
//	<КодВидаБюджета>: 1 - Бюджет, 2 - План, 3 - Факт
// 	<КодВидаИтога>: М - Месяц, К - Квартал, Н - Нарастающий итог по квараталам

// Формат параметра ячейки расшифровки:
// П_<КодВнутренниеВнешние>_<КодВидаБюджета>_<КодВидаИтога>_<НомерМесяца>
//	<КодВнутренниеВнешние>: 0 - Всего, 1 - Внутренние, 2 - Внешние
// 	<КодВидаИтога>: М - Месяц, К - Квартал, Н - Нарастающий итог по квараталам

Функция ПодготовитьСтруктуруПараметровМакета() Экспорт
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("Организация"	, Организация);
	СтруктураПараметров.Вставить("ПериодГод"	, Год(Период));
	
	Для СчПериодов = 1 по 12 Цикл
		
		ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "М", СчПериодов);
		
		// Итог по кварталам
		Если СчПериодов % 3 = 0 Тогда
			
			ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "К", СчПериодов);
			
		КонецЕсли;
		
		// Нарастающий итог с полугодия
		Если СчПериодов % 3 = 0 И СчПериодов > 3 Тогда
			
			ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "Н", СчПериодов);
			
		КонецЕсли;
			
	КонецЦикла;
	
	ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "ПФ", 12, Истина);
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ПодготовитьКолонкуСтруктурыМакета(С, ТекКодВидаИтога, ТекНомерПериода, ЭтоПланФакт = Ложь)
	
	Если ЭтоПланФакт Тогда
		Нач = 0;
		Кон = 0;
	Иначе
		Нач = 1;
		Кон = 4;
	КонецЕсли;
		
	Для СчВидБюджета = Нач по Кон Цикл
		
		// Раздел 1
		С.Вставить("П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 2
		С.Вставить("П_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);			
		С.Вставить("П_2_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 3
		С.Вставить("П_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 4
		С.Вставить("П_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_4_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 5
		С.Вставить("П_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_5_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_5_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_5_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_5_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 6
		С.Вставить("П_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 7
		С.Вставить("П_7_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 8
		С.Вставить("П_8_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);			
		С.Вставить("П_8_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_8_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 9
		С.Вставить("П_9_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 10
		С.Вставить("П_10_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 11
		С.Вставить("П_11_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 12
		С.Вставить("П_12_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 13
		С.Вставить("П_13_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 14
		С.Вставить("П_14_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 15
		С.Вставить("П_15_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 16
		С.Вставить("П_16_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 17
		С.Вставить("П_17_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 18
		С.Вставить("П_18_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 19
		С.Вставить("П_19_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 20
		С.Вставить("П_20_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьИтогиПараметровМакета(СтруктураДанных)
	
	РассчитатьПланФактМакета(СтруктураДанных, "ПФ");
	
	Для СчПериодов = 1 по 12 Цикл
		
		РассчитатьИтогКолонкиПараметровМакета(СтруктураДанных, "М", СчПериодов);
		
		// Итог по кварталам
		Если СчПериодов % 3 = 0 Тогда
			
			РассчитатьНакопительныйИтогПараметровМакета(СтруктураДанных, "К", СчПериодов - 2, СчПериодов);
			
		КонецЕсли;
		
		// Нарастающий итог с полугодия
		Если СчПериодов % 3 = 0 И СчПериодов > 3 Тогда
			
			РассчитатьНакопительныйИтогПараметровМакета(СтруктураДанных, "Н", 1, СчПериодов);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьПланФактМакета(С, ТекКодВидаИтога)
	
	ТекВидБюджета 			= 0;
	ТекНомерПериодаКон 		= 12;
	
	ТекВидБюджетаФакт 		= 3;
	ТекКодВидаИтогаМесяц 	= "М";
	
	Для ТекНомерПериода = 1 По 12 Цикл
		
		Если ТекНомерПериода <= МесяцФакт Тогда
			ВидБюджетаПФ = 3;
		ИначеЕсли ТекНомерПериода <= МесяцОперФакт Тогда
			ВидБюджетаПФ = 4;
		Иначе
			ВидБюджетаПФ = 2;
		КонецЕсли;
		
		// Итог по месяцу факт
		
		С["П_1_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_1_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 2
		С["П_2_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_2_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_4_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_5_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_6_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_6_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_7_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_2_7_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 3
		С["П_3_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_3_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 4
		С["П_4_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_1_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_8_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_8_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_9_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_9_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_2_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_3_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_4_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_5_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_6_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_4_6_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 5
		С["П_5_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_5_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_1_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_5_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_2_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_5_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_3_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_5_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_4_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_5_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_5_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_5_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 6
		С["П_6_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_6_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 7
		С["П_7_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_7_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 8
		С["П_8_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_8_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		С["П_8_1_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_8_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_8_2_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_8_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 9
		С["П_9_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_9_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 10
		С["П_10_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_10_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 11
		С["П_11_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_11_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 12
		С["П_12_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_12_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 13
		С["П_13_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_13_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 14
		С["П_14_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_14_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 15
		С["П_15_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_15_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 16
		С["П_16_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_16_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		//С["П_16_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = ?(С["П_15_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] > 0, С["П_15_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] * 0.2, 0);
		
		// Раздел 17
		С["П_17_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_17_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 18
		С["П_18_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_18_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 19
		С["П_19_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_19_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 20
		С["П_20_0_" + ТекВидБюджетаФакт + "_" + ТекКодВидаИтогаМесяц + "_" + ТекНомерПериода] = С["П_20_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		
		
		// Итоговая колонка План+Факт
		С["П_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 2
		С["П_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_6_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_6_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_6_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_7_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_7_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_7_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 3
		С["П_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_3_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 4
		С["П_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_8_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_8_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_8_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_9_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_9_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_9_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_4_6_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_6_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_6_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 5
		С["П_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_5_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 6
		С["П_6_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 7
		С["П_7_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 8
		С["П_8_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_8_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_8_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		С["П_8_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_8_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_8_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_8_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_8_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_8_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 9
		С["П_9_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_9_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_9_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 10
		С["П_10_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_10_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_10_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 11
		С["П_11_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_11_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_11_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 12
		С["П_12_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_12_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_12_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 13
		С["П_13_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_13_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_13_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 14
		С["П_14_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_14_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_14_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 15
		С["П_15_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_15_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_15_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 16
		С["П_16_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_16_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_16_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 17
		С["П_17_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_17_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_17_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 18
		С["П_18_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_18_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_18_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 19
		С["П_19_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_19_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_19_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 20
		С["П_20_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_20_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_20_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьИтогКолонкиПараметровМакета(С, ТекКодВидаИтога, ТекНомерПериода)
	
	Для СчВидБюджета = 1 по 3 Цикл
		
		// Раздел 1
		//С["П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 2
		С["П_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_2_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_2_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_2_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +		
		С["П_2_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_2_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 3
		С["П_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 4
		С["П_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] =
		
		С["П_4_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_4_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 5
		С["П_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] =
		
		С["П_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_5_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_5_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_5_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_5_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 6
		С["П_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 7
		//С["П_7_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_7_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 8
		С["П_8_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] =
		
		С["П_8_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_8_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 9
		//С["П_9_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_9_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 10
		//С["П_10_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_10_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];		
		
		// Раздел 11
		С["П_11_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_7_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_8_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] + 
		С["П_9_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_10_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 12
		//С["П_12_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_12_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 13
		//С["П_13_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_13_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 14
		//С["П_14_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_14_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 15
		С["П_15_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] =
		
		С["П_11_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] +
		С["П_12_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] -
		С["П_13_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_14_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 16
		С["П_16_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_15_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] * 0.2;
		
		// Раздел 17
		С["П_17_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_15_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_16_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 18
		//С["П_18_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_18_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]; 
		
		// Раздел 19
		//С["П_19_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		//
		//С["П_19_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 20
		С["П_20_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] = 
		
		С["П_17_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] - 
		С["П_18_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
				
	КонецЦикла;	
	
КонецПроцедуры

Процедура РассчитатьНакопительныйИтогПараметровМакета(С, ТекКодВидаИтога, ТекНомерПериодаНач, ТекНомерПериодаКон)
	
	Для ТекНомерПериода = ТекНомерПериодаНач По ТекНомерПериодаКон Цикл
		
		Для СчВидБюджета = 1 по 3 Цикл
			С["П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 2
			С["П_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_4_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_5_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_6_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_7_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 3
			С["П_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_3_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 4
			С["П_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_8_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_9_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_3_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_4_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_5_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_4_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_6_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 5
			С["П_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_5_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_5_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_3_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_5_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_4_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_5_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_5_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 6
			С["П_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 7
			С["П_7_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 8
			С["П_8_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_8_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_8_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
			С["П_8_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_8_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_8_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_8_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_8_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_8_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 9
			С["П_9_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_9_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_9_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 10
			С["П_10_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_10_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_10_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 11
			С["П_11_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_11_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_11_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 12
			С["П_12_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_12_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_12_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 13
			С["П_13_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_13_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_13_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 14
			С["П_14_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_14_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_14_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 15
			С["П_15_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_15_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_15_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 16
			С["П_16_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_16_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_16_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 17
			С["П_17_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_17_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_17_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 18
			С["П_18_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_18_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_18_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 19
			С["П_19_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_19_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_19_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 20
			С["П_20_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_20_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_20_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПараметровМакетаДанными(СтруктураДанных)
	
	ЗапросДанные = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_СобственныеКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(ОборотыБюджетовОбороты.Период) КАК КодМесяца,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.КодРазделаФормыБДР
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБРД.КодРазделаФормыБДР
	|	КОНЕЦ КАК КодРаздела,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.КодПодразделаФормыБДР
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБРД.КодПодразделаФормыБДР
	|	КОНЕЦ КАК КодПодраздела,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
	|			ТОГДА 1
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|			ТОГДА 2
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|			ТОГДА 3
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
	|			ТОГДА 4
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодСценария,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ * ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК ЗначениеСумма
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет В (&Бюджет)
	|				И Сценарий В (&Сценарий)
	|				И ВЫБОР
	|					КОГДА &ОтборПоОрганизации
	|						ТОГДА Организация В (&Организация)
	|					ИНАЧЕ НЕ Контрагент В
	|								(ВЫБРАТЬ
	|									СобственныеКонтрагенты.Контрагент
	|								ИЗ
	|									ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ОтборПоЦФО
	|						ТОГДА ЦФО = &ЦФО
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ОборотыБюджетовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(ОборотыБюджетовОбороты.Период),
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.КодРазделаФормыБДР
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБРД.КодРазделаФормыБДР
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.КодПодразделаФормыБДР
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБРД.КодПодразделаФормыБДР
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
	|			ТОГДА 1
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|			ТОГДА 2
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|			ТОГДА 3
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
	|			ТОГДА 4
	|		ИНАЧЕ 0
	|	КОНЕЦ");
	
	ЗапросДанные.УстановитьПараметр("Период"				, Период);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	ЗапросДанные.УстановитьПараметр("Организация"			, Организация);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоЦФО"			, ЗначениеЗаполнено(ЦФО));
	ЗапросДанные.УстановитьПараметр("ЦФО"					, ЦФО);	
	
	ЗапросДанные.УстановитьПараметр("Бюджет"				, ВидБюджета);
	
	МассивСценариев = Новый Массив();
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Бюджет);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.План);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Факт);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.ОперативныйФакт);
	
	ЗапросДанные.УстановитьПараметр("Сценарий"				, МассивСценариев);
	
	Выборка = ЗапросДанные.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекКлючДанных = "П_" + Выборка.КодРаздела  + "_" + Выборка.КодПодраздела + "_" + Выборка.КодСценария + "_М_" + Выборка.КодМесяца;
		
		СтруктураДанных.Вставить(ТекКлючДанных, Выборка.ЗначениеСумма); 
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСтруктуруДанныхБДР() Экспорт
	
	СтруктураДанных = ПодготовитьСтруктуруПараметровМакета();
	
	ЗаполнитьСтруктуруПараметровМакетаДанными(СтруктураДанных);
	
	РассчитатьИтогиПараметровМакета(СтруктураДанных);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьСтруктуруСтрокиРасшифровки()
	
	СтруктураПараметров = Новый Структура();
		
	Для СчПериодов = 1 по 12 Цикл
		
		ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "М", СчПериодов);
		
		// Итог по кварталам
		Если СчПериодов % 3 = 0 Тогда
			
			ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "К", СчПериодов);
			
		КонецЕсли;
		
		// Нарастающий итог с полугодия
		Если СчПериодов % 3 = 0 И СчПериодов > 3 Тогда
			
			ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "Н", СчПериодов);
			
		КонецЕсли;
			
	КонецЦикла;
	
	ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "ПФ", 12, Истина);
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ПодготовитьКолонкуСтрокиРасшифровки(С, ТекКодВидаИтога, ТекНомерПериода, ЭтоПланФакт = Ложь)
	
	Если ЭтоПланФакт Тогда
		Нач = 0;
		Кон = 0;
	Иначе
		Нач = 1;
		Кон = 4;
	КонецЕсли;

	Для СчВидБюджета = Нач по Кон Цикл
		
		С.Вставить("П_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьЗапросРасшифровкиБДР()
	
	ЗапросДанные = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_СобственныеКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиОборотовПоБюджетам.Ссылка КАК СтатьяОборотов,
	|	СтатьиОборотовПоБюджетам.ОсновноеЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.Период ЕСТЬ NULL 
	|			ТОГДА МЕСЯЦ(ОборотыБюджетовОбороты.Период)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КодМесяца,
	|	ВЫБОР
	|		КОГДА НЕ СтатьиОборотовПоБюджетам.абс_РазделФормыБРД = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)
	|			ТОГДА СтатьиОборотовПоБюджетам.абс_РазделФормыБРД
	|		ИНАЧЕ СтатьиОборотовПоБюджетам.Родитель.абс_РазделФормыБРД
	|	КОНЕЦ КАК СтатьяРаздел,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
	|			ТОГДА 1
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|			ТОГДА 2
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КодСценария,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОборотыБюджетовОбороты.Контрагент В
	|						(ВЫБРАТЬ
	|							СобственныеКонтрагенты.Контрагент
	|						ИЗ
	|							ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК СобственныйКонтрагент,
	|	ВЫБОР
	|		КОГДА СтатьиОборотовПоБюджетам.Ссылка.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот, 0) КАК ЗначениеСумма
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				абс_Бюджет В (&Бюджет)
	|					И Сценарий В (&Сценарий)
	|					И ВЫБОР
	|						КОГДА &ОтборПоОрганизации
	|							ТОГДА Организация В (&Организация)
	|						ИНАЧЕ НЕ Контрагент В
	|									(ВЫБРАТЬ
	|										СобственныеКонтрагенты.Контрагент
	|									ИЗ
	|										ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &ОтборПоЦФО
	|							ТОГДА ЦФО = &ЦФО
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ОборотыБюджетовОбороты
	|		ПО (ОборотыБюджетовОбороты.СтатьяОборотов = СтатьиОборотовПоБюджетам.Ссылка)
	|ГДЕ
	|	НЕ СтатьиОборотовПоБюджетам.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.СтатьяОборотов,
	|	ВТ_Данные.ЦФО,
	|	ВТ_Данные.КодМесяца,
	|	ВТ_Данные.СтатьяРаздел,
	|	ВТ_Данные.КодСценария,
	|	ВТ_Данные.СобственныйКонтрагент,
	|	СУММА(ВТ_Данные.ЗначениеСумма) КАК ЗначениеСумма
	|ПОМЕСТИТЬ ВТ_ДанныеСгруппировано
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	НЕ ВТ_Данные.СтатьяРаздел ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ЦФО,
	|	ВТ_Данные.СтатьяОборотов,
	|	ВТ_Данные.СтатьяРаздел,
	|	ВТ_Данные.СобственныйКонтрагент,
	|	ВТ_Данные.КодМесяца,
	|	ВТ_Данные.КодСценария
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ЦФО КАК ЦФО,
	|	ВТ_Данные.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_Данные.КодМесяца КАК КодМесяца,
	|	ВТ_Данные.КодСценария КАК КодСценария,
	|	ВТ_Данные.СтатьяРаздел КАК РазделБДР,
	|	ВТ_Данные.ЗначениеСумма КАК ЗначениеСумма,
	|	ВТ_Данные.СобственныйКонтрагент КАК Собственный
	|ИЗ
	|	ВТ_ДанныеСгруппировано КАК ВТ_Данные
	|ГДЕ
	|	НЕ ВТ_Данные.КодМесяца = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Данные.СтатьяРаздел.КодРазделаФормыБДР,
	|	ВТ_Данные.СтатьяРаздел.КодПодразделаФормыБДР,
	|	ВТ_Данные.СтатьяРаздел
	|ИТОГИ
	|	СУММА(ЗначениеСумма)
	|ПО
	|	РазделБДР,
	|	ЦФО,
	|	СтатьяОборотов,
	|	КодМесяца,
	|	КодСценария,
	|	Собственный");
	
	ЗапросДанные.УстановитьПараметр("Период"				, Период);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	ЗапросДанные.УстановитьПараметр("Организация"			, Организация);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоЦФО"			, ЗначениеЗаполнено(ЦФО));
	ЗапросДанные.УстановитьПараметр("ЦФО"					, ЦФО);	
	
	ЗапросДанные.УстановитьПараметр("Бюджет"				, ВидБюджета);
	
	МассивСценариев = Новый Массив();
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Бюджет);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.План);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Факт);
	
	ЗапросДанные.УстановитьПараметр("Сценарий"				, МассивСценариев);
	
	Возврат ЗапросДанные.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
КонецФункции

Функция ПолучитьИтогиПоРазделуРасшифровкиБДР(ВыборкаРаздел)
	
	СтруктураИтоговПоРазделу = ПолучитьСтруктуруСтрокиРасшифровки();

	ВыборкаЦФО = ВыборкаРаздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаЦФО.Следующий() Цикл

		ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаКодМесяца = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКодМесяца.Следующий() Цикл
				
				ВыборкаКодСценария = ВыборкаКодМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКодСценария.Следующий() Цикл
					
					ТекКлючДанных = "П_0_" + ВыборкаКодСценария.КодСценария + "_" + "М" + "_" + ВыборкаКодСценария.КодМесяца;
					
					Если СтруктураИтоговПоРазделу.Свойство(ТекКлючДанных) = Неопределено Тогда
						СтруктураИтоговПоРазделу.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
					Иначе
						СтруктураИтоговПоРазделу[ТекКлючДанных] = СтруктураИтоговПоРазделу[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
					КонецЕсли;
											
					ВыборкаСобственный = ВыборкаКодСценария.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаСобственный.Следующий() Цикл
						
						ТекКлючДанных = "П_" + ?(ВыборкаСобственный.Собственный, 1, 2) + "_" + ВыборкаСобственный.КодСценария + "_" + "М" + "_" + ВыборкаСобственный.КодМесяца;
							
						Если СтруктураИтоговПоРазделу.Свойство(ТекКлючДанных) = Неопределено Тогда
							СтруктураИтоговПоРазделу.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
						Иначе
							СтруктураИтоговПоРазделу[ТекКлючДанных] = СтруктураИтоговПоРазделу[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;	
		КонецЦикла;		
	КонецЦикла;
	
	РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураИтоговПоРазделу);
	
	Возврат СтруктураИтоговПоРазделу;
	
КонецФункции

Функция ПолучитьИтогиПоЦФОРасшифровкиБДР(ВыборкаЦФО)
	
	СтруктураИтоговПоЦФО = ПолучитьСтруктуруСтрокиРасшифровки();

	ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаКодМесяца = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКодМесяца.Следующий() Цикл
			
			ВыборкаКодСценария = ВыборкаКодМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКодСценария.Следующий() Цикл
				
				ТекКлючДанных = "П_0_" + ВыборкаКодСценария.КодСценария + "_" + "М" + "_" + ВыборкаКодСценария.КодМесяца;
				
				Если СтруктураИтоговПоЦФО.Свойство(ТекКлючДанных) = Неопределено Тогда
					СтруктураИтоговПоЦФО.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
				Иначе
					СтруктураИтоговПоЦФО[ТекКлючДанных] = СтруктураИтоговПоЦФО[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
				КонецЕсли;
										
				ВыборкаСобственный = ВыборкаКодСценария.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаСобственный.Следующий() Цикл
					
					ТекКлючДанных = "П_" + ?(ВыборкаСобственный.Собственный, 1, 2) + "_" + ВыборкаСобственный.КодСценария + "_" + "М" + "_" + ВыборкаСобственный.КодМесяца;
						
					Если СтруктураИтоговПоЦФО.Свойство(ТекКлючДанных) = Неопределено Тогда
						СтруктураИтоговПоЦФО.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
					Иначе
						СтруктураИтоговПоЦФО[ТекКлючДанных] = СтруктураИтоговПоЦФО[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;		
	
	РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураИтоговПоЦФО);
	
	Возврат СтруктураИтоговПоЦФО;
	
КонецФункции

Процедура РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураДанных)
	
	Для СчПериодов = 1 по 12 Цикл
		
		// Итог по кварталам
		Если СчПериодов % 3 = 0 Тогда
			
			РассчитатьНакопительныйИтогПараметровМакетаРасшифровки(СтруктураДанных, "К", СчПериодов - 2, СчПериодов);
			
		КонецЕсли;
		
		// Нарастающий итог с полугодия
		Если СчПериодов % 3 = 0 И СчПериодов > 3 Тогда
			
			РассчитатьНакопительныйИтогПараметровМакетаРасшифровки(СтруктураДанных, "Н", 1, СчПериодов);
			
		КонецЕсли;
			
	КонецЦикла;
	
	РассчитатьПланФактМакетаРасшифровки(СтруктураДанных, "ПФ");
	
КонецПроцедуры

Процедура РассчитатьПланФактМакетаРасшифровки(С, ТекКодВидаИтога)
	
	ТекВидБюджета = 0;
	ТекНомерПериодаКон = 12;
	
	Для ТекНомерПериода = 1 По 12 Цикл
		
		Если ТекНомерПериода <= МесяцФакт Тогда
			ВидБюджетаПФ = 3;
		ИначеЕсли ТекНомерПериода <= МесяцОперФакт Тогда
			ВидБюджетаПФ = 4;
       	Иначе
			ВидБюджетаПФ = 2;
		КонецЕсли;
	
		Для СчКодВнутренниеВнешние = 0 по 2 Цикл
			
			С["П_" + СчКодВнутренниеВнешние + "_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_" + СчКодВнутренниеВнешние + "_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_" + СчКодВнутренниеВнешние + "_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода]
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьНакопительныйИтогПараметровМакетаРасшифровки(С, ТекКодВидаИтога, ТекНомерПериодаНач, ТекНомерПериодаКон)
	
	Для ТекНомерПериода = ТекНомерПериодаНач По ТекНомерПериодаКон Цикл
		
		Для СчКодВнутренниеВнешние = 0 по 2 Цикл
			
			Для СчВидБюджета = 1 по 3 Цикл
				
				С["П_" + СчКодВнутренниеВнешние + "_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_" + СчКодВнутренниеВнешние + "_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_" + СчКодВнутренниеВнешние + "_" + СчВидБюджета + "_М_" + ТекНомерПериода]
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиРасшифровкуБДР(Макет, ТабДок) Экспорт
	
	ОбластьБДРДетализацияЗаголовок 	= Макет.ПолучитьОбласть("ОбластьБДРДетализацияЗаголовок");
	ОбластьБДРДетализацияШапка 		= Макет.ПолучитьОбласть("ОбластьБДРДетализацияШапка");
	ОбластьБДРДетализацияРаздел 	= Макет.ПолучитьОбласть("ОбластьБДРДетализацияРаздел");
	ОбластьБДРДетализацияЦФО 		= Макет.ПолучитьОбласть("ОбластьБДРДетализацияЦФО");
	ОбластьБДРСтатья 				= Макет.ПолучитьОбласть("ОбластьБДРСтатья");
	
	ТабДок.Вывести(ОбластьБДРДетализацияЗаголовок);
	
	ВыборкаРаздел = ПолучитьЗапросРасшифровкиБДР();
	
	Пока ВыборкаРаздел.Следующий() Цикл
		
		ОбластьБДРДетализацияШапка.Параметры.ЗаголовокРасшифровки 	= "БДР П." + ВыборкаРаздел.РазделБДР.КодРазделаФормыБДР + "." + ?(ЗначениеЗаполнено(ВыборкаРаздел.РазделБДР.КодПодразделаФормыБДР), "" + ВыборкаРаздел.РазделБДР.КодПодразделаФормыБДР + ".", "");
		
		ТабДок.Вывести(ОбластьБДРДетализацияШапка);		
		
		ОбластьБДРДетализацияРаздел.Параметры.КодРаздела 			= "" + ВыборкаРаздел.РазделБДР.КодРазделаФормыБДР + "." + ?(ЗначениеЗаполнено(ВыборкаРаздел.РазделБДР.КодПодразделаФормыБДР), "" + ВыборкаРаздел.РазделБДР.КодПодразделаФормыБДР + ".", "");
		ОбластьБДРДетализацияРаздел.Параметры.НаименованиеРаздела 	= ВыборкаРаздел.РазделБДР.Наименование;
		
		СтруктураИтоговПоРазделу = ПолучитьИтогиПоРазделуРасшифровкиБДР(ВыборкаРаздел);
		
		ОбластьБДРДетализацияРаздел.Параметры.Заполнить(СтруктураИтоговПоРазделу);
				
		ТабДок.Вывести(ОбластьБДРДетализацияРаздел);
		
		ТабДок.НачатьГруппуСтрок();
		
		ВыборкаЦФО = ВыборкаРаздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦФО.Следующий() Цикл
			
			Попытка
				ОбластьБДРДетализацияЦФО.Параметры.НаименованиеЦФО		= ВыборкаЦФО.ЦФО.Наименование;
			Исключение
				ОбластьБДРДетализацияЦФО.Параметры.НаименованиеЦФО		= "<ЦФО не определено>";
			КонецПопытки;
			
			СтруктураИтоговПоЦФО = ПолучитьИтогиПоЦФОРасшифровкиБДР(ВыборкаЦФО);
			
			ОбластьБДРДетализацияЦФО.Параметры.Заполнить(СтруктураИтоговПоЦФО);
						
			ТабДок.Вывести(ОбластьБДРДетализацияЦФО);
			
			ТабДок.НачатьГруппуСтрок();			
			
			ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСтатья.Следующий() Цикл
				
				СтруктураДанныхСтроки = ПолучитьСтруктуруСтрокиРасшифровки();
				
				ВыборкаКодМесяца = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКодМесяца.Следующий() Цикл
					
					ВыборкаКодСценария = ВыборкаКодМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаКодСценария.Следующий() Цикл
						
						ТекКлючДанных = "П_0_" + ВыборкаКодСценария.КодСценария + "_" + "М" + "_" + ВыборкаКодСценария.КодМесяца;
						
						СтруктураДанныхСтроки.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
												
						ВыборкаСобственный = ВыборкаКодСценария.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаСобственный.Следующий() Цикл
							
							ТекКлючДанных = "П_" + ?(ВыборкаСобственный.Собственный, 1, 2) + "_" + ВыборкаСобственный.КодСценария + "_" + "М" + "_" + ВыборкаСобственный.КодМесяца;
							
							СтруктураДанныхСтроки.Вставить(ТекКлючДанных, ВыборкаСобственный.ЗначениеСумма);
							
						КонецЦикла;
												
					КонецЦикла;
										
				КонецЦикла;	
				
				ОбластьБДРСтатья.Параметры.НаименованиеСтатьи		= ВыборкаСтатья.СтатьяОборотов.Наименование;
				
				РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураДанныхСтроки);
				
				ОбластьБДРСтатья.Параметры.Заполнить(СтруктураДанныхСтроки);
				
				ТабДок.Вывести(ОбластьБДРСтатья);
				
			КонецЦикла;
			
			ТабДок.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ТабДок.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НастроитьГруппировкиМакетаБДР(ТабДок) Экспорт
	
	ТабДок.Область( , 6 , , 7).Сгруппировать();
	ТабДок.Область( , 9 , , 10).Сгруппировать();
	ТабДок.Область( , 12, , 13).Сгруппировать();
	ТабДок.Область( , 15, , 16).Сгруппировать();
	ТабДок.Область( , 18, , 19).Сгруппировать();
	ТабДок.Область( , 21, , 22).Сгруппировать();
	ТабДок.Область( , 24, , 25).Сгруппировать();
	ТабДок.Область( , 27, , 28).Сгруппировать();
	ТабДок.Область( , 30, , 31).Сгруппировать();
	ТабДок.Область( , 33, , 34).Сгруппировать();	
	ТабДок.Область( , 36, , 37).Сгруппировать();
	ТабДок.Область( , 39, , 40).Сгруппировать();
	ТабДок.Область( , 42, , 43).Сгруппировать();
	ТабДок.Область( , 45, , 46).Сгруппировать();
	ТабДок.Область( , 48, , 49).Сгруппировать();
	ТабДок.Область( , 51, , 52).Сгруппировать();
	ТабДок.Область( , 54, , 55).Сгруппировать();
	ТабДок.Область( , 57, , 58).Сгруппировать();
	ТабДок.Область( , 60, , 61).Сгруппировать();
	
КонецПроцедуры

