
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_ПланПоступленияНаСклад.Записывать = Истина;
	Движения.Лео_ПланПоступленияНаСклад.Очистить();
	Для Каждого ТекСтрокаПлановыеЗначения Из ПлановыеЗначения Цикл
		Движение = Движения.Лео_ПланПоступленияНаСклад.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПлановыеЗначения.Номенклатура;
		Движение.Дата = ТекСтрокаПлановыеЗначения.Дата;
		Движение.План = План;
		Движение.ЭкстраЗаказ = ТекСтрокаПлановыеЗначения.ЭкстраЗаказ;
		Движение.Количество = ТекСтрокаПлановыеЗначения.Количество;
	КонецЦикла;

КонецПроцедуры
