

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	
	
	Если РольДоступна("ПолныеПрава") или РольДоступна("Финансист")	тогда
	ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.абс_Подразделение) Тогда
		ОтборЦФО = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЦФО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦФО");
		ОтборЦФО.ПравоеЗначение =  ПараметрыСеанса.ТекущийПользователь.абс_Подразделение;
		ОтборЦФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЦФО.Использование = Истина;
		ОтборЦФО.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		//ОтборЦФО.Доступность   = Ложь;
		
	Иначе 	
		// Пустой список 
		ОтборЦФО = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЦФО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦФО");
		ОтборЦФО.ПравоеЗначение =  Справочники.Подразделения.ПустаяСсылка();
		ОтборЦФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЦФО.Использование = Истина;
		ОтборЦФО.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры
