&НаКлиенте
Процедура ОбновитьНаименованиеТС()
	
	ОбновитьНаименованиеТСНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеТСНаСервере()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект"); 
	ЭтотОбъект.СформироватьНаименованиеТС(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаПриИзменении(Элемент)
	
	ОбновитьНаименованиеТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПоУмолчаниюПриИзменении(Элемент)
	
	ОбновитьНаименованиеТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерПриИзменении(Элемент)
	
	ОбновитьНаименованиеТС();
	
КонецПроцедуры
