&НаКлиенте
Перем СписокСкладСиУ;
Перем СписокСкладГП;

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьЭлементСправочникаЛеоПараметрыОбменаЛоджикЛайн();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЭлементСправочникаЛеоПараметрыОбменаЛоджикЛайн () Экспорт
	
	Объект.ПараметрыПоУмолчанию 		= Справочники.абс_ПараметрыОбменаЛогистика.Молком;
	
	Объект.ДатаОтгрузки 				= ТекущаяДата()+ 86400 ;
	Объект.ТипЦеныЗалоговаяСтоимость 	= Объект.ПараметрыПоУмолчанию.ТипЦеныЗалоговая;
	
	Объект.Организация 					= Объект.ПараметрыПоУмолчанию.Организация;
	Объект.Склад						= Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
	
	Объект.ВыгрузкаНакладныхПоСериям			= Истина;
	Объект.ВыгрузкаПриходовПоСериям				= Истина;
	Объект.ИмпортОперативныхОстатковПоСериям 	= Истина;
	
КонецПроцедуры

&НаСервере
Функция СформироватьИмяФайла(Имя,Каталог,Дата,Организация = Неопределено)
	
	Если НЕ Организация = Неопределено Тогда
		Имя = Имя + "_" + СокрЛП(Организация.Префикс);
	КонецЕсли;
	
	ИмяДата =  Формат(Дата,"ДЛФ=D");
	ИмяВремя = Формат(ТекущаяДата(),"ДЛФ=T");
	ИмяФайла =	СтрЗаменить(Имя + "_"+ ИмяДата + "_" + ИмяВремя ,".","_");  
	ИмяФайла =	СтрЗаменить(ИмяФайла," ","_");
	ИмяФайла =	СтрЗаменить(ИмяФайла,":","_");
	ИмяФайла = Каталог + "\" + ИмяФайла +".csv";
	
	Возврат ИмяФайла;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла)
	
	ВыгруженоУспешно = Ложь;
	
	Попытка
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		
		ВыгруженоУспешно = Истина;
	Исключение 
		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если ВыгруженоУспешно Тогда
		Предупреждение("Файл выгрузки успешно сформирован!");
	Иначе
		Предупреждение("Произошла ошибка при записи файла, файл выгрузки не сформирован!");
	КонецЕсли;	
	
	Возврат ВыгруженоУспешно;
	
КонецФункции

&НаКлиенте
Процедура ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(ТабличнаяЧасть, ПризнакВыгружать);
	
	Для Каждого Стр Из ТабличнаяЧасть Цикл
		
		Стр.Выгружать = ПризнакВыгружать;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуИзСтроки(Стр)
	Д = Дата("00010101000000");
	Если ПустаяСтрока(Стр) Тогда
		Возврат Д;
	КонецЕсли;
	
	Если Найти(Стр,".")>0 Тогда
		Если Найти(Стр,":")>0 И Найти(Стр," ")>0 Тогда 
			М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
			Возврат ПолучитьДатуИзСтроки(М[0]);
		КонецЕсли;
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,".");
	ИначеЕсли Найти(Стр,"/")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"/");
	ИначеЕсли Найти(Стр,",")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,",");
	ИначеЕсли Найти(Стр,"-")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"-");
	КонецЕсли;
	
	Попытка
		Если М.Количество()=3 Тогда //"01.02.13" или "01.02.2013"
			Год = ?(СтрДлина(М[2])=2,2000+М[2],М[2]);
			Д = Дата(Год,М[1],М[0]);
		ИначеЕсли М.Количество()=2 Тогда //"02.13" или "02.2013";
			Год = ?(СтрДлина(М[1])=2,2000+М[1],М[1]);
			Д = Дата(Год,М[0],1);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Д;
КонецФункции

&НаСервере
Функция ЛогированиеФайлЛога()
	
	ИмяФайла = "ЛогОбмена_" + Формат(ТекущаяДата(),"ДФ=гг_ММ_д") +".txt";
	
	КаталогЛога = Объект.ПараметрыПоУмолчанию.ПутьКЛогФайлу;
	Если КаталогЛога = "" Тогда
		КаталогЛога = КаталогВременныхФайлов();
	КонецЕсли;
	ТекстЛога = Новый ЗаписьТекста(КаталогЛога + "\" + ИмяФайла, КодировкаТекста.UTF16,,Истина,);
	Возврат  ТекстЛога;
	
КонецФункции

&НаСервере
Функция ЗагрузитьМетодом_ExcelApplication(Знач ИмяФайла, ПерваяСтрокаЗаголовки = Истина, НачалоСтрокДанных = 2, ТекстЛога = Неопределено) Экспорт
	
	
	Перем оЕ, Книга, Лист;                  
	
	// создаем объект Excel
	Попытка
		оЕ = Новый COMОбъект("Excel.Application");
	Исключение
		мСообщениеПользователю("Ошибка запуска Excel: " + ОписаниеОшибки(), ТекстЛога);
		
		оЕ = Неопределено;
		
		Возврат Неопределено;
	КонецПопытки;
	
	// открываем файл
	Попытка
		Книга = оЕ.Workbooks.Open(ИмяФайла);
	Исключение
		мСообщениеПользователю("Ошибка открытия файла " + ИмяФайла + ": " + ОписаниеОшибки(), ТекстЛога);
		
		Книга 		= Неопределено;
		
		оЕ.Quit();
		оЕ 			= Неопределено;
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	// получаем данные листа 1
	Попытка
		Лист = Книга.Worksheets(1);
		
		КоличествоСтрок 	= Лист.UsedRange.Rows.Count;
		КоличествоКолонок 	= Лист.UsedRange.Columns.Count;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		Для Сч = 1 По КоличествоКолонок Цикл
			Если ПерваяСтрокаЗаголовки Тогда
				Колонка = ТаблицаРезультат.Колонки.Добавить(Строка(Лист.Cells(1,Сч).Value));
				Колонка.Заголовок = Строка(Лист.Cells(1,Сч).Value);
			Иначе
				Колонка = ТаблицаРезультат.Колонки.Добавить("Колонка"+СтрЗаменить(Строка(Сч),Символы.НПП,""));
			КонецЕсли;
		КонецЦикла;
		
		ПерваяСтрока = НачалоСтрокДанных;//?(ПерваяСтрокаЗаголовки,2,1);
		
		МассивДанных = Лист.Range(Лист.Cells(ПерваяСтрока,1),Лист.Cells(КоличествоСтрок,КоличествоКолонок)).Value.Unload();
		
		Лист 		= Неопределено;
		Книга 		= Неопределено;
		
		оЕ.Quit();
		оЕ 			= Неопределено;
		
		Для Сч = ПерваяСтрока По КоличествоСтрок Цикл
			ТаблицаРезультат.Добавить();
		КонецЦикла;
		
		Для Сч = 0 По КоличествоКолонок-1 Цикл
			ТаблицаРезультат.ЗагрузитьКолонку(МассивДанных[Сч],Сч);
		КонецЦикла;
		
		//Для Каждого Строка из ТаблицаРезультат Цикл
		//	Если ТипЗнч(Строка.Колонка1) = Тип("Число") Тогда
		//		Строка.Колонка1 = Строка(Формат(Строка.Колонка1, "ЧГ=0"));
		//	КонецЕсли;
		//КонецЦикла;
		
		Возврат ТаблицаРезультат;
		
	Исключение
		
		мСообщениеПользователю("Ошибка загрузки данных: " + ОписаниеОшибки(), ТекстЛога);
		
		Лист 		= Неопределено;
		Книга 		= Неопределено;
		
		оЕ.Quit();
		оЕ 			= Неопределено;
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Создаем текст CSV:
// текст заголовков и 
// текст данных
&НаСервере
Функция СоздатьДанныеCSV(ТаблицаЗначений,разделитель)

    Текст="";
	КоличествоКолонок = ТаблицаЗначений.колонки.Количество()-1;
	КоличествоСтрок =  ТаблицаЗначений.Количество();
	
	Для Каждого Строка из ТаблицаЗначений Цикл
		НомерКолонки = 1;
		Пока НомерКолонки <= КоличествоКолонок Цикл
			Если Строка[НомерКолонки] = Null или Строка[НомерКолонки] = "Не заполняется" Тогда
				НомерКолонки = НомерКолонки+1;
				Продолжить
				
			КонецЕсли;
			
			Значение = ФорматированиеЗначение(Строка[НомерКолонки]);
			Значение = СокрЛП(Значение);
			//Если Найти(Значение, """")> 0 Тогда 
			//	Значение = СтрЗаменить(Значение,"""","""""");
			//	//Значение = СтрЗаменить(Значение,",",""",""");
			//	Значение = СтрЗаменить(Значение,";",""";""");
			//	Значение = """" + Значение + """";
			//КонецЕсли;
			
			Если НомерКолонки < КоличествоКолонок Тогда
				Текст = Текст + Значение + разделитель;
			Иначе
				Текст = Текст + Значение;
			КонецЕсли;
			НомерКолонки = НомерКолонки+1;
		КонецЦикла;
		Текст = Текст + Символы.ПС;
    КонецЦикла;
    Текст = Лев(Текст,СтрДлина(Текст)-1 );
	
    Возврат текст;

КонецФункции //

Функция ФорматированиеЗначение(Значение)
	ЗначениеСтрокой = "";
	Если ТипЗнч(Значение) =  Тип("Строка") Тогда
		ЗначениеСтрокой = Значение;	
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		ЗначениеСтрокой = Формат(Значение,"ЧРД=.; ЧГ=");	
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
        ЗначениеСтрокой = Строка(Формат(Значение,"ДФ=dd.MM.yyyy"));
		Значение = ЗначениеСтрокой;
	КонецЕсли;

	Возврат ЗначениеСтрокой 
КонецФункции

// Запишем данные в файл
&НаСервере
Функция ЗаписатьCSV_Сервер(Текст,ИмяФайла)              
    Кодировка = КодировкаТекста.ANSI;
    ТекстовыйФайлЗапись = Новый ЗаписьТекста(имяФайла,Кодировка);            
    ТекстовыйФайлЗапись.ЗаписатьСтроку(текст); 
    ТекстовыйФайлЗапись.Закрыть();    
    Возврат 0;

КонецФункции // ЗаписатьCSV()

// Основная логика:
&НаСервере
Функция ВыгрузитьВCSV(ИмяФайлаCSV,ТаблицаЗначений);
    Разделитель = ";";
	Кодировка = КодировкаТекста.ANSI;
	ВыгруженоУспешно = Ложь;

	Попытка 
		Текст = СоздатьДанныеCSV(ТаблицаЗначений,Разделитель);
		
		ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяФайлаCSV,Кодировка);            
	    ТекстовыйФайлЗапись.ЗаписатьСтроку(текст); 
	    ТекстовыйФайлЗапись.Закрыть();
		ВыгруженоУспешно = Истина;
	Исключение 
		Сообщить("Не удалось записать Файл " + ИмяФайлаCSV + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если ВыгруженоУспешно Тогда
		Сообщить("Файл " + ИмяФайлаCSV + "выгрузки успешно сформирован!");
	Иначе
		Сообщить("Произошла ошибка при записи файла, файл выгрузки не сформирован!");
	КонецЕсли;	
	
	Возврат ВыгруженоУспешно;

КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ КОНТРАГЕНТЫ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ТчКонтрагентыКнопкаВыделитьВсе(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.ТчКонтрагенты, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ТчКонтрагентыКнопкаСнятьВыделение(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.ТчКонтрагенты, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокКонтрагентов(Команда)
	
	СформироватьЗапросClients();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСписокКонтрагентов(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуКонтрагенты;	
	ИмяФайла = СформироватьИмяФайла("COMPANY",Каталог,ТекущаяДата());
	МаскаФайла = "*.csv";
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	ВыгрузитьВCSV(ИмяФайла,ВыгрузитьКонтрагентоНаСервере());
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );	
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Процедура СформироватьЗапросClients()
	
	спБизнесРегионов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.БизнесРегионы Цикл
		спБизнесРегионов.Добавить(СтрокаТЧ.БизнесРегион);	
	КонецЦикла;
	
	Объект.ТчКонтрагенты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК UrAdr,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ЮрАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК FactAdres,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ФактАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК PHONE,
	|	КонтактнаяИнформация.Объект КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Телефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК НомерМагазина
	|ПОМЕСТИТЬ ВТ_НомерМагазина
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(50)) КАК КодПоставщика
	|ПОМЕСТИТЬ ВТ_КодПоставщика
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_КодПоставщика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""COMPANY"" КАК ТипДокумента,
	|	Контрагенты.Код КАК КодКонтрагентаПоСистеме,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.НаименованиеПолное
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеКонтрагента,
	|	ЕСТЬNULL(ВТ_ЮрАдреса.UrAdr, ВТ_ЮрАдресаГоловногоКонтрагента.UrAdr) КАК АдресЮридический,
	|	ЕСТЬNULL(ВТ_ФактАдреса.FactAdres, ВТ_ФактАдресаГоловногоКонтрагента.FactAdres) КАК АдресФактический,
	|	ЕСТЬNULL(ВТ_ФактАдреса.FactAdres, ВТ_ФактАдресаГоловногоКонтрагента.FactAdres) КАК АдресПочтовый,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ИНН
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ИНН
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.КПП
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.КПП
	|	КОНЕЦ КАК КПП,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.КодПоОКПО
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.КодПоОКПО
	|	КОНЕЦ КАК ОКПО,
	|	ЕСТЬNULL(ВТ_Телефон.PHONE, ВТ_ТелефонГоловногоКонтрагента.PHONE) КАК ТелефонФакс,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.НомерСчета
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.НомерСчета
	|	КОНЕЦ КАК РасчетныйСчет,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.Код
	|	КОНЕЦ КАК ГруппаПартнеров,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.Наименование
	|	КОНЕЦ КАК Банк,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.Адрес
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.Адрес
	|	КОНЕЦ КАК АдресБанка,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.КоррСчет
	|	КОНЕЦ КАК КоррСчет,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Контрагенты.ОсновнойБанковскийСчет.Банк.Код
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент.ОсновнойБанковскийСчет.Банк.Код
	|	КОНЕЦ КАК БИК,
	|	"""" КАК ВидДеятельности,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_НомерМагазина.НомерМагазина
	|	КОНЕЦ КАК НомерМагазина,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВТ_КодПоставщика.КодПоставщика
	|		ИНАЧЕ ВТ_КодПоставщикаГоловногоКонтрагента.КодПоставщика
	|	КОНЕЦ КАК НомерПоставщика
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮрАдреса КАК ВТ_ЮрАдреса
	|		ПО Контрагенты.Ссылка = ВТ_ЮрАдреса.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФактАдреса КАК ВТ_ФактАдреса
	|		ПО Контрагенты.Ссылка = ВТ_ФактАдреса.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Телефон КАК ВТ_Телефон
	|		ПО Контрагенты.Ссылка = ВТ_Телефон.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомерМагазина КАК ВТ_НомерМагазина
	|		ПО Контрагенты.Ссылка = ВТ_НомерМагазина.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодПоставщика КАК ВТ_КодПоставщика
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_КодПоставщика.Контрагент
	|			И Контрагенты.ГоловнойКонтрагент = ВТ_КодПоставщика.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Телефон КАК ВТ_ТелефонГоловногоКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_ТелефонГоловногоКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФактАдреса КАК ВТ_ФактАдресаГоловногоКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_ФактАдресаГоловногоКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮрАдреса КАК ВТ_ЮрАдресаГоловногоКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_ЮрАдресаГоловногоКонтрагента.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодПоставщика КАК ВТ_КодПоставщикаГоловногоКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = ВТ_КодПоставщикаГоловногоКонтрагента.Контрагент
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоБизнесРегиону = ИСТИНА
	|				ТОГДА Контрагенты.абс_БизнесРегион В ИЕРАРХИИ (&БизнесРегион)
	|						ИЛИ Контрагенты.ГоловнойКонтрагент.абс_БизнесРегион В ИЕРАРХИИ (&БизнесРегион)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &БезОтбораПоСтатусуКонтрагента = ЛОЖЬ
	|				ТОГДА Контрагенты.абс_СтатусКонтрагента = &Статус
	|						ИЛИ Контрагенты.ГоловнойКонтрагент.абс_СтатусКонтрагента = &Статус
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (Контрагенты.ИНН <> """"
	|			ИЛИ Контрагенты.ГоловнойКонтрагент.ИНН <> """""""")";
	
	Запрос.УстановитьПараметр("БизнесРегион"					, спБизнесРегионов);
	Запрос.УстановитьПараметр("Статус"							, Объект.СтатусКонтрагента);
	Запрос.УстановитьПараметр("ОтборПоБизнесРегиону"			, НЕ спБизнесРегионов.Количество() = 0 );
	Запрос.УстановитьПараметр("БезОтбораПоСтатусуКонтрагента"	, Объект.БезОтбораПоСтатусуКонтрагента);
	
	Результат = Запрос.Выполнить();
	
	ТзКонтрагенты = Результат.Выгрузить();
	//{Лео Катанович
	Для Каждого Строка из  ТзКонтрагенты Цикл
		Строка.АдресЮридический = СтрЗаменить(Строка.АдресЮридический,";",",");
		Строка.АдресФактический = СтрЗаменить(Строка.АдресФактический,";",",");
		Строка.АдресПочтовый = СтрЗаменить(Строка.АдресПочтовый,";",",");
	КонецЦикла;	
	//Лео Катанович}
	Объект.ТчКонтрагенты.Загрузить(ТзКонтрагенты);	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьКонтрагентоНаСервере()
	ТаблицаЗначений = Объект.ТчКонтрагенты.Выгрузить();
	Отбор = новый Структура ;
	Отбор.Вставить("Выгружать", Истина);
	МассивСтрок = ТаблицаЗначений.НайтиСтроки(Отбор);
	ТаблицаЗначений = ТаблицаЗначений.Скопировать(МассивСтрок,);
	ТаблицаЗначений.Колонки.Удалить("Выгружать");
	ТаблицаЗначений.Колонки.Удалить("ИсходныйНомерСтроки");
	Возврат  ТаблицаЗначений;		
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ НОМЕНКЛАТУРА
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ТчНоменклатураКнопкаВыделитьВсе(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.ТчНоменклатура, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТчНоменклатураКнопкаСнятьВыделение(Команда)
	
	ВыделитьВыгрузитьВсеСтрокиВТабличнойЧасти(Объект.ТчНоменклатура, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокНоменклатуры(Команда)
	
	СформироватьЗапросСписокНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНоменклатуру(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуАсортимент;	
	ИмяФайла = СформироватьИмяФайла("INFO",Каталог,ТекущаяДата());
	МаскаФайла = "*.csv";
	
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	ВыгрузитьВCSV(ИмяФайла,ВыгрузитьНоменклатуруНаСервере());
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНоменклатуруНаСервере()
	ТаблицаЗначений = Объект.ТчНоменклатура.Выгрузить();
	Отбор = новый Структура ;
	Отбор.Вставить("Выгружать", Истина);
	МассивСтрок = ТаблицаЗначений.НайтиСтроки(Отбор);
	ТаблицаЗначений = ТаблицаЗначений.Скопировать(МассивСтрок,);
	ТаблицаЗначений.Колонки.Удалить("Выгружать");
	ТаблицаЗначений.Колонки.Удалить("ИсходныйНомерСтроки");
	Возврат  ТаблицаЗначений;	
КонецФункции


&НаКлиенте
Процедура ВыгрузитьНоменклатуруКонтрагентов(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуАсортимент;	
	ИмяФайла = СформироватьИмяФайла("MUNIT",Каталог,ТекущаяДата());
	МаскаФайла = "*.csv";
		
	ВыбФайл = Новый Файл(ИмяФайла);
	
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	ВыгрузитьВCSV(ИмяФайла,ВыгрузитьНоменклатуруКонтрагентовНаСервере());
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );

КонецПроцедуры

&НаСервере
Функция ВыгрузитьНоменклатуруКонтрагентовНаСервере()
	ТаблицаЗначений =СформироватьЗапросMUNIT();
	
	Возврат ТаблицаЗначений
КонецФункции

// Процедуры и функции обмена данными

&НаСервере
Функция СформироватьЗапросСписокНоменклатуры()
	
	//Выгружаем номенклатуру из групп.
	спГруппНоменклатуры = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.ГруппыНоменклатуры Цикл
		спГруппНоменклатуры.Добавить(СтрокаТЧ.ГруппаНоменклатуры);		
	КонецЦикла;
	
	спНоменклатура = новый Массив;
	Для каждого СтрокаТЧ из Объект.СписокНоменклатур Цикл
		спНоменклатура.Добавить(СтрокаТЧ.Номенклатура);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Номенклатура,
	|	ЗначенияСвойствОбъектов.Значение КАК СрокГодности
	|ПОМЕСТИТЬ ВТ_СрокГодности
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
	|	Штрихкоды.ЕдиницаИзмерения.Вес КАК Вес,
	|	Штрихкоды.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И Штрихкоды.СерияНоменклатуры = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
	|	И Штрихкоды.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения.Вес,
	|	Штрихкоды.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
	|	Штрихкоды.ЕдиницаИзмерения.Вес КАК Вес,
	|	Штрихкоды.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_ШтрихкодыУпак
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И Штрихкоды.СерияНоменклатуры = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.ITF14)
	|	И Штрихкоды.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = &ЕдИзмеренияУпак
	|	И Штрихкоды.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения.Вес,
	|	Штрихкоды.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ТипЦен = &ТипЦены) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Владелец,
	|	МАКСИМУМ(ВложенныйЗапрос.Наименование1) КАК Наименование1,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕдиницаПоКлассификатору1) КАК ЕдиницаПоКлассификатору1,
	|	МАКСИМУМ(ВложенныйЗапрос.Вес1) КАК Вес1,
	|	МАКСИМУМ(ВложенныйЗапрос.ВесНетто1) КАК ВесНетто1,
	|	МАКСИМУМ(ВложенныйЗапрос.Объем1) КАК Объем1,
	|	МАКСИМУМ(ВложенныйЗапрос.Коэффициент1) КАК Коэффициент1,
	|	МАКСИМУМ(ВложенныйЗапрос.Наименование2) КАК Наименование2,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕдиницаПоКлассификатору2) КАК ЕдиницаПоКлассификатору2,
	|	МАКСИМУМ(ВложенныйЗапрос.Вес2) КАК Вес2,
	|	МАКСИМУМ(ВложенныйЗапрос.ВесНетто2) КАК ВесНетто2,
	|	МАКСИМУМ(ВложенныйЗапрос.Объем2) КАК Объем2,
	|	МАКСИМУМ(ВложенныйЗапрос.Коэффициент2) КАК Коэффициент2,
	|	МАКСИМУМ(ВложенныйЗапрос.Наименование3) КАК Наименование3,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕдиницаПоКлассификатору3) КАК ЕдиницаПоКлассификатору3,
	|	МАКСИМУМ(ВложенныйЗапрос.Вес3) КАК Вес3,
	|	МАКСИМУМ(ВложенныйЗапрос.ВесНетто3) КАК ВесНетто3,
	|	МАКСИМУМ(ВложенныйЗапрос.Объем3) КАК Объем3,
	|	МАКСИМУМ(ВложенныйЗапрос.Коэффициент3) КАК Коэффициент3
	|ПОМЕСТИТЬ ВТ_ЕдИзмПалет
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕдиницыИзмерения.Владелец КАК Владелец,
	|		ЕдиницыИзмерения.Наименование КАК Наименование1,
	|		ЕдиницыИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаПоКлассификатору1,
	|		ЕдиницыИзмерения.Вес КАК Вес1,
	|		ЕдиницыИзмерения.ВесНетто КАК ВесНетто1,
	|		ЕдиницыИзмерения.Объем КАК Объем1,
	|		ЕдиницыИзмерения.Коэффициент КАК Коэффициент1,
	|		"""" КАК Наименование2,
	|		"""" КАК Наименование3,
	|		"""" КАК ЕдиницаПоКлассификатору2,
	|		"""" КАК ЕдиницаПоКлассификатору3,
	|		0 КАК Вес2,
	|		0 КАК Вес3,
	|		0 КАК ВесНетто2,
	|		0 КАК ВесНетто3,
	|		0 КАК Объем2,
	|		0 КАК Объем3,
	|		0 КАК Коэффициент2,
	|		0 КАК Коэффициент3
	|	ИЗ
	|		Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|	ГДЕ
	|		ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
	|		И ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование = ""Блок""
	|		И НЕ ЕдиницыИзмерения.Владелец.Артикул = """"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕдиницыИзмерения.Владелец,
	|		"""",
	|		"""",
	|		0,
	|		0,
	|		0,
	|		ЕдиницыИзмерения.Объем,
	|		ЕдиницыИзмерения.Наименование,
	|		"""",
	|		ЕдиницыИзмерения.ЕдиницаПоКлассификатору,
	|		"""",
	|		ЕдиницыИзмерения.Вес,
	|		0,
	|		ЕдиницыИзмерения.ВесНетто,
	|		0,
	|		0,
	|		0,
	|		ЕдиницыИзмерения.Коэффициент,
	|		0
	|	ИЗ
	|		Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|	ГДЕ
	|		ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование = ""упак""
	|		И ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
	|		И НЕ ЕдиницыИзмерения.Владелец.Артикул = """"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕдиницыИзмерения.Владелец,
	|		"""",
	|		"""",
	|		0,
	|		0,
	|		0,
	|		0,
	|		"""",
	|		ЕдиницыИзмерения.Наименование,
	|		"""",
	|		ЕдиницыИзмерения.ЕдиницаПоКлассификатору,
	|		0,
	|		ЕдиницыИзмерения.Вес,
	|		0,
	|		ЕдиницыИзмерения.ВесНетто,
	|		0,
	|		ЕдиницыИзмерения.Объем,
	|		0,
	|		ЕдиницыИзмерения.Коэффициент
	|	ИЗ
	|		Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|	ГДЕ
	|		ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
	|		И ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование = ""паллет""
	|		И НЕ ЕдиницыИзмерения.Владелец.Артикул = """") КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""INFO"" КАК ТипДокумента,
	|	"""" КАК ГрТовараУровень1,
	|	"""" КАК ГрТовараУровень2,
	|	"""" КАК ГрТовараУровень3,
	|	""A"" КАК ГруппаДляРазмещения,
	|	СпрНоменклатура.Артикул КАК КодТовара,
	|	СпрНоменклатура.Артикул КАК АртикулПроизводителя,
	|	СпрНоменклатура.Наименование КАК КраткоеНаименованиеТовара,
	|	СпрНоменклатура.НаименованиеПолное КАК ПолноеНаименованиеТовара,
	|	"""" КАК Характеристики,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.МеждународноеСокращение = """"
	|			ТОГДА ""PCE""
	|		ИНАЧЕ СпрНоменклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.МеждународноеСокращение
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.ЕдиницаХраненияОстатков.Вес КАК ВесТовара,
	|	СпрНоменклатура.ЕдиницаХраненияОстатков.Объем КАК ОбъемТовара,
	|	ВТ_ЕдИзмПалет.Наименование1 КАК ВидУпаковки1,
	|	ВТ_ЕдИзмПалет.Коэффициент1 КАК КоличествовоТовараВУпаковке1,
	|	ВТ_ЕдИзмПалет.Вес1 КАК ВесУпаковки1,
	|	ВТ_ЕдИзмПалет.Объем1 КАК ОбъемУпаковки1,
	|	ВТ_ЕдИзмПалет.Наименование2 КАК ВидУпаковки2,
	|	ВТ_ЕдИзмПалет.Коэффициент2 КАК КоличествовоТовараВУпаковке2,
	|	ВТ_ЕдИзмПалет.Вес2 КАК ВесУпаковки2,
	|	ВТ_ЕдИзмПалет.Объем2 КАК ОбъемУпаковки2,
	|	ВТ_ЕдИзмПалет.Наименование3 КАК ВидУпаковки3,
	|	ВТ_ЕдИзмПалет.Коэффициент3 КАК КоличествовоТовараВУпаковке3,
	|	ВТ_ЕдИзмПалет.Вес3 КАК ВесУпаковки3,
	|	ВТ_ЕдИзмПалет.Объем3 КАК ОбъемУпаковки3,
	|	1 КАК ПризнакУчетаПоСрокуГодности,
	|	0 КАК ПризнакПроверкиКомплектности,
	|	0 КАК ПризнакПечатиГарантийногоТалона,
	|	1 КАК ПризнакПриемкиТовара,
	|	0 КАК ПризнакУчетаПоSN,
	|	ВТ_Штрихкоды.Штрихкод КАК ШтрихКодАртикулаПроизводителя,
	|	ВТ_Штрихкоды.Штрихкод КАК ШтрихКодКодаТовара,
	|	"""" КАК СерийныйНомерЮвелирногоИзделия,
	|	"""" КАК ИнвентарныйУчет,
	|	"""" КАК Родитель,
	|	"""" КАК КоличествоЕденицВКомплекте,
	|	"""" КАК СрокГарантии,
	|	ВТ_ШтрихкодыУпак.Штрихкод КАК ШтрихКодУпаковки,
	|	""      "" КАК МаркировкаЧЗ
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ПО СпрНоменклатура.Ссылка = ВТ_Штрихкоды.Номенклатура
	|			И СпрНоменклатура.ЕдиницаХраненияОстатков = ВТ_Штрихкоды.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО СпрНоменклатура.Ссылка = ВТ_Цены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокГодности КАК ВТ_СрокГодности
	|		ПО СпрНоменклатура.Ссылка = ВТ_СрокГодности.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдИзмПалет КАК ВТ_ЕдИзмПалет
	|		ПО СпрНоменклатура.Ссылка = ВТ_ЕдИзмПалет.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыУпак КАК ВТ_ШтрихкодыУпак
	|		ПО СпрНоменклатура.Ссылка = ВТ_ШтрихкодыУпак.Номенклатура
	|ГДЕ
	|	СпрНоменклатура.Артикул <> """"
	|	И СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &БезОтбораПоСтатусу = ИСТИНА
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ СпрНоменклатура.абс_СтатусНоменклатуры В (&Статус)
	|		КОНЕЦ
	|	//УСЛОВИЕ ГРУППЫ
	|	//УСЛОВИЕ НОМЕНКЛАТУРА";
	
	//Последнии2 условия теряются, по этому комментирую для восстановления
	//|ГДЕ
	//|	СпрНоменклатура.Артикул <> """"
	//|	И СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
	//|	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	//|	И ВЫБОР
	//|			КОГДА &БезОтбораПоСтатусу = ИСТИНА
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ СпрНоменклатура.абс_СтатусНоменклатуры В (&Статус)
	//|		КОНЕЦ
	//|	//УСЛОВИЕ ГРУППЫ
	//|	//УСЛОВИЕ НОМЕНКЛАТУРА";
	
	Запрос.УстановитьПараметр("ТипЦены"				, Объект.ТипЦеныЗалоговаяСтоимость);
	Запрос.УстановитьПараметр("ТекущаяДата"			, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("БезОтбораПоСтатусу"	, Объект.БезОтбораПоСтатусуНоменклатуры);
	Запрос.УстановитьПараметр("Статус"				, Объект.СтатусНоменклатуры);
	Запрос.УстановитьПараметр("ЕдИзмеренияУпак"		, Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("778"));
	                                                  
	Если спГруппНоменклатуры.Количество() > 0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ ГРУППЫ", "И СпрНоменклатура.Ссылка В ИЕРАРХИИ(&СписокГруппНоменклатуры)"); 
		Запрос.УстановитьПараметр("СписокГруппНоменклатуры", спГруппНоменклатуры);
	КонецЕсли;
	
	Если спНоменклатура.Количество() > 0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ НОМЕНКЛАТУРА", "И СпрНоменклатура.Ссылка В (&СписокНоменклатуры)"); 
		Запрос.УстановитьПараметр("СписокНоменклатуры", спНоменклатура);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ТзНоменклатура = Результат.Выгрузить();
	
	//+Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
	//Удалить код после окончательной ратации номенклатуры
	Для каждого СтрокаНоменклатура из ТзНоменклатура Цикл 
		НоменклатураСсылка	=	Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаНоменклатура.КодТовара);
		Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
			ЗначениеОКПД2	= лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(НоменклатураСсылка, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
			Если ЗначениеЗаполнено(ЗначениеОКПД2) И ТипЗнч(ЗначениеОКПД2)=Тип("СправочникСсылка.Лео_КлассификаторОКПД2") Тогда 
				Если ЗначениеОКПД2.ЧестныйЗнак Тогда
					СтрокаНоменклатура.МаркировкаЧЗ			= "bio";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		АртикулСтрокой = СтрЗаменить(СтрокаНоменклатура.КодТовара,"_18%","");
		
		СтрокаНоменклатура.КодТовара			= АртикулСтрокой;
		СтрокаНоменклатура.АртикулПроизводителя = АртикулСтрокой;
	КонецЦикла;
	//-Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016

	
	Объект.ТчНоменклатура.Загрузить(ТзНоменклатура);
	
КонецФункции

&НаСервере
Функция СформироватьЗапросMUNIT()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент,
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства КАК АртикулКонтрагента,
	|	"""" КАК ОсновнаяЕдиницаОтгрузки,
	|	0 КАК ОсновнаяЕдиницаИзмеренияМест,
	|	"""" КАК Поле3
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(, Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя)) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
	|ГДЕ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Артикул <> """"
	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент,
	|	"""",
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства,
	|	0,
	|	""""
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(, Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя)) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
	|ГДЕ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Артикул <> """"
	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ОсновнаяЕдиницаОтгрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент,
	|	"""",
	|	"""",
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства,
	|	0
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(, Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя)) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
	|ГДЕ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Артикул <> """"
	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ОсновнаяЕдиницаИзмеренияМест)");
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ НАКЛАДНЫЕ И ЗАКАЗЫ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ПодобратьЗаказы(Команда)
	
	СформироватьСписокЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыРеализцииНаКлиенте(Команда)
	
	СоздатьДокументыРеализции();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСчФактуры(Команда)
	
	СформироватьСчФактурыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТаблицуЗаказов(Команда)
	
	СформироватьТаблицуТчНакладныеНаОтгрузку();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтгружен(Команда)
	
	УстановитьСтатусОтгружен_Сервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗаказы(Команда)
    ВыгрузитьЗаказыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЗаказыНаСервере()
    //Заказ!	
	СоздатьДокументыРеализции();
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуЗаказы;

	
	ОтборПоТипуСтрокиШапка 	= Новый Структура;
	ОтборПоТипуСтрокиШапка.Вставить("ТипСтроки", "H");
	
	ШапкиДокумента  = Объект.ТчНакладныеНаОтгрузку.Выгрузить(ОтборПоТипуСтрокиШапка,"ЗаказСсылка,НомерЗаявкиНаВыдачу_КодТовара,НомерТоварнойНакладной_ЗаказанноеКоличество,ДатаЗаявкиНаВыдачу_ЕдиницаИзмерения");
	ШапкиДокумента.Свернуть("ЗаказСсылка,НомерЗаявкиНаВыдачу_КодТовара,НомерТоварнойНакладной_ЗаказанноеКоличество,ДатаЗаявкиНаВыдачу_ЕдиницаИзмерения");
	
	Если ШапкиДокумента.Количество()> 0 Тогда
		Для каждого СтрокаШапкиДокумента из ШапкиДокумента Цикл
			ПрефиксФайла  = "ORDER_" + СтрокаШапкиДокумента.НомерЗаявкиНаВыдачу_КодТовара;
			ИмяФайла = СформироватьИмяФайла(ПрефиксФайла,Каталог,СтрокаШапкиДокумента.ДатаЗаявкиНаВыдачу_ЕдиницаИзмерения);	
			
			ВыбФайл = Новый Файл(ИмяФайла);
	
			Если ВыбФайл.Существует() Тогда
				УдалитьФайлы(ВыбФайл)
			КонецЕсли;
			
			ОтборПоДокументу 	= Новый Структура;
			ОтборПоДокументу.Вставить("ЗаказСсылка", СтрокаШапкиДокумента.ЗаказСсылка);
				
			СтрокиПоДокЗаказ = Объект.ТчНакладныеНаОтгрузку.Выгрузить(ОтборПоДокументу,);
			СтрокиПоДокЗаказ.Колонки.Удалить("ЗаказСсылка");
            СтрокиПоДокЗаказ.Колонки.Удалить("ИсходныйНомерСтроки");
            ВыгрузитьВCSV(ИмяФайла,СтрокиПоДокЗаказ);
			
			Если СтрокаШапкиДокумента.ЗаказСсылка.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.НеПередавалсяЛогОператору Или СтрокаШапкиДокумента.ЗаказСсылка.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ПустаяСсылка() Тогда
				ОбъектЗаказа = СтрокаШапкиДокумента.ЗаказСсылка.ПолучитьОбъект();
				ОбъектЗаказа.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ПереданЛогОператору;
				ОбъектЗаказа.Записать();
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	МаскаФайла = "*.csv";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаказыДляРеестра(Команда)
	
	СформироватьСписокЗаказовДляРеестра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаказыДляСверки(Команда)
	
	СформироватьСписокЗаказовДляСверки();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРеестр(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуЗаказы;
	ИмяФайла = СформироватьИмяФайла ("ReestrNakl", Каталог, Объект.ДатаОтгрузки, Объект.Организация);
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;

	Табдок = ВыгрузкаReestrNaklВТабДок();

	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСверку(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуЗаказы;
	ИмяФайла = СформироватьИмяФайла ("SverkaShapok",Каталог,Объект.ДатаОтгрузки);
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = ВыгрузкаSverkaShapokВТабДок();
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовУстановтитьВсеФлаги(Команда)
	
	ЗаказыУстановитьСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовСнятьВсеФлаги(Команда)
	
	ЗаказыУстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Процедура СформироватьСписокЗаказов()
	
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Контрагент,
	|	ИСТИНА КАК Выгружать,
	|	ЗаказПокупателя.Грузополучатель КАК ТТП
	|ПОМЕСТИТЬ ДокументыЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ПоДатеОтгрузки = ИСТИНА
	|				ТОГДА ЗаказПокупателя.ДатаОтгрузки = &ДатаОтгрузки
	|			ИНАЧЕ ЗаказПокупателя.Дата МЕЖДУ &Дата1 И &Дата2
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоказатьЗакрытыеЗаказы
	|				ТОГДА ЗаказПокупателя.ЛеоСтатусОбменаСЛогоператором В (&СписокСтатусовЗакрыто)
	|			ИНАЧЕ ЗаказПокупателя.ЛеоСтатусОбменаСЛогоператором = ЗНАЧЕНИЕ(Перечисление.Лео_СтатусыОбменаСЛогистическимОператором.ПустаяСсылка)
	|					ИЛИ ЗаказПокупателя.ЛеоСтатусОбменаСЛогоператором = ЗНАЧЕНИЕ(Перечисление.Лео_СтатусыОбменаСЛогистическимОператором.НеПередавалсяЛогОператору)
	|		КОНЕЦ
	|	И ЗаказПокупателя.Организация = &Организация
	|	И ЗаказПокупателя.СкладГруппа = &Склад
	|	И ВЫБОР
	|			КОГДА &ПоказатьЗакрытыеЗаказы
	|				ТОГДА ЗаказПокупателя.абс_Статус В (&СписокСтатусовЗаказовЗакрыто)
	|			ИНАЧЕ ЗаказПокупателя.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.КОтгрузке)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (РеализацияТоваровУслуг.Сделка = ДокументыЗаказы.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(СчетФактураВыданный.Ссылка) КАК Ссылка,
	|	СчетФактураВыданный.ДокументОснование
	|ПОМЕСТИТЬ ВтСчетФактура
	|ИЗ
	|	ДокументыРеализации КАК ДокументыРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ДокументыРеализации.Ссылка = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЗаказы.Ссылка КАК ДокументЗаказ,
	|	ДокументыЗаказы.Контрагент,
	|	ДокументыЗаказы.Выгружать,
	|	ДокументыЗаказы.ТТП,
	|	ДокументыРеализации.Ссылка КАК ДокументРеализация,
	|	ДокументыЗаказы.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ВтСчетФактура.Ссылка КАК ДокументСчетФактура
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтСчетФактура КАК ВтСчетФактура
	|			ПО ДокументыРеализации.Ссылка = ВтСчетФактура.ДокументОснование
	|		ПО ДокументыЗаказы.Ссылка = ДокументыРеализации.Ссылка.Сделка";	
	
	ЗапросЗаказы.УстановитьПараметр("ПоказатьЗакрытыеЗаказы"	, Объект.ПоказатьЗакрытыеЗаказы);						 
	ЗапросЗаказы.УстановитьПараметр("Дата1"						, НачалоДня(Объект.НачПериода));
	ЗапросЗаказы.УстановитьПараметр("Дата2"						, КонецДня(Объект.КонПериода));
	ЗапросЗаказы.УстановитьПараметр("ДатаОтгрузки"				, НачалоДня(Объект.ДатаОтгрузки));
	ЗапросЗаказы.УстановитьПараметр("ПоДатеОтгрузки"			, Объект.ПоДатеОтгрузки);
	ЗапросЗаказы.УстановитьПараметр("Организация"				, Объект.Организация);  
	ЗапросЗаказы.УстановитьПараметр("Склад"						, Объект.Склад);  
	
	СписокСтатусовЗакрыто = Новый СписокЗначений;
	
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
	//СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
	
	СписокСтатусовЗакрыто.Добавить(Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.НеПередавалсяЛогОператору);
	СписокСтатусовЗакрыто.Добавить(Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ПереданЛогОператору);
	СписокСтатусовЗакрыто.Добавить(Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ПодборТовараЛогОператором);
	СписокСтатусовЗакрыто.Добавить(Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.СобранЛогОператором);
	СписокСтатусовЗакрыто.Добавить(Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ПустаяСсылка());
	
	СписокСтатусовЗаказовЗакрыто = Новый СписокЗначений;	
	СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
	//СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);
	СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
	СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
	СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
	СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
	//СписокСтатусовЗаказовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);

	ЗапросЗаказы.УстановитьПараметр("СписокСтатусовЗаказовЗакрыто", СписокСтатусовЗаказовЗакрыто);
	ЗапросЗаказы.УстановитьПараметр("СписокСтатусовЗакрыто", СписокСтатусовЗакрыто);
	
	
	ТабЗнач = ЗапросЗаказы.Выполнить().Выгрузить();
	Объект.СписокЗаказов.Загрузить(ТабЗнач);
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗаказовДляРеестра()
	
	ЗапросЗаказы = Новый Запрос( 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Контрагент,
	|	ИСТИНА КАК Выгружать,
	|	ЗаказПокупателя.Грузополучатель КАК ТТП
	|ПОМЕСТИТЬ ДокументыЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ЗаказПокупателя.ДатаОтгрузки = &ДатаОтгрузки
	|	И ЗаказПокупателя.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
	|	И ЗаказПокупателя.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыЗаказы КАК ДокументыЗаказы
	|		ПО РеализацияТоваровУслуг.Сделка = ДокументыЗаказы.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЗаказы.Ссылка КАК ДокументЗаказ,
	|	ДокументыЗаказы.Контрагент,
	|	ДокументыЗаказы.Выгружать,
	|	ДокументыЗаказы.ТТП,
	|	ДокументыРеализации.Ссылка КАК ДокументРеализация,
	|	ДокументыЗаказы.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|		ПО ДокументыЗаказы.Ссылка = ДокументыРеализации.Ссылка.Сделка");	
						 
					 
	ЗапросЗаказы.УстановитьПараметр("ДатаОтгрузки"	, НачалоДня(Объект.ДатаОтгрузки));
    ЗапросЗаказы.УстановитьПараметр("Организация"	, Объект.Организация);
	
	ТабЗнач = ЗапросЗаказы.Выполнить().Выгрузить();
	Объект.СписокЗаказов.Загрузить(ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗаказовДляСверки()
	
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Контрагент,
	|	ИСТИНА КАК Выгружать,
	|	ЗаказПокупателя.Грузополучатель КАК ТТП
	|ПОМЕСТИТЬ ДокументыЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Проведен = ИСТИНА
	|	И ЗаказПокупателя.ДатаОтгрузки = &Дата1
	|	И ЗаказПокупателя.абс_Статус в (&СписокСтатусовЗакрыто)
	|	И ЗаказПокупателя.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыЗаказы КАК ДокументыЗаказы
	|		ПО РеализацияТоваровУслуг.Сделка = ДокументыЗаказы.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЗаказы.Ссылка КАК ДокументЗаказ,
	|	ДокументыЗаказы.Контрагент,
	|	ДокументыЗаказы.Выгружать,
	|	ДокументыЗаказы.ТТП,
	|	ДокументыРеализации.Ссылка КАК ДокументРеализация,
	|	ДокументыЗаказы.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	ДокументыЗаказы КАК ДокументыЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|		ПО ДокументыЗаказы.Ссылка = ДокументыРеализации.Ссылка.Сделка";	
	
	
	ЗапросЗаказы.УстановитьПараметр("Дата1"			, НачалоДня(Объект.ДатаОтгрузки));
	ЗапросЗаказы.УстановитьПараметр("Организация"	, Объект.ПараметрыПоУмолчанию.Организация);
	СписокСтатусовЗакрыто = Новый СписокЗначений;
	
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
	СписокСтатусовЗакрыто.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
	
	ЗапросЗаказы.УстановитьПараметр("СписокСтатусовЗакрыто", СписокСтатусовЗакрыто);
	ТабЗнач = ЗапросЗаказы.Выполнить().Выгрузить();
	Объект.СписокЗаказов.Загрузить(ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура ЗаказыУстановитьСнятьФлажки(Флаг);
	
	НайденныеСтроки = Объект.СписокЗаказов.НайтиСтроки(Новый Структура("Выгружать", Не Флаг));
	
	Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		НайденнаяСтрока.Выгружать = Флаг;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьДокументыРеализции() Экспорт
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина Тогда
			Если СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
				ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			Иначе
				Продолжить;
				//ДокументРеализация = СтрокаТЧ.ДокументРеализация.ПолучитьОбъект();
			КонецЕсли;
			ДокументРеализация.Заполнить(СтрокаТЧ.ДокументЗаказ);
			Если ЗначениеЗаполнено(СтрокаТЧ.ДокументЗаказ.ДатаОтгрузки) Тогда
				ДокументРеализация.Дата = КонецДня(СтрокаТЧ.ДокументЗаказ.ДатаОтгрузки);
			Иначе
				ДокументРеализация.Дата=ТекущаяДата();
			КонецЕсли;
			
			// {Лео Катанович
			// реквизит отпуск произвел
			Отбор = Новый Структура("СтруктурнаяЕдиница");
			Отбор.СтруктурнаяЕдиница = ДокументРеализация.Склад;
			СрезПоследних = РегистрыСведений.ОтветственныеЛица.СрезПоследних(ДокументРеализация.Дата, Отбор);
			
			Если СрезПоследних.Количество() < 1 Тогда
				ДокументРеализация.ОтпускПроизвел = Справочники.ФизическиеЛица.ПустаяСсылка();
			Иначе
				ДокументРеализация.ОтпускПроизвел = СрезПоследних[0].ФизическоеЛицо;
			КонецЕсли;
			// Лео Катанович}
			
			
			//лео Никитин
			 ДокументРеализация.Комментарий=СтрокаТЧ.ДокументЗаказ.комментарий;

			//
			
			
			// Сначала запишем документ, затем проведем
			ДокументРеализация.Записать(РежимЗаписиДокумента.Запись);
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			СтрокаТЧ.ДокументРеализация = ДокументРеализация.Ссылка;
			Сообщить ("Создан документ ""Реализация товаров и услуг "" №" + ДокументРеализация.Номер + " от " + ДокументРеализация.Дата);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСчФактурыСервер()
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и СтрокаТЧ.ДокументСчетФактура = Документы.СчетФактураВыданный.ПустаяСсылка() и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка()  Тогда
			
			ДокументьСчФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
			ДокументьСчФактура.Заполнить(СтрокаТЧ.ДокументРеализация);
			//Сначала запишем документ, потом проведем
			ДокументьСчФактура.Записать(РежимЗаписиДокумента.Запись);
			ДокументьСчФактура.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаТЧ.ДокументСчетФактура = ДокументьСчФактура.Ссылка;
			Сообщить ("Создан документ ""Счет-фактура выданный "" №" + ДокументьСчФактура.Номер + " от " + ДокументьСчФактура.Дата);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВыгрузкаNaklВТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Nakl");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого Стр Из Объект.Nakl Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ВыгрузкаReestrNaklВТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ReestrNakl");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
    ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
    спДокументов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			спДокументов.Добавить(СтрокаТЧ.ДокументЗаказ);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК ЗаказСсылка,
	|	СУММА(ЗаказПокупателяТовары.КоличествоМест * ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Вес) КАК ОбщийВес,
	|	СУММА(ЗаказПокупателяТовары.КоличествоМест) КАК КоличествоМест,
	|	СУММА(ЗаказПокупателяТовары.Количество) КАК КоличествоШт,
	|	СУММА(ЗаказПокупателяТовары.КоличествоМест * ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Объем) КАК ОбщийОбъем,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА ЗаказПокупателяТовары.Сумма
	|			ИНАЧЕ ЗаказПокупателяТовары.Сумма + ЗаказПокупателяТовары.СуммаНДС
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ДанныеПоТоварамЗаказов
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&СпДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателя.ДатаОтгрузки КАК ДатаПоставки,
	|	ЗаказПокупателя.Ссылка КАК ЗаказСсылка,
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
	|	ЗаказПокупателя.Контрагент.НаименованиеПолное КАК ИмяПолучателя,
	|	"""" КАК АдресГрузополучателя,
	|	"""" КАК АдресДоставки,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.ОбщийВес, 0) КАК ОбщийВес,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.КоличествоШт, 0) КАК КоличествоШт,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.ОбщийОбъем, 0) КАК ОбщийОбъем,
	|	ЕСТЬNULL(ВТ_ДанныеПоТоварамЗаказов.Сумма, 0) КАК Сумма,
	|	ЗаказПокупателя.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Сделка = ЗаказПокупателя.Ссылка
	|			И (РеализацияТоваровУслуг.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоТоварамЗаказов КАК ВТ_ДанныеПоТоварамЗаказов
	|		ПО (ЗаказПокупателя.Ссылка = ВТ_ДанныеПоТоварамЗаказов.ЗаказСсылка)
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&СпДокументов)");
		
    Запрос.УстановитьПараметр("спДокументов", спДокументов);
	Результат = Запрос.Выполнить();

	ТзReestrNakl = Результат.Выгрузить();

	Для Каждого Стр Из ТзReestrNakl Цикл
		
		ОбластьПараметров.Параметры.Заполнить(Стр);
		
		ОбластьПараметров.Параметры.НомерЗаказа = ОбщегоНазначения.ПолучитьНомерНаПечать(Стр.ЗаказСсылка);
		ОбластьПараметров.Параметры.НомерНакладной = ОбщегоНазначения.ПолучитьНомерНаПечать(Стр.РеализацияСсылка);
		
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	
    Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ВыгрузкаSverkaShapokВТабДок()
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("SverkaShapok");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
	спДокументов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			спДокументов.Добавить(СтрокаТЧ.ДокументЗаказ);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка.Дата КАК ДатаПоставки,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Номер, """") КАК НомерНакладной,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент.Код КАК КодКонтрагента,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.ЕдиницаИзмеренияМест.Вес, 0) * ЗаказПокупателяТовары.КоличествоМест КАК ОбщийВес,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА ЗаказПокупателяТовары.Сумма
	|		ИНАЧЕ ЗаказПокупателяТовары.Сумма + ЗаказПокупателяТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ЗаказПокупателяТовары.Ссылка = РеализацияТоваровУслуг.Сделка
	|			И (РеализацияТоваровУслуг.Проведен)
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтБезГруппировки.ДатаПоставки КАК DATEDOC,
	|	ВтБезГруппировки.НомерНакладной КАК NUMDOC,
	|	1 КАК TYPEDOC,
	|	ВтБезГруппировки.КодКонтрагента КАК KODKONTR,
	|	СУММА(ВтБезГруппировки.Сумма) КАК SUMDOCNDS,
	|	СУММА(ВтБезГруппировки.ОбщийВес) КАК MASSA
	|ИЗ
	|	ВТ_Данные КАК ВтБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтБезГруппировки.ДатаПоставки,
	|	ВтБезГруппировки.НомерНакладной,
	|	ВтБезГруппировки.КодКонтрагента";
	
	Запрос.УстановитьПараметр("спДокументов", спДокументов);
	Результат = Запрос.Выполнить();
	
	ТзReestrNakl = Результат.Выгрузить();
	
	Для Каждого Стр Из ТзReestrNakl Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	Возврат ТабДок;	
КонецФункции

&НаСервере
Процедура СформироватьТаблицуТчНакладныеНаОтгрузку()
	
	спДокументов = новый Массив;
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			спДокументов.Добавить(СтрокаТЧ.ДокументЗаказ);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(250)) КАК ГрузополучательТОРГ12
	|ПОМЕСТИТЬ ВТ_ГрузополучательТОРГ12
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.Код = ""00000000046""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(250)) КАК ГрузополучательСФ
	|ПОМЕСТИТЬ ВТ_ГрузополучательСФ
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.Код = ""00000000045""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(250)) КАК Плательщик
	|ПОМЕСТИТЬ ВТ_Плательщик
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.Код = ""00000000047""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК СТРОКА(16)) КАК НомерМагазина
	|ПОМЕСТИТЬ ВТ_НомерМагазина
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер КАК НомерРеализации,
	|	РеализацияТоваровУслуг.Сделка КАК ЗаказПокупателя,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ_Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Сделка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Номер КАК НомерСчетФактуры,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	ВТ_Реализация.Реализация
	|ПОМЕСТИТЬ ВТ_СчетФактура
	|ИЗ
	|	ВТ_Реализация КАК ВТ_Реализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ВТ_Реализация.Реализация = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК ЗаказСсылка,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяТовары.Сумма / ЗаказПокупателяТовары.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РасчетнаяЦена,
	|	ЗаказПокупателяТовары.Количество КАК Количество,
	|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяТовары.СерияНоменклатуры КАК Партия,
	|	ЗаказПокупателяТовары.СерияНоменклатуры.абс_УдостоверениеКачества.Номер КАК УдостоверениеКачества,
	|	ЗаказПокупателяТовары.СерияНоменклатуры.СрокГодности КАК СрокГодности,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, 0) КАК ПолныйСрокГодности,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения.Наименование,
	|	ЗаказПокупателяТовары.СерияНоменклатуры
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ЗаказПокупателяТовары.Номенклатура = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ПолныйСрокГодностиТовара))
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200)) КАК АдресДоставки,
	|	ЗаказПокупателя.Контрагент,
	|	ЕСТЬNULL(КонтактнаяИнформация.абс_ДатаАктуальностиКИ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаАктуальности
	|ПОМЕСТИТЬ АдресаДоставкиСДатами
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаказПокупателя.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = &Вид)
	|			И (КонтактнаяИнформация.Тип = &Тип)
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200)) КАК АдресДоставки,
	|	ЗаказПокупателя.Грузополучатель,
	|	ЕСТЬNULL(КонтактнаяИнформация.абс_ДатаАктуальностиКИ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаАктуальности
	|ПОМЕСТИТЬ АдресаДоставкиСДатами_Грузополучатель
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Вид = &Вид)
	|			И (КонтактнаяИнформация.Тип = &Тип)
	|			И ЗаказПокупателя.Грузополучатель = КонтактнаяИнформация.Объект
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&спДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаДоставкиСДатами.Контрагент,
	|	МАКСИМУМ(АдресаДоставкиСДатами.ДатаАктуальности) КАК ДатаАктуальности
	|ПОМЕСТИТЬ ДатыКИ
	|ИЗ
	|	АдресаДоставкиСДатами КАК АдресаДоставкиСДатами
	|
	|СГРУППИРОВАТЬ ПО
	|	АдресаДоставкиСДатами.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(АдресаДоставкиСДатами_Грузополучатель.ДатаАктуальности) КАК ДатаАктуальности,
	|	АдресаДоставкиСДатами_Грузополучатель.Грузополучатель
	|ПОМЕСТИТЬ ДатыКИ_Грузополучатель
	|ИЗ
	|	АдресаДоставкиСДатами_Грузополучатель КАК АдресаДоставкиСДатами_Грузополучатель
	|
	|СГРУППИРОВАТЬ ПО
	|	АдресаДоставкиСДатами_Грузополучатель.Грузополучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаДоставкиСДатами.Контрагент,
	|	АдресаДоставкиСДатами.АдресДоставки
	|ПОМЕСТИТЬ АдресаДоставки
	|ИЗ
	|	АдресаДоставкиСДатами КАК АдресаДоставкиСДатами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыКИ КАК ДатыКИ
	|		ПО АдресаДоставкиСДатами.Контрагент = ДатыКИ.Контрагент
	|			И АдресаДоставкиСДатами.ДатаАктуальности = ДатыКИ.ДатаАктуальности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаДоставкиСДатами_Грузополучатель.АдресДоставки,
	|	АдресаДоставкиСДатами_Грузополучатель.Грузополучатель
	|ПОМЕСТИТЬ АдресаДоставки_Грузополучатель
	|ИЗ
	|	АдресаДоставкиСДатами_Грузополучатель КАК АдресаДоставкиСДатами_Грузополучатель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыКИ_Грузополучатель КАК ДатыКИ_Грузополучатель
	|		ПО АдресаДоставкиСДатами_Грузополучатель.ДатаАктуальности = ДатыКИ_Грузополучатель.ДатаАктуальности
	|			И АдресаДоставкиСДатами_Грузополучатель.Грузополучатель = ДатыКИ_Грузополучатель.Грузополучатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""H"" КАК ТипСтроки,
	|	""OUT"" КАК ТипДокумента_НомерЗаявкиНаВыдачу,
	|	""MOLCOM"" КАК КодОтправителя_НомерПозиции,
	|	ВЫБОР
	|		КОГДА ВТ_Реализация.Реализация.Организация.Префикс = ""LTT""
	|			ТОГДА ""LTN""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Реализация.Реализация.Организация.Префикс = ""LVN""
	|					ТОГДА ""LVT""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ_Реализация.Реализация.Организация.Префикс = ""LFE""
	|							ТОГДА ""LFE""
	|						ИНАЧЕ """"
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ВладелецТовара,
	|	ВТ_Реализация.ЗаказПокупателя.Номер КАК НомерЗаявкиНаВыдачу_КодТовара,
	|	ВТ_Реализация.НомерРеализации КАК НомерТоварнойНакладной_ЗаказанноеКоличество,
	|	ВТ_Реализация.ЗаказПокупателя.Дата КАК ДатаЗаявкиНаВыдачу_ЕдиницаИзмерения,
	|	ВТ_Реализация.ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки_Партия,
	|	ВЫБОР
	|		КОГДА ВТ_Реализация.ЗаказПокупателя.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.Пустаяссылка)
	|			ТОГДА ВТ_Реализация.ЗаказПокупателя.Контрагент.Код
	|		ИНАЧЕ ВТ_Реализация.ЗаказПокупателя.Грузополучатель.Код
	|	КОНЕЦ КАК КодПолучателя_Цена,
	|	1 КАК ПризнакУпаковки_ПризнакПечатиГарантийногоТалона,
	|	0 КАК ПризнакИнтернетЗаказа_КлиентскийАртикул,
	|	"""" КАК ЗонаОтгрузки_Квалификация,
	|	"""" КАК ЗонаПриемки,
	|	ВЫБОР
	|		КОГДА ВТ_Плательщик.Плательщик ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_Плательщик.Плательщик
	|	КОНЕЦ КАК Адресс1,
	|	ВЫБОР
	|		КОГДА АдресаДоставки_Грузополучатель.АдресДоставки ЕСТЬ NULL
	|			ТОГДА АдресаДоставки.АдресДоставки
	|		ИНАЧЕ АдресаДоставки_Грузополучатель.АдресДоставки
	|	КОНЕЦ КАК Адресс2,
	|	ВЫБОР
	|		КОГДА ВТ_ГрузополучательСФ.ГрузополучательСФ ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ГрузополучательСФ.ГрузополучательСФ
	|	КОНЕЦ КАК Адресс3,
	|	ВЫБОР
	|		КОГДА ВТ_ГрузополучательТОРГ12.ГрузополучательТОРГ12 ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_ГрузополучательТОРГ12.ГрузополучательТОРГ12
	|	КОНЕЦ КАК Адресс4,
	|	"""" КАК ПолучательЭтикетка,
	|	"""" КАК АдресДоставкиЭтикетка,
	|	ВТ_Реализация.ЗаказПокупателя.НомерПоДаннымПокупателя КАК НомерЗаказаКонтрагента,
	|	"""" КАК СрокДоставкиГруза,
	|	ВЫБОР
	|		КОГДА ВТ_Реализация.ЗаказПокупателя.абс_СтокТранзит = ЗНАЧЕНИЕ(Перечисление.абс_СтокТранзит.Транзит)
	|			ТОГДА ""транзит""
	|		КОГДА ВТ_Реализация.ЗаказПокупателя.абс_СтокТранзит = ЗНАЧЕНИЕ(Перечисление.абс_СтокТранзит.Сток)
	|			ТОГДА ""сток""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВариантКомплектации,
	|	"""" КАК ПризнакЧЗ,
	|	ВТ_Реализация.ЗаказПокупателя КАК ЗаказСсылка
	|ИЗ
	|	ВТ_Реализация КАК ВТ_Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетФактура КАК ВТ_СчетФактура
	|		ПО ВТ_Реализация.Реализация = ВТ_СчетФактура.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаДоставки КАК АдресаДоставки
	|		ПО ВТ_Реализация.ЗаказПокупателя.Контрагент = АдресаДоставки.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ АдресаДоставки_Грузополучатель КАК АдресаДоставки_Грузополучатель
	|		ПО ВТ_Реализация.ЗаказПокупателя.Грузополучатель = АдресаДоставки_Грузополучатель.Грузополучатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Плательщик КАК ВТ_Плательщик
	|		ПО ВТ_Реализация.ЗаказПокупателя.Грузополучатель = ВТ_Плательщик.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрузополучательТОРГ12 КАК ВТ_ГрузополучательТОРГ12
	|		ПО ВТ_Реализация.ЗаказПокупателя.Грузополучатель = ВТ_ГрузополучательТОРГ12.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрузополучательСФ КАК ВТ_ГрузополучательСФ
	|		ПО ВТ_Реализация.ЗаказПокупателя.Грузополучатель = ВТ_ГрузополучательСФ.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""I"",
	|	ДанныеСтрокЗаказа.НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ДанныеСтрокЗаказа.НоменклатураИзПаллет = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ДанныеСтрокЗаказа.НомерСтроки
	|		ИНАЧЕ ДанныеСтрокЗаказа.НомерСтрокиПаллет
	|	КОНЕЦ,
	|	""Не заполняется"",
	|	ДанныеСтрокЗаказа.Артикул,
	|	ВЫБОР
	|		КОГДА ДанныеСтрокЗаказа.НоменклатураИзПаллет = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ДанныеСтрокЗаказа.КоличествоЗаказ
	|		ИНАЧЕ ДанныеСтрокЗаказа.КоличествоПоПаллетам
	|	КОНЕЦ,
	|	ДанныеСтрокЗаказа.ЕдиницаИзмеренияНаименование,
	|	ДанныеСтрокЗаказа.Партия,
	|	ДанныеСтрокЗаказа.РасчетнаяЦена,
	|	0,
	|	ЕСТЬNULL(абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства, """"),
	|	ВЫБОР
	|		КОГДА ДанныеСтрокЗаказа.ЗаказСсылка.СкладГруппа = &QLFQUARANTINE2
	|				ИЛИ ДанныеСтрокЗаказа.ЗаказСсылка.СкладГруппа = &QLFQUARANTINE1
	|			ТОГДА ""QLFQUARANTINE1""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеСтрокЗаказа.ЗаказСсылка.СкладГруппа = &QLFDEFECT1
	|						ИЛИ ДанныеСтрокЗаказа.ЗаказСсылка.СкладГруппа = &QLFDEFECT2
	|					ТОГДА ""QLFDEFECT""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДанныеСтрокЗаказа.ЗаказСсылка.СкладГруппа = &QLFNORMAL
	|							ТОГДА ""QLFNORMAL""
	|						ИНАЧЕ ""QLFNORMAL""
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	""Не заполняется"",
	|	ДанныеСтрокЗаказа.ШтрихкодПаллеты,
	|	0,
	|	ДанныеСтрокЗаказа.ЗаказСсылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Заказы.ЗаказСсылка.Номер КАК НомерЗаказа,
	|		ВТ_Заказы.Артикул КАК Артикул,
	|		ВТ_Заказы.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|		ВТ_Заказы.Партия КАК Партия,
	|		ВТ_Заказы.РасчетнаяЦена КАК РасчетнаяЦена,
	|		ВТ_Заказы.ЗаказСсылка КАК ЗаказСсылка,
	|		ВТ_Заказы.Номенклатура КАК Номенклатура,
	|		ВТ_Заказы.НомерСтроки КАК НомерСтроки,
	|		ВТ_Заказы.Количество КАК КоличествоЗаказ,
	|		ЕСТЬNULL(РеализацияТоваровУслугЛео_Паллеты.Количество, 0) КАК КоличествоПоПаллетам,
	|		ЕСТЬNULL(РеализацияТоваровУслугЛео_Паллеты.Номенклатура, ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)) КАК НоменклатураИзПаллет,
	|		ЕСТЬNULL(РеализацияТоваровУслугЛео_Паллеты.ШтрихкодПаллеты, """") КАК ШтрихкодПаллеты,
	|		ЕСТЬNULL(РеализацияТоваровУслугЛео_Паллеты.УникальныйИндификаторПалеты, """") КАК УникальныйИндификаторПалеты,
	|		РеализацияТоваровУслугЛео_Паллеты.НомерСтроки КАК НомерСтрокиПаллет
	|	ИЗ
	|		ВТ_Заказы КАК ВТ_Заказы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Лео_Паллеты КАК РеализацияТоваровУслугЛео_Паллеты
	|			ПО ВТ_Заказы.ЗаказСсылка = РеализацияТоваровУслугЛео_Паллеты.Ссылка.Сделка
	|				И (РеализацияТоваровУслугЛео_Паллеты.Ссылка.Проведен = ИСТИНА)
	|				И ВТ_Заказы.Номенклатура = РеализацияТоваровУслугЛео_Паллеты.Номенклатура
	|				И ВТ_Заказы.СерияНоменклатуры = РеализацияТоваровУслугЛео_Паллеты.СерияНоменклатуры) КАК ДанныеСтрокЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(, Свойство = &СвойствоНоменклатуры) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
	|		ПО ДанныеСтрокЗаказа.Номенклатура = абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|			И ДанныеСтрокЗаказа.ЗаказСсылка.Контрагент = абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Контрагент";
	
	Запрос.УстановитьПараметр("спДокументов", спДокументов);
	
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Запрос.УстановитьПараметр("СвойствоНоменклатуры",ПланыВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя);
	Запрос.УстановитьПараметр("QLFNORMAL",Объект.ПараметрыПоУмолчанию.QLFNORMAL);
    Запрос.УстановитьПараметр("QLFDEFECT1",Объект.ПараметрыПоУмолчанию.QLFDEFECT1);
    Запрос.УстановитьПараметр("QLFDEFECT2",Объект.ПараметрыПоУмолчанию.QLFDEFECT2);
    Запрос.УстановитьПараметр("QLFQUARANTINE1",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1);
    Запрос.УстановитьПараметр("QLFQUARANTINE2",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2);

	
	НакладныеНаОтгрузку = Запрос.Выполнить().Выгрузить();	
	
	Объект.ТчНакладныеНаОтгрузку.Очистить();
	
	
	//+Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
	//Удалить код после окончательной ратации номенклатуры
	Для каждого СтрокаНакладные из НакладныеНаОтгрузку Цикл
		Если  СтрокаНакладные.ТипСтроки = "I" Тогда
			СтрокаНакладные.ПризнакЧЗ			= "0";
			НоменклатураСсылка	=	Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаНакладные.НомерЗаявкиНаВыдачу_КодТовара);
			Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				ЗначениеОКПД2	= лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(НоменклатураСсылка, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
				Если ЗначениеЗаполнено(ЗначениеОКПД2) И ТипЗнч(ЗначениеОКПД2)=Тип("СправочникСсылка.Лео_КлассификаторОКПД2") Тогда 
					Если ЗначениеОКПД2.ЧестныйЗнак Тогда
						СтрокаНакладные.ПризнакЧЗ			= "1";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			
			АртикулСтрокой = СтрЗаменить(СтрокаНакладные.НомерЗаявкиНаВыдачу_КодТовара,"_18%","");
			СтрокаНакладные.НомерЗаявкиНаВыдачу_КодТовара	= АртикулСтрокой;
		КонецЕсли;
		СтрокаНакладные.Адресс1 = СтрЗаменить(СтрокаНакладные.Адресс1,";",",");
		СтрокаНакладные.Адресс2 = СтрЗаменить(СтрокаНакладные.Адресс2,";",",");
		СтрокаНакладные.Адресс3 = СтрЗаменить(СтрокаНакладные.Адресс3,";",",");
		СтрокаНакладные.Адресс4 = СтрЗаменить(СтрокаНакладные.Адресс4,";",",");
		СтрокаНакладные.АдресДоставкиЭтикетка = СтрЗаменить(СтрокаНакладные.АдресДоставкиЭтикетка,";",",");
	КонецЦикла;
	//-Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
	
	Объект.ТчНакладныеНаОтгрузку.Загрузить(НакладныеНаОтгрузку);					
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусОтгружен_Сервер()
	
	Для каждого СтрокаТЧ из Объект.СписокЗаказов Цикл
		Если СтрокаТЧ.Выгружать = Истина и НЕ СтрокаТЧ.ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			ЗаменитьДатуЖелаемойОтгрузки(СтрокаТЧ.ДокументЗаказ, Перечисления.абс_СтатусыОтгрузки.Отгружен);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьДатуЖелаемойОтгрузки(ДокументЗаказ,Статус)
	ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
	ДокументОбъект.абс_Статус = Статус;
	ДокументОбъект.ДатаОтгрузки = Объект.ДатаОтгрузки;
	ДокументОбъект.Записать();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ ПЕРЕМЕЩЕНИЯ ЛЛ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура СписокПеремещенийУстановитьВсеФлаги(Команда)
	ПеремещенияУстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокПеремещенийСнятьВсеФлаги(Команда)
	ПеремещенияУстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокПеремещенийНаСкладЛЛ(Команда)
	
	СкладОтправитель = новый Массив;
	СкладОтправитель.Добавить(Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции);
	СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000042"));   //Основной склад упаковки
    СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000041"));   //Основной склад сырья
    СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000053"));   //КАРАНТИН СЫРЬЕ
	СкладПолучатель = новый Массив;
	СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад);
	СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора);
	СкладПолучатель.Добавить(Справочники.Склады.НайтиПоКоду("000000075"));   //КАРАНТИН МОЛКОМ (СЫРЬЕ)
	СкладПолучатель.Добавить(Справочники.Склады.НайтиПоКоду("000000060"));   //СКЛАД МОЛКОМ (СЫРЬЕ)
	СкладПолучатель.Добавить(Справочники.Склады.НайтиПоКоду("000000061"));   //СКЛАД МОЛКОМ (МАТЕРИАЛЫ)
	СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.QLFDEFECT1);
	СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.QLFDEFECT2);
	СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1);
    СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2);     

	СформироватьСписокПеремещенийЛЛ_Сервер(СкладОтправитель, СкладПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокПоступленийТУМЛ(Команда)
	
	СкладОтправитель =  Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
	СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
	СформироватьСписокПоступленийТУ_Сервер(СкладОтправитель, СкладПолучатель);
	
КонецПроцедуры
                                                                                      
&НаКлиенте
Процедура ВыгрузитьПеремещенияНаСкладЛЛ(Команда)	
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
		
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда   
			//проверить наличие цены в таб.части документа
			ЕстьНулеваяЦена	=	Ложь;
			Для каждого СтрокаТовары Из СтрокаТЗ.Перемещение.Товары Цикл
				Если СтрокаТовары.Цена=0 Тогда
					ЕстьНулеваяЦена	=	Истина;
				КонецЕсли;	
			КонецЦикла;	
			
			ЕстьСтрокаЧЗ=Ложь;
			Для каждого СтрокаТовары Из СтрокаТЗ.Перемещение.Товары Цикл
				ЗначениеОКПД2	= лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(СтрокаТовары.Номенклатура, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
				Если ЗначениеЗаполнено(ЗначениеОКПД2) И ТипЗнч(ЗначениеОКПД2)=Тип("СправочникСсылка.Лео_КлассификаторОКПД2") Тогда 
					Если ЗначениеОКПД2.ЧестныйЗнак Тогда 
						ЕстьСтрокаЧЗ=Истина;
				    КонецЕсли;
			    КонецЕсли;
			КонецЦикла;
			НеЗаполненыКоды=Ложь;
			Если ЕстьСтрокаЧЗ Тогда
				Если СтрокаТЗ.Перемещение.СписокКоробок.Количество()=0 Тогда	
					НеЗаполненыКоды=Истина;
				КонецЕсли;
			КонецЕсли;
			Если НеЗаполненыКоды и ПараметрыСеанса.ТекущийПользователь.Наименование="Громова Юлия Сергеевна" Тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("Отсутствуют коды ЧЗ для выгрузки, все равно выгрузить?", Режим, 0);
				Если Ответ = КодВозвратаДиалога.Да Тогда
    				НеЗаполненыКоды=Ложь;
				КонецЕсли;			
			КонецЕсли;	
			
			Если ЕстьНулеваяЦена Тогда
				Предупреждение("Документ "+СтрокаТЗ.Перемещение+" содержит строки с нулевой ценой, данный документ не может быть отправлен, необходимо исправить ошибку");
			ИначеЕсли НеЗаполненыКоды Тогда
				Предупреждение("Документ "+СтрокаТЗ.Перемещение+" содержит строки товаром подлежащим маркировки ЧЗ, но коды маркирове для передачи отсутствуют");
			Иначе	
	
				ПрефиксФайла  = "input_" + ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаТЗ.Перемещение);
				
				ИмяФайла = СформироватьИмяФайла(ПрефиксФайла,Каталог,Объект.ДатаОтгрузки);
				
				ВыбФайл = Новый Файл(ИмяФайла);
		
				Если ВыбФайл.Существует() Тогда
					УдалитьФайлы(ВыбФайл);
				КонецЕсли;
				
				ТаблицаЗначений = СформироватьТабДокПеремещенияНаСкладМолком_Сервер(СтрокаТЗ.Перемещение);
				
				// проверка на склад если Это СиУ то меняем склад получатель
	            Если НЕ СписокСкладСиУ.НайтиПоЗначению(СтрокаТЗ.Перемещение.СкладПолучатель)=Неопределено Тогда  
					Для каждого СтрокаНакладные из ТаблицаЗначений Цикл
						Если  СтрокаНакладные.Поле1 = "H" Тогда 
							СтрокаНакладные.Поле4 = "LVU";
						КонецЕсли;
					КонецЦикла;
	            КонецЕсли;
				Если ТаблицаЗначений.Количество()> 0  Тогда
					ВыгруженоУспешно = ВыгрузитьВCSV(ИмяФайла,ТаблицаЗначений);
				КонецЕсли;
				
				Если ВыгруженоУспешно Тогда
					ОбработатьДокуменДляВыгрузкиКодовМаркировки(СтрокаТЗ.Перемещение);	
				КонецЕсли;	
			КонецЕсли;	
		Конецесли;
	КонецЦикла;
	
	МаскаФайла = "*.csv";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", ); 
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
КонецПроцедуры  

&НаКлиенте
Процедура ВыгрузитьПоступленияТУНаСкладМЛ(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
		
	Для каждого СтрокаТЗ из Объект.СписокПоступлениеТУ Цикл
		Если СтрокаТЗ.Выгружать Тогда
			ПрефиксФайла  = "inputPTU_" + ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаТЗ.ПоступлениеТУ);
			
			ИмяФайла = СформироватьИмяФайла(ПрефиксФайла,Каталог,Объект.ДатаОтгрузки);
			
			ВыбФайл = Новый Файл(ИмяФайла);
	
			Если ВыбФайл.Существует() Тогда
				УдалитьФайлы(ВыбФайл)
			КонецЕсли;
			
			ТаблицаЗначений = СформироватьТабДокПоступленияТУНаСкладМолком_Сервер(СтрокаТЗ.ПоступлениеТУ);

			// проверка на склад если Это СиУ то меняем склад получатель
            Если НЕ СписокСкладСиУ.НайтиПоЗначению(СтрокаТЗ.ПоступлениеТУ.СкладОрдер)=Неопределено Тогда  
				Для каждого СтрокаНакладные из ТаблицаЗначений Цикл
					Если  СтрокаНакладные.Поле1 = "H" Тогда 
						СтрокаНакладные.Поле4 = "LVU";
					КонецЕсли;
				КонецЦикла;
            КонецЕсли;
		
			Если ТаблицаЗначений.Количество()> 0  Тогда
				ВыгруженоУспешно = ВыгрузитьВCSV(ИмяФайла,ТаблицаЗначений);
			КонецЕсли;
			
		Конецесли;
	КонецЦикла;
	
	МаскаФайла = "*.csv";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
КонецПроцедуры

Функция СформироватьТабДокПоступленияТУНаСкладМолком_Сервер(Перемещение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваров.Дата КАК абс_СрокДоставки
		|ПОМЕСТИТЬ ВТ_Шапка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.НомерСтроки,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Количество,
		|	ПеремещениеТоваровТовары.СерияНоменклатуры,
		|	ПеремещениеТоваровТовары.Цена
		|ПОМЕСТИТЬ ВТ_ТчТовары
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""OUT"" КАК УдаляемоеПоле,
		|	""H"" КАК Поле1,
		|	""IN"" КАК Поле2,
		|	""MOLCOM"" КАК Поле3,
		|	ВЫБОР
		|		КОГДА ВТ_Шапка.Организация.Префикс = ""LTT""
		|			ТОГДА ""LTN""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Шапка.Организация.Префикс = ""LVN""
		|					ТОГДА ""LVT""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_Шапка.Организация.Префикс = ""LFE""
		|							ТОГДА ""LFE""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле4,
		|	1 КАК Поле5,
		|	ВТ_Шапка.Номер КАК Поле6,
		|	ВТ_Шапка.Номер КАК Поле7,
		|	ВТ_Шапка.абс_СрокДоставки КАК Поле8,
		|	"""" КАК Поле9,
		|	"""" КАК Поле10,
		|	"""" КАК Поле11,
		|	"""" КАК Поле12,
		|	1 КАК Поле13
		|ИЗ
		|	ВТ_Шапка КАК ВТ_Шапка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""OUT"",
		|	""I"",
		|	ВТ_ТчТовары.Ссылка.Номер,
		|	ВТ_ТчТовары.НомерСтроки,
		|	ВТ_ТчТовары.Номенклатура.Артикул,
		|	ВТ_ТчТовары.Количество,
		|	ВТ_ТчТовары.ЕдиницаИзмерения.Наименование,
		|	ЕСТЬNULL(ВТ_ТчТовары.СерияНоменклатуры.Наименование, """"),
		|	ВТ_ТчТовары.Цена,
		|	"""",
		|	"""",
		|	""Не заполняется"",
		|	""Не заполняется"",
		|	ВЫБОР
		|		КОГДА ВТ_ТчТовары.Ссылка.СкладОрдер = &QLFQUARANTINE2
		|				ИЛИ ВТ_ТчТовары.Ссылка.СкладОрдер = &QLFQUARANTINE1
		|			ТОГДА ""QLFQUARANTINE1""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_ТчТовары.Ссылка.СкладОрдер = &QLFDEFECT1
		|						ИЛИ ВТ_ТчТовары.Ссылка.СкладОрдер = &QLFDEFECT2
		|					ТОГДА ""QLFDEFECT""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_ТчТовары.Ссылка.СкладОрдер = &QLFNORMAL
		|							ТОГДА ""QLFNORMAL""
		|						ИНАЧЕ ""QLFNORMAL""
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТчТовары КАК ВТ_ТчТовары";

	Запрос.УстановитьПараметр("СсылкаПеремещение", Перемещение);
	//Запрос.УстановитьПараметр("QLFNORMAL",Объект.ПараметрыПоУмолчанию.QLFNORMAL);
	Запрос.УстановитьПараметр("QLFNORMAL",Перемещение.СкладОрдер);
    Запрос.УстановитьПараметр("QLFDEFECT1",Объект.ПараметрыПоУмолчанию.QLFDEFECT1);
    Запрос.УстановитьПараметр("QLFDEFECT2",Объект.ПараметрыПоУмолчанию.QLFDEFECT2);
    Запрос.УстановитьПараметр("QLFQUARANTINE1",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1);
    Запрос.УстановитьПараметр("QLFQUARANTINE2",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2);

	
	Результат = Запрос.Выполнить();
	ТабЗначений = Результат.Выгрузить();
	
	Возврат ТабЗначений;	
	
КонецФункции


&НаКлиенте
Процедура СформироватьСписокВозвратовСоСкладаЛЛ(Команда)
	
	СкладОтправитель = новый Массив;
	СкладОтправитель.Добавить(Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора);
	СкладОтправитель.Добавить(Объект.ПараметрыПоУмолчанию.QLFDEFECT1);
	СкладОтправитель.Добавить(Объект.ПараметрыПоУмолчанию.QLFDEFECT2);
	СкладОтправитель.Добавить(Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1);
    СкладОтправитель.Добавить(Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2);
    СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000075"));     //КАРАНТИН МОЛКОМ (СЫРЬЕ)
    СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000047"));     //Склад Молком карантин
    СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000061"));     //СКЛАД МОЛКОМ (МАТЕРИАЛЫ)
    СкладОтправитель.Добавить(Справочники.Склады.НайтиПоКоду("000000060"));     //СКЛАД МОЛКОМ (СЫРЬЕ)
	
	СкладПолучатель = новый Массив;
    СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции);
    СкладПолучатель.Добавить(Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад);
    СкладПолучатель.Добавить(Справочники.Склады.НайтиПоКоду("000000042"));      //Основной склад упаковки
    СкладПолучатель.Добавить(Справочники.Склады.НайтиПоКоду("000000041"));
    СкладПолучатель.Добавить(Справочники.Склады.НайтиПоКоду("000000053"));      //КАРАНТИН СЫРЬЕ
	
	СформироватьСписокПеремещенийЛЛ_Сервер(СкладОтправитель, СкладПолучатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВозвратыСоСкладаЛЛ(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиВозвратыСоСклада;
		
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда
			//проверить наличие цены в таб.части документа
			ЕстьНулеваяЦена	=	Ложь;
			Для каждого СтрокаТовары Из СтрокаТЗ.Перемещение.Товары Цикл
				Если СтрокаТовары.Цена=0 Тогда
					ЕстьНулеваяЦена	=	Истина;
				КонецЕсли;	
			КонецЦикла;	
			
			Если ЕстьНулеваяЦена Тогда
				Предупреждение("Документ "+СтрокаТЗ.Перемещение+" содержит строки с нулевой ценой, данный документ не может быть отправлен, необходимо исправить ошибку");
			Иначе	
				ПрефиксФайла  = "ORDER_" + ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаТЗ.Перемещение);
				
				ИмяФайла = СформироватьИмяФайла(ПрефиксФайла,Каталог,Объект.ДатаОтгрузки);
				
				ВыбФайл = Новый Файл(ИмяФайла);
		
				Если ВыбФайл.Существует() Тогда
					УдалитьФайлы(ВыбФайл)
				КонецЕсли;
				
				ТаблицаЗначений = СформироватьТабДокВозвратаСоСкладаЛЛ_Сервер(СтрокаТЗ.Перемещение);

				// проверка на склад если Это СиУ то меняем склад получатель
	            Если НЕ СписокСкладСиУ.НайтиПоЗначению(СтрокаТЗ.Перемещение.СкладОтправитель)=Неопределено Тогда  
					Для каждого СтрокаНакладные из ТаблицаЗначений Цикл
						Если  СтрокаНакладные.Поле1 = "H" Тогда 
							СтрокаНакладные.Поле4 = "LVU";
						КонецЕсли;
					КонецЦикла;
	            КонецЕсли;
				
				Если ТаблицаЗначений.Количество()> 0  Тогда
					ВыгруженоУспешно = ВыгрузитьВCSV(ИмяФайла,ТаблицаЗначений);
				КонецЕсли;
			
			Конецесли;
		Конецесли;
	КонецЦикла;
	
	МаскаФайла = "*.csv";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
	//ЛЕО Зароднюк Владимир 26.05.2025
	МаскаФайла = "*.xml";
	ВыгрузитьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,"inbound", );
КонецПроцедуры

&НаКлиенте  
//&НаСервере 
Процедура ОбработатьДокуменДляВыгрузкиКодовМаркировки(ДокументПеремещение)   
	//проверим наличие данных для передачи
	Если НЕ ДокументПеремещение.СписокКоробок.Количество()=0 Тогда  
		
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
		ПрефиксФайла  = "Contentsscc_" + ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументПеремещение);
		ИмяФайла = СтрЗаменить(СформироватьИмяФайла(ПрефиксФайла,Каталог,ТекущаяДата()),".csv",".xml");
	    //Проверка файла на наличие
		ВыбФайл = Новый Файл(ИмяФайла);
		Если ВыбФайл.Существует() Тогда
			УдалитьФайлы(ВыбФайл);
		КонецЕсли;        
	
		ВТСписокКоробок	=	Новый ТаблицаЗначений;
		ВТСписокКоробок	=	ДокументПеремещение.СписокКоробок.Выгрузить();
		ВТСписокКоробок.Сортировать("SSCC_КодыПаллеты,Номенклатура,ШтрихКодКоробки");
		
        Запрос	=	Новый Запрос;
		Запрос.Текст	=	"ВЫБРАТЬ
		            	 	|	Лео_СкладQRКоды_ВведеноВОборот.Код_КМ КАК QR_Код
		            	 	|ИЗ
		            	 	|	РегистрСведений.Лео_СкладQRКоды_ВведеноВОборот КАК Лео_СкладQRКоды_ВведеноВОборот
		            	 	|ГДЕ
		            	 	|	Лео_СкладQRКоды_ВведеноВОборот.id_korob = &ШтрихКодКоробка";
		
	    ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	    ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("CONTENTSSCC"); // Первый элемент	
			ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCIWBNAME");
			ЗаписьXML.ЗаписатьТекст(ДокументПеремещение.Номер);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCACTION");
			ЗаписьXML.ЗаписатьТекст("2");
			ЗаписьXML.ЗаписатьКонецЭлемента();
			Для Каждого СтрокаТЧ Из ВТСписокКоробок Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("LINE"); 
					Запрос.УстановитьПараметр("ШтрихКодКоробка",СтрокаТЧ.ШтрихКодКоробки);
					ВыборкаQR	= Запрос.Выполнить().Выбрать();

					ЗаписьXML.ЗаписатьНачалоЭлемента("ARTNAME");
					ЗаписьXML.ЗаписатьТекст(СокрЛП(СтрокаТЧ.Номенклатура.Артикул));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCCOUNT");
					ЗаписьXML.ЗаписатьТекст(Строка(ВыборкаQR.Количество()));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					Если ЗначениеЗаполнено(СтрокаТЧ.SSCC_КодыПаллеты) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCUP");
					ЗаписьXML.ЗаписатьТекст(СокрЛП(СтрокаТЧ.SSCC_КодыПаллеты));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					КонецЕсли;
					ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCLOW");
					ЗаписьXML.ЗаписатьТекст(СокрЛП(СтрокаТЧ.ШтрихКодКоробки.Наименование));
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCMEDIUM");
					//ЗаписьXML.ЗаписатьТекст("-");
					ЗаписьXML.ЗаписатьКонецЭлемента();
					ЗаписьXML.ЗаписатьНачалоЭлемента("SSCCTRACKANDTRACEMARKINGS"); 
						Пока ВыборкаQR.Следующий() Цикл
							ЗаписьXML.ЗаписатьНачалоЭлемента("TRACKANDTRACEMARKING");
							ЗаписьXML.ЗаписатьТекст(СтрЗаменить(ВыборкаQR.QR_Код,Символ(29),""));
							ЗаписьXML.ЗаписатьКонецЭлемента();
						КонецЦикла;
					ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть(); // Закрываем файл 
	КонецЕсли;
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Функция СформироватьТабДокПеремещенияНаСкладМолком_Сервер(Перемещение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.ВерсияДанных,
		|	ПеремещениеТоваров.ПометкаУдаления,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.Проведен,
		|	ПеремещениеТоваров.ВидОперации,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваров.ОтражатьВУправленческомУчете,
		|	ПеремещениеТоваров.ОтражатьВБухгалтерскомУчете,
		|	ПеремещениеТоваров.ОтражатьВНалоговомУчете,
		|	ПеремещениеТоваров.Подразделение,
		|	ПеремещениеТоваров.Комментарий,
		|	ПеремещениеТоваров.СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель,
		|	ПеремещениеТоваров.Ответственный,
		|	ПеремещениеТоваров.ВнутреннийЗаказ,
		|	ПеремещениеТоваров.НДСвСтоимостиТоваров,
		|	ПеремещениеТоваров.СчетСписанияНДС,
		|	ПеремещениеТоваров.СубконтоСписанияНДС1,
		|	ПеремещениеТоваров.СубконтоСписанияНДС2,
		|	ПеремещениеТоваров.СубконтоСписанияНДС3,
		|	ПеремещениеТоваров.СчетСписанияНДСНУ,
		|	ПеремещениеТоваров.СубконтоСписанияНДСНУ1,
		|	ПеремещениеТоваров.СубконтоСписанияНДСНУ2,
		|	ПеремещениеТоваров.СубконтоСписанияНДСНУ3,
		|	ПеремещениеТоваров.НоменклатурнаяГруппа,
		|	ПеремещениеТоваров.СтатьяЗатратСписанияНДС,
		|	ПеремещениеТоваров.ПодразделениеОрганизации,
		|	ПеремещениеТоваров.СуммаДокументаРозничная,
		|	ПеремещениеТоваров.РаспределениеОстатковТоваровОрганизацийПоСкладам,
		|	ПеремещениеТоваров.абс_НомерЛЛ,
		|	ПеремещениеТоваров.ТипЦен,
		|	ПеремещениеТоваров.ВалютаДокумента,
		|	ПеремещениеТоваров.абс_ХозяйственнаяОперация,
		|	ПеремещениеТоваров.абс_Выгружен,
		|	ПеремещениеТоваров.абс_Статус,
		|	ПеремещениеТоваров.абс_Водитель,
		|	ПеремещениеТоваров.абс_ТранспортноеСредство,
		|	ПеремещениеТоваров.абс_СрокДоставки,
		|	ПеремещениеТоваров.абс_ПунктПогрузки,
		|	ПеремещениеТоваров.абс_ПунктРазгрузки,
		|	ПеремещениеТоваров.абс_Заказчик,
		|	ПеремещениеТоваров.абс_Перевозчик,
		|	ПеремещениеТоваров.абс_НомерПломбы,
		|	ПеремещениеТоваров.абс_КоличествоПалет,
		|	ПеремещениеТоваров.абс_ЛицензионнаяКарточка,
		|	ПеремещениеТоваров.абс_ВидПеревозки,
		|	ПеремещениеТоваров.абс_ДокументОснование
		|ПОМЕСТИТЬ ВТ_Шапка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.НомерСтроки,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.КоличествоМест,
		|	ПеремещениеТоваровТовары.ЕдиницаИзмеренияМест,
		|	ПеремещениеТоваровТовары.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Коэффициент,
		|	ПеремещениеТоваровТовары.Количество,
		|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры,
		|	ПеремещениеТоваровТовары.СерияНоменклатуры,
		|	ПеремещениеТоваровТовары.ДокументРезерва,
		|	ПеремещениеТоваровТовары.Цена,
		|	ПеремещениеТоваровТовары.ПринятыеСчетУчетаБУ,
		|	ПеремещениеТоваровТовары.СчетУчетаБУ,
		|	ПеремещениеТоваровТовары.СчетУчетаНУ,
		|	ПеремещениеТоваровТовары.НовыйПринятыеСчетУчетаБУ,
		|	ПеремещениеТоваровТовары.НовыйСчетУчетаБУ,
		|	ПеремещениеТоваровТовары.Качество,
		|	ПеремещениеТоваровТовары.НовыйСчетУчетаНУ,
		|	ПеремещениеТоваровТовары.НовыйПринятыеСчетУчетаНУ,
		|	ПеремещениеТоваровТовары.ПринятыеСчетУчетаНУ,
		|	ПеремещениеТоваровТовары.ВнутреннийЗаказ,
		|	ПеремещениеТоваровТовары.ПринадлежностьНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТчТовары
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""OUT"" КАК УдаляемоеПоле,
		|	""H"" КАК Поле1,
		|	""IN"" КАК Поле2,
		|	""MOLCOM"" КАК Поле3,
		|	ВЫБОР
		|		КОГДА ВТ_Шапка.Организация.Префикс = ""LTT""
		|			ТОГДА ""LTN""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Шапка.Организация.Префикс = ""LVN""
		|					ТОГДА ""LVT""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_Шапка.Организация.Префикс = ""LFE""
		|							ТОГДА ""LFE""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле4,
		|	1 КАК Поле5,
		|	ВТ_Шапка.Номер КАК Поле6,
		|	ВТ_Шапка.Номер КАК Поле7,
		|	ВТ_Шапка.абс_СрокДоставки КАК Поле8,
		|	"""" КАК Поле9,
		|	"""" КАК Поле10,
		|	"""" КАК Поле11,
		|	ВТ_Шапка.СкладПолучатель.абс_Контрагент.Код КАК Поле12,
		|	1 КАК Поле13
		|ИЗ
		|	ВТ_Шапка КАК ВТ_Шапка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""OUT"",
		|	""I"",
		|	ВТ_ТчТовары.Ссылка.Номер,
		|	ВТ_ТчТовары.НомерСтроки,
		|	ВТ_ТчТовары.Номенклатура.Артикул,
		|	ВТ_ТчТовары.Количество,
		|	ВТ_ТчТовары.ЕдиницаИзмерения.Наименование,
		|	ЕСТЬNULL(ВТ_ТчТовары.СерияНоменклатуры.Наименование, """"),
		|	ВТ_ТчТовары.Цена,
		|	"""",
		|	"""",
		|	""Не заполняется"",
		|	""Не заполняется"",
		|	ВЫБОР
		|		КОГДА ВТ_ТчТовары.Ссылка.СкладПолучатель = &QLFQUARANTINE2
		|				ИЛИ ВТ_ТчТовары.Ссылка.СкладПолучатель = &QLFQUARANTINE1
		|			ТОГДА ""QLFQUARANTINE1""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_ТчТовары.Ссылка.СкладПолучатель = &QLFDEFECT1
		|						ИЛИ ВТ_ТчТовары.Ссылка.СкладПолучатель = &QLFDEFECT2
		|					ТОГДА ""QLFDEFECT""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_ТчТовары.Ссылка.СкладПолучатель = &QLFNORMAL
		|							ТОГДА ""QLFNORMAL""
		|						ИНАЧЕ ""QLFNORMAL""
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	ВТ_ТчТовары КАК ВТ_ТчТовары";

	Запрос.УстановитьПараметр("СсылкаПеремещение", Перемещение);
	//Запрос.УстановитьПараметр("QLFNORMAL",Объект.ПараметрыПоУмолчанию.QLFNORMAL);
	Запрос.УстановитьПараметр("QLFNORMAL",Перемещение.СкладПолучатель);
    Запрос.УстановитьПараметр("QLFDEFECT1",Объект.ПараметрыПоУмолчанию.QLFDEFECT1);
    Запрос.УстановитьПараметр("QLFDEFECT2",Объект.ПараметрыПоУмолчанию.QLFDEFECT2);
    Запрос.УстановитьПараметр("QLFQUARANTINE1",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1);
    Запрос.УстановитьПараметр("QLFQUARANTINE2",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2);
	//Запрос.УстановитьПараметр("ОрганизацияХранитель","ООО ""ЛЕОВИТ нутрио"" (Через ООО ""ЛО МОЛКОМ"")");

	
	Результат = Запрос.Выполнить();
	ТабЗначений = Результат.Выгрузить();
		
	Возврат ТабЗначений;	
	
КонецФункции

//&НаСервере
//Процедура ВыгрузитьСписокПеремещенийЛЛ_Сервер(ВидОперации)
//	
//	Если ВидОперации = "ОтгрузкаНаСкладЛЛ" Тогда
//		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
//	ИначеЕсли ВидОперации = "ВозвратСоСкладаЛЛ" Тогда
//		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиВозвратыСоСклада;
//	Иначе
//		Возврат;
//	КонецЕсли;
//	
//	ИмяФайла = СформироватьИмяФайла("LP",Каталог,Объект.ДатаОтгрузки);
//	
//	ВыбФайл = Новый Файл(ИмяФайла);
//	
//	Если ВыбФайл.Существует() Тогда
//		УдалитьФайлы(ВыбФайл)
//	КонецЕсли;
//	
//	Табдок = СформироватьТабДокВозвратаСоСкладаЛЛ_Сервер(ВидОперации);
//	
//	ФайлЗаписан = Ложь;
//	Попытка
//		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
//		ФайлЗаписан = Истина;
//	Исключение 
//		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
//	КонецПопытки;			
//	
//	Если ФайлЗаписан Тогда
//		Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
//			Если СтрокаТЗ.Выгружать Тогда
//				Попытка
//					ПеремещениеОбъект = СтрокаТЗ.Перемещение.ПолучитьОбъект();
//					ПеремещениеОбъект.абс_Выгружен = Истина;
//					ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
//				Исключение
//					Сообщить(ОписаниеОшибки());
//				КонецПопытки;
//			Конецесли;
//		КонецЦикла;
//	КонецЕсли;

//КонецПроцедуры

&НаСервере
Функция СформироватьТабДокВозвратаСоСкладаЛЛ_Сервер(Перемещение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.ВерсияДанных,
		|	ПеремещениеТоваров.ПометкаУдаления,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.Проведен,
		|	ПеремещениеТоваров.ВидОперации,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваров.ОтражатьВУправленческомУчете,
		|	ПеремещениеТоваров.ОтражатьВБухгалтерскомУчете,
		|	ПеремещениеТоваров.ОтражатьВНалоговомУчете,
		|	ПеремещениеТоваров.Подразделение,
		|	ПеремещениеТоваров.Комментарий,
		|	ПеремещениеТоваров.СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель,
		|	ПеремещениеТоваров.Ответственный,
		|	ПеремещениеТоваров.ВнутреннийЗаказ,
		|	ПеремещениеТоваров.НДСвСтоимостиТоваров,
		|	ПеремещениеТоваров.СчетСписанияНДС,
		|	ПеремещениеТоваров.СубконтоСписанияНДС1,
		|	ПеремещениеТоваров.СубконтоСписанияНДС2,
		|	ПеремещениеТоваров.СубконтоСписанияНДС3,
		|	ПеремещениеТоваров.СчетСписанияНДСНУ,
		|	ПеремещениеТоваров.СубконтоСписанияНДСНУ1,
		|	ПеремещениеТоваров.СубконтоСписанияНДСНУ2,
		|	ПеремещениеТоваров.СубконтоСписанияНДСНУ3,
		|	ПеремещениеТоваров.НоменклатурнаяГруппа,
		|	ПеремещениеТоваров.СтатьяЗатратСписанияНДС,
		|	ПеремещениеТоваров.ПодразделениеОрганизации,
		|	ПеремещениеТоваров.СуммаДокументаРозничная,
		|	ПеремещениеТоваров.РаспределениеОстатковТоваровОрганизацийПоСкладам,
		|	ПеремещениеТоваров.абс_НомерЛЛ,
		|	ПеремещениеТоваров.ТипЦен,
		|	ПеремещениеТоваров.ВалютаДокумента,
		|	ПеремещениеТоваров.абс_ХозяйственнаяОперация,
		|	ПеремещениеТоваров.абс_Выгружен,
		|	ПеремещениеТоваров.абс_Статус,
		|	ПеремещениеТоваров.абс_Водитель,
		|	ПеремещениеТоваров.абс_ТранспортноеСредство,
		|	ПеремещениеТоваров.абс_СрокДоставки,
		|	ПеремещениеТоваров.абс_ПунктПогрузки,
		|	ПеремещениеТоваров.абс_ПунктРазгрузки,
		|	ПеремещениеТоваров.абс_Заказчик,
		|	ПеремещениеТоваров.абс_Перевозчик,
		|	ПеремещениеТоваров.абс_НомерПломбы,
		|	ПеремещениеТоваров.абс_КоличествоПалет,
		|	ПеремещениеТоваров.абс_ЛицензионнаяКарточка,
		|	ПеремещениеТоваров.абс_ВидПеревозки,
		|	ПеремещениеТоваров.абс_ДокументОснование
		|ПОМЕСТИТЬ ВТ_Шапка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.НомерСтроки,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.КоличествоМест,
		|	ПеремещениеТоваровТовары.ЕдиницаИзмеренияМест,
		|	ПеремещениеТоваровТовары.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Коэффициент,
		|	ПеремещениеТоваровТовары.Количество,
		|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры,
		|	ПеремещениеТоваровТовары.СерияНоменклатуры,
		|	ПеремещениеТоваровТовары.ДокументРезерва,
		|	ПеремещениеТоваровТовары.Цена,
		|	ПеремещениеТоваровТовары.ПринятыеСчетУчетаБУ,
		|	ПеремещениеТоваровТовары.СчетУчетаБУ,
		|	ПеремещениеТоваровТовары.СчетУчетаНУ,
		|	ПеремещениеТоваровТовары.НовыйПринятыеСчетУчетаБУ,
		|	ПеремещениеТоваровТовары.НовыйСчетУчетаБУ,
		|	ПеремещениеТоваровТовары.Качество,
		|	ПеремещениеТоваровТовары.НовыйСчетУчетаНУ,
		|	ПеремещениеТоваровТовары.НовыйПринятыеСчетУчетаНУ,
		|	ПеремещениеТоваровТовары.ПринятыеСчетУчетаНУ,
		|	ПеремещениеТоваровТовары.ВнутреннийЗаказ,
		|	ПеремещениеТоваровТовары.ПринадлежностьНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТчТовары
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &СсылкаПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""OUT"" КАК УдаляемоеПоле,
		|	""H"" КАК Поле1,
		|	""OUT"" КАК Поле2,
		|	""MOLCOM"" КАК Поле3,
		|	ВЫБОР
		|		КОГДА ВТ_Шапка.Организация.Префикс = ""LTT""
		|			ТОГДА ""LTN""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Шапка.Организация.Префикс = ""LVN""
		|					ТОГДА ""LVT""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_Шапка.Организация.Префикс = ""LFE""
		|							ТОГДА ""LFE""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле4,
		|	ВТ_Шапка.Номер КАК Поле5,
		|	ВТ_Шапка.Номер КАК Поле6,
		|	ВТ_Шапка.Дата КАК Поле7,
		|	ВТ_Шапка.абс_СрокДоставки КАК Поле8,
		|	ВЫБОР
		|		КОГДА ВТ_Шапка.Организация.Префикс = ""LTT""
		|			ТОГДА ""К00001098""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_Шапка.Организация.Префикс = ""LVN""
		|					ТОГДА ""К00000011""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_Шапка.Организация.Префикс = ""LFE""
		|							ТОГДА ""К00000893""
		|						ИНАЧЕ """"
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Поле9,
		|	1 КАК Поле10,
		|	0 КАК Поле11,
		|	"""" КАК Поле12,
		|	"""" КАК Поле13,
		|	"""" КАК Поле14,
		|	"""" КАК Поле15,
		|	"""" КАК Поле16,
		|	"""" КАК Поле17,
		|	"""" КАК Поле18,
		|	"""" КАК Поле19,
		|	"""" КАК Поле20,
		|	ВТ_Шапка.абс_СрокДоставки КАК Поле21,
		|	"""" КАК Поле22
		|ИЗ
		|	ВТ_Шапка КАК ВТ_Шапка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""OUT"",
		|	""I"",
		|	ВТ_ТчТовары.Ссылка.Номер,
		|	ВТ_ТчТовары.НомерСтроки,
		|	ВТ_ТчТовары.Номенклатура.Артикул,
		|	ВТ_ТчТовары.Количество,
		|	ВТ_ТчТовары.ЕдиницаИзмерения.Наименование,
		|	ВЫБОР
		|		КОГДА ВТ_ТчТовары.СерияНоменклатуры = &ПустаяСерияНоменклатуры
		|			ТОГДА """"
		|		ИНАЧЕ ВТ_ТчТовары.СерияНоменклатуры.Наименование
		|	КОНЕЦ,
		|	ВТ_ТчТовары.Цена,
		|	"""",
		|	"""",
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВЫБОР
		|		КОГДА ВТ_ТчТовары.Ссылка.СкладОтправитель = &QLFQUARANTINE2
		|				ИЛИ ВТ_ТчТовары.Ссылка.СкладОтправитель = &QLFQUARANTINE1
		|			ТОГДА ""QLFQUARANTINE1""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ_ТчТовары.Ссылка.СкладОтправитель = &QLFDEFECT1
		|						ИЛИ ВТ_ТчТовары.Ссылка.СкладОтправитель = &QLFDEFECT2
		|					ТОГДА ""QLFDEFECT""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ_ТчТовары.Ссылка.СкладОтправитель = &QLFNORMAL
		|							ТОГДА ""QLFNORMAL""
		|						ИНАЧЕ ""QLFNORMAL""
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	""""
		|ИЗ
		|	ВТ_ТчТовары КАК ВТ_ТчТовары";

	Запрос.УстановитьПараметр("СсылкаПеремещение", Перемещение);
	Запрос.УстановитьПараметр("ПустаяСерияНоменклатуры", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("QLFNORMAL",Объект.ПараметрыПоУмолчанию.QLFNORMAL);
    Запрос.УстановитьПараметр("QLFDEFECT1",Объект.ПараметрыПоУмолчанию.QLFDEFECT1);
    Запрос.УстановитьПараметр("QLFDEFECT2",Объект.ПараметрыПоУмолчанию.QLFDEFECT2);
    Запрос.УстановитьПараметр("QLFQUARANTINE1",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1);
    Запрос.УстановитьПараметр("QLFQUARANTINE2",Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2);

	
	Результат = Запрос.Выполнить();
	ТабЗначений = Результат.Выгрузить();
	
	
	//+Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
	//Удалить код после окончательной ратации номенклатуры
	Для каждого СтрокаНакладные из ТабЗначений Цикл
		Если  СтрокаНакладные.Поле1 = "I" Тогда 
			АртикулСтрокой = СтрЗаменить(СтрокаНакладные.Поле4,"_18%","");
			СтрокаНакладные.Поле4 = АртикулСтрокой;
		КонецЕсли;
	КонецЦикла;
	//-Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
		
	Возврат ТабЗначений;
	
КонецФункции

//&НаСервере
//Процедура ВыгрузитьПеремещенияНаСкладЛЛ_Сервер()
//		
//	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВыгрузкиПриходНаСклад;
//	
//	ИмяФайла = СформироватьИмяФайла("Nakl",Каталог,Объект.ДатаОтгрузки);
//	
//	ВыбФайл = Новый Файл(ИмяФайла);
//	
//	Если ВыбФайл.Существует() Тогда
//		УдалитьФайлы(ВыбФайл)
//	КонецЕсли;
//	
//	Табдок = СформироватьТабДокПеремещенияНаСкладМолком_Сервер();
//	
//	ФайлЗаписан = Ложь;
//	Попытка
//		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
//		ФайлЗаписан = Истина;
//	Исключение 
//		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
//	КонецПопытки;
//	
//	Если ФайлЗаписан Тогда
//		Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
//			Если СтрокаТЗ.Выгружать Тогда
//				Попытка
//					ПеремещениеОбъект = СтрокаТЗ.Перемещение.ПолучитьОбъект();
//					ПеремещениеОбъект.абс_Выгружен = Истина;
//					ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
//				Исключение
//					Сообщить(ОписаниеОшибки());
//				КонецПопытки;
//			Конецесли;
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура СформироватьСписокПеремещенийЛЛ_Сервер(СкладОтправитель, СкладПолучатель)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НЕ ПеремещениеТоваров.Ссылка.абс_Выгружен КАК Выгружать,
	|	ПеремещениеТоваров.Ссылка КАК Перемещение,
	|	ПеремещениеТоваров.СкладОтправитель,
	|	ПеремещениеТоваров.СкладПолучатель,
	|	ПеремещениеТоваров.абс_СрокДоставки КАК СрокДоставки
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПеремещениеТоваров.СкладОтправитель В(&СкладОтправитель)
	|	И ПеремещениеТоваров.Проведен
	|	И ПеремещениеТоваров.СкладПолучатель В(&СкладПолучатель)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваров.МоментВремени");
	
	Запрос.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(Объект.НачПериода), Объект.НачПериода, '00010101'));
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(Объект.КонПериода), КонецДня(Объект.КонПериода), '39990101'));
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	
	Результат = Запрос.Выполнить();
	
	Объект.СписокПеремещений.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокПоступленийТУ_Сервер(СкладОтправитель, СкладПолучатель)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслуг.Ссылка КАК ПоступлениеТУ,
	|	ЛОЖЬ КАК Выгружать,
	|	ПоступлениеТоваровУслуг.Контрагент КАК СкладОтправитель,
	|	ПоступлениеТоваровУслуг.СкладОрдер КАК СкладПолучатель
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПоступлениеТоваровУслуг.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеТоваровУслуг.МоментВремени");
	
	Запрос.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(Объект.НачПериода), Объект.НачПериода, '00010101'));
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(Объект.КонПериода), КонецДня(Объект.КонПериода), '39990101'));
	//Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	//Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	
	Результат = Запрос.Выполнить();
	
	Объект.СписокПоступлениеТУ.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПеремещенияУстановитьСнятьФлажки(Флаг)
	
	НайденныеСтроки = Объект.СписокПеремещений.НайтиСтроки(Новый Структура("Выгружать", Не Флаг));
	
	Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		НайденнаяСтрока.Выгружать = Флаг;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроставитьПризнакВыгруженПеремещенийЛЛ()
	
	Для каждого СтрокаТЗ из Объект.СписокПеремещений Цикл
		Если СтрокаТЗ.Выгружать Тогда
			Попытка
				ПеремещениеОбъект = СтрокаТЗ.Перемещение.ПолучитьОбъект();
			    ПеремещениеОбъект.абс_Выгружен = Истина;
				ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		Конецесли;
	КонецЦикла;
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАКЛАДКИ ИМПОРТ ОТ ЛЛ
////////////////////////////////////////////////////////////////////////////////

// Обработчики команд формы

&НаКлиенте
Процедура ИмпортПоступленияНаСкладЛоджикЛайн(Команда)
		
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуПриходНаСклад;
	МаскаФайла = "*inputact*csv";	
	//+FTP	
	ПрочитатьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,);
	//-FTP

	МаскаФайла	  = "*csv";
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
	КонецЦикла;
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортПоступленияНаСкладЛоджикЛайнНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	Иначе
		Сообщить("Нет файла для загрузки.");
		Возврат;
	КонецЕсли;
	
	Каталог = Каталог + "\Arhiv\";
	
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортВозвратТовараСоСкладаЛоджиклайн(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуВозвратТовара;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
	КонецЦикла;
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортВозвратТовараСоСкладаЛоджиклайнНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	Иначе
		Сообщить("Нет файла для загрузки.");
		Возврат;
	КонецЕсли;
	
	Каталог = Каталог + "\Arhiv\";
	
	Для каждого ФайлМассива из МассивФайлов Цикл
		ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортОтгрузок(Команда) 
	
	//на всякий случай сначала обработает акты сборок
	ИмпортАктыСборки(Команда);
	
	Попытка 
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
		МаскаФайла = "*outputact_*csv";	
		//+FTP	
		ПрочитатьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,);
		//-FTP
		Сообщить("Прошло соединение с FTP");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;

	
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
	МаскаФайла = "*outputact_*csv";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	
	Попытка
		Для каждого ФайлМассива из МассивФайлов Цикл
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
		КонецЦикла;
		Сообщить("Файлы добавлены в массив");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;

	Попытка	
		Если ПомещаемыеФайлы.Количество()>0 Тогда
			Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь,УникальныйИдентификатор) Тогда
				Сообщить("Файлы помещены во временное хранилище");
				ЗагрузитьОтгрузкиЛоджикЛайн(ПомещенныеФайлы);
			КонецЕсли;
		Иначе
			Сообщить("Нет файла для загрузки.");
			Возврат;
		КонецЕсли;
	    Сообщить("Файлы получены и обработаны");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
	
	Попытка
		Каталог = Каталог + "\Arhiv\";
		Для каждого ФайлМассива из МассивФайлов Цикл
			ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
		КонецЦикла;
		Сообщить("Файлы перенесены в архив");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ИмпортОстатков(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуОстатки;
	МаскаФайла = "*ACTUALSTOCK*csv";	
	//+FTP	
	ПрочитатьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,);
	//-FTP


	
	//Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуОстатки;
	//МаскаФайла = "*csv";	
	//МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	//
	//Сообщение = Новый СообщениеПользователю;
	//
	//ПомещаемыеФайлы = Новый Массив;
	//ПомещенныеФайлы	= Новый Массив;

	//ФайлОстатков = Неопределено;
	//Для Каждого Файл Из МассивФайлов Цикл
	//	Если НЕ Файл.ПолучитьНевидимость() Тогда
	//		ФайлОстатков = Файл;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если ФайлОстатков = Неопределено Тогда
	//	Сообщение.Текст = "Не найден файл для загрузки!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлОстатков.ПолноеИмя));		
	//
	//Если ПомещаемыеФайлы.Количество()>0 Тогда
	//	Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
	//		ИмпортОстатковНаСервере(ПомещенныеФайлы);
	//	КонецЕсли;
	//КонецЕсли;
	//
	////переместим файл загрузки в архив
	//Если Прав(Каталог, 1) <> "\" ТОгда
	//	Каталог = Каталог + "\";
	//КонецЕсли;
	//Каталог = Каталог + "Arhiv\";
	//Попытка
	//	ПереместитьФайл(ФайлОстатков.ПолноеИмя,Каталог + ФайлОстатков.Имя);
	//Исключение
	//	Сообщение.Текст = "Не удалось переместить файл загрузки в архив, сделайте это вручную!";
	//	Сообщение.Сообщить();
	//КонецПопытки;
	
КонецПроцедуры

// Процедуры и функции обмена данными

&НаСервере
Процедура ИмпортПоступленияНаСкладЛоджикЛайнНаСервере(МассивФайлов)
	
	ТекстЛога = ЛогированиеФайлЛога();
	
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("csv");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
        мСообщениеПользователю("" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС, ТекстЛога);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		ИмяФайла =СтрЗаменить(ПутьКФайлу, КаталогВременныхФайлов(),""); 
		Каталог = КаталогВременныхФайлов();
        		
		ТабЗнач = ПрочитатьCSV(Каталог,ИмяФайла, 12);
		
		Если ТабЗнач = Неопределено Тогда
			мСообщениеПользователю("Загрузка данных не произведена!", ТекстЛога);
			Возврат;
		КонецЕсли;
		
		ИмпортНакладных = Объект.ТчИмпортНакладныхПриходаТовараНаСкладМолком;
		ИмпортНакладных.Очистить();
		
		Для каждого Строка из  ТабЗнач Цикл	
			//СтрокаШапкиДокумента
			Если Строка.К_1 = "H" Тогда
				СтрокаИмпортаНакладных = ИмпортНакладных.Добавить();
				СтрокаИмпортаНакладных.ТипСтроки 		= Строка.К_1;
				СтрокаИмпортаНакладных.АктПриемки 		= Строка.К_3;
				СтрокаИмпортаНакладных.ДатаПриемки 		= Дата(Строка.К_4 +  " 00:00:00");
				ДатаПриемки = Дата(Строка.К_4 +  " 00:00:00");
				ДатаПриемки = ДатаПриемки  + 32400;
				СтрокаИмпортаНакладных.НомерЗаказа 		= Строка.К_5;
				СтрокаИмпортаНакладных.НомерНакладной 	= Строка.К_6;
				СтрокаИмпортаНакладных.Отправитель 		= Строка.К_7;
				СтрокаИмпортаНакладных.Перевозчик	 	= Строка.К_8;
			ИначеЕсли Строка.К_1 = "I" Тогда
				
				СтрокаИмпортаНакладных = ИмпортНакладных.Добавить();
				СтрокаИмпортаНакладных.ТипСтроки 		= Строка.К_1;
				СтрокаИмпортаНакладных.НомерЗаказа 		= Строка.К_2;
				
				Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",(СокрЛП(Строка.К_4)));
				Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
					СтрокаИмпортаНакладных.Номенклатура = Номенклатура;
				Иначе	
					мСообщениеПользователю("" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + Строка.К_4 + "." + Символы.ПС, ТекстЛога);
					//Продолжить;
				КонецЕсли;
				
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
							
				СерияСтрока = СокрЛП(Строка.К_7);
				СерияСтрока = Лев(СерияСтрока,2) + "." + Сред(СерияСтрока,4,2) + "." + Сред(СерияСтрока,7,4);
				Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СерияСтрока, Истина, , Номенклатура);
				Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
					СтрокаИмпортаНакладных.Серия = Серия;
				Иначе	
					мСообщениеПользователю("" + ТекущаяДата() + " Не найдена серия """ + Строка.К_7 + """по Артикулу. Артикул в файле:" + Строка.К_3 + "." + Символы.ПС, ТекстЛога);
					//Продолжить;
				КонецЕсли;

				СтрокаИмпортаНакладных.КоличествоПоНакладной	= Строка.К_6;
				СтрокаИмпортаНакладных.КоличествоПоАктуПриемки	= Строка.К_8;
				СтрокаИмпортаНакладных.ИзНихБрак				= Строка.К_9;
				Квалификация = СокрЛП(Строка.К_12);

			КонецЕсли;				
		КонецЦикла;
		
		ОтборПоШапке = Новый Структура;
		ОтборПоШапке.Вставить("ТипСтроки","H");
		
		ТЗ_ДокПоступления = ИмпортНакладных.Выгрузить(ОтборПоШапке,"КоличествоПоНакладной,НомерЗаказа,НомерНакладной,ДатаПриемки");
		ТЗ_ДокПоступления.Свернуть("НомерЗаказа,НомерНакладной,ДатаПриемки","КоличествоПоНакладной");
		
		Если ТЗ_ДокПоступления.Количество() > 0 Тогда
			
			Для каждого ДокПоступления из ТЗ_ДокПоступления Цикл
				
				ОтборПоДокПоступления 	= Новый Структура;
				ОтборПоДокПоступления.Вставить("ТипСтроки", "I");
				ОтборПоДокПоступления.Вставить("НомерЗаказа", ДокПоступления.НомерЗаказа);
				
				СтрокиПоДокПоступления = ИмпортНакладных.Выгрузить(ОтборПоДокПоступления, "Номенклатура,ЕдиницаИзмерения,КоличествоПоНакладной,КоличествоПоАктуПриемки,Серия");
				СтрокиПоДокПоступления.Свернуть("Номенклатура,ЕдиницаИзмерения,Серия","КоличествоПоНакладной,КоличествоПоАктуПриемки");
				
				СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				ДокументПриходЛоджикЛайн = ПолучитьДокументПеремещенияТоваров(ДокПоступления.НомерЗаказа, ДокПоступления.ДатаПриемки, СкладОтправитель, СкладПолучатель, Организация);
				
				Если ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
					
					ДокументПриходЛоджикЛайн = НайтиДокументПеремещения(ДокПоступления.НомерЗаказа, ДокПоступления.ДатаПриемки, Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора); 
					
					Если ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
						
						мСообщениеПользователю("Не найден документ Перемещение № " + ДокПоступления.НомерНакладной + " от " + ДокПоступления.ДатаПриемки, ТекстЛога);
						
						Если Объект.ФормироватьНовыеДокументы Тогда
							ДокументПриходЛоджикЛайн = Документы.ПеремещениеТоваров.СоздатьДокумент();
						Иначе
							Продолжить;
						КонецЕсли;
					Иначе
						ДокументПриходЛоджикЛайн = ДокументПриходЛоджикЛайн.ПолучитьОбъект();							
					КонецЕсли;
				Иначе	
					ДокументПриходЛоджикЛайн = ДокументПриходЛоджикЛайн.ПолучитьОбъект();
				КонецЕсли;
				
				//ДокументПриходЛоджикЛайн.Номер = ДокВозврата.NumDoc;
				//Если НЕ ЗначениеЗаполнено(ДокументПриходЛоджикЛайн.абс_НомерЛЛ) тогда
					ДокументПриходЛоджикЛайн.абс_НомерЛЛ = ДокПоступления.НомерЗаказа;
				//КонецЕсли;
				
				//По Письму Папашенко АА 
				//Дата должна быть датой приемки Моском
				//ДокументПриходЛоджикЛайн.Дата 				= КонецДня(ДокПоступления.ДатаПриемки);
				ДокументПриходЛоджикЛайн.Дата 	= ДатаПриемки;
                //-Сафонов ЕА
				ДокументПриходЛоджикЛайн.Организация		= Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				ДокументПриходЛоджикЛайн.ВидОперации 		= Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
				ДокументПриходЛоджикЛайн.ОтражатьВУправленческомУчете = Истина;				
				ДокументПриходЛоджикЛайн.СкладОтправитель 	= Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				
				//+Сафонов ЕА
				//ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				Если Квалификация = "QLFNORMAL" И Не Объект.ПараметрыПоУмолчанию.QLFNORMAL = Справочники.Склады.ПустаяСсылка() Тогда
					ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.QLFNORMAL;
				ИначеЕсли Квалификация = "QLFDEFECT" И Не Объект.ПараметрыПоУмолчанию.QLFDEFECT1 = Справочники.Склады.ПустаяСсылка() Тогда
					ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.QLFDEFECT1;
				ИначеЕсли Квалификация = "QLFQUARANTINE1" И Не Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1 = Справочники.Склады.ПустаяСсылка() Тогда
					ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.QLFQUARANTINE1;
				ИначеЕсли Квалификация = "QLFQUARANTINE2" И Не Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2 = Справочники.Склады.ПустаяСсылка() Тогда
                    ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.QLFQUARANTINE2;
				Иначе
					ДокументПриходЛоджикЛайн.СкладПолучатель 	= Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;	
				КонецЕсли;
				//-Сафонов ЕА

				ДокументПриходЛоджикЛайн.Товары.Очистить();
				
				Для Каждого СтрокаНоменклатура Из СтрокиПоДокПоступления Цикл
					СтрокаТабЧасти 						= ДокументПриходЛоджикЛайн.Товары.Добавить();
					СтрокаТабЧасти.Номенклатура 		= СтрокаНоменклатура.Номенклатура;
					СтрокаТабЧасти.Количество 			= СтрокаНоменклатура.КоличествоПоАктуПриемки;
					СтрокаТабЧасти.ЕдиницаИзмерения 	= СтрокаНоменклатура.ЕдиницаИзмерения;
					СтрокаТабЧасти.СерияНоменклатуры	= СтрокаНоменклатура.Серия;
					СтрокаТабЧасти.Коэффициент			= СтрокаНоменклатура.ЕдиницаИзмерения.Коэффициент;
					СтрокаТабЧасти.ЕдиницаИзмеренияМест	= СтрокаНоменклатура.Номенклатура.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабЧасти, ДокументПриходЛоджикЛайн);
				КонецЦикла;
				
				//проверим на расхождения
				флРасхождения = Ложь;
				
				СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				ДокументОтгрузкиНаЛЛ = ПолучитьДокументПеремещенияТоваровДатаВпределахМесяца(ДокПоступления.НомерЗаказа, ДокПоступления.ДатаПриемки, СкладОтправитель, СкладПолучатель, Организация);
				
				Если НЕ ДокументОтгрузкиНаЛЛ = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
					ДокументПриходЛоджикЛайн.Комментарий  = ДокументОтгрузкиНаЛЛ.Номер;
					//ДокументПриходЛоджикЛайн.Дата  = ДокументОтгрузкиНаЛЛ.Дата + 60;
				КонецЕсли;
				
				тзОтгружено = ДокументОтгрузкиНаЛЛ.Товары.Выгрузить(); 
				тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
				СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
				
				Если ДокументОтгрузкиНаЛЛ.Товары.Количество()<>ДокументПриходЛоджикЛайн.Товары.Количество() Тогда
					флРасхождения = Истина;
				КонецЕсли;
				
				Для Каждого СтрокаТовары Из ДокументОтгрузкиНаЛЛ.Товары Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
					мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
					Если мСтроки.Количество() = 0 Тогда
						флРасхождения = Истина;
					ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
						флРасхождения = Истина;
					КонецЕсли;						
					Если флРасхождения Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если флРасхождения Тогда
					
					мСообщениеПользователю("" + ТекущаяДата() + " По документу " + ДокументПриходЛоджикЛайн + " зафиксированы расхождения!", ТекстЛога);
					
				КонецЕсли;
				
				Попытка
					
					ДокументПриходЛоджикЛайн.Записать(РежимЗаписиДокумента.Запись);
					
					//ДокументПриходЛоджикЛайн.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					
					мСообщениеПользователю("" + ТекущаяДата() + "Записан документ " + ДокументПриходЛоджикЛайн, ТекстЛога);
					
					СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					СтрокаТаб.СсылкаДокумент  = ДокументПриходЛоджикЛайн.Ссылка;
					СтрокаТаб.Расхождение = флРасхождения;
					
				Исключение
					
					мСообщениеПользователю("" + ТекущаяДата() + "Ошибка записи документа Перемещения: " + ОписаниеОшибки(), ТекстЛога);
					
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ИмпортВозвратТовараСоСкладаЛоджиклайнНаСервере(МассивФайлов)
	
	ТекстЛога = ЛогированиеФайлЛога();
	
	//+Обход массива файлов
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС ;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		КолвоСтрокExcel = 1;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
		ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Истина);	
		ИмпортНакладных = Объект.ИмпортНакладныхПриходаТовараНаСкладЛоджикЛайн;
		ИмпортНакладных.Очистить();
		Для каждого Строка из  ТабЗнач Цикл				
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",(СокрЛП(Строка.KodTMC)));
			Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных = ИмпортНакладных.Добавить();
				СтрокаИмпортаНакладных.Номенклатура = Номенклатура;
			Иначе	
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				Продолжить
			КонецЕсли;
			
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СокрЛП(Строка.EdIzm), , , Номенклатура);
			Если Не ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = ЕдиницаИзмерения;
			Иначе	
				СтрокаИмпортаНакладных.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица """ + Строка.EdIzm + """по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				//Продолжить
			КонецЕсли;
			
			СерияСтрока = СокрЛП(Строка.KodPart);
			СерияСтрока = Лев(СерияСтрока,2) + "." + Сред(СерияСтрока,4,2) + "." + Сред(СерияСтрока,7,4);
			Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СерияСтрока, Истина, , Номенклатура);
			Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
				СтрокаИмпортаНакладных.Серия = Серия;
			Иначе	
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + Строка.KodPart + """по Артикулу. Артикул в файле:" + Строка.KodTMC + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				//Продолжить
			КонецЕсли;
			
			СтрокаИмпортаНакладных.DateDoc = ПолучитьДатуИзСтроки(Строка.DateDoc);
			СтрокаИмпортаНакладных.NumDoc = СокрЛП(Строка.NumDoc);
			СтрокаИмпортаНакладных.KodKontr = СокрЛП(Строка.KodKontr);
			СтрокаИмпортаНакладных.MarkirData = ПолучитьДатуИзСтроки(Строка.MarkirData);
			СтрокаИмпортаНакладных.KodPart = СокрЛП(Строка.KodPart);
			СтрокаИмпортаНакладных.KodTMC = СокрЛП(Строка.KodTMC);
			СтрокаИмпортаНакладных.NameTMC = СокрЛП(Строка.NameTMC);
			СтрокаИмпортаНакладных.EdIzm = СокрЛП(Строка.EdIzm);
			СтрокаИмпортаНакладных.Kol = Число(Строка.Kol);
			СтрокаИмпортаНакладных.Price = Число(Строка.Price);
			
		КонецЦикла;
		
		ТЗ_ДокВозврата = ИмпортНакладных.Выгрузить(,"Kol,DateDoc,NumDoc");
		ТЗ_ДокВозврата.Свернуть("DateDoc,NumDoc","Kol");
		
		Если ТЗ_ДокВозврата.Количество()>0 Тогда
			Для каждого ДокВозврата из ТЗ_ДокВозврата Цикл   
				ОтборПоДокВозврат = Новый Структура;
				ОтборПоДокВозврат.Вставить("NumDoc", ДокВозврата.NumDoc);
				СтрокиПоДокВозврат = ИмпортНакладных.Выгрузить(ОтборПоДокВозврат,"Номенклатура,Kol,ЕдиницаИзмерения,Серия");
				СтрокиПоДокВозврат.Свернуть("Номенклатура,ЕдиницаИзмерения,Серия","Kol");
				
				//ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.НайтиПоРеквизиту("абс_НомерЛЛ",ДокВозврата.NumDoc); 
				//ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.НайтиПоНомеру(ДокВозврата.NumDoc, ДокВозврата.DateDoc); 
				//СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				//СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				//Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				//ДокументВозвратаТовараСоСклада = ПолучитьДокументПеремещенияТоваров(ДокВозврата.NumDoc, ДокВозврата.DateDoc, СкладОтправитель, СкладПолучатель, Организация);
				//  
				//Если ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
				//	ДокументВозвратаТовараСоСклада = НайтиДокументПеремещения(ДокВозврата.NumDoc, ДокВозврата.DateDoc, Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции); 
				//	Если ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда						
				//		Сообщить("Не найден документ Перемещение № " + ДокВозврата.NumDoc + " от " + ДокВозврата.DateDoc);
				//		Если Объект.ФормироватьНовыеДокументы Тогда
				//			ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.СоздатьДокумент();
				//		Иначе
				//			Продолжить;
				//		КонецЕсли;
				//	Иначе
				//		ДокументВозвратаТовараСоСклада = ДокументВозвратаТовараСоСклада.ПолучитьОбъект();							
				//	КонецЕсли;
				//Иначе	
				//	ДокументВозвратаТовараСоСклада = ДокументВозвратаТовараСоСклада.ПолучитьОбъект();
				//КонецЕсли;
				
				Если Объект.ФормироватьНовыеДокументы Тогда
					ДокументВозвратаТовараСоСклада = Документы.ПеремещениеТоваров.СоздатьДокумент();
				Иначе
					Продолжить;
				КонецЕсли;
				
				//ДокументВозвратаТовараСоСклада.Номер = ДокВозврата.NumDoc;
				Если НЕ ЗначениеЗаполнено(ДокументВозвратаТовараСоСклада.абс_НомерЛЛ) тогда
					ДокументВозвратаТовараСоСклада.абс_НомерЛЛ = ДокВозврата.NumDoc;
				КонецЕсли;
				//+Леовит Сафонов ЕА 22.07.2014
				//Просьба склада изменить дату на 8.00 
				ДокументВозвратаТовараСоСклада.Дата = КонецДня(ДокВозврата.DateDoc) - 57599;
				//-Леовит Сафонов ЕА 22.07.2014
				ДокументВозвратаТовараСоСклада.Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				
				ДокументВозвратаТовараСоСклада.СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладЛогоператора;
				ДокументВозвратаТовараСоСклада.СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				ДокументВозвратаТовараСоСклада.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;
				ДокументВозвратаТовараСоСклада.ОтражатьВУправленческомУчете = Истина;
				ДокументВозвратаТовараСоСклада.Товары.Очистить();
				Для каждого СтрокаНоменклатура из СтрокиПоДокВозврат Цикл
					СтрокаТабЧасти = ДокументВозвратаТовараСоСклада.Товары.Добавить();
					СтрокаТабЧасти.Номенклатура 	= СтрокаНоменклатура.Номенклатура;
					СтрокаТабЧасти.Количество 		= СтрокаНоменклатура.Kol;
					СтрокаТабЧасти.ЕдиницаИзмерения = СтрокаНоменклатура.ЕдиницаИзмерения;
					СтрокаТабЧасти.СерияНоменклатуры= СтрокаНоменклатура.Серия;						
					СтрокаТабЧасти.Коэффициент		= СтрокаНоменклатура.ЕдиницаИзмерения.Коэффициент;
					СтрокаТабЧасти.ЕдиницаИзмеренияМест	= СтрокаНоменклатура.Номенклатура.ЕдиницаИзмеренияМест;
					ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабЧасти, ДокументВозвратаТовараСоСклада);
				КонецЦикла;	
				
				////проверим на расхождения
				флРасхождения = ЛОЖЬ;
				//
				//СкладОтправитель = Объект.ПараметрыПоУмолчанию.ОсновнойТранзитныйСклад;
				//СкладПолучатель = Объект.ПараметрыПоУмолчанию.ОсновнойСкладГотовойПродукции;
				//Организация = Объект.ПараметрыПоУмолчанию.ОрганизацияЛеовит;
				//ДокументПолученияТовараСоСклада = ПолучитьДокументПеремещенияТоваров(ДокВозврата.NumDoc, ДокВозврата.DateDoc, СкладОтправитель, СкладПолучатель, Организация);
				//
				//тзОтгружено = ДокументПолученияТовараСоСклада.Товары.Выгрузить();
				//Если ДокументПолученияТовараСоСклада.Товары.Количество()<>ДокументВозвратаТовараСоСклада.Товары.Количество() Тогда
				//	флРасхождения = Истина;
				//КонецЕсли;
				//
				//тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
				//СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
				//Для Каждого СтрокаТовары Из ДокументВозвратаТовараСоСклада.Товары Цикл
				//	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
				//	мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
				//	Если мСтроки.Количество() = 0 Тогда
				//		флРасхождения = Истина;
				//	ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
				//		флРасхождения = Истина;
				//	КонецЕсли;						
				//	Если флРасхождения Тогда
				//		Прервать;
				//	КонецЕсли;
				//КонецЦикла;
				//Если флРасхождения Тогда
				//	ТекстСтроки = "" + ТекущаяДата() + " По документу " + ДокументВозвратаТовараСоСклада + " зафиксированы расхождения!";
				//	ТекстЛога.Записать(ТекстСтроки);
				//	Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				//КонецЕсли;
				
				Попытка
					ДокументВозвратаТовараСоСклада.Записать(РежимЗаписиДокумента.Запись);
					ТекстСтроки = "" + ТекущаяДата() + "Записан документ " + ДокументВозвратаТовараСоСклада;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					СтрокаТаб.СсылкаДокумент  = ДокументВозвратаТовараСоСклада.Ссылка;
					СтрокаТаб.Расхождение = флРасхождения;
				Исключение
					ТекстСтроки = "" + ТекущаяДата() + "Ошибка записи документа Перемещение" + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументПеремещенияТоваров(НомерЛЛ, ДатаЛЛ , СкладОтправитель, СкладПолучатель, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	|	И ПеремещениеТоваров.абс_НомерЛЛ = &НомерЛЛ
	|	И ПеремещениеТоваров.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ДатаЛЛ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, ДЕНЬ) = &ДатаЛЛ
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("НомерЛЛ", НомерЛЛ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаЛЛ", НачалоДня(ДатаЛЛ));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДокументПеремещенияТоваровДатаВпределахМесяца(НомерЛЛ, ДатаЛЛ , СкладОтправитель, СкладПолучатель, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	|	И ПеремещениеТоваров.Номер = &НомерЛЛ
	|	И ПеремещениеТоваров.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ДатаЛЛ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПеремещениеТоваров.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаЛЛ, МЕСЯЦ, -1) И ДОБАВИТЬКДАТЕ(&ДатаЛЛ, МЕСЯЦ, 1)
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("НомерЛЛ", НомерЛЛ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаЛЛ", НачалоДня(ДатаЛЛ));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ЗагрузитьОтгрузкиЛоджикЛайн(МассивФайлов) Экспорт
	Попытка
		ТекстЛога = ЛогированиеФайлЛога ();
		Сообщить("Начало логирования процесса");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
	
	Попытка
		//+Обход массива файлов
		Для каждого ФайлЗаказа Из МассивФайлов Цикл
			ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщить(ТекстСтроки,СтатусСообщения.Важное);
			
			ФайлEXCEL = ФайлЗаказа.Имя ;
			КолвоСтрокExcel = 1;
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
			ПутьКФайлу = ПолучитьИмяВременногоФайла("csv");
			ДвоичныеДанные.Записать(ПутьКФайлу);
			
			
			ИмяФайла =СтрЗаменить(ПутьКФайлу, КаталогВременныхФайлов(),""); 
			Каталог = КаталогВременныхФайлов();

			ТабЗнач = ПрочитатьCSV(Каталог,ИмяФайла, 13);
			
					//Строка "H"
					//Строка.К_1	Тип строки
					//Строка.К_2	Тип документа
					//Строка.К_3	№ акта выдачи
					//Строка.К_4	Номер маршрута
					//Строка.К_5	Дата выдачи
					//Строка.К_6	№ консолидированного заказа
					//Строка.К_7	Дата заявки на выдачу
					//Строка.К_8	Получатель
					//Строка.К_9	Адрес доставки
					//Строка.К_10	Признак упаковки
					//Строка.К_11	№ а/м
					//Строка.К_12	Перевозчик
					//Строка.К_13	не используется

					//Строка "I"
					//Строка.К_1	Тип строки
					//Строка.К_2	№ консолидированного заказа
					//Строка.К_3	Номер позиции
					//Строка.К_4	№ заявки на выдачу
					//Строка.К_5	Код товара
					//Строка.К_6	Наименование товара
					//Строка.К_7	Кол-во выданного товара
					//Строка.К_8	Партия
					//Строка.К_9	S/n ювелирного изд-я
					//Строка.К_10	Код IMEI
					//Строка.К_11	Номер грузового места
					//Строка.К_12	Агригатор коробки ЧЗ
					//Строка.К_13	QR код ЧЗ
					
			Для каждого Строка из  ТабЗнач Цикл	
				Если Строка.К_1 = "H" Тогда
					Строка.К_3	= СокрЛП(Строка.К_3); //№ акта выдачи
					Строка.К_5	= ПолучитьДатуИзСтроки(Строка.К_5); //Дата выдачи 		
					Строка.К_7	= ПолучитьДатуИзСтроки(Строка.К_7); //Дата заявки на выдачу
				ИначеЕсли Строка.К_1 = "I" Тогда
					Строка.К_2		= СокрЛП(Строка.К_2); //№ консолидированного заказа
					Строка.К_4		= СокрЛП(Строка.К_4); //№ заявки на выдачу
	                Строка.К_5		= СокрЛП(Строка.К_5); //Код товара
					Строка.К_7		= Число(Строка.К_7);  //Кол-во выданного товара
					Строка.К_8		= СокрЛП(Строка.К_8); //Партия
					Строка.К_12 	= СокрЛП(Строка.К_12);//Агрегаты коробок честного знака
					Строка.К_13 	= СокрЛП(Строка.К_13);//QR Коды честного знака
					Квалификация	= "";
	 			КонецЕсли;				
			КонецЦикла;

			
			ОтборПоШапке = Новый Структура;
			ОтборПоШапке.Вставить("К_1","H");
			
					
			ТабЗначДок = ТабЗнач.Скопировать(ОтборПоШапке,"К_3,К_5,К_7");
			ТабЗначДок.Свернуть("К_3,К_5,К_7");
			
			
			//+Сгруппированная таблица  ТабЗначДок. (список документов в файле)
			Для Каждого СтрокаДок из ТабЗначДок Цикл
				ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
				ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
				
				ОтборПоДокументуЗаказа = Новый Структура;
				ОтборПоДокументуЗаказа.Вставить("К_4", СтрокаДок.К_3);
				СтрокиТабЧастиДокументаИзФайла 	= ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_7,К_8"); 
				СтрокиТабЧастиДокументаИзФайла.Свернуть("К_5,К_8","К_7");
				//ЛЕО Пока временнр отключим,либо изменить и обеденить колонку К_12  
				СтрокиТабЧастиКодыЧЗ			 = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_8,К_12");	
				СтрокиТабЧастиКодыЧЗ.Свернуть("К_5,К_8,К_12");
				СтрокиТабЧастиКодыЧЗ_ТаблQR		 = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_8,К_13");	
				СтрокиТабЧастиКодыЧЗ_ТаблQR.Свернуть("К_5,К_8,К_13");
				//СтрокиТабЧастиДокументаИзФайла.Колонки.Добавить("Обработано");
				
				ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.К_3,СтрокаДок.К_7);
				Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
					//если январь попробуем поискать за прошлый год
					Если Месяц(СтрокаДок.К_7)=1 Тогда	
						ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.К_3,ДобавитьМесяц(СтрокаДок.К_7,-1));
					КонецЕсли;
				КонецЕсли;
					
				Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
					ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Заказ клиента"" по номеру заказа. Номер заказа " + СтрокаДок.К_3 + Символы.ПС ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					Продолжить;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
				|	И РеализацияТоваровУслуг.Сделка = &Заказ";
				
				Запрос.УстановитьПараметр("Заказ", ДокументЗаказ);
				Результат = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ДокументРеализация = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				Если   ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
					ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Реализация товаров и услуг"" по документу ""Заказ клиента"". Номер заказа " + СтрокаДок.К_3 + Символы.ПС  ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					Продолжить;		
				КонецЕсли;
				
				//Проверка документа
				ОбъектЗаказ = ДокументЗаказ.ПолучитьОбъект() ;
				ОбъектРеализация = ДокументРеализация.ПолучитьОбъект(); 
				
				//Очистим табличную часть Кодов ЧЗ
				ОбъектРеализация.СписокКоробок.Очистить();
				//заполним Коды что бы не нарушать процесс
				Для каждого СтрокаИзФайла из СтрокиТабЧастиКодыЧЗ Цикл
					Строка_К12	=	СокрЛП(СтрокаИзФайла.К_12);	
					Если ЗначениеЗаполнено(Строка_К12) Тогда 
						Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
						Если НЕ Номенклатура.Пустая() Тогда
							Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
							Если Сред(Строка_К12,1,3)="146" ИЛИ Сред(Строка_К12,1,3)="346" ИЛИ Сред(Строка_К12,1,5)="00146" ИЛИ Сред(Строка_К12,1,5)="00346" Тогда
								НоваяСтр_СписокКоробок	=	ОбъектРеализация.СписокКоробок.Добавить();	
								НоваяСтр_СписокКоробок.Номенклатура			= Номенклатура.Ссылка;
								НоваяСтр_СписокКоробок.СерияНоменклатуры	= ?(Серия.Пустая(),Справочники.СерииНоменклатуры.ПустаяСсылка(),Серия);
								НоваяСтр_СписокКоробок.ШтрихКодКоробки		= НайтиСсылкаШтрихКодКоробки(Строка_К12);
							Иначе
								//Проверить возможно это QR код
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				ОбъектРеализация.ШтучныеQR_Коды.Очистить();
				Для каждого СтрокаИзФайла из СтрокиТабЧастиКодыЧЗ_ТаблQR Цикл
					Строка_К13	=	СокрЛП(СтрокаИзФайла.К_13);	
					Если ЗначениеЗаполнено(Строка_К13) Тогда 
						Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
						Если НЕ Номенклатура.Пустая() Тогда
							Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
							Если Сред(Строка_К13,1,5)="01046" Тогда
								НоваяСтр_СписокQR_Код	=	ОбъектРеализация.ШтучныеQR_Коды.Добавить();	
								НоваяСтр_СписокQR_Код.Номенклатура		= Номенклатура.Ссылка;
								НоваяСтр_СписокQR_Код.СерияНоменклатуры	= ?(Серия.Пустая(),Справочники.СерииНоменклатуры.ПустаяСсылка(),Серия);
								НоваяСтр_СписокQR_Код.QR_Код_Входящий	= СокрЛП(Строка_К13); 
								НоваяСтр_СписокQR_Код.QR_Код_Сопоставлен= СопоставлениеКИЗ(НоваяСтр_СписокQR_Код.QR_Код_Входящий);
							Иначе
								//Проверить возможно это QR код
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				//Если НЕ ДокументРеализация.Контрагент.ИНН = КонтрагентИНН Тогда
				//	ТекстСтроки = "" + ТекущаяДата() + " В документе " + ДокументРеализация + " ИНН контрагента не совпадает с данными файла. ИНН" + КонтрагентИНН + Символы.ПС;
				//	ТекстЛога.Записать(ТекстСтроки);
				//	Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				//	Продолжить;
				//КонецЕсли;
				
				ТаблицаОтгружено = ОбъектРеализация.абс_Отгружено;
				ТаблицаОтгружено.Очистить();
				
				Для каждого СтрокаИзФайла из СтрокиТабЧастиДокументаИзФайла Цикл
					//+Лео Сафонов. В связи с изменением НДС у номенклатуры, добавлять "_18%" к артикулу если контрагент в списке 23.01.2016
					//Удалить код после окончательной ратации номенклатуры
					МассивКонтрагентов = новый Массив();
					//МассивКонтрагентов.Добавить("7825706086");  //Агроторг ООО
					//МассивКонтрагентов.Добавить("7743543232");  //АТАК ООО
					//МассивКонтрагентов.Добавить("7703270067");  //АШАН ООО
                    МассивКонтрагентов.Добавить("5047085094");  //Бэст Прайс ООО
					//МассивКонтрагентов.Добавить("7743543761");  //ГИПЕРГЛОБУС ООО
					МассивКонтрагентов.Добавить("5047081220");  //Инвестпроект ООО (Монетка)
					//МассивКонтрагентов.Добавить("7715196234");  //Копейка-Москва ООО
					//МассивКонтрагентов.Добавить("7713527850");  //Новый импульс-50 ООО (Утконос)
					//МассивКонтрагентов.Добавить("2310031475");  //ТАНДЕР АО
					//МассивКонтрагентов.Добавить("7728029110");  //ТД ПЕРЕКРЕСТОК ЗАО
					//МассивКонтрагентов.Добавить("7721511903");  //БИЛЛА ООО
					//МассивКонтрагентов.Добавить("5050058510");  //Зельгрос ООО

					МассивАртикулов = новый Массив();
					МассивАртикулов.Добавить("132337");
					МассивАртикулов.Добавить("132336");
					МассивАртикулов.Добавить("132331");
					МассивАртикулов.Добавить("132330");
					МассивАртикулов.Добавить("132329");
					МассивАртикулов.Добавить("132328");
					МассивАртикулов.Добавить("132327");
					МассивАртикулов.Добавить("132325");
					МассивАртикулов.Добавить("132324");
					МассивАртикулов.Добавить("132323");
					МассивАртикулов.Добавить("132322");
					МассивАртикулов.Добавить("132319");
					МассивАртикулов.Добавить("132318");
					МассивАртикулов.Добавить("132307");
					МассивАртикулов.Добавить("132306");
					МассивАртикулов.Добавить("132305");
					МассивАртикулов.Добавить("132304");
					МассивАртикулов.Добавить("132303");
					МассивАртикулов.Добавить("132302");
					МассивАртикулов.Добавить("132301");


					Если МассивКонтрагентов.Найти(ДокументРеализация.Контрагент.ИНН) <> Неопределено Тогда
						Если МассивАртикулов.Найти(СтрокаИзФайла.К_5) <> Неопределено Тогда 
							СтрокаИзФайла.К_5 = СтрокаИзФайла.К_5 + "_18%";
						КонецЕсли;
					КонецЕсли;
					//-Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
					
					
					Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
					Если НЕ Номенклатура.Пустая() Тогда
						СтрокаОтгружено = ТаблицаОтгружено.Добавить();
						СтрокаОтгружено.Номенклатура = Номенклатура;
					Иначе
						ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + СтрокаИзФайла.К_5 + "." + Символы.ПС ;
						ТекстЛога.Записать(ТекстСтроки);
						Сообщить(ТекстСтроки,СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
					
					СтрокаОтгружено.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
					//ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица """ + Строка.EdIzm + """по Артикулу. Артикул в файле:" + СтрокаИзФайла.KodTMC + "." + Символы.ПС ;
					
					
					Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
					Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
						СтрокаОтгружено.СерияНоменклатуры = Серия;
					Иначе	
						ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + СтрокаИзФайла.К_8 + """по Артикулу. Артикул в файле:" + СтрокаИзФайла.К_5 + "." + Символы.ПС ;
						ТекстЛога.Записать(ТекстСтроки);
						Сообщить(ТекстСтроки,СтатусСообщения.Важное);
						//Продолжить
					КонецЕсли;
					
					СтрокаОтгружено.Количество = СтрокаИзФайла.К_7;  
					
					//Если ЗначениеЗаполнено(СтрокаИзФайла.К_12) Тогда
					//ЗаполнитьТабличнуюЧастьДокументаРеализация(ОбъектРеализация, Номенклатура, СтрокаИзФайла.К_12);
					//КонецЕсли;
				КонецЦикла;
				
				//проверим на расхождения
				флРасхождения = ЛОЖЬ;
				тзОтгружено = ТаблицаОтгружено.Выгрузить();
				тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
				СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
				Для Каждого СтрокаТовары Из ОбъектРеализация.Товары Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
					мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
					Если мСтроки.Количество() = 0 Тогда
						флРасхождения = Истина;
					ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
						флРасхождения = Истина;
					КонецЕсли;						
					Если флРасхождения Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если флРасхождения Тогда
					ТекстСтроки = "" + ТекущаяДата() + " По документу " + ДокументРеализация + " зафиксированы расхождения!";
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					ОбъектЗаказ.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ОтгруженЛогОператоромСРасхождениями;
					ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Ошибка;
					ОбъектРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.Ошибка;
				Иначе	
					ОбъектЗаказ.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ОтгруженЛогОператором;
					ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен;
					ОбъектРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.Отгружен;
				КонецЕсли;
				
				
				
				
				Попытка
					ОбъектРеализация.Записать(РежимЗаписиДокумента.Проведение);
					ТекстСтроки = "" + ТекущаяДата() + " Проведен документ " + ДокументРеализация;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					СтрокаТаб.СсылкаДокумент  = ОбъектРеализация.Ссылка;
					СтрокаТаб.Расхождение = флРасхождения;
				Исключение
					ТекстСтроки = "" + ТекущаяДата() + " Ошибка проведения документа " + ДокументРеализация + "." + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;
				
				Попытка
					ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
					ТекстСтроки = "" + ТекущаяДата() + " Записан документ " + ОбъектЗаказ.Ссылка;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);

		            //проведение заказа по регистру абс_НеотгруженныеТовары					
					Если ОбъектЗаказ.Ссылка.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ОбъектЗаказ.Ссылка.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
						абс_Дистрибуция.СформироватьДвиженияПоНеотгруженнымТоварам(ОбъектЗаказ);
						ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;

					ТекстСтроки = "" + ТекущаяДата() + " Сформированы движения для отчета: Анализ неотгруженных товаров " + ОбъектЗаказ.Ссылка;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);

				Исключение
					ТекстСтроки = "" + ТекущаяДата() + " Ошибка записи документа " + ОбъектЗаказ.Ссылка + "." + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;

				////проведение заказа по регистру абс_НеотгруженныеТовары
				//Если ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
				//	абс_Дистрибуция.СформироватьДвиженияПоНеотгруженнымТоварам(ОбъектЗаказ.Ссылка);
				//КонецЕсли;
				
			КонецЦикла;
			//- Сгруппированная таблица  ТабЗначДок.
		КонецЦикла;
		Сообщить("Завершена обработка файлов");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;

	//-Обход массива файлов
	ТекстЛога.Закрыть();
		
КонецПроцедуры

&НаСервере
Процедура ИмпортОстатковНаСервере(МассивФайлов)
	
	Сообщение = Новый СообщениеПользователю;
	
	ТекстЛога = ЛогированиеФайлЛога ();
	
	Попытка
		ДатаЗагрузки = НачалоДня(ТекущаяДата());
		ДокументЗагрузки = Объект.ПараметрыПоУмолчанию.ОприходованиеОстатков.ПолучитьОбъект();
		ДокументЗагрузки.Заблокировать();
		
		АрхивныйДокумент = Неопределено;
		
		//ОстаткиНаДатуЗагрузки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартийТоваров.Купленный) КАК СтатусПартии,
		|	ЗНАЧЕНИЕ(Справочник.Качество.Новый) КАК Качество,
		|	-ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("ДатаЗагрузки", ДатаЗагрузки);
		Запрос.УстановитьПараметр("Склад", ДокументЗагрузки.Склад);
		
		Результат = Запрос.Выполнить();
		тзОстатки = Результат.Выгрузить();
		
		Если ДокументЗагрузки.Дата < ДатаЗагрузки Тогда
			//это вчерашний документ
			//нужно сделать с него архивную копию
			//и переместить на сегодня
			АрхивныйДокумент = ДокументЗагрузки.Скопировать();
			АрхивныйДокумент.Дата = ДокументЗагрузки.Дата;
			АрхивныйДокумент.Комментарий = "Документ загрузки остатков логоператора, перемещен в архив " + ТекущаяДата();
			
			ДокументЗагрузки.Дата = ДатаЗагрузки;
			ДокументЗагрузки.Комментарий = "Документ загрузки остатков логоператора, актуальный, обновлен " + ТекущаяДата();
		КонецЕсли;
		
		//сторно вчерашних остатков
		ДокументЗагрузки.Товары.Загрузить(тзОстатки);
		
	Исключение
		Сообщение.Текст = "Не удалось получить и заблокировать документ загрузки остатков.";
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ФайлОстатков = МассивФайлов[0]; 
	
	ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлОстатков.Имя + ")" + Символы.ПС ;
	ТекстЛога.Записать(ТекстСтроки);
	Сообщение.Текст = ТекстСтроки;
	Сообщение.Сообщить();
	
	ФайлEXCEL = ФайлОстатков.Имя ;
	КолвоСтрокExcel = 1;	
		
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлОстатков.Хранение);
	ПутьКФайлу = ПолучитьИмяВременногоФайла("csv");
	ДвоичныеДанные.Записать(ПутьКФайлу);
	
	
	ИмяФайла =СтрЗаменить(ПутьКФайлу, КаталогВременныхФайлов(),""); 
	Каталог = КаталогВременныхФайлов();

	ТабЗнач = ПрочитатьCSV(Каталог,ИмяФайла, 10);
	
	
	Для каждого Строка из ТабЗнач Цикл	
				
		
		НомерКолонкиАртикул 			= 3;
		НомерКолонкиЕдиницаИзмерения 	= Неопределено; // В новом формате нет единицы измерения, грузим пустую колонку
		НомерКолонкиСерияНоменклатуры	= 4;
		НомерКолонкиКоличество			= 5;
				
		ТекущиеДанные = ДокументЗагрузки.Товары.Добавить();
		
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",(СокрЛП(Строка[НомерКолонкиАртикул])));
		Если Не Номенклатура = Справочники.Номенклатура.ПустаяСсылка()Тогда
			ТекущиеДанные.Номенклатура = Номенклатура;			
		Иначе	
			ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщение.Текст = ТекстСтроки;
			Сообщение.Сообщить();
			
			ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
			Продолжить;
		КонецЕсли;
		
		Если НЕ НомерКолонкиЕдиницаИзмерения = Неопределено Тогда
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СокрЛП(Строка[НомерКолонкиЕдиницаИзмерения]),,, ТекущиеДанные.Номенклатура);
			Если Не ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка()Тогда
				ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмерения;			
			Иначе	
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица измерения """ + СокрЛП(Строка[НомерКолонкиЕдиницаИзмерения])  + """ для номенклатуры:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщение.Текст = ТекстСтроки;
				Сообщение.Сообщить();
				
				ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
				Продолжить;
			КонецЕсли;
		Иначе
			ТекущиеДанные.ЕдиницаИзмерения = ТекущиеДанные.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения) Тогда
			ТекущиеДанные.Коэффициент = ТекущиеДанные.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		Если Объект.ИмпортОперативныхОстатковПоСериям Тогда
			
			НаименованиеСерииНоменклатуры = СтрЗаменить(СокрЛП(Строка[НомерКолонкиСерияНоменклатуры]), " ", ".");
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И ЗначениеЗаполнено(НаименованиеСерииНоменклатуры) Тогда
				Результат = Справочники.СерииНоменклатуры.НайтиПоНаименованию(НаименованиеСерииНоменклатуры,,, ТекущиеДанные.Номенклатура);
			Иначе
				ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + НаименованиеСерииНоменклатуры + """ для номенклатуры:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
				ТекстЛога.Записать(ТекстСтроки);
				Сообщение.Текст = ТекстСтроки;
				Сообщение.Сообщить();
				
				Результат = Справочники.СерииНоменклатуры.ПустаяСсылка();
			КонецЕсли;
		Иначе
			Результат = Справочники.СерииНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		ТекущиеДанные.СерияНоменклатуры = Результат;
		
		ТекущиеДанные.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;	
		
		сКоличество = СокрЛП(Строка[НомерКолонкиКоличество]);    
		сКоличество = СтрЗаменить(сКоличество, " ", "");
		сКоличество = СтрЗаменить(сКоличество, Символы.НПП, "");
		сКоличество = СтрЗаменить(сКоличество, ",", "");
		Попытка
			ТекущиеДанные.Количество = Число(сКоличество);
		Исключение
			ТекстСтроки = "" + ТекущаяДата() + " Не загружено колчиество """ + СокрЛП(Строка[НомерКолонкиКоличество])  + """ для номенклатуры:" + Строка[НомерКолонкиАртикул] + "." + Символы.ПС ;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщение.Текст = ТекстСтроки;
			Сообщение.Сообщить();
			
			ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
			Продолжить;
		КонецПопытки;	
		
		Если ТекущиеДанные.Количество = 0 ТОгда
			ДокументЗагрузки.Товары.Удалить(ТекущиеДанные);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если АрхивныйДокумент <> Неопределено Тогда
		Попытка
			АрхивныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстСтроки = "" + ТекущаяДата() + "Ошибка проведения архивного документа переноса остатков." + Символы.ПС + ОписаниеОшибки() ;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщение.Текст = ТекстСтроки;
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;	
	
	Попытка
		ДокументЗагрузки.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекстСтроки = "" + ТекущаяДата() + "Проведен документ " + ДокументЗагрузки;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщение.Текст = ТекстСтроки;
		Сообщение.Сообщить();
		//добавим в ТЧ обработки
		СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
		СтрокаТаб.СсылкаДокумент  = ДокументЗагрузки.Ссылка;
	Исключение
		ТекстСтроки = "" + ТекущаяДата() + "Ошибка проведения документа Оприходования." + Символы.ПС + ОписаниеОшибки() ;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщение.Текст = ТекстСтроки;
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция НайтиДокументПеремещения(НомерЛЛ, ДатаДокумента, НаправлениеПеремещения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(ПеремещениеТоваров.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
	|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель";
	
	Запрос.УстановитьПараметр("Дата", ДатаДокумента);
	Запрос.УстановитьПараметр("Номер", НомерЛЛ);
	Запрос.УстановитьПараметр("СкладПолучатель", НаправлениеПеремещения);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;		
	Иначе
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура мСообщениеПользователю(СтрокаСообщения, ТекстЛога = Неопределено)
	
	Если НЕ ТекстЛога = Неопределено Тогда	
		ТекстЛога.Записать(СтрокаСообщения);
	КонецЕсли;
	
	Сообщить(СтрокаСообщения, СтатусСообщения.Важное);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Склад = Объект.Организация.абс_ОсновнойСклад;
	
	Объект.ВыгрузкаЛефЭкспо = Объект.Организация.Наименование = "ЛефЭкспо";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ФормироватьНовыеДокументы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеMetroMGL(Команда)
	
	сАдресВременногоХранилища = ПолучитьДанныеВыгрузкиMetroMGLНаСервере();
	
	Если сАдресВременногоХранилища <> Неопределено Тогда
		//формируем имя файла
		сИмяФайла = "MGL" + Формат(ТекущаяДата(), "ДФ=ddMMyy_HHmm") + ".swr";
		//открываем форму открытия/сохранения файла
		ПолучитьФайл(сАдресВременногоХранилища, сИмяФайла);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВыгрузкиMetroMGLНаСервере()
	
	КонтрагентМетро = Константы.абс_КонтрагентМетро.Получить();
	
	СпРеализаций = Новый Массив();
	
	Для Каждого СтрЗаказа из Объект.СписокЗаказов Цикл
		
		Если НЕ СтрЗаказа.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтрЗаказа.ДокументРеализация.Контрагент = КонтрагентМетро Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В документе " + СтрЗаказа.ДокументРеализация + " выбран контрагент отличный от """ + КонтрагентМетро + """!");
			Продолжить;
		КонецЕсли;
		
		СпРеализаций.Добавить(СтрЗаказа.ДокументРеализация);
		
	КонецЦикла;
	
	ВыгруженныйФайл = абс_ОбменДаннымиСервер.ВыгрузитьДанныеМетро(СпРеализаций);
	
	Возврат ВыгруженныйФайл;
	
КонецФункции


&НаКлиенте
Процедура ВыгрузитьУведомленияОбОтгрузке(Команда)
	
	ВыгрузитьУведомленияОбОтгрузкеНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьУведомленияОбОтгрузкеНаСервере()
	
	Для Каждого СтрЗаказа из Объект.СписокЗаказов Цикл
		
		Если НЕ СтрЗаказа.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		
		абс_ОбменДаннымиСервер.ВыгрузитьУведомлениеОбОтгрузке(СтрЗаказа.ДокументРеализация, ЕстьОшибки);
		
		Если НЕ ЕстьОшибки Тогда
			Сообщить("Выгружено уведомление об отгрузке по документу: " + СтрЗаказа.ДокументРеализация);
		Иначе
			Сообщить("Уведомление об отгрузке по документу: " + СтрЗаказа.ДокументРеализация + " не выгружено!", СтатусСообщения.ОченьВажное);
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ИмпортПодбораОВХПоОтгрузкам(Команда)
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуПодбораОВХ;
	МаскаФайла = "*xls";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	Сообщение = Новый СообщениеПользователю;
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	//+Обход массива файлов
	//загружаем первый видимый (там могут быть экселевские "копии" типа ~$имяфайла.xslx)
	ФайлОстатков = Неопределено;
	Для Каждого Файл Из МассивФайлов Цикл
		Если НЕ Файл.ПолучитьНевидимость() Тогда
			ФайлОстатков = Файл;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ФайлОстатков = Неопределено Тогда
		Сообщение.Текст = "Не найден файл для загрузки!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлОстатков.ПолноеИмя));		
	
	Если ПомещаемыеФайлы.Количество()>0 Тогда
		Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь) Тогда
			ИмпортПодбораОВХПоОтгрузкамНаСервере(ПомещенныеФайлы);
		КонецЕсли;
	КонецЕсли;
	
	//переместим файл загрузки в архив
	Если Прав(Каталог, 1) <> "\" ТОгда
		Каталог = Каталог + "\";
	КонецЕсли;
	Каталог = Каталог + "Arhiv\";
	Попытка
		ПереместитьФайл(ФайлОстатков.ПолноеИмя,Каталог + ФайлОстатков.Имя);
	Исключение
		Сообщение.Текст = "Не удалось переместить файл загрузки в архив, сделайте это вручную!";
		Сообщение.Сообщить();
	КонецПопытки;

КонецПроцедуры

Процедура ИмпортПодбораОВХПоОтгрузкамНаСервере(МассивФайлов)
	
	ТекстЛога = ЛогированиеФайлЛога ();
	
	//+Обход массива файлов
	Для каждого ФайлЗаказа Из МассивФайлов Цикл
		ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС;
		ТекстЛога.Записать(ТекстСтроки);
		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
		
		ФайлEXCEL = ФайлЗаказа.Имя ;
		КолвоСтрокExcel = 1;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
		ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
		ДвоичныеДанные.Записать(ПутьКФайлу);
		
		ТабЗнач = ЗагрузитьМетодом_ExcelApplication(ПутьКФайлу, Истина);
		Для каждого Строка из  ТабЗнач Цикл
			
			НомерЗаказаEDI 		= СокрЛП(Строка[11]);
			НомерЗаказаEDI = СтрЗаменить(НомерЗаказаEDI, Символы.НПП,"");
			ДатаПоставкиСтр 	= СокрЛП(Строка[0]);
			НомерЗаказа 		= СокрЛП(Строка[1]);
			НомерЗаказа = СтрЗаменить(НомерЗаказа, Символы.НПП,"");
			НомерНакладной 		= СокрЛП(Строка[2]);
			НомерНакладной = СтрЗаменить(НомерНакладной, Символы.НПП,"");
			НомерМагазинаМетро	= СокрЛП(Строка[14]);
			НомерМагазинаМетро = СтрЗаменить(НомерМагазинаМетро, Символы.НПП,"");
			КоличествоПаллетСтр	= СокрЛП(Строка[15]);
			КоличествоКоробовСтр= СокрЛП(Строка[16]);
			ОбъемФактическийСтр	= СокрЛП(Строка[17]);
			ВесФактическийСтр	= СокрЛП(Строка[18]);
			
			Попытка
				ДатаПоставки = Дата(Число(Сред(ДатаПоставкиСтр, 7, 4)), Число(Сред(ДатаПоставкиСтр, 4, 2)), Число(Сред(ДатаПоставкиСтр, 1, 2)));
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения даты поставки: " + ДатаПоставкиСтр);
			КонецПопытки;
			
			КоличествоПаллет = 0;
			КоличествоКоробов = 0;
			ОбъемФактический = 0;
			ВесФактический = 0;
			
			Попытка
				Если КоличествоПаллет<>"" Тогда
					КоличествоПаллет = Число(КоличествоПаллетСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + КоличествоПаллетСтр);
			КонецПопытки;			
			
			Попытка
				Если КоличествоКоробов<>"" Тогда
					КоличествоКоробов = Число(КоличествоКоробовСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + КоличествоКоробовСтр);
			КонецПопытки;
			
			Попытка
				Если ОбъемФактический<>"" Тогда
					ОбъемФактический = Число(ОбъемФактическийСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + ОбъемФактическийСтр);
			КонецПопытки;
			
			Попытка
				Если ВесФактический<>"" Тогда
					ВесФактический = Число(ВесФактическийСтр);
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка чтения количества паллет: " + ВесФактическийСтр);
			КонецПопытки;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
			|	ЗначенияСвойствОбъектов.Значение КАК НомерМагазина
			|ПОМЕСТИТЬ ВТ_ДокументыНомерМагазина
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|		ПО РеализацияТоваровУслуг.Грузополучатель = ЗначенияСвойствОбъектов.Объект
			|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_НомерМагазина))
			|ГДЕ
			|	РеализацияТоваровУслуг.Сделка.абс_НомерЗаказаEDI = &НомерЗаказаEDI
			|	И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПоставки, ДЕНЬ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДокументыНомерМагазина.РеализацияСсылка
			|ИЗ
			|	ВТ_ДокументыНомерМагазина КАК ВТ_ДокументыНомерМагазина
			|ГДЕ
			|	ВТ_ДокументыНомерМагазина.НомерМагазина = &НомерМагазина");
			
			Запрос.УстановитьПараметр("НомерЗаказаEDI"	, НомерЗаказаEDI);
			Запрос.УстановитьПараметр("ДатаПоставки"	, ДатаПоставки);
			Запрос.УстановитьПараметр("НомерМагазина"	, НомерМагазинаМетро);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				РеализацияОбъект = Выборка.РеализацияСсылка.ПолучитьОбъект();
				РеализацияОбъект.абс_КоличествоПаллет = КоличествоПаллет;
				РеализацияОбъект.абс_КоличествоТранспортныхКоробов = КоличествоКоробов;
				РеализацияОбъект.абс_ФактическийОбъем = ОбъемФактический;
				РеализацияОбъект.абс_ФактическийВес = ВесФактический;
				
				РеализацияОбъект.ОбменДанными.Загрузка = Истина;
				РеализацияОбъект.Записать();
			Иначе
				Сообщить("Не найдена реализация № " + НомерНакладной + " от " + ДатаПоставки + " Номер магазина метро " + НомерМагазинаМетро + " Номер заказа EDI " + НомерЗаказаEDI);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	//-Обход массива файлов
	ТекстЛога.Закрыть();
	
	
КонецПроцедуры

// Параметры:
// "Каталог" - путь к файлу без имени файла с завершающим слешем,
// "ИмяФайла" - имя файла,
// "КолПолей" - количество колонок (число).
// Функция возвращает ТаблицуЗначений с данными файла.
&НаСервере
Функция ПрочитатьCSV(Каталог,ИмяФайла, КолПолей)
	ФайлДокумента = Новый ТекстовыйДокумент ;
	//ФайлДокумента.Прочитать(Папка ,  КодировкаТекста.ANSI ,);
	//ИмяФайла =СтрЗаменить(Папка, КаталогВременныхФайлов(),""); 
	//Каталог = КаталогВременныхФайлов();
	//ФайлДокумента.Записать(Папка , КодировкаТекста.ANSI);
	
	Текст = "[" + ИмяФайла + "]
	|ColNameHeader=False
	|Format=Delimited(;)
	|TextDelimiter=none
	|CharacterSet=ANSI              
	|";

	Для ы = 1 По КолПолей Цикл
		Текст = Текст + "Col" + ы + "=Field" + ы + " Text" + Символы.ПС;
	КонецЦикла;
	
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(Текст);
	ТекстДок.Записать(Каталог + "Schema.ini",КодировкаТекста.ANSI); 
	
    objRec = Новый COMОбъект("ADODB.Recordset");
    strQuery = "SELECT * FROM [" + ИмяФайла + "]";
	//strConn = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + Каталог + ";Extended Properties=""text;""";
	strConn = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + Каталог + ";Extended Properties=""text;""";
    adOpenStatic = 3;
    adLockOptimistic = 3;
    adCmdText = 1;
	
	ТаблЗнач = Новый ТаблицаЗначений;

	НомКолонки = 1;
	Пока НомКолонки <= КолПолей Цикл
       	ТаблЗнач.Колонки.Добавить("К_"+НомКолонки,,"К_"+НомКолонки,300);
		НомКолонки = НомКолонки+1; 
	КонецЦикла;
	
	objRec.Open(strQuery, strConn, adOpenStatic, adLockOptimistic, adCmdText);
    КолСтрок = objRec.RecordCount;

    Ном = 1;

    Пока Не objRec.EOF Цикл
		//Если Ном % 500 = 0 Тогда
		//	Состояние(ИмяФайла + " " + Ном + " из " + КолСтрок);
		//  КонецЕсли;

        НовСтр = ТаблЗнач.Добавить();
        Для i=0 По objRec.Fields.Count-1 Цикл
        	НовСтр[i] = Строка(objRec.Fields(i).Value);
        КонецЦикла;
        objRec.MoveNext();
        Ном = Ном + 1;
    КонецЦикла;
    objRec.Close();

    Возврат ТаблЗнач;

КонецФункции


//+FTP
&НаСервере
Процедура ПрочитатьФайлFTP(НастройкаОбмена,МаскаФайла,Каталог, Отказ = Ложь) Экспорт
	ИмяFTPСервера = "";
	ИмяКаталогаСервера = "";
	ДанныеПротокола = "";
	ПолучитьИмяСервераИИмяКаталогаОбмена(НастройкаОбмена.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, НастройкаОбмена, ДанныеПротокола, Истина, Неопределено);
	Если Соединение = Неопределено Тогда
		СообщитьОбОшибкеОбмена("Ошибка при подключении к серверу: " + ИмяFTPСервера);
		Возврат;
	КонецЕсли;
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, НастройкаОбмена.Входящие, ДанныеПротокола, Истина, Неопределено);
	Если Не НаличиеКаталога Тогда
		СообщитьОбОшибкеОбмена("На сервере " + ИмяFTPСервера + " отсутствует каталог: " + НастройкаОбмена.Входящие);
		Возврат;
	КонецЕсли;	
	МассивФайлов = Соединение.НайтиФайлы("/" + НастройкаОбмена.Входящие + "/", МаскаФайла);
	Если МассивФайлов.Количество() > 0 Тогда   		
		Для Каждого ФайлОбмена Из МассивФайлов Цикл 
			Если НастройкаОбмена.ТипНастройки = Перечисления.абс_ТипыОбменаEDI.ОбменЧерезFTPРесурс Тогда 		
				Соединение.Получить(ФайлОбмена.ПолноеИмя, "" + КаталогВременныхФайлов() + ФайлОбмена.Имя);
				абс_Файл = "" + КаталогВременныхФайлов() + ФайлОбмена.Имя;
				ФайлОбмена = Новый Файл(абс_Файл);
				КопироватьФайл(ФайлОбмена.ПолноеИмя, Каталог + "\" + ФайлОбмена.Имя);
			КонецЕсли;
		КонецЦикла; 
	Соединение.Удалить("/" + НастройкаОбмена.Входящие + "/",МаскаФайла);	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФайлFTP(НастройкаОбмена,МаскаФайла,ЛокальныйКаталог,КаталогFTP, Отказ = Ложь) Экспорт
	ИмяFTPСервера = "";
	ИмяКаталогаСервера = "";
	ДанныеПротокола = "";
	ПолучитьИмяСервераИИмяКаталогаОбмена(НастройкаОбмена.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, НастройкаОбмена, ДанныеПротокола, Истина, Неопределено);
	Если Соединение = Неопределено Тогда
		СообщитьОбОшибкеОбмена("Ошибка при подключении к серверу: " + ИмяFTPСервера);
		Возврат;
	КонецЕсли;
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, НастройкаОбмена.Входящие, ДанныеПротокола, Истина, Неопределено);
	Если Не НаличиеКаталога Тогда
		СообщитьОбОшибкеОбмена("На сервере " + ИмяFTPСервера + " отсутствует каталог: " + НастройкаОбмена.Входящие);
		Возврат;
	КонецЕсли;	
	//МаскаФайла	  = "*csv";
	МассивФайлов  = НайтиФайлы(ЛокальныйКаталог,МаскаФайла,Ложь);

	Если МассивФайлов.Количество() > 0 Тогда   		
		Для Каждого ФайлОбмена Из МассивФайлов Цикл 
			Если НастройкаОбмена.ТипНастройки = Перечисления.абс_ТипыОбменаEDI.ОбменЧерезFTPРесурс Тогда 		
				Соединение.Записать(ФайлОбмена.ПолноеИмя, ФайлОбмена.Имя);
				Соединение.Переместить( ФайлОбмена.Имя, "inbound/" + ФайлОбмена.Имя);
				
				КаталогАрхив = ЛокальныйКаталог + "\Arhiv\";
				ПереместитьФайл(ФайлОбмена.ПолноеИмя,КаталогАрхив + ФайлОбмена.Имя);
				 				
			КонецЕсли;
		КонецЦикла;  	
	КонецЕсли; 	
КонецПроцедуры


&НаСервере
Процедура ПолучитьИмяСервераИИмяКаталогаОбмена(Знач ПолныйFTPАдрес, ИмяСервера, ИмяКаталога)
	
	АдресОбмена = ПроцедурыОбменаДанными.НормализоватьFTPАдрес(ПолныйFTPАдрес);
	
	// принцип получения адреса такой, все что до первой черты / или \ - это имя сервера, потом каталог
	АдресОбмена = СтрЗаменить(АдресОбмена, "\", "/");
	
	ПозицияПрямогоСлеша = Найти(АдресОбмена, "/");
	
	Если ПозицияПрямогоСлеша = 0 Тогда
		
		ИмяСервера = АдресОбмена;
		ИмяКаталога = "";
		
		
	Иначе
		
		ИмяСервера = Сред(АдресОбмена, 1, ПозицияПрямогоСлеша - 1);
		ИмяКаталога = Сред(АдресОбмена, ПозицияПрямогоСлеша);
		
		// последний должен быть слеш у имени каталога
		Если Сред(ИмяКаталога, СтрДлина(ИмяКаталога)) <> "/" Тогда
			
			ИмяКаталога = ИмяКаталога + "/";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено)       
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
	#КонецЕсли
	
	Попытка
		
		Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
		НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, ,НастройкиОбмена.ПассивноеFTPСоединение);						
		
	Исключение
		
		// ошибка при подключении к ftp
		ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки(), 
		ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

&НаСервере
Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	Попытка
		
		МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
		
	Исключение
		
		// ошибка при подключении к ftp
		ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! " + ОписаниеОшибки(), 
		ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
		Возврат Ложь;
		
	КонецПопытки;
	
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.ПолноеИмя <> "/" + ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	// если не найден каталог для обмена
	ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Не найден FTP каталог обмена информацией: " + ИмяКаталогаСервера, 
	ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура СообщитьОбОшибкеОбмена(ТекстСообщенияОбОшибке)
	
	Сообщить(ТекстСообщенияОбОшибке, СтатусСообщения.ОченьВажное);
	
	ЗаписьЖурналаРегистрации("ОбменДаннымиEDI", УровеньЖурналаРегистрации.Ошибка);
	
КонецПроцедуры

//-FTP


&НаКлиенте
Процедура ВыгрузитьНоменклатуруДля77(Команда)
	Каталог = "\\december\1C_Exchange\Obmen77";
	ИмяФайла = СформироватьИмяФайла ("НоменклатураДля77",Каталог,ТекущаяДата());
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;

	ТабДок = ВыгрузкаНоменклатуруДля77Сервер ();

	Попытка
        ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
    Исключение 
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ВыгрузкаНоменклатуруДля77Сервер ();
	Если Объект.СписокНоменклатур.Количество()> 0 Тогда
		//Выгружаем номенклатуру из списка
		спНоменклатура = новый Массив;
		Для каждого СтрокаТЧ из Объект.СписокНоменклатур Цикл
			спНоменклатура.Добавить(СтрокаТЧ.Номенклатура);		
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Номенклатура.Артикул,
		|	Номенклатура.Наименование,
		|	Номенклатура.НаименованиеПолное,
		|	Номенклатура.СтавкаНДС,
		|	ЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО Номенклатура.Ссылка = Штрихкоды.Владелец
		|			И Номенклатура.ЕдиницаХраненияОстатков = Штрихкоды.ЕдиницаИзмерения
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И Номенклатура.Артикул <> """"";	
			

		Запрос.УстановитьПараметр("СписокНоменклатуры", спНоменклатура);
					
	Иначе
		//Выгружаем всю номенклатуру
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Артикул,
			|	Номенклатура.Наименование,
			|	Номенклатура.НаименованиеПолное,
			|	Номенклатура.СтавкаНДС,
			|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмерения,
			|	Штрихкоды.Штрихкод
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
			|		ПО Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
			|		ПО Номенклатура.Ссылка = Штрихкоды.Владелец
			|			И Номенклатура.ЕдиницаХраненияОстатков = Штрихкоды.ЕдиницаИзмерения
			|ГДЕ
			|	Номенклатура.ЭтоГруппа = ЛОЖЬ
			|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
			|	И Номенклатура.Артикул <> """"";

		
	КонецЕсли;	
		
	Результат = Запрос.Выполнить();
 	ТзAssort = Результат.Выгрузить();
	
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ВыгрузкаВ77");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
    ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого Стр Из ТзAssort Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
    Возврат ТабДок;	

КонецФункции

//Функция ПроверитьНаПринадлежность   

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьДокументаРеализация(Докум, Номенклатура, СписокКодов) 
	
	СтрокаДляРазделения	=	СписокКодов;
	ПрерватьРазборСтроки	=	Ложь;
	Пока НЕ ПрерватьРазборСтроки Цикл
		НомерСимволаРазделения	=	Найти(СтрокаДляРазделения, ", ");
		КодКоробкиТекущий		=	СокрЛП(Сред(СтрокаДляРазделения,1, НомерСимволаРазделения-1));
		СтрокаДляРазделения		=	Сред(СтрокаДляРазделения,НомерСимволаРазделения+2);
		//найти код
		//распределить по таблицам
		Если НЕ ЗначениеЗаполнено(СтрокаДляРазделения) Тогда
		ПрерватьРазборСтроки	=	Истина;                 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиСсылкаШтрихКодКоробки(ШтрихКодКоробки)
	Ссылка_ШтрихКод	=	Справочники.Лео_СправочникШтрихКодовКоробок.НайтиПоНаименованию(ШтрихКодКоробки,Истина);
	Если Ссылка_ШтрихКод=Неопределено Тогда
		Ссылка_ШтрихКод	=	Справочники.Лео_СправочникШтрихКодовКоробок.ПустаяСсылка();
	КонецЕсли;
	Возврат Ссылка_ШтрихКод;
КонецФункции

&НаКлиенте
Процедура ИмпортАктыСборки(Команда) Экспорт
	// Вставить содержимое обработчика.
	Попытка 
		Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
		МаскаФайла = "*PickAct_*csv";	
		//+FTP	
		ПрочитатьФайлFTP(Объект.ПараметрыПоУмолчанию,МаскаФайла,Каталог,);
		//-FTP
		Сообщить("Прошло соединение с FTP");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;

	
	
	Каталог = Объект.ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
	МаскаФайла = "*PickAct_*csv";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	
	Попытка
		Для каждого ФайлМассива из МассивФайлов Цикл
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));		
		КонецЦикла;
		Сообщить("Файлы добавлены в массив");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;

	Попытка	
		Если ПомещаемыеФайлы.Количество()>0 Тогда
			Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь,УникальныйИдентификатор) Тогда
				Сообщить("Файлы помещены во временное хранилище");
				ЗагрузитьАктыОтгрузкиЛоджикЛайн(ПомещенныеФайлы);
			КонецЕсли;
		Иначе
			Сообщить("Нет файла для загрузки.");
			Возврат;
		КонецЕсли;
	    Сообщить("Файлы получены и обработаны");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
	
	Попытка
		Каталог = Каталог + "\Arhiv\";
		Для каждого ФайлМассива из МассивФайлов Цикл
			ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
		КонецЦикла;
		Сообщить("Файлы перенесены в архив");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАктыОтгрузкиЛоджикЛайн(МассивФайлов) Экспорт
	Попытка
		ТекстЛога = ЛогированиеФайлЛога ();
		Сообщить("Начало логирования процесса");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
	
	Попытка
		//+Обход массива файлов
		Для каждого ФайлЗаказа Из МассивФайлов Цикл
			ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС;
			ТекстЛога.Записать(ТекстСтроки);
			Сообщить(ТекстСтроки,СтатусСообщения.Важное);
			
			ФайлEXCEL = ФайлЗаказа.Имя ;
			КолвоСтрокExcel = 1;
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);
			ПутьКФайлу = ПолучитьИмяВременногоФайла("csv");
			ДвоичныеДанные.Записать(ПутьКФайлу);
			
			
			ИмяФайла =СтрЗаменить(ПутьКФайлу, КаталогВременныхФайлов(),""); 
			Каталог = КаталогВременныхФайлов();

			ТабЗнач = ПрочитатьCSV(Каталог,ИмяФайла, 13);
			
					//Строка "H"
					//Строка.К_1	Тип строки
					//Строка.К_2	Тип документа
					//Строка.К_3	№ акта выдачи
					//Строка.К_4	Номер маршрута
					//Строка.К_5	Дата выдачи
					//Строка.К_6	№ консолидированного заказа
					//Строка.К_7	Дата заявки на выдачу
					//Строка.К_8	Получатель
					//Строка.К_9	Адрес доставки
					//Строка.К_10	Признак упаковки
					//Строка.К_11	№ а/м
					//Строка.К_12	Перевозчик
					//Строка.К_13	не используется

					//Строка "I"
					//Строка.К_1	Тип строки
					//Строка.К_2	№ консолидированного заказа
					//Строка.К_3	Номер позиции
					//Строка.К_4	№ заявки на выдачу
					//Строка.К_5	Код товара
					//Строка.К_6	Наименование товара
					//Строка.К_7	Кол-во выданного товара
					//Строка.К_8	Партия
					//Строка.К_9	S/n ювелирного изд-я
					//Строка.К_10	Код IMEI
					//Строка.К_11	Номер грузового места
					//Строка.К_12	Агригатор коробки ЧЗ
					//Строка.К_13	QR код ЧЗ
					
			Для каждого Строка из  ТабЗнач Цикл	
				Если Строка.К_1 = "H" Тогда
					Строка.К_3	= СокрЛП(Строка.К_3); //№ акта выдачи
					Строка.К_5	= ПолучитьДатуИзСтроки(Строка.К_5); //Дата выдачи 		
					Строка.К_7	= ПолучитьДатуИзСтроки(Строка.К_7); //Дата заявки на выдачу
				ИначеЕсли Строка.К_1 = "I" Тогда
					Строка.К_2		= СокрЛП(Строка.К_2); //№ консолидированного заказа
					Строка.К_4		= СокрЛП(Строка.К_4); //№ заявки на выдачу
	                Строка.К_5		= СокрЛП(Строка.К_5); //Код товара
					Строка.К_7		= Число(Строка.К_7);  //Кол-во выданного товара
					Строка.К_8		= СокрЛП(Строка.К_8); //Партия
					Строка.К_12 	= СокрЛП(Строка.К_12);//Агрегаты коробок честного знака
					Строка.К_13 	= СокрЛП(Строка.К_13);//QR Коды честного знака
					Квалификация	= "";
	 			КонецЕсли;				
			КонецЦикла;

			
			ОтборПоШапке = Новый Структура;
			ОтборПоШапке.Вставить("К_1","H");
			
					
			ТабЗначДок = ТабЗнач.Скопировать(ОтборПоШапке,"К_3,К_5,К_7");
			ТабЗначДок.Свернуть("К_3,К_5,К_7");
			
			
			//+Сгруппированная таблица  ТабЗначДок. (список документов в файле)
			Для Каждого СтрокаДок из ТабЗначДок Цикл
				ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
				ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
				
				ОтборПоДокументуЗаказа = Новый Структура;
				ОтборПоДокументуЗаказа.Вставить("К_4", СтрокаДок.К_3);
				СтрокиТабЧастиДокументаИзФайла 	= ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_7,К_8"); 
				СтрокиТабЧастиДокументаИзФайла.Свернуть("К_5,К_8","К_7");
				//ЛЕО Пока временнр отключим,либо изменить и обеденить колонку К_12  
				СтрокиТабЧастиКодыЧЗ			 = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_8,К_12");	
				СтрокиТабЧастиКодыЧЗ.Свернуть("К_5,К_8,К_12");
				СтрокиТабЧастиКодыЧЗ_ТаблQR		 = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_8,К_13");	
				СтрокиТабЧастиКодыЧЗ_ТаблQR.Свернуть("К_5,К_8,К_13");
				//СтрокиТабЧастиДокументаИзФайла.Колонки.Добавить("Обработано");
				
				ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.К_3,СтрокаДок.К_7);
				Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
					//если январь попробуем поискать за прошлый год
					Если Месяц(СтрокаДок.К_7)=1 Тогда	
						ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.К_3,ДобавитьМесяц(СтрокаДок.К_7,-1));
					КонецЕсли;
				КонецЕсли;
					
				Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
					ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Заказ клиента"" по номеру заказа. Номер заказа " + СтрокаДок.К_3 + Символы.ПС ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					Продолжить;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
				|	И РеализацияТоваровУслуг.Сделка = &Заказ";
				
				Запрос.УстановитьПараметр("Заказ", ДокументЗаказ);
				Результат = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ДокументРеализация = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				Если   ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
					ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Реализация товаров и услуг"" по документу ""Заказ клиента"". Номер заказа " + СтрокаДок.К_3 + Символы.ПС  ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					Продолжить;		
				КонецЕсли;
				
				Если ДокументЗаказ.ДатаОтгрузки<Дата("20250818") Тогда
					Продолжить;	
				КонецЕсли;
				//Проверка документа
				ОбъектЗаказ = ДокументЗаказ.ПолучитьОбъект() ;
				ОбъектРеализация = ДокументРеализация.ПолучитьОбъект(); 
				
				//Очистим табличную часть Кодов ЧЗ
				ОбъектРеализация.СписокКоробок.Очистить();
				//заполним Коды что бы не нарушать процесс
				Для каждого СтрокаИзФайла из СтрокиТабЧастиКодыЧЗ Цикл
					Строка_К12	=	СокрЛП(СтрокаИзФайла.К_12);	
					Если ЗначениеЗаполнено(Строка_К12) Тогда 
						Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
						Если НЕ Номенклатура.Пустая() Тогда
							Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
							Если Сред(Строка_К12,1,3)="146" ИЛИ Сред(Строка_К12,1,3)="346" ИЛИ Сред(Строка_К12,1,5)="00146" ИЛИ Сред(Строка_К12,1,5)="00346" Тогда
								НоваяСтр_СписокКоробок	=	ОбъектРеализация.СписокКоробок.Добавить();	
								НоваяСтр_СписокКоробок.Номенклатура			= Номенклатура.Ссылка;
								НоваяСтр_СписокКоробок.СерияНоменклатуры	= ?(Серия.Пустая(),Справочники.СерииНоменклатуры.ПустаяСсылка(),Серия);
								НоваяСтр_СписокКоробок.ШтрихКодКоробки		= НайтиСсылкаШтрихКодКоробки(Строка_К12);
							Иначе
								//Проверить возможно это QR код
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				ОбъектРеализация.ШтучныеQR_Коды.Очистить();
				Для каждого СтрокаИзФайла из СтрокиТабЧастиКодыЧЗ_ТаблQR Цикл
					Строка_К13	=	СокрЛП(СтрокаИзФайла.К_13);	
					Если ЗначениеЗаполнено(Строка_К13) Тогда 
						Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
						Если НЕ Номенклатура.Пустая() Тогда
							Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
							Если Сред(Строка_К13,1,5)="01046" Тогда
								НоваяСтр_СписокQR_Код	=	ОбъектРеализация.ШтучныеQR_Коды.Добавить();	
								НоваяСтр_СписокQR_Код.Номенклатура		= Номенклатура.Ссылка;
								НоваяСтр_СписокQR_Код.СерияНоменклатуры	= ?(Серия.Пустая(),Справочники.СерииНоменклатуры.ПустаяСсылка(),Серия);
								НоваяСтр_СписокQR_Код.QR_Код_Входящий	= СокрЛП(Строка_К13); 
								НоваяСтр_СписокQR_Код.QR_Код_Сопоставлен= СопоставлениеКИЗ(НоваяСтр_СписокQR_Код.QR_Код_Входящий);
							Иначе
								//Проверить возможно это QR код
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				//Если НЕ ДокументРеализация.Контрагент.ИНН = КонтрагентИНН Тогда
				//	ТекстСтроки = "" + ТекущаяДата() + " В документе " + ДокументРеализация + " ИНН контрагента не совпадает с данными файла. ИНН" + КонтрагентИНН + Символы.ПС;
				//	ТекстЛога.Записать(ТекстСтроки);
				//	Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				//	Продолжить;
				//КонецЕсли;
				
				//ТаблицаОтгружено = ОбъектРеализация.абс_Отгружено;
				//ТаблицаОтгружено.Очистить();
				//
				//Для каждого СтрокаИзФайла из СтрокиТабЧастиДокументаИзФайла Цикл
				//	//+Лео Сафонов. В связи с изменением НДС у номенклатуры, добавлять "_18%" к артикулу если контрагент в списке 23.01.2016
				//	//Удалить код после окончательной ратации номенклатуры
				//	МассивКонтрагентов = новый Массив();
				//	//МассивКонтрагентов.Добавить("7825706086");  //Агроторг ООО
				//	//МассивКонтрагентов.Добавить("7743543232");  //АТАК ООО
				//	//МассивКонтрагентов.Добавить("7703270067");  //АШАН ООО
				//    МассивКонтрагентов.Добавить("5047085094");  //Бэст Прайс ООО
				//	//МассивКонтрагентов.Добавить("7743543761");  //ГИПЕРГЛОБУС ООО
				//	МассивКонтрагентов.Добавить("5047081220");  //Инвестпроект ООО (Монетка)
				//	//МассивКонтрагентов.Добавить("7715196234");  //Копейка-Москва ООО
				//	//МассивКонтрагентов.Добавить("7713527850");  //Новый импульс-50 ООО (Утконос)
				//	//МассивКонтрагентов.Добавить("2310031475");  //ТАНДЕР АО
				//	//МассивКонтрагентов.Добавить("7728029110");  //ТД ПЕРЕКРЕСТОК ЗАО
				//	//МассивКонтрагентов.Добавить("7721511903");  //БИЛЛА ООО
				//	//МассивКонтрагентов.Добавить("5050058510");  //Зельгрос ООО

				//	МассивАртикулов = новый Массив();
				//	МассивАртикулов.Добавить("132337");
				//	МассивАртикулов.Добавить("132336");
				//	МассивАртикулов.Добавить("132331");
				//	МассивАртикулов.Добавить("132330");
				//	МассивАртикулов.Добавить("132329");
				//	МассивАртикулов.Добавить("132328");
				//	МассивАртикулов.Добавить("132327");
				//	МассивАртикулов.Добавить("132325");
				//	МассивАртикулов.Добавить("132324");
				//	МассивАртикулов.Добавить("132323");
				//	МассивАртикулов.Добавить("132322");
				//	МассивАртикулов.Добавить("132319");
				//	МассивАртикулов.Добавить("132318");
				//	МассивАртикулов.Добавить("132307");
				//	МассивАртикулов.Добавить("132306");
				//	МассивАртикулов.Добавить("132305");
				//	МассивАртикулов.Добавить("132304");
				//	МассивАртикулов.Добавить("132303");
				//	МассивАртикулов.Добавить("132302");
				//	МассивАртикулов.Добавить("132301");


				//	Если МассивКонтрагентов.Найти(ДокументРеализация.Контрагент.ИНН) <> Неопределено Тогда
				//		Если МассивАртикулов.Найти(СтрокаИзФайла.К_5) <> Неопределено Тогда 
				//			СтрокаИзФайла.К_5 = СтрокаИзФайла.К_5 + "_18%";
				//		КонецЕсли;
				//	КонецЕсли;
				//	//-Лео Сафонов. В связи с изменением НДС у номенклатуры, обрезать из артикула "_18%" 23.01.2016
				//	
				//	
				//	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
				//	Если НЕ Номенклатура.Пустая() Тогда
				//		СтрокаОтгружено = ТаблицаОтгружено.Добавить();
				//		СтрокаОтгружено.Номенклатура = Номенклатура;
				//	Иначе
				//		ТекстСтроки = "" + ТекущаяДата() + " Не найдена номенклатура по Артикулу. Артикул в файле:" + СтрокаИзФайла.К_5 + "." + Символы.ПС ;
				//		ТекстЛога.Записать(ТекстСтроки);
				//		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				//		Продолжить;
				//	КонецЕсли;
				//	
				//	СтрокаОтгружено.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
				//	//ТекстСтроки = "" + ТекущаяДата() + " Не найдена единица """ + Строка.EdIzm + """по Артикулу. Артикул в файле:" + СтрокаИзФайла.KodTMC + "." + Символы.ПС ;
				//	
				//	
				//	Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
				//	Если Не Серия = Справочники.СерииНоменклатуры.ПустаяСсылка()Тогда
				//		СтрокаОтгружено.СерияНоменклатуры = Серия;
				//	Иначе	
				//		ТекстСтроки = "" + ТекущаяДата() + " Не найдена серия """ + СтрокаИзФайла.К_8 + """по Артикулу. Артикул в файле:" + СтрокаИзФайла.К_5 + "." + Символы.ПС ;
				//		ТекстЛога.Записать(ТекстСтроки);
				//		Сообщить(ТекстСтроки,СтатусСообщения.Важное);
				//		//Продолжить
				//	КонецЕсли;
				//	
				//	СтрокаОтгружено.Количество = СтрокаИзФайла.К_7;  
				//	
				//	//Если ЗначениеЗаполнено(СтрокаИзФайла.К_12) Тогда
				//	//ЗаполнитьТабличнуюЧастьДокументаРеализация(ОбъектРеализация, Номенклатура, СтрокаИзФайла.К_12);
				//	//КонецЕсли;
				//КонецЦикла;
				//
				////проверим на расхождения
				//флРасхождения = ЛОЖЬ;
				//тзОтгружено = ТаблицаОтгружено.Выгрузить();
				//тзОтгружено.Свернуть("Номенклатура,СерияНоменклатуры","Количество");
				//СтруктураПоиска = Новый Структура("Номенклатура,СерияНоменклатуры");
				//Для Каждого СтрокаТовары Из ОбъектРеализация.Товары Цикл
				//	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовары);
				//	мСтроки = тзОтгружено.НайтиСтроки(СтруктураПоиска);
				//	Если мСтроки.Количество() = 0 Тогда
				//		флРасхождения = Истина;
				//	ИначеЕсли мСтроки[0].Количество <> СтрокаТовары.Количество Тогда
				//		флРасхождения = Истина;
				//	КонецЕсли;						
				//	Если флРасхождения Тогда
				//		Прервать;
				//	КонецЕсли;
				//КонецЦикла;
				//
				//Если флРасхождения Тогда
				//	ТекстСтроки = "" + ТекущаяДата() + " По документу " + ДокументРеализация + " зафиксированы расхождения!";
				//	ТекстЛога.Записать(ТекстСтроки);
				//	Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				//	
				//	//ОбъектЗаказ.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ОтгруженЛогОператоромСРасхождениями;
				//	//ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Ошибка;
				//	//ОбъектРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.Ошибка;
				//Иначе	
				//	//ОбъектЗаказ.ЛеоСтатусОбменаСЛогоператором = Перечисления.Лео_СтатусыОбменаСЛогистическимОператором.ОтгруженЛогОператором;
				//	//ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен;
				//	//ОбъектРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.Отгружен;
				//КонецЕсли;
				
				
				
				
				Попытка
					Если НЕ ОбъектРеализация.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда 
						//Отгружен более высокий статус и его не надо перебивать.
						ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка;
						ОбъектРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка;
						Сообщить("Данные по документу "+ДокументРеализация+" успешно обновлены по акту (информация по наличию кодов ЧЗ)");
					КонецЕсли;
					ОбъектРеализация.Записать(РежимЗаписиДокумента.Проведение);
					//ТекстСтроки = "" + ТекущаяДата() + " Проведен документ " + ДокументРеализация;
					//ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					//СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					//СтрокаТаб.СсылкаДокумент  = ОбъектРеализация.Ссылка;
					//СтрокаТаб.Расхождение = флРасхождения;
				Исключение
					ТекстСтроки = "" + ТекущаяДата() + " Ошибка проведения документа " + ДокументРеализация + "." + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;
				
				Попытка
					//ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
					//ТекстСтроки = "" + ТекущаяДата() + " Записан документ " + ОбъектЗаказ.Ссылка;
					//ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);

					////проведение заказа по регистру абс_НеотгруженныеТовары					
					//Если ОбъектЗаказ.Ссылка.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ОбъектЗаказ.Ссылка.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
					//	абс_Дистрибуция.СформироватьДвиженияПоНеотгруженнымТоварам(ОбъектЗаказ);
					//	ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
					//КонецЕсли;

					//ТекстСтроки = "" + ТекущаяДата() + " Сформированы движения для отчета: Анализ неотгруженных товаров " + ОбъектЗаказ.Ссылка;
					//ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);

				Исключение
					ТекстСтроки = "" + ТекущаяДата() + " Ошибка записи документа " + ОбъектЗаказ.Ссылка + "." + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;

				////проведение заказа по регистру абс_НеотгруженныеТовары
				//Если ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
				//	абс_Дистрибуция.СформироватьДвиженияПоНеотгруженнымТоварам(ОбъектЗаказ.Ссылка);
				//КонецЕсли;
				
			КонецЦикла;
			//- Сгруппированная таблица  ТабЗначДок.
		КонецЦикла;
		Сообщить("Завершена обработка файлов");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	    Сообщить(НСтр("ru=""Описание="";en=""Description=""") + Инфо.Описание + """");
	    Сообщить(НСтр("ru=""ИмяМодуля="";en=""ModuleName=""") + Инфо.ИмяМодуля + """");
	    Сообщить(НСтр("ru=""НомерСтроки="";en=""LineNumber=""") + Инфо.НомерСтроки);
	    Сообщить(НСтр("ru=""ИсходнаяСтрока="";en=""SourceLine=""") + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;

	//-Обход массива файлов
	ТекстЛога.Закрыть();
		
КонецПроцедуры  

Функция СопоставлениеКИЗ(QR_Код_Входящий)
	//Ищем соответствие
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	Лео_СкладQRКоды_ВведеноВОборот.Код_КМ
	            	 	|ИЗ
	            	 	|	РегистрСведений.Лео_СкладQRКоды_ВведеноВОборот КАК Лео_СкладQRКоды_ВведеноВОборот
	            	 	|ГДЕ
	            	 	|	Лео_СкладQRКоды_ВведеноВОборот.Код_КМ ПОДОБНО &Код_КИЗ";
	Запрос.УстановитьПараметр("Код_КИЗ",""+Сред(QR_Код_Входящий,1,31)+"%");
    Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;  
	КонецЕсли;	   
	Возврат Ложь;  
КонецФункции

//перечень складов товаров СиУ
СписокСкладСиУ	=	Новый СписокЗначений; 
СписокСкладСиУ.Добавить(Справочники.Склады.НайтиПоКоду("000000075"));   //КАРАНТИН МОЛКОМ (СЫРЬЕ)
СписокСкладСиУ.Добавить(Справочники.Склады.НайтиПоКоду("000000060"));   //СКЛАД МОЛКОМ (СЫРЬЕ)
СписокСкладСиУ.Добавить(Справочники.Склады.НайтиПоКоду("000000107"));   //СКЛАД МОЛКОМ (БРАК СЫРЬЕ)
СписокСкладСиУ.Добавить(Справочники.Склады.НайтиПоКоду("000000095"));   //КАРАНТИН МОЛКОМ (УПАКОВКА)
СписокСкладСиУ.Добавить(Справочники.Склады.НайтиПоКоду("000000061"));   //СКЛАД МОЛКОМ (МАТЕРИАЛЫ)
СписокСкладСиУ.Добавить(Справочники.Склады.НайтиПоКоду("000000074"));   //СКЛАД МОЛКОМ (НЕЛИКВИДЫ)


СписокСкладГП	=	Новый СписокЗначений;
СписокСкладГП.Добавить(Справочники.Склады.НайтиПоКоду("000000043"));   //Склад Молком
СписокСкладГП.Добавить(Справочники.Склады.НайтиПоКоду("000000047"));   //Склад Молком карантин
СписокСкладГП.Добавить(Справочники.Склады.НайтиПоКоду("000000024"));   //Склад Транзитный
СписокСкладГП.Добавить(Справочники.Склады.НайтиПоКоду("000000053"));   //КАРАНТИН СЫРЬЕ
