
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.абс_СтраховойЗапас.Записывать = Истина;
	Движения.абс_СтраховойЗапас.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.абс_СтраховойЗапас.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Дней = ТекСтрокаТовары.Дней;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
