&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("ПланПроизводства_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	Если Объект.ПериодичностьДетализации = Перечисления.Периодичность.ПустаяСсылка() Тогда
		ТекущаяПериодичность = Перечисления.Периодичность.День;
	Иначе
		ТекущаяПериодичность = Объект.ПериодичностьДетализации;
	КонецЕсли;
	Если Объект.Сценарий.Периодичность = Перечисления.Периодичность.ПустаяСсылка() Тогда
		ПеиодичностьПлана = Перечисления.Периодичность.Год;
	Иначе
		ПериодичностьПлана = Объект.Сценарий.Периодичность;
	КонецЕсли;
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	дПериодПланирования = НачалоДня(обОбъект.ДатаПланирования);
	
	Макет = Документы.ПланПроизводства.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаКлиентНоменклатура 	= Макет.ПолучитьОбласть("Шапка|КлиентНоменклатура");
	ОбластьШапкаПериод 				= Макет.ПолучитьОбласть("Шапка|Период");
	ОбластьСтрокаКлиентНоменклатура = Макет.ПолучитьОбласть("Строка|КлиентНоменклатура");
	ОбластьСтрокаПериод			 	= Макет.ПолучитьОбласть("Строка|Период");
	
	//нарисуем шапку
	ТабДок.Вывести(ОбластьШапкаКлиентНоменклатура);
	
	НачалоПериода = Объект.ДатаПланирования;
	КонецПериода = Объект.ДатаПланирования;
	
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(НачалоПериода, ПериодичностьПлана);
	УправлениеПланированием.ВыровнятьДатуПоКонцуПериода(КонецПериода, ПериодичностьПлана);
	
	КоличествоДнейВПериоде = (НачалоДня(КонецПериода) - НачалоПериода)/86400 + 1;
	
	МассивПериодов = Новый Массив;
	
	Для Сч = 0 По КоличествоДнейВПериоде-1 Цикл
		Период = НачалоПериода + Сч * 86400;
		УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Период, ТекущаяПериодичность);
		Если МассивПериодов.Найти(Период) = Неопределено Тогда
			ОбластьШапкаПериод.Параметры.Период = Период;		
			ТабДок.Присоединить(ОбластьШапкаПериод);		
			МассивПериодов.Добавить(Период);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПроизводстваСоставПлана.Период КАК Период,
		|	ПланПроизводстваСоставПлана.Номенклатура КАК Номенклатура,
		|	ПланПроизводстваСоставПлана.Номенклатура.Артикул КАК Артикул,
		|	ПланПроизводстваСоставПлана.Количество КАК Количество
		|ИЗ
		|	Документ.ПланПроизводства.СоставПлана КАК ПланПроизводстваСоставПлана
		|ГДЕ
		|	ПланПроизводстваСоставПлана.Ссылка = &Ссылка
		|	И ПланПроизводстваСоставПлана.Номенклатура ССЫЛКА Справочник.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура,
		|	Период ПЕРИОДАМИ("+Строка(ТекущаяПериодичность)+", &НачПериода, &КонПериода)";

	Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
	Запрос.УстановитьПараметр("НачПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецПериода);

	Результат = Запрос.Выполнить();

	ВыборкаКлиентНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаКлиентНоменклатура.Следующий() Цикл
		
		ОбластьСтрокаКлиентНоменклатура.Параметры.Заполнить(ВыборкаКлиентНоменклатура);
	  	ТабДок.Вывести(ОбластьСтрокаКлиентНоменклатура);

		ВыборкаПериод = ВыборкаКлиентНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

		Пока ВыборкаПериод.Следующий() Цикл
			ОбластьСтрокаПериод.Параметры.Заполнить(ВыборкаПериод);
			ТабДок.Присоединить(ОбластьСтрокаПериод);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

