Процедура ПриЗаписи(Отказ,Замещение)
	
	МассивНоменклатуры = Новый Массив;
	Для каждого Запись из ЭтотОбъект Цикл
		Если Запись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя Тогда
			Если МассивНоменклатуры.Найти(Запись.Номенклатура) = Неопределено Тогда
				МассивНоменклатуры.Добавить(Запись.Номенклатура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если МассивНоменклатуры.Количество()>0 Тогда
		абс_Дистрибуция.ЗаполнитьАртикулыПокупателяПоЗаписиРегистра(МассивНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры