
&НаКлиенте
Процедура ТекущийПериодПриИзменении(Элемент)
	
	Объект.ТекущийПериод = НачалоМесяца(Объект.ТекущийПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеБухФакта(Команда)
		
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.СоставБюджета.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ВнешнийФайл);
	
	Если НЕ АдресФайлаВХранилище = Неопределено Тогда
				
		ЗагрузитьБухФактИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьБухФактИзФайлаСервер(АдресФайлаВХранилище)
	
	//	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);   ///Никитин
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel_Леовит(АдресФайлаВХранилище);

	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеБухФактаСервер(ТабДок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеБухФактаСервер(ТабДок)
			
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблицеБухФакта(ТабДок);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры



&НаКлиенте
Процедура КомандаСортироватьПоСтатье(Команда)
	
	КомандаСортироватьПоСтатьеСервер();	
	
КонецПроцедуры

&НаСервере
Процедура КомандаСортироватьПоСтатьеСервер() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.СортироватьСоставБюджетаПоСтатье(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьПоКонтрагенту(Команда)
	
	КомандаСортироватьПоКонтрагентуСервер();
	
КонецПроцедуры

&НаСервере
Процедура КомандаСортироватьПоКонтрагентуСервер() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.СортироватьСоставБюджетаПоКонтрагенту(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактДДС(Команда)
	
	ЕстьОшибки = Ложь;
	
	Если Объект.Организация.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", ЕстьОшибки);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.ТекущийПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран текущий период", ЕстьОшибки);
	КонецЕсли;	
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.СоставБюджетаДДС.Количество()>0 Тогда
		Если Вопрос("Данные по текущему периоду будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьФактДДССервер();
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

Процедура ЗаполнитьФактДДССервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	ЭтотОбъект.ЗаполнитьФактДДС(ЭтотОбъект);
	
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьСкрытьБДДС(Команда)
	
	Элементы.БДДС.Пометка = НЕ Элементы.БДДС.Пометка;
	
	УстановитьВидимостьБДДС(Элементы.БДДС.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьБДДС(ВидимостьБДДС)
	
	Элементы.СоставБюджетаДДС.Видимость = ВидимостьБДДС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.БДДС.Пометка = Истина;
	
	УстановитьВидимостьБДДС(Элементы.БДДС.Пометка);
	
КонецПроцедуры



