
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ПланСуммаБезНДС		= ЭтаФорма.Параметры.ПланСуммаБезНДС;
	ЭтаФорма.ПланСумма				= ЭтаФорма.Параметры.ПланСумма;
	ЭтаФорма.ПланКоличество			= ЭтаФорма.Параметры.ПланКоличество;
	
	ЭтаФорма.ОперФактСуммаБезНДС	= ЭтаФорма.Параметры.ОперФактСуммаБезНДС;
	ЭтаФорма.ОперФактСумма			= ЭтаФорма.Параметры.ОперФактСумма;
	ЭтаФорма.ОперФактКоличество		= ЭтаФорма.Параметры.ОперФактКоличество;	
	
	ЭтаФорма.БухФактСуммаБезНДС		= ЭтаФорма.Параметры.БухФактСуммаБезНДС;
	ЭтаФорма.БухФактСумма			= ЭтаФорма.Параметры.БухФактСумма;
	ЭтаФорма.БухФактКоличество		= ЭтаФорма.Параметры.БухФактКоличество;
	
	ЭтаФорма.ФактСуммаБезНДС		= ЭтаФорма.Параметры.ФактСуммаБезНДС;
	ЭтаФорма.ФактСумма				= ЭтаФорма.Параметры.ФактСумма;	
	ЭтаФорма.ФактКоличество			= ЭтаФорма.Параметры.ФактКоличество;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(Команда)
	
	СтруктураПараметров = Новый Структура;

	СтруктураПараметров.Вставить("ПланСуммаБезНДС"		, ЭтаФорма.ПланСуммаБезНДС);
	СтруктураПараметров.Вставить("ПланСумма"			, ЭтаФорма.ПланСумма);
	СтруктураПараметров.Вставить("ПланКоличество"		, ЭтаФорма.ПланКоличество);
	
	СтруктураПараметров.Вставить("ОперФактСуммаБезНДС"	, ЭтаФорма.ОперФактСуммаБезНДС);
	СтруктураПараметров.Вставить("ОперФактСумма"		, ЭтаФорма.ОперФактСумма);
	СтруктураПараметров.Вставить("ОперФактКоличество"	, ЭтаФорма.ОперФактКоличество);
	
	СтруктураПараметров.Вставить("БухФактСуммаБезНДС"	, ЭтаФорма.БухФактСуммаБезНДС);
	СтруктураПараметров.Вставить("БухФактСумма"			, ЭтаФорма.БухФактСумма);
	СтруктураПараметров.Вставить("БухФактКоличество"	, ЭтаФорма.БухФактКоличество);
	
	СтруктураПараметров.Вставить("ФактСуммаБезНДС"		, ЭтаФорма.ФактСуммаБезНДС);
	СтруктураПараметров.Вставить("ФактСумма"			, ЭтаФорма.ФактСумма);	
	СтруктураПараметров.Вставить("ФактКоличество"		, ЭтаФорма.ФактКоличество);	
	
	Оповестить("УстановитьВидимость", СтруктураПараметров,ЭтаФорма);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
