 Процедура ЗаписатьСостояниеДокументовСогласования(ТекДокумент, ТекСостояние, ТекЭтап, ТекУровень, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекДокумент) Тогда
		Возврат;
	КонецЕсли;
	МетаданныеДокумента=ТекДокумент.Метаданные();
	Если МетаданныеДокумента.Реквизиты.Найти("ЭтапСогласования")=Неопределено И МетаданныеДокумента.Реквизиты.Найти("абс_ЭтапСогласования")=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Об = ТекДокумент.ПолучитьОбъект();
	Если Не МетаданныеДокумента.Реквизиты.Найти("абс_ЭтапСогласования")=Неопределено Тогда
		Если ТекДокумент.Состояние = ТекСостояние И ТекДокумент.абс_ЭтапСогласования = ТекЭтап Тогда
			Возврат;
		КонецЕсли;
		Об.Состояние 				= ТекСостояние;
		Об.абс_ЭтапСогласования 	= ТекЭтап;
		Об.абс_УровеньСогласования 	= ТекУровень;
	ИначеЕсли Не МетаданныеДокумента.Реквизиты.Найти("ЭтапСогласования")=Неопределено Тогда
		
		Если ТекДокумент.Состояние = ТекСостояние И ТекДокумент.ЭтапСогласования = ТекЭтап Тогда
			Возврат;
		КонецЕсли;
		
		
		Об.Состояние 			= ТекСостояние;
		Об.ЭтапСогласования 	= ТекЭтап;
		Об.УровеньСогласования 	= ТекУровень;
	КонецЕсли;
	
	Попытка 
		Об.ОбменДанными.Загрузка = Истина;
		Об.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать состояние " + ТекДокумент + " " + ТекСостояние + ".", Отказ);
	КонецПопытки;
	
КонецПроцедуры
		   