
Функция ПолучитьТабличныйДокументПоФайлуExcel(ПутьКФайлу) Экспорт
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось открыть файл. ", ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	ТабДок = Новый ТабличныйДокумент;
	
	//рассчитаем количество колонок по шапке
	//считаем что шапка состоит из двух строк
	ТекущаяКолонка = 1;
	
	ТекущееЗначение1 = СокрЛП(ExcelЛист.Cells(1, ТекущаяКолонка).Value);
	ТекущееЗначение2 = СокрЛП(ExcelЛист.Cells(2, ТекущаяКолонка).Value);
	
	Пока ЗначениеЗаполнено(ТекущееЗначение1) или ЗначениеЗаполнено(ТекущееЗначение2) Цикл
		ТабДок.Область(1, ТекущаяКолонка, 1, ТекущаяКолонка).Текст = ТекущееЗначение1;
		ТабДок.Область(2, ТекущаяКолонка, 2, ТекущаяКолонка).Текст = ТекущееЗначение2;
		ТекущаяКолонка = ТекущаяКолонка + 1;
		ТекущееЗначение1 = СокрЛП(ExcelЛист.Cells(1, ТекущаяКолонка).Value);
		ТекущееЗначение2 = СокрЛП(ExcelЛист.Cells(2, ТекущаяКолонка).Value);
	КонецЦикла;
	
	КоличествоКолонок = ТекущаяКолонка - 1;
	
	ТекущаяСтрока = 3;
	ТекущаяКолонка = 1;
	ТекущееЗначение = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
	
	КоличествоСтрок	= ExcelЛист.UsedRange.Rows.Count;
	
	Для ТекущаяСтрока = 3 По КоличествоСтрок Цикл
	               
		Пока ТекущаяКолонка<=КоличествоКолонок Цикл
			
			ТекущееЗначение = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
			
			ТабДок.Область(ТекущаяСтрока, ТекущаяКолонка, ТекущаяСтрока, ТекущаяКолонка).Текст = ТекущееЗначение;
			
			ТекущаяКолонка = ТекущаяКолонка + 1;
			
		КонецЦикла;
		
		ТекущаяКолонка = 1; 
		
	КонецЦикла;
	
	Excel.Quit();
	
	Возврат ТабДок;
	
КонецФункции
