Процедура ЗаполнитьСертификаты(Объект) Экспорт
	
	ТЧ_Товары = Объект.Товары;
	ТЧ_ВыгруженныеТовары = ТЧ_Товары.Выгрузить(, "Номенклатура,СерияНоменклатуры");
	
	
	//+Лео Сафонов ЕА
	//Подбор сертификатов на дату производства
	
	//ЗапросСертификаты = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(ВТТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	//|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	//|ИЗ
	//|	&ТоварыДокумента КАК ВТТоварыДокумента
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ТоварыДокумента.Номенклатура,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияСоответствия,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСвидетельствоОГосрегистрации,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСертификатСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСоответствия,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияТаможенногоСоюза,
	//|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ) КАК ОбязательноДекларацияСоответствия,
	//|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ) КАК ОбязательноДекларацияТаможенногоСоюза,
	//|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ) КАК ОбязательноСвидетельствоОГосрегистрации,
	//|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ) КАК ОбязательноСертификатСоответствия
	//|ИЗ
	//|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияСоответствия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияСоответствия.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовДекларацияСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияСоответствия.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовДекларацияСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСвидетельствоОГосрегистрации
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСертификатСоответствия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСертификатСоответствия.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовСертификатСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСертификатСоответствия.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовСертификатСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СертификатСоответствия))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияТаможенногоСоюза
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовСертификатСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияСоответствия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	//|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	//|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	//|			И (СвойстваДекларацияСоответствия.Свойство = &СвойствоДекларацияСоответствия)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияТаможенногоСоюза
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияТаможенногоСоюза.Объект
	//|			И (СвойстваДекларацияТаможенногоСоюза.Свойство = &СвойствоДекларацияТаможенногоСоюза)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСвидетельсвоОГосрегистрации
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСвидетельсвоОГосрегистрации.Объект
	//|			И (СвойстваСвидетельсвоОГосрегистрации.Свойство = &СвойствоСвидетельсвоОГосрегистрации)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСертификатСоответсвия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСертификатСоответсвия.Объект
	//|			И (СвойстваСертификатСоответсвия.Свойство = &СвойствоСертификатСоответсвия)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ТоварыДокумента.Номенклатура,
	//|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ),
	//|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ),
	//|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ),
	//|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ)");
	
	ЗапросСертификаты = Новый Запрос(	
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВТТоварыДокумента.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	&ТоварыДокумента КАК ВТТоварыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияСоответствия,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСвидетельствоОГосрегистрации,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСертификатСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСоответствия,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияТаможенногоСоюза,
	|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ) КАК ОбязательноДекларацияСоответствия,
	|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ) КАК ОбязательноДекларацияТаможенногоСоюза,
	|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ) КАК ОбязательноСвидетельствоОГосрегистрации,
	|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ) КАК ОбязательноСертификатСоответствия
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияСоответствия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияСоответствия.Номенклатура
	|			И (абс_ТоварыСертификатовДекларацияСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия))
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовДекларацияСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияСоответствия.ДатаОкончанияДействияСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСвидетельствоОГосрегистрации
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Номенклатура
	|			И (абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации))
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаОкончанияДействияСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСертификатСоответствия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСертификатСоответствия.Номенклатура
	|			И (абс_ТоварыСертификатовСертификатСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СертификатСоответствия))
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовСертификатСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСертификатСоответствия.ДатаОкончанияДействияСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияТаможенногоСоюза
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Номенклатура
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаОкончанияДействияСертификата)
	|			И (абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияСоответствия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	|			И (СвойстваДекларацияСоответствия.Свойство = &СвойствоДекларацияСоответствия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияТаможенногоСоюза
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияТаможенногоСоюза.Объект
	|			И (СвойстваДекларацияТаможенногоСоюза.Свойство = &СвойствоДекларацияТаможенногоСоюза)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСвидетельсвоОГосрегистрации
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСвидетельсвоОГосрегистрации.Объект
	|			И (СвойстваСвидетельсвоОГосрегистрации.Свойство = &СвойствоСвидетельсвоОГосрегистрации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСертификатСоответсвия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСертификатСоответсвия.Объект
	|			И (СвойстваСертификатСоответсвия.Свойство = &СвойствоСертификатСоответсвия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ),
	|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ),
	|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ),
	|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ)");
	
	ЗапросСертификаты.УстановитьПараметр("ТоварыДокумента", ТЧ_ВыгруженныеТовары);
	
	//Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
	//	ЗапросСертификаты.УстановитьПараметр("ДатаОтгрузки", Объект.ДатаОтгрузки);
	//ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
	//	ЗапросСертификаты.УстановитьПараметр("ДатаОтгрузки", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	//КонецЕсли;
	//-Лео Сафонов ЕА
	
	ЗапросСертификаты.УстановитьПараметр("СвойствоДекларацияСоответствия", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДекларацияСоответствия);
	ЗапросСертификаты.УстановитьПараметр("СвойствоДекларацияТаможенногоСоюза", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДекларацияТаможенногоСоюза);
	ЗапросСертификаты.УстановитьПараметр("СвойствоСвидетельсвоОГосрегистрации", ПланыВидовХарактеристик.СвойстваОбъектов.абс_СвидетельствоОГосрегистрации);
	ЗапросСертификаты.УстановитьПараметр("СвойствоСертификатСоответсвия", ПланыВидовХарактеристик.СвойстваОбъектов.абс_СертификатСоответствия);
	
	
	Выборка = ЗапросСертификаты.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокиПоНоменклатуре = ТЧ_Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
		
		Для Каждого СтрокаПоНоменклатуре Из СтрокиПоНоменклатуре Цикл
			ЗаполнитьЗначенияСвойств(СтрокаПоНоменклатуре, Выборка, "абс_СертификатДекларацияСоответствия, абс_СертификатСвидетельствоОГосрегистрации, абс_СертификатСоответствия, абс_СертификатДекларацияТаможенногоСоюза");
			Если Выборка.ОбязательноДекларацияСоответствия И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатДекларацияСоответствия) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнена декларация соответствия");
			КонецЕсли;
			Если Выборка.ОбязательноДекларацияТаможенногоСоюза И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатДекларацияТаможенногоСоюза) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнена декларация таможенного союза");
			КонецЕсли;
			Если Выборка.ОбязательноСвидетельствоОГосрегистрации И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатСвидетельствоОГосрегистрации) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнено свидетельство о госрегистрации");
			КонецЕсли;
			Если Выборка.ОбязательноСертификатСоответствия И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатСоответствия) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнен сертификат соответствия");
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры