Процедура Инициализировать(Объект, ИмяТабличнойЧасти, ТабличноеПоле) Экспорт
	
	Если ИмяТабличнойЧасти <> "Товары" Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если НЕ ТабличноеПоле = Неопределено Тогда
		РежимВопроса = РежимДиалогаВопрос.ДаНет;
		ТекстВопроса = "Сертификаты, введные вручную будут заменены автоматически. Продолжить?";
		Ответ = Вопрос(ТекстВопроса, РежимВопроса, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕСли;
	КонецЕсли;
	#КонецЕсли
	
	Обработки.абс_ЗаполнитьСертификаты.ЗаполнитьСертификаты(Объект);
	
КонецПроцедуры

Функция ЗаполнитьСертификатНаПартию(Строка)
	
	Если Не ЗначениеЗаполнено(Строка.СерияНоменклатуры) Тогда
		Сообщить("в строку " + Строка.НомерСтроки + " не подобран сертификат на партию");		
		Возврат Документы.абс_СертификатНаТовары.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТоварыСертификатов.Регистратор
	|ИЗ
	|	РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатов
	|ГДЕ
	|	абс_ТоварыСертификатов.Номенклатура = &Номенклатура
	|	И абс_ТоварыСертификатов.ДатаНачалаДействияСертификата >= &ДатаПроизводства
	|	И абс_ТоварыСертификатов.ДатаОкончанияДействияСертификата <= &ДатаПроизводства
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_ТоварыСертификатов.Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаПроизводства", Строка.СерияНоменклатуры.абс_ДатаПроизводства);
	Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Регистратор;
	Иначе
		Сообщить("в строку " + Строка.НомерСтроки + " не подобран сертификат на партию");
		Возврат Документы.абс_СертификатНаТовары.ПустаяСсылка();
	КонецЕсли;

КонецФункции

Функция ЗаполнитьСертификатНаОтгрузку(Строка, ДатаОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТоварыСертификатов.Регистратор       
	|ИЗ
	|	РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатов
	|ГДЕ
	|	абс_ТоварыСертификатов.Номенклатура = &Номенклатура
	|	И абс_ТоварыСертификатов.ДатаНачалаДействияСертификата >= &ДатаОтгрузки
	|	И абс_ТоварыСертификатов.ДатаОкончанияДействияСертификата <= &ДатаОтгрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_ТоварыСертификатов.Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Регистратор;
	Иначе
		Сообщить("в строку " + Строка.НомерСтроки + " не подобран сертификат на отгрузку");
		Возврат Документы.абс_СертификатНаТовары.ПустаяСсылка();
	КонецЕсли;

КонецФункции