
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка Тогда
		Объект.ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.БесплатнаяОтгрузка;
	ИначеЕсли Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.Взаимозачет Тогда
		Объект.ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.Взаимозачет;
   	ИначеЕсли Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.ПредоставлениеСкидки Тогда
		Объект.ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.ПредоставлениеСкидки;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Если Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка Тогда
		ЭтаФорма.Элементы.Товары.Видимость=Истина;
		ЭтаФорма.Элементы.СуммаДокумента.Видимость=Ложь;
	Иначе
		ЭтаФорма.Элементы.Товары.Видимость=Ложь;
		ЭтаФорма.Элементы.СуммаДокумента.Видимость=Истина;
	КонецЕсли;
	
	Если Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка 
		ИЛИ Объект.ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.ПредоставлениеСкидки Тогда
		ЭтаФорма.Элементы.Закрыта.Видимость = Ложь;
		ЭтаФорма.Элементы.РегистрЗакрыт.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.Закрыта.Видимость = Истина;
		ЭтаФорма.Элементы.РегистрЗакрыт.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РассчитатьРегистрЗакрыт()
	
	обДокумент = РеквизитФормыВЗначение("Объект");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА абс_БюджетОтделаТМОбороты.СуммаПриход = абс_БюджетОтделаТМОбороты.СуммаРасход
		|				И абс_БюджетОтделаТМОбороты.СуммаПриход <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РегистрЗакрыт
		|ИЗ
		|	РегистрНакопления.абс_БюджетОтделаТМ.Обороты(, , , ЗаявкаНаБюджетОтделаТМ = &ЗаявкаНаБюджетОтделаТМ) КАК абс_БюджетОтделаТМОбороты";

	Запрос.УстановитьПараметр("ЗаявкаНаБюджетОтделаТМ", обДокумент.Ссылка);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат ЛОЖЬ;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.РегистрЗакрыт;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	абс_СогласованиеДокументов.УстановитьДоступностьРедактирования(Объект, ЭтаФорма);
	УстановитьВидимость();
	РегистрЗакрыт = РассчитатьРегистрЗакрыт();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииНоменклатуры(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатуры(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, );
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииКоличества(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКоличества(НомерСтроки);
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];	
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияМестПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииЕдиницыМест(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЕдиницыМест(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
    ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоМестПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииКоличестваМест(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКоличестваМест(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
    ОбработкаТабличныхЧастей.РассчитатьКоличествоТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииЕдиницыИзмерения(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЕдиницыИзмерения(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииЦены(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЦены(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
    ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	НомерСтроки = ЭтаФорма.Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ПриИзмененииСуммы(НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСуммы(НомерСтроки)
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти=ЭтотОбъект.Товары[НомерСтроки-1];
	ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ПараметрыСеанса.ТекущийПользователь);
    ЗаполнитьЗначенияСвойств(Объект.Товары[НомерСтроки-1],СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначениеКопирования") Тогда
		Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
			Объект.Закрыта = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры


                                          