Процедура ПроверитьЗаполнениеТЧСоставПлана(Объект, Отказ, Заголовок) Экспорт
	
	//АБС Фролов 09.06.2014 Временно отключим контроль по реквизитам
	Возврат;
	//АБС Фролов 09.06.2014 Временно отключим контроль по реквизитам КОНЕЦ
	
	Для Каждого СтрокаТЧ из Объект.СоставПлана Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.абс_Организация) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) +
			""" табличной части ""Состав плана"": не заполнено значение реквизита ""Организация""", Отказ, Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.абс_Подразделение) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) +
			""" табличной части ""Состав плана"": не заполнено значение реквизита ""Подразделение""", Отказ, Заголовок);
		КонецЕсли;
		//АБС 28.05.2014 44000
		Если Объект.Подразделение <> СтрокаТЧ.Контрагент.абс_БизнесРегион.абс_Подразделение Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке номер """+ СокрЛП(СтрокаТЧ.НомерСтроки) +
			""" табличной части ""Состав плана"": не совпадает значение реквизита  ""Подразделение"" из бизнес-региона в карточке контрагента и реквизита ""Подразделение"" указанного в шапке документа", Отказ, Заголовок);
		КонецЕсли;
		//АБС 28.05.2014 44000
	КонецЦикла;
	
КонецПроцедуры