
&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			Объект.СоставБюджета.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
    ЗаполнитьСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиНИС(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриИзменении(Элемент)
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;	
		                          
	Если Найти(ИмяТекКолонки, "Сумма") > 0 Тогда
		
		ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогСуммаНачисления 			= 0;
	ИтогСуммаОплаты 				= 0;
	ИтогСуммаКОплатеДополнительно	= 0;
	
	Для Н = 1 По 12 Цикл
		
		ИтогСуммаНачисления 			= ИтогСуммаНачисления 				+ ТекДанные["СуммаНачисления" 			+ Н];
		ИтогСуммаОплаты 				= ИтогСуммаОплаты 					+ ТекДанные["СуммаОплаты" 				+ Н];
		ИтогСуммаКОплатеДополнительно 	= ИтогСуммаКОплатеДополнительно 	+ ТекДанные["СуммаКОплатеДополнительно" + Н];
		
	КонецЦикла;
	
	ТекДанные.СуммаНачисленияИтог 			= ИтогСуммаНачисления;
	ТекДанные.СуммаОплатыИтог 				= ИтогСуммаОплаты;
	ТекДанные.СуммаКОплатеДополнительноИтог	= ИтогСуммаКОплатеДополнительно;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПередУдалением(Элемент, Отказ)
	
	Если Вопрос("Удалить строку?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры



