
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьПутевогоЛиста(ПараметрКоманды);
	ПараметрыПечати=Новый Структура;
	ПараметрыПечати.Вставить("Автомасштаб",Истина);
	ПараметрыПечати.Вставить("ОриентацияСтраницы",ОриентацияСтраницы.Ландшафт);
	ПараметрыПечати.Вставить("ОтображатьЗаголовки", Ложь);
	ПараметрыПечати.Вставить("ОтображатьСетку", Ложь);
	ПараметрыПечати.Вставить("ТолькоПросмотр", Истина);
	ПараметрыПечати.Вставить("Защита", Ложь);
	ПараметрыПечати.Вставить("ИмяПараметровПечати", "");
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, Ложь, "Путевой лист", ПараметрКоманды, ПараметрыПечати);
КонецПроцедуры
