
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Если используется механизм согласования заявок, и заявка еще не прошла по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Состояние = Выборка.Состояние;
	Иначе
		Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
	КонецЕсли;
	
	Если Состояние = Перечисления.СостоянияОбъектов.Отклонен или Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку 
		ИЛИ НЕ ЗначениеЗаполнено(Состояние) Тогда
		Состояние = Перечисления.СостоянияОбъектов.Подготовлен; 
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по согласованию:
	
	//Если используется механизм согласования документов , и документ еще не прошел по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	//Если Состояние = Перечисления.СостоянияОбъектов.Отклонен или Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку 
	//	ИЛИ НЕ ЗначениеЗаполнено(Состояние) Тогда
	//		//Ответ = Вопрос("Отправить на согласование?",РежимДиалогаВопрос.ДаНет);
	//	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	 Состояние = Перечисления.СостоянияОбъектов.Подготовлен; 
	//   // КонецЕсли;
	//КонецЕсли;
	
	
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу,Дата) Тогда
		Если Состояние = Перечисления.СостоянияОбъектов.Подготовлен Тогда
			Запрос = Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние = Перечисления.СостоянияОбъектов.Отклонен или Выборка.Состояние = Перечисления.СостоянияОбъектов.Лео_ОтправленНаДоработку Тогда
					МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					// Повторно
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.Активность = Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
					НоваяЗапись.Этап = МаршрутСогласования;
					НоваяЗапись.ТекущийЭтап = "Начальный";
					НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
					Попытка
						НоваяЗапись.Комментарий = ДополнительныеСвойства.КомментарийИнициатора;
					Исключение
					КонецПопытки;   
					НаборЗаписейСостояниеСогласования.Записать();
					ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
					ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования, НоваяЗапись.Состояние);
					
					Возврат;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Состояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
			ДвиженияПоРегиструСкидок();
			Возврат;
		КонецЕсли;
		
		Если НаборЗаписейСостояниеСогласования.Количество() > 1   Тогда
			Возврат;
		КонецЕсли;
		МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить новый маршрут согласования документа", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		
		//Первый раз
		НаборЗаписейСостояниеСогласования.Очистить();
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.Этап = МаршрутСогласования;
		НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		НоваяЗапись.ТекущийЭтап = "Начальный";
		НаборЗаписейСостояниеСогласования.Записать();
		ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
		ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования,НоваяЗапись.Состояние);
		
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
	
	
	
	//ДвиженияПоРегиструСогласования(Отказ, Режим, Состояние);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
КонецПроцедуры

Процедура ДвиженияПоРегиструСкидок()
	//Если Состояние = Перечисления.СостоянияОбъектов.Утвержден  Тогда
	Движения.Лно_СкидкиТрейдМаркетинг.Записывать = Истина;
	Движения.Лно_СкидкиТрейдМаркетинг.Очистить();
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.Лно_СкидкиТрейдМаркетинг.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Сеть = ТекСтрокаСкидки.Сеть;
		Движение.Номенклатура = ТекСтрокаСкидки.Номенклатура;
		Движение.НомерАктивности = НомерАктивности;
		Движение.ВидАктивности = ВидАктивности;
		Движение.Скидка = ТекСтрокаСкидки.СуммаСкидки;
		Движение.ДопОбъём = ТекСтрокаСкидки.ДопОбъём;
		Движение.ПериодВозникновенияРасхода = ПериодВозникновенияРасхода;
		//{Лео Катанович
		Движение.ВидОплаты = ВидОплаты;
		//Лео Катанович}
	КонецЦикла;
	
	Если ПодтвержениеФактаПредоставленияСкидки Тогда
		Для Каждого ТекСтрокаСкидки Из Скидки Цикл
			Движение = Движения.Лно_СкидкиТрейдМаркетинг.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение.Период = ?( ДокуменПредоставленияСкидки.Дата> Дата ,ДокуменПредоставленияСкидки.Дата,Дата) ;
			Движение.Период = Дата;
			
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Сеть = ТекСтрокаСкидки.Сеть;
			Движение.Номенклатура = ТекСтрокаСкидки.Номенклатура;
			Движение.НомерАктивности = НомерАктивности;
			Движение.ВидАктивности = ВидАктивности;
			Движение.Скидка = ТекСтрокаСкидки.СуммаСкидки;
			Движение.ДопОбъём = ТекСтрокаСкидки.ДопОбъём;
			Движение.ПериодВозникновенияРасхода = ПериодВозникновенияРасхода;
			//{Лео Катанович
			Движение.ВидОплаты = ВидОплаты;
			//Лео Катанович}
		КонецЦикла;
	КонецЕсли;
	
	//КонецЕсли;	
	
КонецПроцедуры	


Процедура ДвиженияПоРегиструСогласования (Отказ, Режим,Состояние)
	//Если используется механизм согласования заявок, и заявка еще не прошла по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	
	
	
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу,Дата) Тогда
		
		Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
					
					МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период 					= ТекущаяДата();
					НоваяЗапись.Активность 				= Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь 			= Ответственный;
					НоваяЗапись.Этап 					= МаршрутСогласования;
					НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
					
					НаборЗаписейСостояниеСогласования.Записать();
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования
			Возврат;
		КонецЕсли;
		
		МаршрутСогласования = ОпределитьМаршрутСогласования(Перечисления.абс_ТипыДокументовДляСогласования.Лео_ФиксацияСкидокПоТрейдМаркетингу);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования заявки", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписейСостояниеСогласования.Очистить();
		
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период 					= ТекущаяДата();
		НоваяЗапись.Активность 				= Истина;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь 			= Ответственный;
		НоваяЗапись.Этап 					= МаршрутСогласования;
		НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
		
		
		НаборЗаписейСостояниеСогласования.Записать();
		
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Удаление движений по регистру СостоянияСогласованияЗаявок, если заявка была подготовлена
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если НаборЗаписейСостояниеСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,Дата) Тогда
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования, не следует ничего менять
			Возврат;
		КонецЕсли;
		//Если в наборе записей только одна запись - значит заявка только подготовлена.
		//Очистим набор записей
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры

//Функция определяет маршрут согласования документа по подразделению
Функция ОпределитьМаршрутСогласования(ТипДокументаДляСогласования)      Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования КАК МаршрутСогласования
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования");
	
	//Запрос.УстановитьПараметр("ТекПодразделение"			, Подразделение);
	//Запрос.УстановитьПараметр("ПустоеПодразделение"			, Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, ТипДокументаДляСогласования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.МаршрутыСогласования.ПустаяСсылка();
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (НЕ РольДоступна("ПолныеПрава")) и  (НЕ РольДоступна("Финансист"))  Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Состояние = Выборка.Состояние;
			Иначе
				Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
			КонецЕсли;
			
			Если Состояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
				Отказ = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Ответственный = Справочники.Пользователи.ПустаяСсылка()Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//ПодтвержениеФактаПредоставленияСкидки = Ложь;
	ДатаФактаПредоставленияСкидки = Дата("00010101000000");
	ДокуменПредоставленияСкидки = Неопределено;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") Тогда
		
		ДополнительныеСвойства.Вставить("ОткрыватьФорму", Ложь);
		Если РольДоступна("ПолныеПрава") Тогда
			
		Иначе
			Если НЕ (ДанныеЗаполнения.ВидКомпенсации  = "Компенсирующая скидка" И (ДанныеЗаполнения.Состояние = Перечисления.СостоянияОбъектов.Утвержден ИЛИ ДанныеЗаполнения.Состояние = Перечисления.СостоянияОбъектов.Лео_ПроверенФакт))  Тогда
				Комментарий = "Не открывать форму";
			КонецЕсли;
			
		КонецЕсли;	 
		
		Организация = ДанныеЗаполнения.Организация;
		ПериодВозникновенияРасхода = ДанныеЗаполнения.ДатаОкончанияАкции;
		ВидАктивности =  ДанныеЗаполнения.ТипСкидкиНаценки;
		Контрагент = ДанныеЗаполнения.Контрагент;
		НомерАктивности = ДанныеЗаполнения.НомерТМА;
		ДокументОснование =  ДанныеЗаполнения.Ссылка;
		ВидОплаты = ДанныеЗаполнения.ВидОплаты;
		//Скидки.Загрузить(ДанныеЗаполнения.УсловияФормированияСкидки.Выгрузить());
		Для Каждого Строка из ДанныеЗаполнения.ЭффективностьФакт Цикл
			НоваяСтрока = Скидки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Сеть = ДанныеЗаполнения.Участник;
			НоваяСтрока.СуммаСкидки = Строка.БюджетПоставщикаСНДС;  // с НДС
			НоваяСтрока.СуммаСкидкиБезНДС = Строка.БюджетПоставщикаБезНДС;
		КонецЦикла;	 
		ЛимитБюджетаБезНДС = Скидки.Итог("СуммаСкидкиБезНДС");
		СуммаДокумента = Скидки.Итог("СуммаСкидки");
		
	Конецесли;
	
КонецПроцедуры

