//Функция определяет тип сообщения по имени файла и/или настройке обмена
//
//Для обмена EDI.su тип сообщения определяется по имени файла обмена, 
//если имя файла содержит recadv, то это уведомление о приемке, если имя содержит order - то это заказ. 
//Для всех остальных обменов подставлять Заказ.
//
//Параметры
//НастройкаОбмена - Справочник.абс_НастройкиEDIОбмена
//ИмяФайлаОбмена - строка с именем файла обмена. Например: EDI_order_201312300845_156203886_пример 9.xml
Функция ОпределитьТипСообщения(ИмяФайлаОбмена, НастройкаОбмена) Экспорт 
	
	//по умолчанию - Заказ
	ТипСообщения = Перечисления.абс_ТипыСообщенийEDI.Заказ;
	
	Если НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.edi_su И Найти(ВРЕГ(ИмяФайлаОбмена),"RECADV") > 0 Тогда
		ТипСообщения = Перечисления.абс_ТипыСообщенийEDI.УведомлениеОПриемке ;
	КонецЕсли;
	
	Возврат ТипСообщения;
	
КонецФункции

//получаем единицу измерения из классификатора по международному сокращению
Функция ПолучитьЕдиницуИзКлассификатора(КодЕдиницы) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.МеждународноеСокращение = &МеждународноеСокращение
	|";
	
	Запрос.УстановитьПараметр("МеждународноеСокращение",КодЕдиницы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЕдиницуИзмеренияНоменклатуры(Владелец, ЕдиницаПоКлассификатору)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
	|	И ЕдиницыИзмерения.Владелец = &Владелец
	|";
	
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",ЕдиницаПоКлассификатору);
	Запрос.УстановитьПараметр("Владелец",Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазобратьДеревоСообщения_УведомлениеОПриемке(Дерево, Отказ)
	
	СтруктураРеквизитов = Новый Структура;
	
	//Определяем реквизиты документа
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "RECADV");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	НомерЗаказаКлиента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "ORDERNUMBER", Истина);
	НомерУведомленияОПриемке = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "NUMBER", Истина);
	СтруктураРеквизитов.Вставить("НомерУведомленияОПриемке",НомерУведомленияОПриемке);
	
	Если НомерЗаказаКлиента <> Неопределено Тогда
		СтруктураРеквизитов.Вставить("НомерЗаказаКлиента",НомерЗаказаКлиента);
	Иначе
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	СтрДатаУведомленияОПриемке = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "DATE", Ложь);
	Если СтрДатаУведомленияОПриемке <> Неопределено Тогда
		
		ДатаУведомленияОПриемке = Дата(1, 1, 1);
		Попытка
			ДатаУведомленияОПриемке = Дата(Число(Лев(СтрДатаУведомленияОПриемке, 4)), Число(Сред(СтрДатаУведомленияОПриемке, 6, 2)), Число(Прав(СтрДатаУведомленияОПриемке, 2)));
		Исключение
			
		КонецПопытки;
		
		СтруктураРеквизитов.Вставить("ДатаУведомленияОПриемке",ДатаУведомленияОПриемке);
	Иначе
		СтруктураРеквизитов.Вставить("ДатаУведомленияОПриемке",Неопределено);
		//Отказ = Истина;
		//Возврат Неопределено;
	КонецЕсли; 
	
	СтрДатаПриемки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "RECEPTIONDATE", Ложь);
	Если СтрДатаПриемки <> Неопределено Тогда
		
		ДатаПриемки = Дата(1, 1, 1);
		Попытка
			ДатаПриемки = Дата(Число(Лев(СтрДатаПриемки, 4)), Число(Сред(СтрДатаПриемки, 6, 2)), Число(Прав(СтрДатаПриемки, 2)));
		Исключение
			
		КонецПопытки;
		
		СтруктураРеквизитов.Вставить("ДатаПриемки",ДатаПриемки);
	Иначе
		СтруктураРеквизитов.Вставить("ДатаПриемки",ДатаПриемки);
		//Отказ = Истина;
		//Возврат Неопределено;
	КонецЕсли;	
	
	ТабПринятыхТоваров = Новый ТаблицаЗначений;
	ТабПринятыхТоваров.Колонки.Добавить("Номенклатура");
	ТабПринятыхТоваров.Колонки.Добавить("Количество");
	ТабПринятыхТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	
	ЗаголовокТЧ1 = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
	Если НЕ ЗаголовокТЧ1 = Неопределено Тогда
		ЗаголовокТЧ2 = ПолучитьУзелДерева(ЗаголовокТЧ1.Строки, "Строка", "PACKINGSEQUENCE");
		Если НЕ ЗаголовокТЧ2 = Неопределено Тогда
			
			//в данном узле первой строкой идет строка со значением колонки "Элемент" = "HIERARCHICALID", 
			//все остальные строки содержат подчиненные строки с нужными данными
			Для Каждого СтрокаТаб Из ЗаголовокТЧ2.Строки Цикл
				Если СтрокаТаб.Элемент = "POSITION" Тогда
					
					НоваяСтрокаПринятыхТоваров = ТабПринятыхТоваров.Добавить();
					
					Для Каждого ПодчСтрокаТаб Из СтрокаТаб.Строки Цикл
						
						Если ПодчСтрокаТаб.Элемент = "PRODUCT" Тогда //штрихкод номенклатуры
							ШтрихКодТовара = ПодчСтрокаТаб.Текст;
							СтруктураТовара = ПолучитьНоменклатуру(ШтрихКодТовара);
							Если НЕ ЗначениеЗаполнено(СтруктураТовара.Номенклатура) Тогда
								Сообщить("Не найден товар со штрих-кодом " + ШтрихКодТовара,СтатусСообщения.Важное);
								Отказ = Истина;
								Продолжить;
							Иначе
								НоваяСтрокаПринятыхТоваров.Номенклатура = СтруктураТовара.Номенклатура;
							КонецЕсли;
							
						ИначеЕсли ПодчСтрокаТаб.Элемент = "ACCEPTEDQUANTITY" Тогда  //принятое количество
							
							НоваяСтрокаПринятыхТоваров.Количество = Число(ПодчСтрокаТаб.Текст);
							
						ИначеЕсли ПодчСтрокаТаб.Элемент = "ACCEPTEDUNIT" Тогда //единица измерения (код по классификатору)
							
							//по международному сокращению найдем единицу в классификаторе. По ней найдем подходящую ед. 
							КодЕдиницы = ПодчСтрокаТаб.Текст;
							
							ЕдиницаКлассификатора = ПолучитьЕдиницуИзКлассификатора(КодЕдиницы);
							
							ЕдиницаНоменклатуры = ПолучитьЕдиницуИзмеренияНоменклатуры(СтруктураТовара.Номенклатура, ЕдиницаКлассификатора); //упрощенный вариант для отладки
							
							//Если ЗначениеЗаполнено(ЕдиницаКлассификатора) Тогда
							//	ЕдиницаНоменклатуры = ПолучитьЕдиницуИзмеренияНоменклатуры(ЕдиницаКлассификатора);
							//Иначе
							//	Сообщить("В классификаторе единиц измерения не найдена единица с кодом " + КодЕдиницы,СтатусСообщения.Важное);
							//КонецЕсли;
							
							НоваяСтрокаПринятыхТоваров.ЕдиницаИзмерения = ЕдиницаНоменклатуры;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Отказ = Истина;
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураРеквизитов.Вставить("ТабПринятыхТоваров",ТабПринятыхТоваров);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Процедура ЗагрузитьУведомлениеОПриемкеВРеализацию(СообщениеEDI) Экспорт
	
	//получим нужные данные сообщения запросом
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ТекстСообщенияXML,
	|	НомерДокументаEDIЗаказа,
	|	ПРЕДСТАВЛЕНИЕ(Ссылка) КАК ПредставлениеДокумента
	|ИЗ
	|	Документ.абс_СообщениеEDI
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", СообщениеEDI);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения          = Выборка.ТекстСообщенияXML;
	НомерДокументаEDIЗаказа = Выборка.НомерДокументаEDIЗаказа;
	
	Отказ = Ложь;
	
	//по тексту ХМЛ получаем дерево значений
	ДеревоСообщения = РазобратьСообщениеXML_Универсальная(ТекстСообщения, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//по дереву получаем структуру реквизитов из двух элементов. 1 - № заказа клиента, 2 - таб.часть (Номенклатура, Кол-во, Ед.изм)
	СтруктураРеквизитов = РазобратьДеревоСообщения_УведомлениеОПриемке(ДеревоСообщения, Отказ);
	
	Если Отказ Тогда
		Сообщить("Ошибка при разборе сообщения!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	НомерЗаказаКлиента = СтруктураРеквизитов.НомерЗаказаКлиента;
	ТабПринятыхТоваров = СтруктураРеквизитов.ТабПринятыхТоваров;;
	
	//найдем сообщение о заказе по номеру
	
	//АБС ИЗМЕНЕНО АЛГОРИТМ ПОИСКА ЗАКАЗА 26.06.2014 Фролов
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	абс_СообщениеEDI.Ссылка
	//|ИЗ
	//|	Документ.абс_СообщениеEDI КАК абс_СообщениеEDI
	//|ГДЕ
	//|	абс_СообщениеEDI.НомерДокументаEDIЗаказа = &НомерДокументаEDIЗаказа
	//|	И НЕ абс_СообщениеEDI.ПометкаУдаления";
	//
	//Запрос.УстановитьПараметр("НомерДокументаEDIЗаказа", НомерЗаказаКлиента);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.абс_НомерЗаказаEDI = &НомерЗаказаEDI
	|	И ЗаказПокупателя.Грузополучатель.абс_GLN = &GLNГрузополучателя
	|	И РАЗНОСТЬДАТ(ЗаказПокупателя.ДатаОтгрузки, &ДатаПриемки, ДЕНЬ) <= &МаксимальнаяРазностьДат
	|	И РАЗНОСТЬДАТ(ЗаказПокупателя.ДатаОтгрузки, &ДатаПриемки, ДЕНЬ) >= -&МаксимальнаяРазностьДат");
	
	Запрос.УстановитьПараметр("НомерЗаказаEDI"			, НомерЗаказаКлиента);
	Запрос.УстановитьПараметр("ДатаПриемки"				, СообщениеEDI.ДатаДокументаEDI);
	Запрос.УстановитьПараметр("GLNГрузополучателя"		, СообщениеEDI.GLNГрузополучателя);
	//Запрос.УстановитьПараметр("GLNПокупателя"			, СообщениеEDI.GLNПокупателя);
	Запрос.УстановитьПараметр("МаксимальнаяРазностьДат"	, 21);
	//АБС ИЗМЕНЕНО КОНЕЦ
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаказПокупателя = Выборка.Ссылка;
	Иначе
		Сообщить("Обработка уведомления о приемке № " + СокрЛП(НомерДокументаEDIЗаказа) + ". Не найден заказ покупателя " + НомерЗаказаКлиента, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	//// Найдем заказ покупателя по документу основанию
	//ЗаказПокупателя = Документы.ЗаказПокупателя.НайтиПоРеквизиту("ДокументОснование", СообщениеОЗаказе);
	//
	//// Если не нашли по основанию попробуем найти по номеру заказа из EDI
	//Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	ЗаказПокупателя.Ссылка
	//	|ИЗ
	//	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	//	|ГДЕ
	//	|	ЗаказПокупателя.НомерПоДаннымПокупателя = &НомерПоДаннымПокупателя
	//	|	И ЗаказПокупателя.Контрагент.абс_GLN = &GLNКонтрагента
	//	|	И НАЧАЛОПЕРИОДА(ЗаказПокупателя.абс_ДатаПоставкиВТЦ, ГОД) = НАЧАЛОПЕРИОДА(&ДатаПриемки, ГОД)");
	//	
	//	Запрос.УстановитьПараметр("НомерПоДаннымПокупателя"		, СтруктураРеквизитов.НомерЗаказаКлиента);
	//	Запрос.УстановитьПараметр("GLNКонтрагента"				, СообщениеEDI.GLNПокупателя);
	//	Запрос.УстановитьПараметр("ДатаПриемки"					, СтруктураРеквизитов.ДатаПриемки);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Если Выборка.Количество() = 1 Тогда
	//		
	//		Выборка.Следующий();
	//		
	//		ЗаказПокупателя = Выборка.Ссылка;
	//		
	//	КонецЕсли;
	//		
	//КонецЕсли;
	
	
	Если НЕ ЗаказПокупателя.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Сделка = &Сделка
		|	И Проведен";
		
		Запрос.УстановитьПараметр("Сделка", ЗаказПокупателя);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			РеализацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
			РеализацияОбъект.абс_СообщениеEDI = СообщениеEDI;
			РеализацияОбъект.абс_ПолученоУведомлениеОПриемке = Истина;
			РеализацияОбъект.абс_НомерУведомленияОПриемке = СтруктураРеквизитов.НомерУведомленияОПриемке;
			РеализацияОбъект.абс_Принято.Загрузить(ТабПринятыхТоваров);
			
			РеализацияОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				РеализацияОбъект.Записать();
			Исключение
				Сообщить("Обработка уведомления о приемке № " + СокрЛП(НомерДокументаEDIЗаказа) + ". Не записана реализация " + Строка(РеализацияОбъект) + " " + ОписаниеОшибки(),
				СтатусСообщения.Важное);
			КонецПопытки;
			
		Иначе
			Сообщить("Обработка уведомления о приемке № " + СокрЛП(НомерДокументаEDIЗаказа) + ". Не найдена реализация по заказу покупателя " + Строка(ЗаказПокупателя),
			СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
	Иначе
		Сообщить("Обработка уведомления о приемке № " + СокрЛП(НомерДокументаEDIЗаказа) + ". Не найден заказ покупателя " + Строка(СообщениеEDI.НомерДокументаEDIЗаказа),
		СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ПоискСообщенияEDI(Параметры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СообщениеEDI.Ссылка
	|ИЗ
	|	Документ.абс_СообщениеEDI КАК абс_СообщениеEDI
	|ГДЕ
	|	абс_СообщениеEDI.ТипСообщения = &ТипСообщения
	|	И абс_СообщениеEDI.НомерДокументаEDIЗаказа = &НомерДокументаEDIЗаказа
	|	И абс_СообщениеEDI.ДатаДокументаEDI = НАЧАЛОПЕРИОДА(&ДатаДокументаEDI, ДЕНЬ)
	|	И абс_СообщениеEDI.GLNПокупателя = &GLNПокупателя
	|	И абс_СообщениеEDI.GLNПоставщика = &GLNПоставщика"; 
	Запрос.УстановитьПараметр("GLNПокупателя", Параметры.GLNПокупателя);
	Запрос.УстановитьПараметр("GLNПоставщика", Параметры.GLNПоставщика);
	Запрос.УстановитьПараметр("ДатаДокументаEDI", Параметры.ДатаДокументаEDI);
	Запрос.УстановитьПараметр("НомерДокументаEDIЗаказа", Параметры.НомерДокументаEDIЗаказа);
	Запрос.УстановитьПараметр("ТипСообщения", Параметры.ТипСообщения); 
	Результат = Запрос.Выполнить();   
	ВыборкаДетальныеЗаписи = Результат.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции	

Функция РазобратьСообщениеXML_НеИсп(ТекстСообщения, Отказ) Экспорт
	
	СтруктураШапки    = Новый Структура;
	СтруктураТабЧасти = Новый Структура;
	ТабЧастьТовары    = Новый ТаблицаЗначений;
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(ТекстСообщения);
	
	АтрибутыШапки = Истина;
	Пока ЧтениеХМЛ.Прочитать() Цикл
		Если ЧтениеХМЛ.ТипУзла  = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяАтрибута = ЧтениеХМЛ.Имя;
			
			Если ИмяАтрибута = "POSITION" Тогда
				АтрибутыШапки = Ложь;
				НоваяСтрокаТаб = ТабЧастьТовары.Добавить();
			КонецЕсли;
		ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.Текст Тогда
			ЗначениеАтрибута = ЧтениеХМЛ.Значение;
		Иначе 
			Продолжить;
		КонецЕсли;
		
		Если АтрибутыШапки Тогда
			СтруктураШапки.Вставить(ИмяАтрибута,ЗначениеАтрибута);
		Иначе
			Если ТабЧастьТовары.Колонки.Найти(ИмяАтрибута) = Неопределено Тогда
				СтруктураТабЧасти.Вставить(ИмяАтрибута);
				ТабЧастьТовары.Колонки.Добавить(ИмяАтрибута);
			КонецЕсли;
			
			НоваяСтрокаТаб[ИмяАтрибута] = ЗначениеАтрибута;
		КонецЕсли;
	КонецЦикла;
	
	//ненужная колонка
	КолонкаТЧ = ТабЧастьТовары.Колонки.Найти("POSITION");
	Если КолонкаТЧ <> Неопределено Тогда
		ИндексКолонки = ТабЧастьТовары.Колонки.Индекс(КолонкаТЧ);
		ТабЧастьТовары.Колонки.Удалить(ИндексКолонки);
	КонецЕсли;
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("СтруктураШапки"   ,СтруктураШапки);
	СтруктураСообщения.Вставить("СтруктураТабЧасти",СтруктураТабЧасти);
	СтруктураСообщения.Вставить("ТабЧастьТовары"   ,ТабЧастьТовары);
	
	Возврат СтруктураСообщения;
	
КонецФункции

//функция получает в качестве параметра текст ХМЛ и возвращает дерево значений
Функция РазобратьСообщениеXML_Универсальная(ТекстСообщенияXML, Отказ) Экспорт
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	
	Попытка
		ЧтениеХМЛ.УстановитьСтроку(ТекстСообщенияXML);
		ЧтениеХМЛ.Прочитать();
	Исключение
		Сообщить("Не удалось прочитать XML-сообщение. " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	ДеревоСообщения = Новый ДеревоЗначений;
	ДеревоСообщения.Колонки.Добавить("Элемент");
	ДеревоСообщения.Колонки.Добавить("Текст");
	
	СтрокаДерева = ДеревоСообщения.Строки.Добавить();
	СтрокаДерева.Элемент = ЧтениеХМЛ.Имя;
	ПрочитатьХМЛСообщениеВДеревоЗначений(СтрокаДерева, ЧтениеХМЛ);
	
	Возврат ДеревоСообщения;
	
КонецФункции

// Процедура предназначена для обхода древовидной структуры XML - файла
//
// Параметры:
//  СтрокаДерева                - строка дерева файла XML
//
Процедура ПрочитатьХМЛСообщениеВДеревоЗначений(СтрокаДерева, ЧтениеХМЛ)
	
	АтрибутыСоответствие = Новый Соответствие;
	Пока ЧтениеХМЛ.ПрочитатьАтрибут() Цикл
		АтрибутыСоответствие.Вставить(ЧтениеХМЛ.Имя, ЧтениеХМЛ.Значение);
	КонецЦикла;
	
	Если АтрибутыСоответствие.Количество() > 0 Тогда
		СтрокаДерева.Атрибуты = АтрибутыСоответствие;
	Иначе
		АтрибутыСоответствие = 0;
	КонецЕсли;
	
	Пока ЧтениеХМЛ.Прочитать() Цикл
		Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.Текст Тогда
			СтрокаДерева.Текст = ЧтениеХМЛ.Значение;
		ИначеЕсли ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Дочерний         = СтрокаДерева.Строки.Добавить();
			Дочерний.Элемент = ЧтениеХМЛ.Имя;
			ПрочитатьХМЛСообщениеВДеревоЗначений(Дочерний, ЧтениеХМЛ);
		КонецЕсли;
		
		//ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
КонецПроцедуры

//процедура заполняет заказ покупателя данными из сообщения XML в соответствии с указанными настройками
Процедура ЗаполнитьЗаказПокупателяПоСообщениюEDI(СообщениеEDI) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ТекстСообщенияXML,
	|	НастройкаОбмена,
	|	ПРЕДСТАВЛЕНИЕ(Ссылка) КАК ПредставлениеДокумента
	|ИЗ
	|	Документ.абс_СообщениеEDI
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", СообщениеEDI);
	
	ВыборкаПоляСообщения = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаПоляСообщения.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаПоляСообщения.НастройкаОбмена) Тогда
		Сообщить("Для " + ВыборкаПоляСообщения.ПредставлениеДокумента + " не указана настройка обмена!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДеревоСообщения = РазобратьСообщениеXML_Универсальная(ВыборкаПоляСообщения.ТекстСообщенияXML, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//формирование заказа покупателя по разным вариантам форматов обмена
	ЗаказПокупателяОбъект = ПолучитьЗаказПокупателя(СообщениеEDI);
	
	Если НЕ ЗаказПокупателяОбъект.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Создан Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("По сообщению " + ВыборкаПоляСообщения.ПредставлениеДокумента + " сформированный заказ " + ЗаказПокупателяОбъект.Ссылка + " уже находится в статусе " + ЗаказПокупателяОбъект.абс_Статус);
		
		Возврат;
	КонецЕсли;
	
	// << Горбунов, добавил выгрузку из организации ООО "ЛЕОВИТ нутрио"
	Если ВыборкаПоляСообщения.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.edi_su Или ВыборкаПоляСообщения.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.edi_su_Leovit Тогда
		// >> Горбунов, добавил выгрузку из организации ООО "ЛЕОВИТ нутрио"
		
		СтруктураДокумента = ПолучитьСтруктуруЗаказаПокупателяПоФормату_edi_su(ДеревоСообщения, ВыборкаПоляСообщения.НастройкаОбмена);
		
	ИначеЕсли ВыборкаПоляСообщения.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.ecode_ru Тогда
		
		СтруктураДокумента = ПолучитьСтруктуруЗаказаПокупателяПоФормату_ecode_ru(ДеревоСообщения, ВыборкаПоляСообщения.НастройкаОбмена);
	// {Лео Катанович	
	ИначеЕсли ВыборкаПоляСообщения.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.КОРУС Тогда
		
		СтруктураДокумента = ПолучитьСтруктуруЗаказаПокупателяПоФормату_КОРУС(ДеревоСообщения, ВыборкаПоляСообщения.НастройкаОбмена);
	// Лео Катанович}		
	ИначеЕсли ВыборкаПоляСообщения.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.DIP7K Тогда
		
		СтруктураДокумента = ПолучитьСтруктуруЗаказаПокупателяПоФормату_DIP7K(ДеревоСообщения, ВыборкаПоляСообщения.НастройкаОбмена);
		
	Иначе //неизвестный формат обмена
		Возврат;
	КонецЕсли;
	
	//заполним номер заказа покупателя по сообщению EDI
	СтруктураДокумента.Вставить("НомерПоДаннымПокупателя"	, СообщениеEDI.НомерДокументаEDIЗаказа);
	СтруктураДокумента.Вставить("абс_НомерЗаказаEDI"		, СообщениеEDI.НомерДокументаEDIЗаказа);
	СтруктураДокумента.Вставить("ДатаПоДаннымПокупателя"	, СообщениеEDI.ДатаДокументаEDI);
	
	//в процессе разбора дерева произошли ошибки
	Если СтруктураДокумента = Неопределено Тогда
		Сообщить("Ошибка разбора сообщения " + Строка(СообщениеEDI),СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыЗаказаПокупателяПоСтруктуреСообщения(ЗаказПокупателяОбъект, СтруктураДокумента, СообщениеEDI);
	
КонецПроцедуры

//функция ищет существующий заказ покупателя по сообщению EDI
//возвращает объект найденного заказа. Если заказ не найден, то создается новый
Функция ПолучитьЗаказПокупателя(СообщениеEDI)
	
	//найдем уже существующий заказ, если такой есть, просто перезапишем (обновим) его
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя
	|ГДЕ
	|	ДокументОснование = &ДокументОснование
	|";
	
	Запрос.УстановитьПараметр("ДокументОснование", СообщениеEDI);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаказПокупателя = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
		ЗаказПокупателя.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Создан;
	КонецЕсли;
	
	Возврат ЗаказПокупателя;
	
КонецФункции

Функция ПолучитьТипЦенПоДоговоруСКонтрагентом(ДоговорКонтрагента, ДатаЦен)
	
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.ТипЦен, НЕОПРЕДЕЛЕНО) КАК ТипЦен
	|ИЗ
	|	РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей.СрезПоследних(
	|			&ДатаЦен,
	|			абс_ДоговорКонтрагента = &ДоговорКонтрагента
	|				И НоменклатурнаяЦеноваяГруппа = НЕОПРЕДЕЛЕНО
	|				И Контрагент = &Контрагент) КАК ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних");
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента"	, ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент"			, ДоговорКонтрагента.Владелец);
	Запрос.УстановитьПараметр("ДатаЦен"				, ДатаЦен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТипЦен;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция предназначена для создания документа "Заказ покупателя"
//
// Параметры:
//  ТекИмяФайла                    - полное имя файла, с помощью которго загружается заказ
//
// Возвращаемое значение:
// 1, если документ создан, 0 в противном случае.
//
Функция ЗаполнитьРеквизитыЗаказаПокупателяПоСтруктуреСообщения(ЗаказПокупателя, СтруктураДокумента, СообщениеEDI)
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЗаказПокупателя, "Продажа");
	
	ЗаказПокупателя.ДокументОснование   = СообщениеEDI;
	ЗаказПокупателя.ВидОперации         = Перечисления.ВидыОперацийЗаказПокупателя.ПродажаКомиссия;
	ЗаказПокупателя.УчитыватьНДС        = Истина;
	Если СообщениеEDI.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.DIP7K Тогда
		ЗаказПокупателя.СуммаВключаетНДС    = Истина;
	Иначе
		ЗаказПокупателя.СуммаВключаетНДС    = Ложь;
	КонецЕсли;
	//ЗаказПокупателя.Дата                = СтруктураДокумента.Дата;
	ЗаказПокупателя.Дата                = ТекущаяДата();
	ЗаказПокупателя.абс_ДатаПоставкиВТЦ = СтруктураДокумента.ДатаПоставки;
	//{Лео Катанович 
	//ЗаказПокупателя.ДатаОплаты          = ЗаказПокупателя.Дата;
    //Лео Катанович}
	
	ЗаказПокупателя.Контрагент          = СтруктураДокумента.Контрагент;
	ЗаказПокупателя.Грузополучатель     = СтруктураДокумента.Грузополучатель;
	
	абс_СпособДоставкиКонтрагента = ЗаказПокупателя.Грузополучатель.абс_ОсновнойСпособДоставки;
	
	Если Не ЗначениеЗаполнено(абс_СпособДоставкиКонтрагента) Тогда
		абс_СпособДоставкиКонтрагента = ЗаказПокупателя.Контрагент.абс_ОсновнойСпособДоставки;
	КонецЕсли;
	
	ЗаказПокупателя.абс_СпособДоставкиКонтрагента = абс_СпособДоставкиКонтрагента;
	
	ЗаказПокупателя.АдресДоставки = абс_СпособДоставкиКонтрагента.АдресДоставки;
	
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя.Контрагент) Тогда
		ЗаказПокупателя.Контрагент = ЗаказПокупателя.Грузополучатель.ГоловнойКонтрагент;
	КонецЕсли;	
	
	//АБС ИЗМЕНЕНО 18.06.2014 Фролов 
	//ЗаказПокупателя.Организация         = СтруктураДокумента.Организация;
	//ЗаказПокупателя.ДоговорКонтрагента  = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(ЗаказПокупателя.Организация, ЗаказПокупателя.Контрагент, ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораЗаказаПокупателя());
	
	Если ЗначениеЗаполнено(ЗаказПокупателя.Контрагент) Тогда
		
		ЗаказПокупателя.ДоговорКонтрагента 	= ЗаказПокупателя.Контрагент.ОсновнойДоговорКонтрагента;
		//{Лео Катанович
	    абс_Дистрибуция.УстановитьДатуОплаты(ЗаказПокупателя,"ДоговорКонтрагента",ЗаказПокупателя.ДоговорКонтрагента);
        //Лео Катанович}

		ЗаказПокупателя.Организация			= ЗаказПокупателя.ДоговорКонтрагента.Организация;
		ЗаказПокупателя.СтруктурнаяЕдиница	= ЗаказПокупателя.Организация.ОсновнойБанковскийСчет;
		ЗаказПокупателя.СкладГруппа			= ЗаказПокупателя.Организация.абс_ОсновнойСклад;
		
		//+Лео Сафонов ЕА 30.06.2016
		//ЗаказПокупателя.Грузоотправитель	= ЗаказПокупателя.СкладГруппа.абс_Контрагент;
		Запрос = Новый Запрос;
		Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Лео_СоответствиеСкладОрганизацияГрузотправительСрезПоследних.Контрагент
					|ИЗ
					|	РегистрСведений.Лео_СоответствиеСкладОрганизацияГрузотправитель.СрезПоследних(
					|			&ДатаДокумента,
					|			Организация = &Организация
					|				И Склад = &Склад) КАК Лео_СоответствиеСкладОрганизацияГрузотправительСрезПоследних";

		Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", ЗаказПокупателя.ДоговорКонтрагента.Организация);
		Запрос.УстановитьПараметр("Склад",ЗаказПокупателя.Организация.абс_ОсновнойСклад);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
        Если ВыборкаДетальныеЗаписи.Количество()> 0  тогда
			ВыборкаДетальныеЗаписи.Следующий();
			ЗаказПокупателя.Грузоотправитель = ВыборкаДетальныеЗаписи.Контрагент;
		Иначе
			ЗаказПокупателя.Грузоотправитель	= ЗаказПокупателя.СкладГруппа.абс_Контрагент;
		КонецЕсли;
		//-Лео Сафонов ЕА 30.06.2016
		
		Если ЗначениеЗаполнено(ЗаказПокупателя.ДоговорКонтрагента.абс_БанковскийСчетОплатыКонтрагента) Тогда
			ЗаказПокупателя.СтруктурнаяЕдиница = ЗаказПокупателя.ДоговорКонтрагента.абс_БанковскийСчетОплатыКонтрагента;
		Иначе
			ЗаказПокупателя.СтруктурнаяЕдиница = ЗаказПокупателя.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;	
		
	КонецЕсли;	
	//АБС ИЗМЕНЕНО 18.06.2014 Фролов КОНЕЦ
	
	Если СтруктураДокумента.Свойство("абс_СтокТранзит") Тогда
		ЗаказПокупателя.абс_СтокТранзит = СтруктураДокумента.абс_СтокТранзит;
	КонецЕсли;
	
	ЗаказПокупателя.ТипЦен              = ПолучитьТипЦенПоДоговоруСКонтрагентом(ЗаказПокупателя.ДоговорКонтрагента, СтруктураДокумента.Дата);
	//<< Горбунов, используя "тип цен" установим признак ВклНДС. Создано по Седьмому континенту.
	Если ЗаказПокупателя.ТипЦен.ЦенаВключаетНДС Тогда
		ЗаказПокупателя.СуммаВключаетНДС = Истина;
	Иначе
		ЗаказПокупателя.СуммаВключаетНДС = Ложь;
	КонецЕсли;
	//>> Горбунов, используя "тип цен" установим признак ВклНДС. Создано по Седьмому континенту.
	
	ЗаказПокупателя.ВалютаДокумента     = ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	
	ЗагружатьДатуПоставкиEDI = абс_Дистрибуция.ПолучитьЗначениеСвойстваОбъекта(ЗаказПокупателя.Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ЗагружатьДатуПоставкиEDI);
	
	абс_Дистрибуция.УстановитьДатуОтгрузкиПоДиспоСхеме(ЗаказПокупателя);
	
	Если ЗагружатьДатуПоставкиEDI = Истина Тогда
		ЗаказПокупателя.Лео_ПодтвержденнаяДатаДоставки = СтруктураДокумента.ДатаПоставки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя.ДатаОтгрузки) Тогда
		ЗаказПокупателя.ДатаОтгрузки = СтруктураДокумента.ДатаПоставки;
	КонецЕсли;
	
	//+Лео Сафонов ЕА 17.03.2016 
	Если Не СтруктураДокумента.ДатаПрибытияТранспорта = Неопределено Тогда
		ЗаказПокупателя.Лео_НазваниеРампыРазгрузки = СтруктураДокумента.НазваниеРампыРазгрузки;
	КонецЕсли;	
	
	Если Не СтруктураДокумента.ДатаПрибытияТранспорта = Неопределено Тогда
		ЗаказПокупателя.Лео_ДатаВремяПрибытияТранспортаПолучателю = СтруктураДокумента.ДатаПрибытияТранспорта;
	КонецЕсли;
	
	Если не СтруктураДокумента.ВремяПрибытияТранспорта = Неопределено Тогда
		Секунды =  Час(СтруктураДокумента.ВремяПрибытияТранспорта)*60*60;
		Секунды = Секунды + (Минута(СтруктураДокумента.ВремяПрибытияТранспорта)*60);
		ДатаВремяПрибытияТранспортаПолучателю = ЗаказПокупателя.Лео_ДатаВремяПрибытияТранспортаПолучателю + Секунды;
		ЗаказПокупателя.Лео_ДатаВремяПрибытияТранспортаПолучателю = ДатаВремяПрибытияТранспортаПолучателю;
	КонецЕсли;
 	//-Лео Сафонов ЕА 17.03.2016
	
	СтруктураКурсовВалют = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ЗаказПокупателя.Дата,Новый Структура("Валюта",ЗаказПокупателя.ВалютаДокумента));
	
	// Курс и кратность
	ЗаказПокупателя.КурсВзаиморасчетов      = СтруктураКурсовВалют.Курс;
	ЗаказПокупателя.КратностьВзаиморасчетов = СтруктураКурсовВалют.Кратность;
	
	// Номер и дата заказа EDI
	ЗаказПокупателя.НомерПоДаннымПокупателя = СтруктураДокумента.НомерПоДаннымПокупателя;
	ЗаказПокупателя.ДатаПоДаннымПокупателя 	= СтруктураДокумента.ДатаПоДаннымПокупателя;
	
	//ЗаказПокупателя.абс_НомерЗаказаEDI 		= СтруктураДокумента.абс_НомерЗаказаEDI;
	
	// Структурная единица
	Если ЗначениеЗаполнено(ЗаказПокупателя.ДоговорКонтрагента.абс_БанковскийСчетОплатыКонтрагента) 
		И ЗаказПокупателя.ДоговорКонтрагента.абс_БанковскийСчетОплатыКонтрагента.ВалютаДенежныхСредств = ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		
		ЗаказПокупателя.СтруктурнаяЕдиница = ЗаказПокупателя.ДоговорКонтрагента.абс_БанковскийСчетОплатыКонтрагента;
		
	ИначеЕсли ЗначениеЗаполнено(ЗаказПокупателя.Организация.ОсновнойБанковскийСчет)
		И ЗаказПокупателя.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств = ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
		
		ЗаказПокупателя.СтруктурнаяЕдиница = ЗаказПокупателя.Организация.ОсновнойБанковскийСчет;
		
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Счет
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Организация
		|   И БанковскиеСчета.ВалютаДенежныхСредств=&Валюта");
		
		Запрос.УстановитьПараметр("Организация"				, ЗаказПокупателя.Организация);
		Запрос.УстановитьПараметр("Валюта"					, ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаЗапроса.Количество()=1 Тогда
			ВыборкаЗапроса.Следующий();
			ЗаказПокупателя.СтруктурнаяЕдиница=ВыборкаЗапроса.Счет;
		КонецЕсли;
	КонецЕсли;
	
	// Склад
	СкладСсылка = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
	ЗаказПокупателя.СкладГруппа = СкладСсылка;
	
	Если ЗначениеЗаполнено(ЗаказПокупателя.Организация.абс_ОсновнойСклад) Тогда
		ЗаказПокупателя.СкладГруппа = ЗаказПокупателя.Организация.абс_ОсновнойСклад;
	КонецЕсли;
	
	//Табличная часть
	ЗаказПокупателя.Товары.Загрузить(СтруктураДокумента.ДокументТЧ);
	
	Для Каждого ТекСтрока ИЗ ЗаказПокупателя.Товары Цикл
		
		// Склад в табличной части выбираем тот же, что и в шапке
		ТекСтрока.Размещение = СкладСсылка;
		
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ТекСтрока.СтавкаНДС = ТекСтрока.Номенклатура.СтавкаНДС;
		КонецЕсли;
	КонецЦикла;
	
	// Заполняем табличную часть ценами номенклатуры исходя из типа цен договора контрагента
	ЗаполнитьТабличнуюЧастьЦенами(ЗаказПокупателя);
	
	Попытка
		ЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Создан документ "+ЗаказПокупателя.Ссылка);
		ЗаписьЖурналаРегистрации("ЗагрузкаЗаказовEDI.УспешнаяЗагрузка",УровеньЖурналаРегистрации.Ошибка,,,"Создан документ "+ЗаказПокупателя.Ссылка + " на основании сообщения " + Строка(СообщениеEDI));
	Исключение
		Сообщить("Ошибка при создании заказа покупателя на основании сообщения " + Строка(СообщениеEDI));
		ЗаписьЖурналаРегистрации("ЗагрузкаЗаказовEDI.ОшибкаЗагрузки",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка при создании заказа покупателя на основании сообщения " + Строка(СообщениеEDI));
	КонецПопытки;
	
КонецФункции

// Процедура предназначена для заполнения табличной части ценами номенклатуры исходя из типа цен договора контрагента
//
// Параметры:
//  ЗаказПокупателя                - ссылка на объект ЗаказПокупателя 
//
Процедура ЗаполнитьТабличнуюЧастьЦенами(ЗаказПокупателя)
	
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ЗаказПокупателя);
	
	СтруктураЗначений = ПолучитьСтруктуруФормы(ЗаказПокупателя);
	
	ЗаполнениеДокументов.ИзменитьЦеныВалюту(ЗаказПокупателя, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, , "Товары", мВалютаРегламентированногоУчета, , СтруктураЗначений);
	
КонецПроцедуры

// Функция возвращает структуру возвращаемых параметров, необходимых
// для заполнения табличной части заказа ценами номенклатуры
//
// Параметры:
//  ЗаказПокупателя   - ссылка на объект заказ покупателя
//
// Возвращаемое значение:
//  Структура - структура возвращаемых параметров.
//
Функция ПолучитьСтруктуруФормы(ЗаказПокупателя)
	
	// Заполним структуру возвращаемых параметров
	СтруктураВозвращаемыхЗначений = Новый Структура();
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийТипЦен"						, ЗаказПокупателя.ТипЦен);
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийВалютаДокумента"				, ЗаказПокупателя.ВалютаДокумента);
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийВалютаВзаиморасчетов"		, ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийКурсДокумента"				, ЗаказПокупателя.КурсВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийКурсВзаиморасчетов"			, ЗаказПокупателя.КурсВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийУчитыватьНДС"				, ЗаказПокупателя.УчитыватьНДС);
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийСуммаВключаетНДС"			, ЗаказПокупателя.СуммаВключаетНДС);
	
	СтруктураВозвращаемыхЗначений.Вставить("ПерезаполнитьЦеныПоТипу"			, Истина);
	СтруктураВозвращаемыхЗначений.Вставить("ПерезаполнитьПроцентСкидкиНаценки"  , Ложь);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйТипЦен"						, ЗаказПокупателя.ТипЦен);
	СтруктураВозвращаемыхЗначений.Вставить("ПересчитатьЦеныПоВалюте"			, Ложь);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйВалютаДокумента"				, ЗаказПокупателя.ВалютаДокумента);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйКурсДокумента"					, ЗаказПокупателя.КурсВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйКурсВзаиморасчетов"			, ЗаказПокупателя.КурсВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйУчитыватьНДС"					, ЗаказПокупателя.УчитыватьНДС);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйСуммаВключаетНДС"				, ЗаказПокупателя.СуммаВключаетНДС);
	
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийКратностьДокумента"			, ЗаказПокупателя.КратностьВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйКратностьДокумента"			, ЗаказПокупателя.КратностьВзаиморасчетов);
	
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийКратностьВзаиморасчетов"		, ЗаказПокупателя.КратностьВзаиморасчетов);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйКратностьВзаиморасчетов"		, ЗаказПокупателя.КратностьВзаиморасчетов);
	
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийАвторасчетНДС"				, Истина);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйАвторасчетНДС"					, Истина);
	СтруктураВозвращаемыхЗначений.Вставить("РассчитатьНДССУчетомОшибокОкругления", Ложь);
	
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийИспользоватьПлановуюСебестоимость", Ложь);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйИспользоватьПлановуюСебестоимость"  , Ложь);
	
	СтруктураВозвращаемыхЗначений.Вставить("ТекущийРегистрироватьЦеныПоставщика"     , Ложь);
	СтруктураВозвращаемыхЗначений.Вставить("НовыйРегистрироватьЦеныПоставщика"       , Ложь);
	
	Возврат СтруктураВозвращаемыхЗначений;
	
КонецФункции

Функция ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, ИмяПоля, Обязательное)
	
	xmlЗначение = СтрокаДерева.Найти(ИмяПоля, "Элемент", Ложь);
	
	Если xmlЗначение = Неопределено Тогда
		
		Если Обязательное Тогда
			Сообщить("В файле не найдено обязательное поле """ + ИмяПоля + """", СтатусСообщения.ОченьВажное);
		КонецЕсли;
		
		Возврат Неопределено;
		
	Иначе
		
		ТекстовоеЗначение = "" + xmlЗначение.Текст;
		
		Если Не ЗначениеЗаполнено(ТекстовоеЗначение) Тогда
			
			Если Обязательное Тогда
				Сообщить("Не заполнено обязательное поле """ + ИмяПоля + """", СтатусСообщения.Важное);
			КонецЕсли;
			
			Возврат Неопределено;
			
		Иначе
			
			Возврат ТекстовоеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУзелДерева(СтрокаДерева, ТипУзла, ИмяПоля)
	
	Если ТипУзла = "Строка" Тогда
		xmlУзел = СтрокаДерева.Найти(ИмяПоля, "Элемент", Ложь);
	ИначеЕсли ТипУзла = "Массив" Тогда
		xmlУзел = СтрокаДерева.НайтиСтроки(Новый Структура("Элемент", ИмяПоля), Ложь);
	Иначе
		xmlУзел = Неопределено;
	КонецЕсли;
	
	Возврат xmlУзел;
	
КонецФункции

// Функция определяет валюту 
//
// Параметры:
//  xmlВалюта               - представление валюты в файле обмена
//
// Возвращаемое значение:
// Валюта 					- СправочникСсылка.Валюты
//
Функция ПолучитьВалюту(xmlВалюта)
	
	Если xmlВалюта = "UAH" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(980);
	ИначеЕсли xmlВалюта = "RUB" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(643);
	ИначеЕсли xmlВалюта = "USD" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(840);
	ИначеЕсли xmlВалюта = "EUR" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(978);
	ИначеЕсли xmlВалюта = "MDL" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(498);
	ИначеЕсли xmlВалюта = "BYR" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(112);
	Иначе
		Возврат Справочники.Валюты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

//функция возвращает структуру с номенклатурой и единицей измерения по указанному штрих-коду
Функция ПолучитьНоменклатуру(ШтрихКод, НеПодбиратьНоменклатуруВАрхиве = Ложь)
	
	СтруктураТовара = Новый Структура;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &ШтрихКод
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|	И ВЫБОР
	|			КОГДА &НеПодбиратьНоменклатуруВАрхиве
	|				ТОГДА Штрихкоды.Владелец.абс_НеИспользоватьПриПодборе = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("ШтрихКод"						, ШтрихКод);
	Запрос.УстановитьПараметр("НеПодбиратьНоменклатуруВАрхиве"	, НеПодбиратьНоменклатуруВАрхиве);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураТовара.Вставить("Номенклатура",Выборка.Владелец);
		СтруктураТовара.Вставить("ЕдиницаИзмерения",Выборка.ЕдиницаИзмерения);
	Иначе
		СтруктураТовара.Вставить("Номенклатура",Справочники.Номенклатура.ПустаяСсылка());
		СтруктураТовара.Вставить("ЕдиницаИзмерения",Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураТовара;
	
КонецФункции

//функция возвращает номенклатуру найденную по артикулу покупталея
Функция ПолучитьНоменклатуруПоАртикулуПокупателя(АртикулПокупателя, Контрагент, НеПодбиратьНоменклатуруВАрхиве = Ложь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.Свойстваобъектов.абс_АртикулПокупателя)) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних
	|ГДЕ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства = &АртикулПокупателя
	|	И ВЫБОР
	|			КОГДА &НеПодбиратьНоменклатуруВАрхиве
	|				ТОГДА абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.Номенклатура.абс_НеИспользоватьПриПодборе = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("АртикулПокупателя"	, АртикулПокупателя);
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
	Запрос.УстановитьПараметр("НеПодбиратьНоменклатуруВАрхиве"			, НеПодбиратьНоменклатуруВАрхиве);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьОбОшибке("Не найдена номенклатура по артикулу покупателя: " + АртикулПокупателя + ", контрагент: " + Контрагент);
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

//функция возвращает организацию по GLN организации
Функция НайтиОрганизациюПоGLN(GLNОрганизации)
	
	ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("абс_GLN", GLNОрганизации);
	
	Если ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		
		Возврат ОрганизацияСсылка;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Организацииабс_GLNОрганизации.Ссылка
	|ИЗ
	|	Справочник.Организации.абс_GLNОрганизации КАК Организацииабс_GLNОрганизации
	|ГДЕ
	|	Организацииабс_GLNОрганизации.GLN = &GLN");
	
	Запрос.УстановитьПараметр("GLN", GLNОрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
	
КонецФункции	

//функция возвращает контрагента по GLN контрагента
Функция НайтиКонтрагентаПоGLN(GLNКонтрагента)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = Контрагенты.Ссылка
	|	И Контрагенты.абс_GLN = &GLNКонтрагента");
	
	Запрос.УстановитьПараметр("GLNКонтрагента", GLNКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();	
	
КонецФункции

//функция возвращает грузополучателя по GLN контрагента
Функция НайтиГрузополучателяПоGLN(GLNГрузополучателя)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	ВЫБОР
	|		КОГДА Контрагенты.ГоловнойКонтрагент = Контрагенты.Ссылка
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.абс_GLN = &GLNГрузополучателя
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("GLNГрузополучателя", GLNГрузополучателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();		
	
КонецФункции

// Функция предназначена для создания структуры образа документа "ЗаказПокупателя" по формату edi_su
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
// Структура образа документа.
//
Функция ПолучитьСтруктуруЗаказаПокупателяПоФормату_edi_su(Дерево, НастройкаОбменаСсылка) Экспорт
	
	ФлАдреса = Истина;
	
	СтруктураДокумента = Новый Структура;
	Отказ = Ложь;
	
	//Определяем реквизиты документа
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "ORDER");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		Сообщить("Файл не является ORDER-файлом!", СтатусСообщения.Важное);
	КонецЕсли;
	
	// Название документа(для ORDER = 220)(обязательное поле)
	ТипДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "DOCUMENTNAME", Истина);
	Если НЕ ТипДокумента = "220" Тогда
		Сообщить("Данные в файле не соотвествуют типу ""ORDER""", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли; 
	
	// Номер заказа(обязательное поле)
	xmlНомерПокупателя = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "NUMBER", Истина);
	Если НЕ xmlНомерПокупателя = Неопределено Тогда
		СтруктураДокумента.Вставить("НомерПокупателя", СокрЛП(xmlНомерПокупателя));
		СтруктураДокумента.Вставить("НомерПоДаннымПокупателя", СокрЛП(xmlНомерПокупателя));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//  Дата заказа(обязательное поле)
	xmlДатаЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "DATE", Истина);
	Если НЕ xmlДатаЗаказа = Неопределено Тогда
		СтруктураДокумента.Вставить("Дата", Дата(Прав(СокрЛП(xmlДатаЗаказа),2)+"."+Сред(СокрЛП(xmlДатаЗаказа),6,2)+"."+Лев(СокрЛП(xmlДатаЗаказа),4)+" 0:00:00"));
		СтруктураДокумента.Вставить("ДатаПоДаннымПокупателя", Дата(Прав(СокрЛП(xmlДатаЗаказа),2)+"."+Сред(СокрЛП(xmlДатаЗаказа),6,2)+"."+Лев(СокрЛП(xmlДатаЗаказа),4)+" 0:00:00"));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Дата поставки(обязательное поле)
	xmlДатапоставки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "DELIVERYDATE", Истина);
	Если НЕ xmlДатапоставки = Неопределено Тогда
		Датапоставки = Дата(Прав(СокрЛП(xmlДатапоставки),2)+"."+Сред(СокрЛП(xmlДатапоставки),6,2)+"."+Лев(СокрЛП(xmlДатапоставки),4)+" 0:00:00");
		СтруктураДокумента.Вставить("Датапоставки", Датапоставки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Время поставки(опциональное поле)
	xmlВремяпоставки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "DELIVERYTIME", Ложь);
	Если НЕ xmlВремяпоставки = Неопределено Тогда
		СтруктураДокумента.Вставить("Времяпоставки", xmlВремяпоставки);//Лев(Формат(Датапоставки, "Л=; ДЛФ=T"), ?(Найти(Формат(Датапоставки, "Л=; ДЛФ=T"), Символ(58)) = 1, 4, 5)));
	КонецЕсли;
	
	// Обозначение промоакции или № поставщика(опциональное поле)
	xmlОбозначениеПромоакции = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "CAMPAIGNNUMBER", Ложь);
	Если НЕ xmlОбозначениеПромоакции = Неопределено Тогда
		СтруктураДокумента.Вставить("ОбозначениеПромоакции", СокрЛП(xmlОбозначениеПромоакции));
	КонецЕсли;
	
	// Валюта(UAH,RUB,USD,EUR,MDL,BYR)(опциональное поле)
	xmlВалюта = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "CURRENCY", Ложь);
	Если НЕ xmlВалюта = Неопределено Тогда
		СтруктураДокумента.Вставить("Валюта", ПолучитьВалюту(xmlВалюта));
	КонецЕсли;
	
	//+ Лео Сафонов ЕА 17.03.2016
	// Дата прибытия транспорта
	УзелLIMES = ПолучитьУзелДерева(СтрокаДерева, "Строка", "LIMES");
	Если НЕ УзелLIMES = Неопределено Тогда
		СтрокаДереваLIMES = УзелLIMES.Строки;
		
		xmlНазваниеРампыРазгрузки = ПолучитьЗначениеВСтрокеДерева(СтрокаДереваLIMES, "LIMESNAME", Истина);
		Если НЕ xmlНазваниеРампыРазгрузки = Неопределено Тогда
			СтруктураДокумента.Вставить("НазваниеРампыРазгрузки", xmlНазваниеРампыРазгрузки);
		Иначе 
			СтруктураДокумента.Вставить("НазваниеРампыРазгрузки", Неопределено);
		КонецЕсли;
		
		xmlДатаПрибытияТранспорта = ПолучитьЗначениеВСтрокеДерева(СтрокаДереваLIMES, "DATEFROM", Истина);
		Если НЕ xmlДатаПрибытияТранспорта = Неопределено Тогда
			ДатаПрибытияТранспорта = Дата(Прав(СокрЛП(xmlДатаПрибытияТранспорта),2)+"."+Сред(СокрЛП(xmlДатаПрибытияТранспорта),6,2)+"."+Лев(СокрЛП(xmlДатаПрибытияТранспорта),4)+" 0:00:00");
			СтруктураДокумента.Вставить("ДатаПрибытияТранспорта", ДатаПрибытияТранспорта);
		Иначе 
			СтруктураДокумента.Вставить("ДатаПрибытияТранспорта", Неопределено);
		КонецЕсли;
		   
		// Время прибытия транспорта
		xmlВремяПрибытияТранспорта = ПолучитьЗначениеВСтрокеДерева(СтрокаДереваLIMES, "TIMEFROM", Ложь);
		Если НЕ xmlВремяПрибытияТранспорта = Неопределено Тогда
			СтрокаВремя = СокрЛП (xmlВремяПрибытияТранспорта);
			ВремяПрибытияТранспорта = ДАТА (0001,01,01,Лев(СтрокаВремя,2),Прав(СтрокаВремя,2),00);
			СтруктураДокумента.Вставить("ВремяПрибытияТранспорта", ВремяПрибытияТранспорта);
		Иначе 
			СтруктураДокумента.Вставить("ВремяПрибытияТранспорта", Неопределено);

		КонецЕсли;
	Иначе	
	    СтруктураДокумента.Вставить("ВремяПрибытияТранспорта", Неопределено);
        СтруктураДокумента.Вставить("ДатаПрибытияТранспорта", Неопределено);
		СтруктураДокумента.Вставить("НазваниеРампыРазгрузки", Неопределено);

	КонецЕсли;

	//- Лео Сафонов ЕА 17.03.2016 
	
	// Свободный текст(опциональное поле)
	xmlINFO = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "INFO", Ложь);
	Если НЕ xmlINFO = Неопределено Тогда 
		Если  xmlINFO = "СТОК" Тогда 
			СтруктураДокумента.Вставить("абс_СтокТранзит", Перечисления.абс_СтокТранзит.Сток);
		ИначеЕсли  xmlINFO = "ТРАНЗИТ" Тогда
			СтруктураДокумента.Вставить("абс_СтокТранзит", Перечисления.абс_СтокТранзит.Транзит);
		Иначе
			СтруктураДокумента.Вставить("абс_СтокТранзит", Неопределено);
			СтруктураДокумента.Вставить("СвободныйТекст", СокрЛП(xmlINFO));
		КонецЕсли;	
	КонецЕсли;

	
	//HEAD
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Поставщик(организация)(обязательное поле)
	xmlОрганизацияGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "SUPPLIER", Истина);
	Если НЕ xmlОрганизацияGLN = Неопределено Тогда
		
		ОрганизацияСсылка = НайтиОрганизациюПоGLN(xmlОрганизацияGLN);		
		//ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("абс_GLN", xmlОрганизацияGLN);
		
		Если НЕ ОрганизацияСсылка.Пустая() Тогда
			СтруктураДокумента.Вставить("Организация", ОрганизацияСсылка);
		Иначе
			Сообщить("Не найдена организация. " + "Возможно заказ нам не принадлежит! Дальнейшее заполнение не возможно!", СтатусСообщения.ОченьВажное);
			
			СтруктураДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
			//Возврат Неопределено;			
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		//Возврат Неопределено;
	КонецЕсли;
	
	// Покупатель(контрагент)(обязательное поле)
	xmlКонтрагентGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "BUYER", Истина);
	Если НЕ xmlКонтрагентGLN = Неопределено Тогда
		
		Если Метаданные.Справочники.Контрагенты.Реквизиты.Найти("абс_GLN") = Неопределено Тогда
			Сообщить("Отсутствует необходимый для загрузки данных реквизит <GLN> в справочнике <Контрагенты>", СтатусСообщения.Важное);
			Возврат Неопределено;
		КонецЕсли;
		
		//КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", xmlКонтрагентGLN);
		КонтрагентСсылка = НайтиКонтрагентаПоGLN(xmlКонтрагентGLN);
		
		СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
		//+Лео Никитин(
		Контрагент_для_повторного_поиска=КонтрагентСсылка;
		//
	Иначе
		СтруктураДокумента.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		//Возврат Неопределено;
	КонецЕсли;
	
	// Плательщик(контрагент)(необязательное поле)
	xmlПлательщикGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "INVOICEPARTNER", Ложь);
	Если НЕ xmlПлательщикGLN = Неопределено Тогда
		
		Если Метаданные.Справочники.Контрагенты.Реквизиты.Найти("абс_GLN") = Неопределено Тогда
			Сообщить("Отсутствует необходимый для загрузки данных реквизит <GLN> в справочнике <Контрагенты>", СтатусСообщения.Важное);
			Возврат Неопределено;
		КонецЕсли;
		
		КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", xmlПлательщикGLN);
		//- никитин
		//СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
		//-Никитин
		//+Лео Никитин (
		Если НЕ КонтрагентСсылка.Пустая() Тогда  
			СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
		КонецЕсли;
        //+Лео Никитин )
	Иначе
		//Возврат Неопределено;
	КонецЕсли;
	
	//грузополучатель
	xmlАдресДоставкиGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "DELIVERYPLACE", Ложь);
	Если НЕ xmlАдресДоставкиGLN = Неопределено Тогда
		//ГрузополучательСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN",xmlАдресДоставкиGLN);
		ГрузополучательСсылка = НайтиГрузополучателяПоGLN(xmlАдресДоставкиGLN);
		СтруктураДокумента.Вставить("Грузополучатель", ГрузополучательСсылка);
	КонецЕсли;
	
	// Получатель(обязательное поле)
	xmlПолучательGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "RECIPIENT", Ложь);
	Если НЕ xmlПолучательGLN = Неопределено Тогда
		ПолучательСсылка = Справочники.Организации.НайтиПоРеквизиту("абс_GLN", xmlПолучательGLN);
		
		Если НЕ ПолучательСсылка.Пустая() Тогда
			СтруктураДокумента.Вставить("Получатель", ПолучательСсылка);
		Иначе
			Сообщить("Не найден получатель с GLN " + xmlПолучательGLN + ". Дальнейшее заполнение не возможно!", СтатусСообщения.ОченьВажное);
			СтруктураДокумента.Вставить("Получатель", Справочники.Контрагенты.ПустаяСсылка());
			//Возврат Неопределено;
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Получатель", Справочники.Контрагенты.ПустаяСсылка());
		//Возврат Неопределено;
	КонецЕсли;
	
	// Номер транзакции
	xmlEDIINTERCHANGEID = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "EDIINTERCHANGEID", Ложь);
	Если НЕ xmlEDIINTERCHANGEID = Неопределено Тогда
		СтруктураДокумента.Вставить("EDIINTERCHANGEID", xmlEDIINTERCHANGEID);
	КонецЕсли;
	
	// Табличная часть
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "POSITION"); 
	
	// Создаем таблицуЗначений, в которую выгружаем табличную часть документа
	ДокументТЧ=Новый ТаблицаЗначений;
	ДокументТЧ.Колонки.Добавить("НомерСтрокиТЧ");
	ДокументТЧ.Колонки.Добавить("Номенклатура");
	ДокументТЧ.Колонки.Добавить("Количество");
	ДокументТЧ.Колонки.Добавить("КоличествоЗаказанное");
	ДокументТЧ.Колонки.Добавить("ШтрихКод");
	ДокументТЧ.Колонки.Добавить("АртикулПоставщика");
	ДокументТЧ.Колонки.Добавить("АртикулПокупателя");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмерения");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияМест");
	ДокументТЧ.Колонки.Добавить("КоличествоВУпаковке");
	ДокументТЧ.Колонки.Добавить("Цена");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияЦены");
	ДокументТЧ.Колонки.Добавить("ОписаниеПродукта");
	ДокументТЧ.Колонки.Добавить("КоличествоМест");
	ДокументТЧ.Колонки.Добавить("Коэффициент");
	
	Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
		
		СтрокаДерева = Узел.Строки;
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		
		//Номер строки (этот параметр при создании заказа не используется, может быть проверочным)
		xmlНомерСтрокиТЧ = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "POSITIONNUMBER", Истина);
		Если НЕ xmlНомерСтрокиТЧ = Неопределено Тогда
			НоваяСтрокаТЧ.НомерСтрокиТЧ = xmlНомерСтрокиТЧ;
		Иначе
			//Возврат Неопределено;
		КонецЕсли;
		
		// Определяем атрибуты номенклатуры:
		
		//Артикул покупателя(опциональное поле)
		xmlАртикулПокупателяСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "PRODUCTIDBUYER", Ложь);
		Если НЕ xmlАртикулПокупателяСтрока = Неопределено Тогда
			АртикулПокупателя = xmlАртикулПокупателяСтрока;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АртикулПокупателя) Тогда
			//+Лео Сафонов ЕА
			Если СтруктураДокумента.Контрагент = Справочники.Контрагенты.ПустаяСсылка()Тогда
				СтруктураДокумента.Контрагент = СтруктураДокумента.Грузополучатель.ГоловнойКонтрагент;		
			КонецЕсли;
			//-Лео Сафонов ЕА
			
			НоваяСтрокаТЧ.Номенклатура = ПолучитьНоменклатуруПоАртикулуПокупателя(АртикулПокупателя, СтруктураДокумента.Контрагент, НастройкаОбменаСсылка.НеПодбиратьНоменклатуруВАрхиве);
			////=Никитин Если не нашли по плательщику, повторить поиск по Контрагенту
			//Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
			//	НоваяСтрокаТЧ.Номенклатура = ПолучитьНоменклатуруПоАртикулуПокупателя(АртикулПокупателя, Контрагент_для_повторного_поиска, НастройкаОбменаСсылка.НеПодбиратьНоменклатуруВАрхиве);				
			//	
			//КонецЕсли;
 
			
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				
				НоваяСтрокаТЧ.ЕдиницаИзмерения = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;				
				
			КонецЕсли;
		КонецЕсли;		
		
		// Штрих - код номенклатуры
		xmlШтрихКодНоменклатуры = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "PRODUCT", Истина);
		Если НЕ xmlШтрихКодНоменклатуры = Неопределено И НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
			
			СтруктураНоменклатуры=ПолучитьНоменклатуру(xmlШтрихКодНоменклатуры);
			
			НоваяСтрокаТЧ.Номенклатура     = СтруктураНоменклатуры.Номенклатура;
			НоваяСтрокаТЧ.ЕдиницаИзмерения = СтруктураНоменклатуры.ЕдиницаИзмерения;
			НоваяСтрокаТЧ.Коэффициент	   = СтруктураНоменклатуры.ЕдиницаИзмерения.Коэффициент;
			
			Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не найдена номенклатура по штрихкоду: " + xmlШтрихКодНоменклатуры + " в строке " + xmlНомерСтрокиТЧ);
				//Отказ = Истина;
				//Продолжить;
			КонецЕсли;
			
			
		Иначе
			
			//Отказ = Истина;
			
		КонецЕсли;
		
		xmlКоличество = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "ORDEREDQUANTITY", Истина);
		Если НЕ xmlКоличество = Неопределено Тогда
			НоваяСтрокаТЧ.Количество = Число(xmlКоличество);
		Иначе
			НоваяСтрокаТЧ.Количество = 0;
			//Возврат Неопределено;
		КонецЕсли;
		
		// Количество в упаковке(опциональное поле)
		xmlКоличествоВУпаковке = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "QUANTITYOFCUINTU", Ложь);
		Если НЕ xmlКоличествоВУпаковке = Неопределено Тогда
			
			// ЗагружатьКоличествоПоМестам - свойство необходимо для правильной загрузки количества и количества мест:
			//	Истина означает что в поле ORDEREDQUANTITY находится количество мест/коробов, а в поле QUANTITYOFCUINTU - количество штук в одном месте/коробе
			//		соотетственно итоговое количество штук = ORDEREDQUANTITY * QUANTITYOFCUINTU, количество мест = ORDEREDQUANTITY;
			// 		Пример: Контрагент БИЛЛА;
			//  Ложь означает что в поле ORDEREDQUANTITY находится итоговое количество штук, а в поле QUANTITYOFCUINTU - количество штук в одном месте/коробе
			//		соответственно итоговое количество штук = ORDEREDQUANTITY, количество мест = ORDEREDQUANTITY / QUANTITYOFCUINTU;
			//		Пример: Контрагент Тандер;
			// Значение по умолчанию - Ложь;
			
			ЗагружатьКоличествоПоМестам = абс_Дистрибуция.ПолучитьЗначениеСвойстваОбъекта(СтруктураДокумента.Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ЗагрузкаКоличестваПоМестамEDI);
			
			Если ЗагружатьКоличествоПоМестам = Неопределено Тогда
				ЗагружатьКоличествоПоМестам = Ложь;
			КонецЕсли;
			
			
			КоличествоВУпаковке = Число(xmlКоличествоВУпаковке);
			
			Если ЗначениеЗаполнено(КоличествоВУпаковке) И ЗагружатьКоличествоПоМестам Тогда
				НоваяСтрокаТЧ.Количество = НоваяСтрокаТЧ.Количество * КоличествоВУпаковке;				
			КонецЕсли;
			
			//+Лео Сафонов ЕА Ошибка возникает если заказано количество равное количеству в одном коробе. Например заказано 180, в коробе 180. В результате ошибки получаем 180 коробов по 1 штуке. 
			//
			//Если КоличествоВУпаковке = НоваяСтрокаТЧ.Количество Тогда
			//	НоваяСтрокаТЧ.КоличествоМест       	= НоваяСтрокаТЧ.Количество;
			//	НоваяСтрокаТЧ.ЕдиницаИзмеренияМест 	= НоваяСтрокаТЧ.ЕдиницаИзмерения;
			//	НоваяСтрокаТЧ.ЕдиницаИзмерения 		= НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
			//	НоваяСтрокаТЧ.Коэффициент	 		= НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			//Иначе //надо определить ед. изм. мест путем соотношения кол-ва и кол-ва упаковок
			//	
			//	ЕдиницаНайдена = Ложь;
			//	ПодчиненныеЕдиницыВыборка = Справочники.ЕдиницыИзмерения.Выбрать(,НоваяСтрокаТЧ.Номенклатура);
			//	Пока ПодчиненныеЕдиницыВыборка.Следующий() Цикл
			//		Если ПодчиненныеЕдиницыВыборка.Коэффициент = КоличествоВУпаковке Тогда
			//			НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / КоличествоВУпаковке; 
			//			НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = ПодчиненныеЕдиницыВыборка.Ссылка;
			//			
			//			ЕдиницаНайдена = Истина;
			//			Прервать;
			//		КонецЕсли;
			//	КонецЦикла;
			//	
			//	Если Не ЕдиницаНайдена Тогда
			//		Сообщить("Для товара в строке " + Строка(НоваяСтрокаТЧ.НомерСтрокиТЧ) + " не найдено ед. измерения с коэфф. = " + Строка(КоличествоВУпаковке),
			//		СтатусСообщения.Информация);
			//	КонецЕсли;
			//КонецЕсли;
			
			
			ЕдиницаНайдена = Ложь;
			ПодчиненныеЕдиницыВыборка = Справочники.ЕдиницыИзмерения.Выбрать(,НоваяСтрокаТЧ.Номенклатура);
			Пока ПодчиненныеЕдиницыВыборка.Следующий() Цикл
				Если ПодчиненныеЕдиницыВыборка.Коэффициент = КоличествоВУпаковке Тогда
					НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / КоличествоВУпаковке; 
					НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = ПодчиненныеЕдиницыВыборка.Ссылка;
					
					ЕдиницаНайдена = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЕдиницаНайдена Тогда
				Сообщить("Для товара в строке " + Строка(НоваяСтрокаТЧ.НомерСтрокиТЧ) + " не найдено ед. измерения с коэфф. = " + Строка(КоличествоВУпаковке),
				СтатусСообщения.Информация);
				
				НоваяСтрокаТЧ.КоличествоМест       	= НоваяСтрокаТЧ.Количество;
				НоваяСтрокаТЧ.ЕдиницаИзмеренияМест 	= НоваяСтрокаТЧ.ЕдиницаИзмерения;
				НоваяСтрокаТЧ.ЕдиницаИзмерения 		= НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТЧ.Коэффициент	 		= НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			//-Лео Сафонов ЕА Ошибка возникает если заказано количество равное количеству в одном коробе. 			
		КонецЕсли;
		
		// Цена продукта без НДС(опциональное поле)
		xmlЦенаБезНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "ORDERPRICE", Ложь);
		Если НЕ xmlЦенаБезНДС = Неопределено Тогда
			НоваяСтрокаТЧ.Цена = Число(xmlЦенаБезНДС);
		КонецЕсли;
		
		// Единицы измерения цены(опциональное поле)
		xmlЕдиницаИзмеренияЦены = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "ORDERPRICEUNIT", Ложь);
		Если НЕ xmlЕдиницаИзмеренияЦены = Неопределено Тогда
			//НоваяСтрокаТЧ.ЕдиницаИзмеренияЦены = СокрЛП(xmlЕдиницаИзмеренияЦены);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.ЕдиницаИзмеренияМест) Тогда
			абс_Дистрибуция.ЗаполнитьЕдиницуМестТабЧасти(НоваяСтрокаТЧ, СтруктураДокумента);
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ЕдиницаИзмеренияМест) И НЕ НоваяСтрокаТЧ.ЕдиницаИзмеренияМест.Коэффициент = 0 И ЗначениеЗаполнено(НоваяСтрокаТЧ.Количество) Тогда
				
				НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / НоваяСтрокаТЧ.ЕдиницаИзмеренияМест.Коэффициент; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтруктураДокумента;
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьСтруктуруЗаказаПокупателяПоФормату_ecode_ru(Дерево, НастройкаОбменаСсылка) Экспорт
	
	СтруктураДокумента = Новый Структура;
	
	Отказ = Ложь;
	
	//Определяем реквизиты документа
	СтрокаЗаголовка = ПолучитьУзелДерева(Дерево.Строки, "Строка", "Document-Order");
	Если НЕ СтрокаЗаголовка = Неопределено Тогда
		СтрокиЗаголовка = СтрокаЗаголовка.Строки;
	Иначе
		Сообщить("Не найден узел Document-Order!", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаШапки1 = ПолучитьУзелДерева(СтрокиЗаголовка, "Строка", "Order-Header");
	СтрокиШапки1 = СтрокаШапки1.Строки;
	
	//основные реквизиты шапки
	ВходящийНомерЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "OrderNumber", Истина);
	Если ВходящийНомерЗаказа <> Неопределено Тогда
		СтруктураДокумента.Вставить("ВходящийНомер",ВходящийНомерЗаказа);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ДатаЗаказаХМЛ = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "OrderDate", Истина);
	Если ДатаЗаказаХМЛ <> Неопределено Тогда
		ДатаДокумента = Дата(СтрЗаменить(ДатаЗаказаХМЛ,"-",""));
		СтруктураДокумента.Вставить("Дата",ДатаДокумента);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ДатаПоставкиХМЛ = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "ExpectedDeliveryDate", Истина);
	Если ДатаПоставкиХМЛ <> Неопределено Тогда
		ДатаПоставки = Дата(СтрЗаменить(ДатаПоставкиХМЛ,"-",""));
		СтруктураДокумента.Вставить("ДатаПоставки",ДатаПоставки);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Валюта = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "Currency", Ложь);
	Если Валюта <> Неопределено Тогда
		СтруктураДокумента.Вставить("Валюта", ПолучитьВалюту(Валюта));
	Иначе
		//Отказ = Истина;
		СтруктураДокумента.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	КонецЕсли;
	
	// Сток транзит
	СтруктураДокумента.Вставить("абс_СтокТранзит", Неопределено);
	xmlСтокТранзит = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "FlowType", Ложь);
	Если НЕ xmlСтокТранзит = Неопределено Тогда
		Если СокрЛП(xmlСтокТранзит) = "TR" Тогда
			СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Транзит;
		Иначе
			СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Сток;
		КонецЕсли;
	КонецЕсли;
	
	//реквизиты поставщика, покупателя, грузполучателя
	СтрокаШапки2 = ПолучитьУзелДерева(СтрокиЗаголовка, "Строка", "Order-Parties");	
	СтрокиШапки2 = СтрокаШапки2.Строки;
	
	//ГЛН покупателя
	СтрокаШапкиПокупатель = ПолучитьУзелДерева(СтрокиШапки2, "Строка", "Buyer");
	СтрокиШапкиПокупатель = СтрокаШапкиПокупатель.Строки;
	
	ПокупательИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиШапкиПокупатель, "ILN", Истина);
	Если ПокупательИЛН <> Неопределено Тогда
		//КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", ПокупательИЛН);
		КонтрагентСсылка = НайтиКонтрагентаПоGLN(ПокупательИЛН);
		Если КонтрагентСсылка.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Не найден контрагент с GLN " + ПокупательИЛН,СтатусСообщения.Важное);
		Иначе
			СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;
	
	//ГЛН поставщика
	СтрокаШапкиПоставщик = ПолучитьУзелДерева(СтрокиШапки2, "Строка", "Seller");
	СтрокиШапкиПоставщик = СтрокаШапкиПоставщик.Строки;
	
	ПоставщикИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиШапкиПоставщик, "ILN", Истина);
	Если ПоставщикИЛН <> Неопределено Тогда
		ОрганизацияСсылка = НайтиОрганизациюПоGLN(ПоставщикИЛН);		
		//ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("абс_GLN", xmlОрганизацияGLN);
		Если НЕ ОрганизацияСсылка.Пустая() Тогда
			СтруктураДокумента.Вставить("Организация",ОрганизацияСсылка);
		Иначе
			Сообщить("Не найдена организация с GLN " + ПоставщикИЛН, СтатусСообщения.ОченьВажное);
			
			СтруктураДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
			//Возврат Неопределено;
			
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;
	
	//ГЛН грузополучателя
	СтрокаШапкиГрузополучатель = ПолучитьУзелДерева(СтрокиШапки2, "Строка", "DeliveryPoint");
	СтрокиШапкиГрузополучатель = СтрокаШапкиГрузополучатель.Строки;
	
	ГрузополучательИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиШапкиГрузополучатель, "ILN", Истина);
	Если ГрузополучательИЛН <> Неопределено Тогда
		//ГрузополучательСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", ГрузополучательИЛН);
		ГрузополучательСсылка = НайтиГрузополучателяПоGLN(ГрузополучательИЛН);
		Если ГрузополучательСсылка.Пустая() Тогда
			Сообщить("Не найден грузополучатель с GLN " + ГрузополучательИЛН,СтатусСообщения.Важное);
			//Отказ = Истина;
			СтруктураДокумента.Вставить("Грузополучатель", Справочники.Контрагенты.ПустаяСсылка());
		Иначе
			СтруктураДокумента.Вставить("Грузополучатель", ГрузополучательСсылка);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Грузополучатель", Справочники.Контрагенты.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;	
	
	//строки табличной части Товары
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокиЗаголовка, "Строка", "Order-Lines");	
	
	// Создаем таблицуЗначений, в которую выгружаем табличную часть документа
	ДокументТЧ=Новый ТаблицаЗначений;
	ДокументТЧ.Колонки.Добавить("НомерСтрокиТЧ");
	ДокументТЧ.Колонки.Добавить("Номенклатура");
	ДокументТЧ.Колонки.Добавить("Количество");
	ДокументТЧ.Колонки.Добавить("КоличествоЗаказанное");
	ДокументТЧ.Колонки.Добавить("ШтрихКод");
	ДокументТЧ.Колонки.Добавить("АртикулПоставщика");
	ДокументТЧ.Колонки.Добавить("АртикулПокупателя");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмерения");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияМест");
	ДокументТЧ.Колонки.Добавить("КоличествоВУпаковке");
	ДокументТЧ.Колонки.Добавить("Цена");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияЦены");
	ДокументТЧ.Колонки.Добавить("ОписаниеПродукта");
	ДокументТЧ.Колонки.Добавить("КоличествоМест");
	ДокументТЧ.Колонки.Добавить("Коэффициент");
	
	ЭтоПерваяСтрока = Истина;
	
	Для Каждого СтрокаТабЧасти ИЗ ТабличнаяЧасть.Строки Цикл
		
		ПодчиненныеСтроки = СтрокаТабЧасти.Строки;
		
		ЗаголовокСтрокТЧ = ПолучитьУзелДерева(ПодчиненныеСтроки, "Строка", "Line-Item");
		СтрокаДерева = ЗаголовокСтрокТЧ.Строки;
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		
		//Номер строки (этот параметр при создании заказа не используется, может быть проверочным)
		xmlНомерСтрокиТЧ = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "LineNumber", Истина);
		Если НЕ xmlНомерСтрокиТЧ = Неопределено Тогда
			НоваяСтрокаТЧ.НомерСтрокиТЧ = xmlНомерСтрокиТЧ;
		КонецЕсли;
		
		// Сток транзит
		Если ЭтоПерваяСтрока Тогда
			xmlСтокТранзит = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "FlowType", Ложь);
			Если НЕ xmlСтокТранзит = Неопределено Тогда
				Если СокрЛП(xmlСтокТранзит) = "TR" Тогда
					СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Транзит;
				Иначе
					СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Сток;
				КонецЕсли;
			КонецЕсли;
			
			ЭтоПерваяСтрока = Ложь;
			
		КонецЕсли;		
		
		// Определяем атрибуты номенклатуры:
		
		// Артикул покупателя(опциональное поле)
		xmlАртикулПокупателяСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "BuyerItemCode", Ложь);
		
		Если НЕ xmlАртикулПокупателяСтрока = Неопределено Тогда
			АртикулПокупателя = xmlАртикулПокупателяСтрока;
		Иначе
			//Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АртикулПокупателя) Тогда
			
			НоваяСтрокаТЧ.Номенклатура = ПолучитьНоменклатуруПоАртикулуПокупателя(АртикулПокупателя, СтруктураДокумента.Контрагент, НастройкаОбменаСсылка.НеПодбиратьНоменклатуруВАрхиве);
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				
				НоваяСтрокаТЧ.ЕдиницаИзмерения = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;				
				
			КонецЕсли;
		КонецЕсли;		
		
		// Штрих - код номенклатуры
		xmlШтрихКодНоменклатуры = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "EAN", Истина);
		Если НЕ xmlШтрихКодНоменклатуры = Неопределено И НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
			СтруктураНоменклатуры = ПолучитьНоменклатуру(xmlШтрихКодНоменклатуры);
			НоваяСтрокаТЧ.Номенклатура = СтруктураНоменклатуры.Номенклатура;
			
			Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не найдена номенклатура по штрихкоду: " + xmlШтрихКодНоменклатуры + " в строке " + xmlНомерСтрокиТЧ);
				//Отказ = Истина;
				//Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТЧ.ЕдиницаИзмерения = СтруктураНоменклатуры.ЕдиницаИзмерения;
			НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			
		Иначе
			
			//Отказ = Истина;
			
		КонецЕсли;
		
		// Количество(обязательное поле)
		xmlКоличество = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "OrderedQuantity", Истина);
		Если НЕ xmlКоличество = Неопределено Тогда
			НоваяСтрокаТЧ.Количество = Число(xmlКоличество);
		Иначе
			НоваяСтрокаТЧ.Количество = 0;
			//Отказ = Истина;
		КонецЕсли;
		
		// Количество в упаковке(опциональное поле)
		xmlКоличествоВУпаковке = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "OrderedUnitPacksize", Ложь);
		Если НЕ xmlКоличествоВУпаковке = Неопределено Тогда
			КоличествоВУпаковке = Число(xmlКоличествоВУпаковке);
			
			Если КоличествоВУпаковке = НоваяСтрокаТЧ.Количество Тогда
				НоваяСтрокаТЧ.КоличествоМест       = НоваяСтрокаТЧ.Количество;
				НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = НоваяСтрокаТЧ.ЕдиницаИзмерения;
			Иначе //надо определить ед. изм. мест путем соотношения кол-ва и кол-ва упаковок
				
				ЕдиницаНайдена = Ложь;
				ПодчиненныеЕдиницыВыборка = Справочники.ЕдиницыИзмерения.Выбрать(,НоваяСтрокаТЧ.Номенклатура);
				Пока ПодчиненныеЕдиницыВыборка.Следующий() Цикл
					Если ПодчиненныеЕдиницыВыборка.Коэффициент = КоличествоВУпаковке Тогда
						НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / КоличествоВУпаковке; 
						НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = ПодчиненныеЕдиницыВыборка.Ссылка;
						
						ЕдиницаНайдена = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЕдиницаНайдена Тогда
					Сообщить("Для товара в строке " + Строка(НоваяСтрокаТЧ.НомерСтрокиТЧ) + " не найдено ед. измерения с коэфф. = " + Строка(КоличествоВУпаковке),
					СтатусСообщения.Информация);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Цена продукта
		xmlЦена = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "OrderedUnitNetPrice", Ложь);
		Если НЕ xmlЦена = Неопределено Тогда
			НоваяСтрокаТЧ.Цена = Число(xmlЦена);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	
	//+Лно Сафонов ЕА
	СтруктураДокумента.Вставить("ДатаПрибытияТранспорта", Неопределено);
	СтруктураДокумента.Вставить("ВремяПрибытияТранспорта", Неопределено);
	СтруктураДокумента.Вставить("НазваниеРампыРазгрузки", Неопределено);
	//-Лно Сафонов ЕА
	
	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтруктураДокумента;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруЗаказаПокупателяПоФормату_DIP7K(Дерево, НастройкаОбменаСсылка) Экспорт
	
	СтруктураДокумента = Новый Структура;
	НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.DIP7K;
	
	Отказ = Ложь;
	//верхний узел
	НаборДанных = ПолучитьУзелДерева(Дерево.Строки, "Строка", "NewDataSet");
	
	//Определяем реквизиты документа
	СтрокаЗаголовка = ПолучитьУзелДерева(НаборДанных.Строки, "Строка", "Orders");
	Если НЕ СтрокаЗаголовка = Неопределено Тогда
		СтрокиЗаголовка = СтрокаЗаголовка.Строки;
	Иначе
		Сообщить("Не найден узел Orders!", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	//основные реквизиты шапки
	ВходящийНомерЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокиЗаголовка, "OrderId", Истина);
	Если ВходящийНомерЗаказа <> Неопределено Тогда
		СтруктураДокумента.Вставить("ВходящийНомер",ВходящийНомерЗаказа);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ДатаЗаказаХМЛ = ПолучитьЗначениеВСтрокеДерева(СтрокиЗаголовка, "OrderDate", Истина);
	Если ДатаЗаказаХМЛ <> Неопределено Тогда
		ДатаДокумента = Дата(Лев(СтрЗаменить(ДатаЗаказаХМЛ,"-",""),8));
		СтруктураДокумента.Вставить("Дата",ДатаДокумента);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ДатаПоставкиХМЛ = ПолучитьЗначениеВСтрокеДерева(СтрокиЗаголовка, "DeliveryDate", Истина);
	Если ДатаПоставкиХМЛ <> Неопределено Тогда
		ДатаПоставки = Дата(Лев(СтрЗаменить(ДатаПоставкиХМЛ,"-",""),8));
		СтруктураДокумента.Вставить("ДатаПоставки",ДатаПоставки);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Валюта", ПолучитьВалюту("RUB"));
	
	//реквизиты поставщика, покупателя, грузполучателя
	//ГЛН покупателя
	СтруктураДокумента.Вставить("Контрагент", НастройкаОбмена.КонтрагентПоУмолчанию);
	
	//ГЛН поставщика
	СтруктураДокумента.Вставить("Организация",НастройкаОбмена.ОрганизацияПоУмолчанию);
	
	//ГЛН грузополучателя
	ГрузополучательИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиЗаголовка, "ShopId", Истина);
	Если ГрузополучательИЛН <> Неопределено Тогда
		ГрузополучательСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", ГрузополучательИЛН);
		Если ГрузополучательСсылка.Пустая() Тогда
			//Отказ = Истина;
			ОбщегоНазначения.СообщитьОбОшибке("Не найден грузополучатель DIP7K с GLN " + ГрузополучательИЛН);
			СтруктураДокумента.Вставить("Грузополучатель",	Справочники.Контрагенты.ПустаяСсылка());
		Иначе
			СтруктураДокумента.Вставить("Грузополучатель",	ГрузополучательСсылка);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Грузополучатель",	Справочники.Контрагенты.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;
	
	СтруктураДокумента.Вставить("абс_СтокТранзит", Неопределено);
	
	//строки табличной части Товары
	ТабличнаяЧасть = ПолучитьУзелДерева(НаборДанных.Строки, "Массив", "OrderItems");	
	
	// Создаем таблицуЗначений, в которую выгружаем табличную часть документа
	ДокументТЧ=Новый ТаблицаЗначений;
	ДокументТЧ.Колонки.Добавить("НомерСтрокиТЧ");
	ДокументТЧ.Колонки.Добавить("Номенклатура");
	ДокументТЧ.Колонки.Добавить("Количество");
	ДокументТЧ.Колонки.Добавить("КоличествоЗаказанное");
	ДокументТЧ.Колонки.Добавить("ШтрихКод");
	ДокументТЧ.Колонки.Добавить("АртикулПоставщика");
	ДокументТЧ.Колонки.Добавить("АртикулПокупателя");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмерения");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияМест");
	ДокументТЧ.Колонки.Добавить("КоличествоВУпаковке");
	ДокументТЧ.Колонки.Добавить("Цена");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияЦены");
	ДокументТЧ.Колонки.Добавить("ОписаниеПродукта");
	ДокументТЧ.Колонки.Добавить("КоличествоМест");
	ДокументТЧ.Колонки.Добавить("Коэффициент");
	
	Для Каждого СтрокаТабЧасти ИЗ ТабличнаяЧасть Цикл
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		
		//Номер строки (этот параметр при создании заказа не используется, может быть проверочным)
		//xmlНомерСтрокиТЧ = ПолучитьЗначениеВСтрокеДерева(СтрокаТабЧасти.Строки, "LineNumber", Истина);
		//Если НЕ xmlНомерСтрокиТЧ = Неопределено Тогда
		//	НоваяСтрокаТЧ.НомерСтрокиТЧ = xmlНомерСтрокиТЧ;
		//КонецЕсли;
		
		// Определяем атрибуты номенклатуры:
		
		// Артикул покупателя(опциональное поле)
		xmlАртикулПокупателяСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаТабЧасти.Строки, "ItemId", Ложь);
		
		Если НЕ xmlАртикулПокупателяСтрока = Неопределено Тогда
			АртикулПокупателя = xmlАртикулПокупателяСтрока;
		Иначе
			//Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АртикулПокупателя) Тогда
			
			НоваяСтрокаТЧ.Номенклатура = ПолучитьНоменклатуруПоАртикулуПокупателя(АртикулПокупателя, СтруктураДокумента.Контрагент, НастройкаОбменаСсылка.НеПодбиратьНоменклатуруВАрхиве);
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				
				НоваяСтрокаТЧ.ЕдиницаИзмерения = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;				
				
			КонецЕсли;
		КонецЕсли;	
		
		// Штрих - код номенклатуры
		xmlШтрихКодНоменклатуры = ПолучитьЗначениеВСтрокеДерева(СтрокаТабЧасти.Строки, "Barcode", Истина);
		Если НЕ xmlШтрихКодНоменклатуры = Неопределено И НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
			СтруктураНоменклатуры = ПолучитьНоменклатуру(xmlШтрихКодНоменклатуры);
			НоваяСтрокаТЧ.Номенклатура = СтруктураНоменклатуры.Номенклатура;
			
			Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не найдена номенклатура по штрихкоду: " + xmlШтрихКодНоменклатуры);
				//Отказ = Истина;
				//Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТЧ.ЕдиницаИзмерения = СтруктураНоменклатуры.ЕдиницаИзмерения;
			НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			
		Иначе
			
			//Отказ = Истина;
			
		КонецЕсли;
		
		// Количество(обязательное поле)
		xmlКоличество = ПолучитьЗначениеВСтрокеДерева(СтрокаТабЧасти.Строки, "OrderedQty", Истина);
		Если НЕ xmlКоличество = Неопределено Тогда
			НоваяСтрокаТЧ.Количество = Число(xmlКоличество);
		Иначе
			НоваяСтрокаТЧ.Количество = 0;
			//Отказ = Истина;
		КонецЕсли;
		
		// Количество в упаковке(опциональное поле)
		//xmlКоличествоВУпаковке = ПолучитьЗначениеВСтрокеДерева(СтрокаТабЧасти.Строки, "OrderedUnitPacksize", Ложь);
		//Если НЕ xmlКоличествоВУпаковке = Неопределено Тогда
		//	КоличествоВУпаковке = Число(xmlКоличествоВУпаковке);
		//	
		//	Если КоличествоВУпаковке = НоваяСтрокаТЧ.Количество Тогда
		//		НоваяСтрокаТЧ.КоличествоМест       = НоваяСтрокаТЧ.Количество;
		//		НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = НоваяСтрокаТЧ.ЕдиницаИзмерения;
		//	Иначе //надо определить ед. изм. мест путем соотношения кол-ва и кол-ва упаковок
		//		
		//		ЕдиницаНайдена = Ложь;
		//		ПодчиненныеЕдиницыВыборка = Справочники.ЕдиницыИзмерения.Выбрать(,НоваяСтрокаТЧ.Номенклатура);
		//		Пока ПодчиненныеЕдиницыВыборка.Следующий() Цикл
		//			Если ПодчиненныеЕдиницыВыборка.Коэффициент = КоличествоВУпаковке Тогда
		//				НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / КоличествоВУпаковке; 
		//				НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = ПодчиненныеЕдиницыВыборка.Ссылка;
		//				
		//				ЕдиницаНайдена = Истина;
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;
		//		
		//		Если Не ЕдиницаНайдена Тогда
		//			Сообщить("Для товара в строке " + Строка(НоваяСтрокаТЧ.НомерСтрокиТЧ) + " не найдено ед. измерения с коэфф. = " + Строка(КоличествоВУпаковке),
		//			СтатусСообщения.Информация);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
			
			НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = НоваяСтрокаТЧ.Номенклатура.ЕдиницаИзмеренияМест;
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ЕдиницаИзмеренияМест.Коэффициент) И ЗначениеЗаполнено(НоваяСтрокаТЧ.Количество) Тогда
				НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / НоваяСтрокаТЧ.ЕдиницаИзмеренияМест.Коэффициент;
			КонецЕсли;
			
		КонецЕсли;
		
		// Цена продукта
		xmlЦена = ПолучитьЗначениеВСтрокеДерева(СтрокаТабЧасти.Строки, "PurchasingPrice", Ложь);
		Если НЕ xmlЦена = Неопределено Тогда
			НоваяСтрокаТЧ.Цена = Число(xmlЦена);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	//+Лно Сафонов ЕА
	СтруктураДокумента.Вставить("ДатаПрибытияТранспорта", Неопределено);
	СтруктураДокумента.Вставить("ВремяПрибытияТранспорта", Неопределено);
	СтруктураДокумента.Вставить("НазваниеРампыРазгрузки", Неопределено);

	//-Лно Сафонов ЕА

	
	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтруктураДокумента;
	КонецЕсли;	
	
КонецФункции

// {Лео Катанович	
Функция ПолучитьСтруктуруЗаказаПокупателяПоФормату_КОРУС(Дерево, НастройкаОбменаСсылка) Экспорт
	
	СтруктураДокумента = Новый Структура;
	
	Отказ = Ложь;
	
	//Определяем реквизиты документа
	СтрокаЗаголовка = ПолучитьУзелДерева(Дерево.Строки, "Строка", "Document-Order");
	Если НЕ СтрокаЗаголовка = Неопределено Тогда
		СтрокиЗаголовка = СтрокаЗаголовка.Строки;
	Иначе
		Сообщить("Не найден узел Document-Order!", СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаШапки1 = ПолучитьУзелДерева(СтрокиЗаголовка, "Строка", "Order-Header");
	СтрокиШапки1 = СтрокаШапки1.Строки;
	
	//основные реквизиты шапки
	ВходящийНомерЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "OrderNumber", Истина);
	Если ВходящийНомерЗаказа <> Неопределено Тогда
		СтруктураДокумента.Вставить("ВходящийНомер",ВходящийНомерЗаказа);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ДатаЗаказаХМЛ = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "OrderDate", Истина);
	Если ДатаЗаказаХМЛ <> Неопределено Тогда
		ДатаДокумента = Дата(СтрЗаменить(ДатаЗаказаХМЛ,"-",""));
		СтруктураДокумента.Вставить("Дата",ДатаДокумента);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ДатаПоставкиХМЛ = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "ExpectedDeliveryDate", Истина);
	Если ДатаПоставкиХМЛ <> Неопределено Тогда
		ДатаПоставки = Дата(СтрЗаменить(ДатаПоставкиХМЛ,"-",""));
		СтруктураДокумента.Вставить("ДатаПоставки",ДатаПоставки);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Валюта = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "Currency", Ложь);
	Если Валюта <> Неопределено Тогда
		СтруктураДокумента.Вставить("Валюта", ПолучитьВалюту(Валюта));
	Иначе
		//Отказ = Истина;
		СтруктураДокумента.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	КонецЕсли;
	
	// Сток транзит
	СтруктураДокумента.Вставить("абс_СтокТранзит", Неопределено);
	xmlСтокТранзит = ПолучитьЗначениеВСтрокеДерева(СтрокиШапки1, "FlowType", Ложь);
	Если НЕ xmlСтокТранзит = Неопределено Тогда
		Если СокрЛП(xmlСтокТранзит) = "TR" Тогда
			СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Транзит;
		Иначе
			СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Сток;
		КонецЕсли;
	КонецЕсли;
	
	//реквизиты поставщика, покупателя, грузполучателя
	СтрокаШапки2 = ПолучитьУзелДерева(СтрокиЗаголовка, "Строка", "Order-Parties");	
	СтрокиШапки2 = СтрокаШапки2.Строки;
	
	//ГЛН покупателя
	СтрокаШапкиПокупатель = ПолучитьУзелДерева(СтрокиШапки2, "Строка", "Buyer");
	СтрокиШапкиПокупатель = СтрокаШапкиПокупатель.Строки;
	
	ПокупательИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиШапкиПокупатель, "ILN", Истина);
	Если ПокупательИЛН <> Неопределено Тогда
		//КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", ПокупательИЛН);
		КонтрагентСсылка = НайтиКонтрагентаПоGLN(ПокупательИЛН);
		Если КонтрагентСсылка.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Не найден контрагент с GLN " + ПокупательИЛН,СтатусСообщения.Важное);
		Иначе
			СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;
	
	//ГЛН поставщика
	СтрокаШапкиПоставщик = ПолучитьУзелДерева(СтрокиШапки2, "Строка", "Seller");
	СтрокиШапкиПоставщик = СтрокаШапкиПоставщик.Строки;
	
	ПоставщикИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиШапкиПоставщик, "ILN", Истина);
	Если ПоставщикИЛН <> Неопределено Тогда
		ОрганизацияСсылка = НайтиОрганизациюПоGLN(ПоставщикИЛН);		
		//ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("абс_GLN", xmlОрганизацияGLN);
		Если НЕ ОрганизацияСсылка.Пустая() Тогда
			СтруктураДокумента.Вставить("Организация",ОрганизацияСсылка);
		Иначе
			Сообщить("Не найдена организация с GLN " + ПоставщикИЛН, СтатусСообщения.ОченьВажное);
			
			СтруктураДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
			//Возврат Неопределено;
			
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;
	
	//ГЛН грузополучателя
	СтрокаШапкиГрузополучатель = ПолучитьУзелДерева(СтрокиШапки2, "Строка", "DeliveryPoint");
	СтрокиШапкиГрузополучатель = СтрокаШапкиГрузополучатель.Строки;
	
	ГрузополучательИЛН = ПолучитьЗначениеВСтрокеДерева(СтрокиШапкиГрузополучатель, "ILN", Истина);
	Если ГрузополучательИЛН <> Неопределено Тогда
		//ГрузополучательСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("абс_GLN", ГрузополучательИЛН);
		ГрузополучательСсылка = НайтиГрузополучателяПоGLN(ГрузополучательИЛН);
		Если ГрузополучательСсылка.Пустая() Тогда
			Сообщить("Не найден грузополучатель с GLN " + ГрузополучательИЛН,СтатусСообщения.Важное);
			//Отказ = Истина;
			СтруктураДокумента.Вставить("Грузополучатель", Справочники.Контрагенты.ПустаяСсылка());
		Иначе
			СтруктураДокумента.Вставить("Грузополучатель", ГрузополучательСсылка);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("Грузополучатель", Справочники.Контрагенты.ПустаяСсылка());
		//Отказ = Истина;
	КонецЕсли;	
	
	//строки табличной части Товары
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокиЗаголовка, "Строка", "Order-Lines");	
	
	// Создаем таблицуЗначений, в которую выгружаем табличную часть документа
	ДокументТЧ=Новый ТаблицаЗначений;
	ДокументТЧ.Колонки.Добавить("НомерСтрокиТЧ");
	ДокументТЧ.Колонки.Добавить("Номенклатура");
	ДокументТЧ.Колонки.Добавить("Количество");
	ДокументТЧ.Колонки.Добавить("КоличествоЗаказанное");
	ДокументТЧ.Колонки.Добавить("ШтрихКод");
	ДокументТЧ.Колонки.Добавить("АртикулПоставщика");
	ДокументТЧ.Колонки.Добавить("АртикулПокупателя");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмерения");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияМест");
	ДокументТЧ.Колонки.Добавить("КоличествоВУпаковке");
	ДокументТЧ.Колонки.Добавить("Цена");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмеренияЦены");
	ДокументТЧ.Колонки.Добавить("ОписаниеПродукта");
	ДокументТЧ.Колонки.Добавить("КоличествоМест");
	ДокументТЧ.Колонки.Добавить("Коэффициент");
	
	ЭтоПерваяСтрока = Истина;
	
	Для Каждого СтрокаТабЧасти ИЗ ТабличнаяЧасть.Строки Цикл
		
		ПодчиненныеСтроки = СтрокаТабЧасти.Строки;
		
		ЗаголовокСтрокТЧ = ПолучитьУзелДерева(ПодчиненныеСтроки, "Строка", "Line-Item");
		СтрокаДерева = ЗаголовокСтрокТЧ.Строки;
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		
		//Номер строки (этот параметр при создании заказа не используется, может быть проверочным)
		xmlНомерСтрокиТЧ = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "LineNumber", Истина);
		Если НЕ xmlНомерСтрокиТЧ = Неопределено Тогда
			НоваяСтрокаТЧ.НомерСтрокиТЧ = xmlНомерСтрокиТЧ;
		КонецЕсли;
		
		// Сток транзит
		Если ЭтоПерваяСтрока Тогда
			xmlСтокТранзит = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "FlowType", Ложь);
			Если НЕ xmlСтокТранзит = Неопределено Тогда
				Если СокрЛП(xmlСтокТранзит) = "TR" Тогда
					СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Транзит;
				Иначе
					СтруктураДокумента.абс_СтокТранзит = Перечисления.абс_СтокТранзит.Сток;
				КонецЕсли;
			КонецЕсли;
			
			ЭтоПерваяСтрока = Ложь;
			
		КонецЕсли;		
		
		// Определяем атрибуты номенклатуры:
		
		// Артикул покупателя(опциональное поле)
		xmlАртикулПокупателяСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "BuyerItemCode", Ложь);
		
		Если НЕ xmlАртикулПокупателяСтрока = Неопределено Тогда
			АртикулПокупателя = xmlАртикулПокупателяСтрока;
		Иначе
			//Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АртикулПокупателя) Тогда
			
			НоваяСтрокаТЧ.Номенклатура = ПолучитьНоменклатуруПоАртикулуПокупателя(АртикулПокупателя, СтруктураДокумента.Контрагент, НастройкаОбменаСсылка.НеПодбиратьНоменклатуруВАрхиве);
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				
				НоваяСтрокаТЧ.ЕдиницаИзмерения = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;				
				
			КонецЕсли;
		КонецЕсли;		
		
		// Штрих - код номенклатуры
		xmlШтрихКодНоменклатуры = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "EAN", Истина);
		Если НЕ xmlШтрихКодНоменклатуры = Неопределено И НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
			СтруктураНоменклатуры = ПолучитьНоменклатуру(xmlШтрихКодНоменклатуры);
			НоваяСтрокаТЧ.Номенклатура = СтруктураНоменклатуры.Номенклатура;
			
			Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не найдена номенклатура по штрихкоду: " + xmlШтрихКодНоменклатуры + " в строке " + xmlНомерСтрокиТЧ);
				//Отказ = Истина;
				//Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТЧ.ЕдиницаИзмерения = СтруктураНоменклатуры.ЕдиницаИзмерения;
			НоваяСтрокаТЧ.Коэффициент      = НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			
		Иначе
			
			//Отказ = Истина;
			
		КонецЕсли;
		
		// Количество(обязательное поле)
		xmlКоличество = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "OrderedQuantity", Истина);
		Если НЕ xmlКоличество = Неопределено Тогда
			НоваяСтрокаТЧ.Количество = Число(xmlКоличество);
		Иначе
			НоваяСтрокаТЧ.Количество = 0;
			//Отказ = Истина;
		КонецЕсли;
		
		// Количество в упаковке(опциональное поле)
		xmlКоличествоВУпаковке = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "OrderedUnitPacksize", Ложь);
		Если НЕ xmlКоличествоВУпаковке = Неопределено Тогда
			КоличествоВУпаковке = Число(xmlКоличествоВУпаковке);
			
			//Если КоличествоВУпаковке = НоваяСтрокаТЧ.Количество Тогда
			//	НоваяСтрокаТЧ.КоличествоМест       = НоваяСтрокаТЧ.Количество;
			//	НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = НоваяСтрокаТЧ.ЕдиницаИзмерения;
			//Иначе //надо определить ед. изм. мест путем соотношения кол-ва и кол-ва упаковок
				
				ЕдиницаНайдена = Ложь;
				ПодчиненныеЕдиницыВыборка = Справочники.ЕдиницыИзмерения.Выбрать(,НоваяСтрокаТЧ.Номенклатура);
				Пока ПодчиненныеЕдиницыВыборка.Следующий() Цикл
					Если ПодчиненныеЕдиницыВыборка.Коэффициент = КоличествоВУпаковке Тогда
						НоваяСтрокаТЧ.КоличествоМест = НоваяСтрокаТЧ.Количество / КоличествоВУпаковке; 
						НоваяСтрокаТЧ.ЕдиницаИзмеренияМест = ПодчиненныеЕдиницыВыборка.Ссылка;
						
						ЕдиницаНайдена = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЕдиницаНайдена Тогда
					Сообщить("Для товара в строке " + Строка(НоваяСтрокаТЧ.НомерСтрокиТЧ) + " не найдено ед. измерения с коэфф. = " + Строка(КоличествоВУпаковке),
					СтатусСообщения.Информация);
				КонецЕсли;
			//КонецЕсли;
		Иначе
			НоваяСтрокаТЧ.КоличествоМест = Окр(НоваяСтрокаТЧ.Количество 
				* НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
				/ НоваяСтрокаТЧ.Коэффициент, 0, РежимОкругления.Окр15как20);
		КонецЕсли;
		
		// Цена продукта
		xmlЦена = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "OrderedUnitNetPrice", Ложь);
		Если НЕ xmlЦена = Неопределено Тогда
			НоваяСтрокаТЧ.Цена = Число(xmlЦена);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	СтруктураДокумента.Вставить("ДатаПрибытияТранспорта", Неопределено);
	СтруктураДокумента.Вставить("ВремяПрибытияТранспорта", Неопределено);
	СтруктураДокумента.Вставить("НазваниеРампыРазгрузки", Неопределено);

	
	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтруктураДокумента;
	КонецЕсли;
	
КонецФункции
// Лео Катанович}
