Процедура ДвиженияПоРегиструСогласования (Отказ, Этап,Состояние)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Отбор.
	НаборЗаписейСостояниеСогласования.Прочитать();

	
	НаборЗаписейСостояниеСогласования.Очистить();
		
	НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
	НоваяЗапись.Период 					= ТекущаяДата();
	НоваяЗапись.Активность 				= Истина;
	НоваяЗапись.ДокументДляСогласования = Ссылка;
	НоваяЗапись.Пользователь 			= Ответственный;
	НоваяЗапись.Этап 					= Этап;
	НоваяЗапись.Уровень 				= 0;
	НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Лео_КОплате;
		
		
	НаборЗаписейСостояниеСогласования.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
КонецПроцедуры
