Функция ВывестиОтчет (ДанныеРасшифровки = Неопределено) Экспорт
		
	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Настройки=КомпоновщикНастроек.ПолучитьНастройки();
	
	МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки,ДанныеРасшифровки);
	
	
	
	ПроцессорКомпоновки=Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	
	
	
	ДокументРезультат=Новый ТабличныйДокумент;
	
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	
	                                    
	ПроцессорВывода.НачатьВывод();
	
	
	
	Пока Истина Цикл
		
		ЭлементРезультата=ПроцессорКомпоновки.Следующий();
		
		Если ЭлементРезультата=Неопределено Тогда
			
			Прервать;
			
		Иначе
			
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	ПроцессорВывода.ЗакончитьВывод();
	
	
	
	ДокументРезультат.ОтображатьСетку=Ложь;
	
	ДокументРезультат.ОтображатьЗаголовки=Ложь;
	
	Возврат ДокументРезультат;
КонецФункции
