
&НаКлиенте
Процедура СформироватьПлатежныйКалендаоь(Команда)
	//СформироватьПлатежныйКалендаоьСервер(ДокументРезультат);
	ЗаполнитьТаблицуПлатежныйКалендарьСервер ();
	ЗаполнитьПлатежныйКалендарьНаФорме(ДокументРезультат);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПлатежныйКалендаоьСервер()  Экспорт
	
	ДатаС = Объект.ДатаС;
	ДатаПо = Объект.ДатаПо;
	Организация = Объект.Организация;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
	|ПОМЕСТИТЬ ВТ_Даты
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РегламентированныйПроизводственныйКалендарь.Пятидневка > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование,
	|	ЗаявкиНаРасходованиеСредствОбороты.Период,
	|	ЗаявкиНаРасходованиеСредствОбороты.СуммаПриход,
	|	ЗаявкиНаРасходованиеСредствОбороты.Организация.Префикс КАК ЮЛ,
	|	ЗаявкиНаРасходованиеСредствОбороты.Контрагент.НаименованиеПолное КАК НаименованиеКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОбороты.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК Отсрочка,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_ДатаПоступленияТовараАкта КАК ДатаПоставки,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_НормативнаяДатаОплаты КАК НормДатаОпл,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Комментарий КАК НаличиеВБюджете,
	|	ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Ссылка.Описание КАК НазначениеПлатежа,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.абс_СКредитногоСчета КАК СКредитногоСчета,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ДатаРасхода,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ЦФО КАК ЦФО,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.АвтоРезервированиеПоЗаявке КАК АвтоРезервированиеПоЗаявке,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_Срочная КАК Срочная,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.абс_СверхЛимита КАК СверхЛимита,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.СтатьяОборотов КАК СтатьяОборотов,
	|	ЗаявкиНаРасходованиеСредствОбороты.СтатьяДвиженияДенежныхСредств,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_Овердрафта КАК Овердрафт
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Обороты(, , День, ЗаявкаНаРасходование.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхсредств.Наличные), ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхсредств.Безналичные))) КАК ЗаявкиНаРасходованиеСредствОбороты
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа
	|		ПО ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Ссылка
	|			И ЗаявкиНаРасходованиеСредствОбороты.ДоговорКонтрагента = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.ДоговорКонтрагента
	|			И ЗаявкиНаРасходованиеСредствОбороты.Сделка = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Сделка
	|			И ЗаявкиНаРасходованиеСредствОбороты.СтатьяДвиженияДенежныхСредств = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
	|			И ЗаявкиНаРасходованиеСредствОбороты.Проект = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Проект
	|			И ЗаявкиНаРасходованиеСредствОбороты.ДокументРасчетовСКонтрагентом = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом
	|			И ЗаявкиНаРасходованиеСредствОбороты.СуммаПриход = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.СуммаПлатежа
	|			И ЗаявкиНаРасходованиеСредствОбороты.Период = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.абс_ДатаРасхода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&НачалоПериода, ) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ЗаявкиНаРасходованиеСредствОбороты.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|			И ЗаявкиНаРасходованиеСредствОбороты.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|ГДЕ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ДатаРасхода МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВзаиморасчетыСКонтрагентамиОстатки.Организация = &Организация
	|	И ЗаявкиНаРасходованиеСредствОбороты.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Даты.Дата КАК Дата,
	|	ВТ_Заявки.ЗаявкаНаРасходование,
	|	ВТ_Заявки.СуммаПриход КАК Сумма,
	|	ВТ_Заявки.ЮЛ КАК ЮЛ,
	|	ВТ_Заявки.НаименованиеКонтрагента,
	|	ВТ_Заявки.Отсрочка,
	|	ВТ_Заявки.ДатаПоставки,
	|	ВТ_Заявки.НаличиеВБюджете,
	|	ВТ_Заявки.НазначениеПлатежа,
	|	ВТ_Заявки.СКредитногоСчета,
	|	ВЫБОР
	|		КОГДА ВТ_Заявки.СуммаПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьРасчет,
	|	ВТ_Заявки.Период КАК ДатаРасходаТч,
	|	ВТ_Заявки.ЦФО,
	|	ВТ_Заявки.АвтоРезервированиеПоЗаявке,
	|	ВТ_Заявки.Срочная,
	|	ВТ_Заявки.СверхЛимита,
	|	ВТ_Заявки.СтатьяОборотов,
	|	ВТ_Заявки.НормДатаОпл,
	|	ВТ_Заявки.СтатьяДвиженияДенежныхСредств,
	|	ВТ_Заявки.СуммаВзаиморасчетов,
	|	ВТ_Заявки.Овердрафт
	|ИЗ
	|	ВТ_Даты КАК ВТ_Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|		ПО ВТ_Даты.Дата = ВТ_Заявки.ЗаявкаНаРасходованиеДатаРасхода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ЮЛ";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаС);
	Запрос.УстановитьПараметр("КонецПериода", ДатаПо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	ТЗ_Результат = Результат.Выгрузить();
	ТЗ_Копия = ТЗ_Результат.Скопировать(,"Дата,Сумма");
	ТЗ_Копия.Свернуть("Дата","Сумма");
	ТЗ_Копия.Сортировать("Дата Возр");
	
	ТЗ_Даты = ТЗ_Результат.Скопировать(,"Дата");
	ТЗ_Даты.Свернуть("Дата",);
	ТЗ_Даты.Сортировать("Дата Возр");
	
	
	Макет = Документы.Лео_ПлатежныйКалендарь.ПолучитьМакет("ПлатежныйКалендарь");
	ДокументРезультат.Очистить();
	
	ЗаголовокОтчета 						= Макет.ПолучитьОбласть("ЗаголовокОтчета|ОбзастьЗначение");
	ЗаголовокОтчетаОбластьДень 				= Макет.ПолучитьОбласть("ЗаголовокОтчета|ОбластьДень");
	ЗаголовокОтчета.Параметры.НачалоПериода = Формат(ДатаС,"ДФ='d MMMM'; ДЛФ=DD");
	ЗаголовокОтчета.Параметры.КонецПериода 	= Формат(ДатаПо,"ДФ='d MMMM'; ДЛФ=DD");
	ДокументРезультат.Вывести(ЗаголовокОтчета);	
	
	ОбластьИтогПоКредитамЗначение			= Макет.ПолучитьОбласть("ИтогПоКредитам|ОбзастьЗначение");
	ОбластьИтогПоКредитамРбластьДень 		= Макет.ПолучитьОбласть("ИтогПоКредитам|ОбластьДень");
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СКредитногоСчета",Истина);
	ТЗ_СтрокиКредит = ТЗ_Результат.Скопировать(ПараметрыОтбора,"Дата,Сумма");
	ТЗ_СтрокиКредит.Свернуть("Дата","Сумма");
	ТЗ_СтрокиКредит.Сортировать("Дата Возр");
	ОбластьИтогПоКредитамЗначение.Параметры.ИТОГ = ТЗ_СтрокиКредит.Итог("Сумма");
	ДокументРезультат.Вывести(ОбластьИтогПоКредитамЗначение);	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_СтрокиКредит.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьИтогПоКредитамРбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьИтогПоКредитамРбластьДень.Параметры.Сумма = 0;
		КонецЕсли;
		ДокументРезультат.Присоединить(ОбластьИтогПоКредитамРбластьДень);
	КонецЦикла;
	
	ОбластьИтогПоПоовердрафту			= Макет.ПолучитьОбласть("ИтогПоовердрафту|ОбзастьЗначение");
	ОбластьИтогПоПоовердрафтуДень 		= Макет.ПолучитьОбласть("ИтогПоовердрафту|ОбластьДень");
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Овердрафт",Истина);
	ТЗ_СтрокиКредит = ТЗ_Результат.Скопировать(ПараметрыОтбора,"Дата,Сумма");
	ТЗ_СтрокиКредит.Свернуть("Дата","Сумма");
	ТЗ_СтрокиКредит.Сортировать("Дата Возр");
	ОбластьИтогПоПоовердрафту.Параметры.ИТОГ = ТЗ_СтрокиКредит.Итог("Сумма");
	ДокументРезультат.Вывести(ОбластьИтогПоПоовердрафту);	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_СтрокиКредит.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьИтогПоПоовердрафтуДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьИтогПоПоовердрафтуДень.Параметры.Сумма = 0;
		КонецЕсли;
		ДокументРезультат.Присоединить(ОбластьИтогПоПоовердрафтуДень);
	КонецЦикла;
	
	
	
	ОбластьШапкаЮЛ = Макет.ПолучитьОбласть("ШапкаЮЛ|ОбзастьЗначение");
	ДокументРезультат.Вывести(ОбластьШапкаЮЛ);	
	
	ОбластьСтрокаЮЛЗначение					= Макет.ПолучитьОбласть("СтрокаЮЛ|ОбзастьЗначение");
	ОбластьСтрокаЮЛСтрокаЮЛ 				= Макет.ПолучитьОбласть("СтрокаЮЛ|ОбластьДень");
	ТЗ_ЮЛ = ТЗ_Результат.Скопировать(,"ЮЛ");
	ТЗ_ЮЛ.Свернуть("ЮЛ",);
	ТЗ_ЮЛ.Сортировать("ЮЛ Возр");
	Для каждого СтрокаЮЛ из  ТЗ_ЮЛ Цикл
		ОбластьСтрокаЮЛЗначение.Параметры.Юрлицо = СтрокаЮЛ.ЮЛ;
		Если НЕ СтрокаЮЛ.ЮЛ = NULL Тогда
			ДокументРезультат.Вывести(ОбластьСтрокаЮЛЗначение);
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ЮЛ",СтрокаЮЛ.ЮЛ);
			ТЗ_СтрокиЮЛ = ТЗ_Результат.Скопировать(ПараметрыОтбора,"Дата,Сумма");
			ТЗ_СтрокиЮЛ.Свернуть("Дата","Сумма");
			ТЗ_СтрокиЮЛ.Сортировать("Дата Возр");
			Для каждого СтрокаДаты из  ТЗ_Даты Цикл
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
				НайденныеСтроки = ТЗ_СтрокиЮЛ.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ОбластьСтрокаЮЛСтрокаЮЛ.Параметры.Сумма = НайденныеСтроки[0].Сумма;
				Иначе
					ОбластьСтрокаЮЛСтрокаЮЛ.Параметры.Сумма = 0;
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьСтрокаЮЛСтрокаЮЛ);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	
	ОбластьШапкаОтчетаЗначение			= Макет.ПолучитьОбласть("ШапкаОтчета|ОбзастьЗначение");
	ОбластьШапкаОтчетаОбластьДень 		= Макет.ПолучитьОбласть("ШапкаОтчета|ОбластьДень");
	ДокументРезультат.Вывести(ОбластьШапкаОтчетаЗначение);
	ТЗ_Копия = ТЗ_Результат.Скопировать(,"Дата,Сумма");
	ТЗ_Копия.Свернуть("Дата","Сумма");
	ТЗ_Копия.Сортировать("Дата Возр");
	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_Копия.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьШапкаОтчетаОбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьШапкаОтчетаОбластьДень.Параметры.Сумма  = "-";
		КонецЕсли;
		
		ОбластьШапкаОтчетаОбластьДень.Параметры.Дата = Формат (СтрокаДаты.Дата, "ДФ='dd MMMM'");
		ДокументРезультат.Присоединить(ОбластьШапкаОтчетаОбластьДень);
	КонецЦикла;
	
	ОбластьСтрокаОтчетаЗначение			= Макет.ПолучитьОбласть("СтрокаОтчета|ОбзастьЗначение");
	ОбластьСтрокаОтчетаОбластьДень 		= Макет.ПолучитьОбласть("СтрокаОтчета|ОбластьДень");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЕстьРасчет",Истина);
	ТЗ_СтрокиЗаголовка = ТЗ_Результат.Скопировать(ПараметрыОтбора,"ЮЛ,НаименованиеКонтрагента,Отсрочка,ДатаПоставки,НаличиеВБюджете,НазначениеПлатежа,СКредитногоСчета,ДатаРасходаТч,ЗаявкаНаРасходование,ЦФО,НормДатаОпл,АвтоРезервированиеПоЗаявке,Срочная,СверхЛимита,СтатьяОборотов,СтатьяДвиженияДенежныхСредств,СуммаВзаиморасчетов"); 	
	ТЗ_СтрокиЗаголовка.Сортировать("ЮЛ Возр,НаименованиеКонтрагента Возр,ДатаПоставки Возр ");
	Для Каждого СтрокаЗаголовка из ТЗ_СтрокиЗаголовка Цикл
		ОбластьСтрокаОтчетаЗначение.Параметры.Заполнить(СтрокаЗаголовка);
		ДокументРезультат.Вывести(ОбластьСтрокаОтчетаЗначение);
		Для каждого СтрокаДаты из  ТЗ_Даты Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
			ПараметрыОтбора.Вставить("ЮЛ",СтрокаЗаголовка.ЮЛ);
			ПараметрыОтбора.Вставить("НаименованиеКонтрагента",СтрокаЗаголовка.НаименованиеКонтрагента);
			ПараметрыОтбора.Вставить("Отсрочка",СтрокаЗаголовка.Отсрочка);
			ПараметрыОтбора.Вставить("ДатаПоставки",СтрокаЗаголовка.ДатаПоставки);
			ПараметрыОтбора.Вставить("НормДатаОпл",СтрокаЗаголовка.НормДатаОпл);
			ПараметрыОтбора.Вставить("НаличиеВБюджете",СтрокаЗаголовка.НаличиеВБюджете);
			ПараметрыОтбора.Вставить("НазначениеПлатежа",СтрокаЗаголовка.НазначениеПлатежа);
			ПараметрыОтбора.Вставить("СКредитногоСчета",СтрокаЗаголовка.СКредитногоСчета);
			ПараметрыОтбора.Вставить("ДатаРасходаТч",СтрокаЗаголовка.ДатаРасходаТч);
			ПараметрыОтбора.Вставить("ЗаявкаНаРасходование",СтрокаЗаголовка.ЗаявкаНаРасходование);
			НайденныеСтроки = ТЗ_Результат.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ОбластьСтрокаОтчетаОбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
				Если СтрокаЗаголовка.Срочная Тогда
					ОбластьСтрокаОтчетаОбластьДень.ТекущаяОбласть.ЦветФона = WEBЦвета.Оранжевый;	
				КонецЕсли;
				
				Если СтрокаЗаголовка.СверхЛимита Тогда
					ОбластьСтрокаОтчетаОбластьДень.ТекущаяОбласть.ЦветФона = WEBЦвета.Коралловый;	
				КонецЕсли;
				
				Если СтрокаЗаголовка.АвтоРезервированиеПоЗаявке Тогда
					ОбластьСтрокаОтчетаОбластьДень.ТекущаяОбласть.ЦветФона = WEBЦвета.Голубой;	
				КонецЕсли;
			Иначе
				ОбластьСтрокаОтчетаОбластьДень.Параметры.Сумма = 0;
				ОбластьСтрокаОтчетаОбластьДень.ТекущаяОбласть.ЦветФона = WEBЦвета.Белый;
			КонецЕсли;
			ДокументРезультат.Присоединить(ОбластьСтрокаОтчетаОбластьДень);
		КонецЦикла;
	КонецЦикла;
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Автомасштаб=Истина;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуПлатежныйКалендарьСервер()  Экспорт
	
	ДатаС = Объект.ДатаС;
	ДатаПо = Объект.ДатаПо;
	Организация = Объект.Организация;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
	|ПОМЕСТИТЬ ВТ_Даты
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РегламентированныйПроизводственныйКалендарь.Пятидневка > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование,
	|	ЗаявкиНаРасходованиеСредствОбороты.Период,
	|	ЗаявкиНаРасходованиеСредствОбороты.СуммаПриход,
	|	ЗаявкиНаРасходованиеСредствОбороты.Организация.Префикс КАК ЮЛ,
	|	ЗаявкиНаРасходованиеСредствОбороты.Контрагент КАК Контрагент,
	|	ЗаявкиНаРасходованиеСредствОбороты.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК Отсрочка,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_ДатаПоступленияТовараАкта КАК ДатаПоставки,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_НормативнаяДатаОплаты КАК НормДатаОпл,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Комментарий КАК НаличиеВБюджете,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Описание КАК НазначениеПлатежа,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.абс_СКредитногоСчета КАК СКредитногоСчета,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ДатаРасхода,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ЦФО КАК ЦФО,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.АвтоРезервированиеПоЗаявке КАК АвтоРезервированиеПоЗаявке,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_Срочная КАК Срочная,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.абс_СверхЛимита КАК СверхЛимита,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.СтатьяОборотов КАК СтатьяОборотов,
	|	ЗаявкиНаРасходованиеСредствОбороты.СтатьяДвиженияДенежныхСредств,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_Овердрафта КАК Овердрафт,
	|	ЗаявкиНаРасходованиеСредствОбороты.Организация
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Обороты(, , День, ЗаявкаНаРасходование.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхсредств.Наличные), ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхсредств.Безналичные))) КАК ЗаявкиНаРасходованиеСредствОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&НачалоПериода, ) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО ЗаявкиНаРасходованиеСредствОбороты.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|			И ЗаявкиНаРасходованиеСредствОбороты.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|ГДЕ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ДатаРасхода МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВзаиморасчетыСКонтрагентамиОстатки.Организация = &Организация
	|	И ЗаявкиНаРасходованиеСредствОбороты.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ЗаявкаНаРасходование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СостоянияСогласованияДиректор.Состояние ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК СогласованДиректором,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СостоянияСогласованияПрезидент.Состояние ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК СогласованПрезидентом
	|ПОМЕСТИТЬ ВТ_Согласование
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Заявки.ЗаявкаНаРасходование КАК ЗаявкаНаРасходование
	|	ИЗ
	|		ВТ_Заявки КАК ВТ_Заявки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_Заявки.ЗаявкаНаРасходование) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СостоянияСогласованияДокументов КАК СостоянияСогласованияДиректор
	|		ПО ВложенныйЗапрос.ЗаявкаНаРасходование = СостоянияСогласованияДиректор.ДокументДляСогласования
	|			И (СостоянияСогласованияДиректор.Этап = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.СогласованиеДиректором))
	|			И (СостоянияСогласованияДиректор.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Лео_КОплате))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СостоянияСогласованияДокументов КАК СостоянияСогласованияПрезидент
	|		ПО ВложенныйЗапрос.ЗаявкаНаРасходование = СостоянияСогласованияПрезидент.ДокументДляСогласования
	|			И (СостоянияСогласованияПрезидент.Этап = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.СогласованиеДиректором))
	|			И (СостоянияСогласованияПрезидент.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбъектов.Лео_КОплате))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ЗаявкаНаРасходование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Даты.Дата КАК Дата,
	|	ВТ_Заявки.ЗаявкаНаРасходование,
	|	ВТ_Заявки.СуммаПриход КАК Сумма,
	|	ВТ_Заявки.Отсрочка,
	|	ВТ_Заявки.ДатаПоставки,
	|	ВТ_Заявки.НаличиеВБюджете,
	|	ВТ_Заявки.НазначениеПлатежа,
	|	ВТ_Заявки.СКредитногоСчета,
	|	ВЫБОР
	|		КОГДА ВТ_Заявки.СуммаПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьРасчет,
	|	ВТ_Заявки.Период КАК ДатаРасходаТч,
	|	ВТ_Заявки.ЦФО,
	|	ВТ_Заявки.АвтоРезервированиеПоЗаявке,
	|	ВТ_Заявки.Срочная,
	|	ВТ_Заявки.СверхЛимита,
	|	ВТ_Заявки.СтатьяОборотов,
	|	ВТ_Заявки.НормДатаОпл,
	|	ВТ_Заявки.СтатьяДвиженияДенежныхСредств,
	|	ВТ_Заявки.СуммаВзаиморасчетов,
	|	ВТ_Заявки.Овердрафт,
	|	ВТ_Заявки.Контрагент,
	|	ВТ_Заявки.Организация,
	|	ВТ_Согласование.СогласованДиректором,
	|	ВТ_Согласование.СогласованПрезидентом
	|ИЗ
	|	ВТ_Даты КАК ВТ_Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Согласование КАК ВТ_Согласование
	|			ПО ВТ_Заявки.ЗаявкаНаРасходование = ВТ_Согласование.ЗаявкаНаРасходование
	|		ПО ВТ_Даты.Дата = ВТ_Заявки.ЗаявкаНаРасходованиеДатаРасхода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаС);
	Запрос.УстановитьПараметр("КонецПериода", ДатаПо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	ТЗ_Результат = Результат.Выгрузить();
	Объект.ТчПлатежныйКалендарь.Загрузить(ТЗ_Результат);	
	
	Для каждого СтрокаТч из Объект.ТчПлатежныйКалендарь Цикл
		СтрокаТч.КлючСтроки = СтрокаТч.ПолучитьИдентификатор()	
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПлатежныйКалендарьНаФорме(ДокументРезультат)
	
	ДатаС = Объект.ДатаС;
	ДатаПо = Объект.ДатаПо;
	ТЗ_Копия = Объект.ТчПлатежныйКалендарь.Выгрузить(,"Дата,Сумма");
	ТЗ_Копия.Свернуть("Дата","Сумма");
	ТЗ_Копия.Сортировать("Дата Возр");
	
	ТЗ_Даты = Объект.ТчПлатежныйКалендарь.Выгрузить(,"Дата");
	ТЗ_Даты.Свернуть("Дата",);
	ТЗ_Даты.Сортировать("Дата Возр");
	
	
	Макет = Документы.Лео_ПлатежныйКалендарь.ПолучитьМакет("ПлатежныйКалендарь");
	ДокументРезультат.Очистить();
	
	ЗаголовокОтчета 						= Макет.ПолучитьОбласть("ЗаголовокОтчета|ОбзастьЗначение");
	ЗаголовокОтчетаОбластьДень 				= Макет.ПолучитьОбласть("ЗаголовокОтчета|ОбластьДень");
	ЗаголовокОтчета.Параметры.НачалоПериода = Формат(ДатаС,"ДФ='d MMMM'; ДЛФ=DD");
	ЗаголовокОтчета.Параметры.КонецПериода 	= Формат(ДатаПо,"ДФ='d MMMM'; ДЛФ=DD");
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ЗаголовокОтчетаОбластьДень.Параметры.Дата = Формат (СтрокаДаты.Дата, "ДФ='dd MMMM'");
		ДокументРезультат.Присоединить(ЗаголовокОтчетаОбластьДень);
	КонецЦикла;
	
	
	ОбластьИтогПоКредитамЗначение			= Макет.ПолучитьОбласть("ИтогПоКредитам|ОбзастьЗначение");
	ОбластьИтогПоКредитамРбластьДень 		= Макет.ПолучитьОбласть("ИтогПоКредитам|ОбластьДень");
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СКредитногоСчета",Истина);
	ТЗ_СтрокиКредит = Объект.ТчПлатежныйКалендарь.Выгрузить(ПараметрыОтбора,"Дата,Сумма");
	ТЗ_СтрокиКредит.Свернуть("Дата","Сумма");
	ТЗ_СтрокиКредит.Сортировать("Дата Возр");
	ОбластьИтогПоКредитамЗначение.Параметры.ИТОГ = ТЗ_СтрокиКредит.Итог("Сумма");
	ДокументРезультат.Вывести(ОбластьИтогПоКредитамЗначение);	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_СтрокиКредит.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьИтогПоКредитамРбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьИтогПоКредитамРбластьДень.Параметры.Сумма = 0;
		КонецЕсли;
		ДокументРезультат.Присоединить(ОбластьИтогПоКредитамРбластьДень);
	КонецЦикла;
	
	ОбластьИтогПоПоовердрафту			= Макет.ПолучитьОбласть("ИтогПоовердрафту|ОбзастьЗначение");
	ОбластьИтогПоПоовердрафтуДень 		= Макет.ПолучитьОбласть("ИтогПоовердрафту|ОбластьДень");
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Овердрафт",Истина);
	ТЗ_СтрокиКредит = Объект.ТчПлатежныйКалендарь.Выгрузить(ПараметрыОтбора,"Дата,Сумма");
	ТЗ_СтрокиКредит.Свернуть("Дата","Сумма");
	ТЗ_СтрокиКредит.Сортировать("Дата Возр");
	ОбластьИтогПоПоовердрафту.Параметры.ИТОГ = ТЗ_СтрокиКредит.Итог("Сумма");
	ДокументРезультат.Вывести(ОбластьИтогПоПоовердрафту);	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_СтрокиКредит.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьИтогПоПоовердрафтуДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьИтогПоПоовердрафтуДень.Параметры.Сумма = 0;
		КонецЕсли;
		ДокументРезультат.Присоединить(ОбластьИтогПоПоовердрафтуДень);
	КонецЦикла;
	
	
	
	ОбластьШапкаЮЛ = Макет.ПолучитьОбласть("ШапкаЮЛ|ОбзастьЗначение");
	ДокументРезультат.Вывести(ОбластьШапкаЮЛ);	
	
	ОбластьСтрокаЮЛЗначение					= Макет.ПолучитьОбласть("СтрокаЮЛ|ОбзастьЗначение");
	ОбластьСтрокаЮЛСтрокаЮЛ 				= Макет.ПолучитьОбласть("СтрокаЮЛ|ОбластьДень");
	ТЗ_ЮЛ = Объект.ТчПлатежныйКалендарь.Выгрузить(,"Организация");
	ТЗ_ЮЛ.Свернуть("Организация",);
	ТЗ_ЮЛ.Сортировать("Организация Возр");
	Для каждого СтрокаЮЛ из  ТЗ_ЮЛ Цикл
		ОбластьСтрокаЮЛЗначение.Параметры.Юрлицо = СтрокаЮЛ.Организация;
		Если НЕ СтрокаЮЛ.Организация = NULL Тогда
			ДокументРезультат.Вывести(ОбластьСтрокаЮЛЗначение);
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Организация",СтрокаЮЛ.Организация);
			ТЗ_СтрокиЮЛ = Объект.ТчПлатежныйКалендарь.Выгрузить(ПараметрыОтбора,"Дата,Сумма");
			ТЗ_СтрокиЮЛ.Свернуть("Дата","Сумма");
			ТЗ_СтрокиЮЛ.Сортировать("Дата Возр");
			Для каждого СтрокаДаты из  ТЗ_Даты Цикл
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
				НайденныеСтроки = ТЗ_СтрокиЮЛ.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ОбластьСтрокаЮЛСтрокаЮЛ.Параметры.Сумма = НайденныеСтроки[0].Сумма;
				Иначе
					ОбластьСтрокаЮЛСтрокаЮЛ.Параметры.Сумма = 0;
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьСтрокаЮЛСтрокаЮЛ);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	
	ОбластьИтогоПоЮЛЗначение			= Макет.ПолучитьОбласть("ИтогоПоЮЛ|ОбзастьЗначение");
	ОбластьИтогоПоЮЛОбластьДень 		= Макет.ПолучитьОбласть("ИтогоПоЮЛ|ОбластьДень");
	ДокументРезультат.Вывести(ОбластьИтогоПоЮЛЗначение);
	ТЗ_Копия = Объект.ТчПлатежныйКалендарь.Выгрузить(,"Дата,Сумма");
	ТЗ_Копия.Свернуть("Дата","Сумма");
	ТЗ_Копия.Сортировать("Дата Возр");
	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_Копия.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьИтогоПоЮЛОбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьИтогоПоЮЛОбластьДень.Параметры.Сумма  = 0;
		КонецЕсли;
		ДокументРезультат.Присоединить(ОбластьИтогоПоЮЛОбластьДень);
	КонецЦикла;
	
	ПлатежныйКалендарьДинамическая.Очистить();
	
	
	ТЗПлатежныйКалендарьДинамическая = РеквизитФормыВЗначение("ПлатежныйКалендарьДинамическая");
	
	ИменаУдаляемыхКолонк = Новый Массив;
	УдаляемыеКолонки = Новый Массив;
	Для каждого Колонка из ТЗПлатежныйКалендарьДинамическая.Колонки цикл
		Если Лев(Колонка.Имя,2) = "К_" Тогда
			ИменаУдаляемыхКолонк.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяКолонки из ИменаУдаляемыхКолонк цикл 
		ТЗПлатежныйКалендарьДинамическая.Колонки.Удалить(ИмяКолонки);
		УдаляемыеКолонки.Добавить("ПлатежныйКалендарьДинамическая." + ИмяКолонки);
		Элементы.Удалить(Элементы["ПлатежныйКалендарьДинамическая"+ИмяКолонки]);
	КонецЦикла;
	
	ИзменитьРеквизиты(,УдаляемыеКолонки);
	
	НовыеКолонки = Новый Массив;
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ТипЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,2)); 
		Представление = "К_" + формат(СтрокаДаты.Дата,"ДФ=MMMMdd");
		Заголовок = формат(СтрокаДаты.Дата,"ДФ='dd MMMM'");
		ТЗПлатежныйКалендарьДинамическая.Колонки.Добавить(Представление,ТипЧисло,,);
		НовыеКолонки.Добавить(Новый РеквизитФормы(Представление,ТипЧисло, "ПлатежныйКалендарьДинамическая",Заголовок));		
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеКолонки, ); 
	
	Для каждого Колонка Из НовыеКолонки Цикл 
		НовыйЭлемент = Элементы.Добавить("ПлатежныйКалендарьДинамическая"+Колонка.Имя,Тип("ПолеФормы"),Элементы.ПлатежныйКалендарьДинамическая); 
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлемент.ПутьКДанным = "ПлатежныйКалендарьДинамическая."+Колонка.Имя; 
		НовыйЭлемент.ТолькоПросмотр = Истина;
	КонецЦикла; 
	
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЕстьРасчет",Истина);
	ТЗ_СтрокиЗаголовка = Объект.ТчПлатежныйКалендарь.Выгрузить(ПараметрыОтбора,"ЗаявкаНаРасходование,СогласованДиректором,СогласованПрезидентом,КлючСтроки,Организация,Контрагент,Отсрочка,ДатаПоставки,НаличиеВБюджете,НазначениеПлатежа,СКредитногоСчета,ДатаРасходаТч,ЗаявкаНаРасходование,ЦФО,НормДатаОпл,АвтоРезервированиеПоЗаявке,Срочная,СверхЛимита,СтатьяОборотов,СтатьяДвиженияДенежныхСредств,СуммаВзаиморасчетов,ПлатежныйДокумент"); 	
	ТЗ_СтрокиЗаголовка.Сортировать("Организация Возр,Контрагент Возр,ДатаПоставки Возр ");
	Для Каждого СтрокаЗаголовка из ТЗ_СтрокиЗаголовка Цикл
		СтрокаКалендаря = ТЗПлатежныйКалендарьДинамическая.Добавить();
		
		ЗаполнитьЗначенияСвойств (СтрокаКалендаря, СтрокаЗаголовка);
		СтрокаКалендаря.Юл = СтрокаЗаголовка.Организация.Префикс;
		Для каждого СтрокаДаты из  ТЗ_Даты Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
			ПараметрыОтбора.Вставить("Организация",СтрокаЗаголовка.Организация);
			ПараметрыОтбора.Вставить("Контрагент",СтрокаЗаголовка.Контрагент);
			ПараметрыОтбора.Вставить("Отсрочка",СтрокаЗаголовка.Отсрочка);
			ПараметрыОтбора.Вставить("ДатаПоставки",СтрокаЗаголовка.ДатаПоставки);
			ПараметрыОтбора.Вставить("НормДатаОпл",СтрокаЗаголовка.НормДатаОпл);
			ПараметрыОтбора.Вставить("НаличиеВБюджете",СтрокаЗаголовка.НаличиеВБюджете);
			ПараметрыОтбора.Вставить("НазначениеПлатежа",СтрокаЗаголовка.НазначениеПлатежа);
			ПараметрыОтбора.Вставить("СКредитногоСчета",СтрокаЗаголовка.СКредитногоСчета);
			ПараметрыОтбора.Вставить("ДатаРасходаТч",СтрокаЗаголовка.ДатаРасходаТч);
			ПараметрыОтбора.Вставить("ЗаявкаНаРасходование",СтрокаЗаголовка.ЗаявкаНаРасходование);
			НайденныеСтроки = Объект.ТчПлатежныйКалендарь.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаКалендаря["К_" + формат(СтрокаДаты.Дата,"ДФ=MMMMdd")] = НайденныеСтроки[0].Сумма;
			Иначе
				СтрокаКалендаря["К_" + формат(СтрокаДаты.Дата,"ДФ=MMMMdd")]= 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗПлатежныйКалендарьДинамическая,"ПлатежныйКалендарьДинамическая");
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Автомасштаб=Истина;
	
	УстановитьУсловноеОформление(ТЗ_Даты);	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформление(ТЗ_Даты)
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		
		Представление = "К_" + формат(СтрокаДаты.Дата,"ДФ=MMMMdd");
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая" + Представление);											   
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая.Срочная");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая." + Представление);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ОтборЭлемента.ПравоеЗначение = 0;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBЦвета.Оранжевый);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая" + Представление);											   
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая.СверхЛимита");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая." + Представление);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ОтборЭлемента.ПравоеЗначение = 0;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBЦвета.Коралловый);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая" + Представление);											   
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая.АвтоРезервированиеПоЗаявке");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлатежныйКалендарьДинамическая." + Представление);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ОтборЭлемента.ПравоеЗначение = 0;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBЦвета.Голубой);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ТчПлатежныйКалендарь.Количество()>0 тогда
		ЗаполнитьПлатежныйКалендарьНаФорме(ДокументРезультат);
	КонецЕсли;	
	
	Если ПолуситьДоступностьСогласования(Справочники.РолиИсполнителей.ГенеральныйДиректор) Тогда
		ДоступноСогласованиеДиректором = Истина;
		Элементы.ПлатежныйКалендарьДинамическаяСогласованДиректором.Доступность = Истина;
	Иначе
		Элементы.ПлатежныйКалендарьДинамическаяСогласованДиректором.Доступность = Ложь;
	КонецЕсли;
	
	Если ПолуситьДоступностьСогласования(Справочники.РолиИсполнителей.ПрезидентКомпании) Тогда
		ДоступноСогласованиеПрезидентом = Истина;
		Элементы.ПлатежныйКалендарьДинамическаяСогласованПрезидентом.Доступность = Истина;
	Иначе
		Элементы.ПлатежныйКалендарьДинамическаяСогласованПрезидентом.Доступность = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиСогласования(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагиСогласования(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьФлажки(Флаг)
	ТЗПлатежныйКалендарьДинамическая = РеквизитФормыВЗначение("ПлатежныйКалендарьДинамическая");
	Для каждого Строка из ТЗПлатежныйКалендарьДинамическая цикл
		Если ДоступноСогласованиеДиректором Тогда
			Строка.СогласованДиректором	= Флаг;
		КонецЕсли;
		Если ДоступноСогласованиеПрезидентом Тогда
			Строка.СогласованПрезидентом = Флаг;
		КонецЕсли;	
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗПлатежныйКалендарьДинамическая,"ПлатежныйКалендарьДинамическая");
	
КонецПроцедуры

&НаСервере
Функция ПолуситьДоступностьСогласования(Роль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РолиИИсполнители.Исполнитель,
	|	РолиИИсполнители.Роль,
	|	РолиИИсполнители.Организация
	|ИЗ
	|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	|ГДЕ
	|	РолиИИсполнители.Исполнитель = &Исполнитель
	|	И РолиИИсполнители.Роль = &Роль";
	
	Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Роль", Роль);
	
	Результат = Запрос.Выполнить();
	
	Записи = Результат.Выгрузить();
	
	Если Записи.Количество()> 0 тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СинхронизитоватьТабличныеЧасти();
КонецПроцедуры

&НаСервере
Процедура СинхронизитоватьТабличныеЧасти()
	ТЗПлатежныйКалендарьДинамическая = РеквизитФормыВЗначение("ПлатежныйКалендарьДинамическая");
	Для каждого Строка из ТЗПлатежныйКалендарьДинамическая цикл
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("КлючСтроки",Строка.КлючСтроки);
		СтрокаТчПлатежныйКалендарь = Объект.ТчПлатежныйКалендарь.НайтиСтроки(ПараметрыОтбора);
		Если НЕ СтрокаТчПлатежныйКалендарь = неопределено Тогда
			СтрокаТчПлатежныйКалендарь[0].СогласованДиректором = Строка.СогласованДиректором;
			СтрокаТчПлатежныйКалендарь[0].СогласованПрезидентом = Строка.СогласованПрезидентом;
			СтрокаТчПлатежныйКалендарь[0].ПлатежныйДокумент = Строка.ПлатежныйДокумент;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьВыбранныеЗаявки(Команда)
	
	СогласоватьВыбранныеЗаявкиНаСервере ();
	
КонецПроцедуры
&НаСервере
Процедура СогласоватьВыбранныеЗаявкиНаСервере()
	Отказ = Ложь;	
	Если ДоступноСогласованиеДиректором Тогда
		ДвиженияПоРегиструСогласования (Отказ, Справочники.абс_МаршрутыСогласованияДокументов.СогласованиеДиректором,Перечисления.СостоянияОбъектов.Лео_КОплате)
	КонецЕсли;
	
	Если ДоступноСогласованиеПрезидентом Тогда
		ДвиженияПоРегиструСогласования (Отказ, Справочники.абс_МаршрутыСогласованияДокументов.СогласованиеПрезидентом,Перечисления.СостоянияОбъектов.Лео_КОплате)
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ДвиженияПоРегиструСогласования (Отказ, Этап,Состояние)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ТЗПлатежныйКалендарьДинамическая = РеквизитФормыВЗначение("ПлатежныйКалендарьДинамическая");
	
	Для каждого Строка из ТЗПлатежныйКалендарьДинамическая цикл 
		Если Этап = Справочники.абс_МаршрутыСогласованияДокументов.СогласованиеДиректором и Строка.СогласованДиректором  Тогда
			Согласовать = Истина;		 	
		ИначеЕсли Этап = Справочники.абс_МаршрутыСогласованияДокументов.СогласованиеПрезидентом и Строка.СогласованПрезидентом Тогда
			Согласовать = Истина;
		Иначе
			Продолжить;
		КонецЕсли;
		НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Строка.ЗаявкаНаРасходование);
		НаборЗаписейСостояниеСогласования.Прочитать();
		
		//Проверим последнюю запись
		Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
			ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
			Если ПоследняяЗапись.Пользователь = Ответственный
				И ПоследняяЗапись.Этап = Этап Тогда
				
			Иначе	
				НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();	
				НоваяЗапись.Период 					= ТекущаяДата();
				НоваяЗапись.Активность 				= Истина;
				НоваяЗапись.ДокументДляСогласования = Строка.ЗаявкаНаРасходование;
				НоваяЗапись.Пользователь 			= Ответственный;
				НоваяЗапись.Этап 					= Этап;
				НоваяЗапись.Уровень 				= 0;
				НоваяЗапись.Состояние 				= Состояние;
				
			КонецЕсли;
			НаборЗаписейСостояниеСогласования.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПлатежныеДокументы(Команда)
	СоздатьПлатежныеДокументыНаСервере();
КонецПроцедуры


&НаСервере
Функция НайтиПодчиненныеПП(СсылкаДок)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка КАК ПП
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДокументПланированияПлатежа = &Заявка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка";
	Запрос.УстановитьПараметр("Заявка", СсылкаДок);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПП");
	Возврат Результат;
КонецФункции



&НаСервере
Процедура СоздатьПлатежныеДокументыНаСервере()
	ТЗПлатежныйКалендарьДинамическая = РеквизитФормыВЗначение("ПлатежныйКалендарьДинамическая");
	Для каждого Строка из ТЗПлатежныйКалендарьДинамическая цикл
		//Если Строка.СогласованДиректором и 	Строка.СогласованПрезидентом Тогда
		Если Строка.Флаг Тогда	
			#Если Клиент Тогда			
				Платежки = НайтиПодчиненныеПП(Строка.ЗаявкаНаРасходование);
				Если Платежки.Количество() > 0 Тогда
					
					
					Ответ = Вопрос("Существующие платежные поручения по данной заявке будут удалены?", РежимДиалогаВопрос.ДаНетОтмена,
					60, КодВозвратаДиалога.Да, , КодВозвратаДиалога.Отмена);
					Если Ответ = КодВозвратаДиалога.Отмена Тогда
						Возврат;
					ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
						УстановитьПривилегированныйРежим(Истина);
						Для Каждого ПП Из Платежки Цикл
							ПредставлениеПП = Строка(ПП);
							ППОбъект = ПП.ПолучитьОбъект();
							ППОбъект.Удалить();
							Сообщить("Удален документ: "+ ПредставлениеПП);
						КонецЦикла;
						УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли;
				КонецЕсли;
			#Иначе
				Если ЗначениеЗаполнено(Строка.ПлатежныйДокумент) Тогда
					Продолжить;
				КонецЕсли;
			#КонецЕсли
			
			ПП = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
			
			// Шапка
			ПП.Дата = ТекущаяДата();
			ПП.Заполнить(Строка.ЗаявкаНаРасходование);
			ПП.ДатаОплаты = ТекущаяДата();
			
			ПП.СуммаДокумента = ПП.РасшифровкаПлатежа.Итог("СуммаПлатежа");
			
			ПП.НазначениеПлатежа = Строка.ЗаявкаНаРасходование.Описание;
			//
			ПП.НазначениеПлатежа = Строка.ЗаявкаНаРасходование.Описание;
			ПП.РасшифровкаПлатежа.Получить(0);
			
			ПП.РасшифровкаПлатежа.Получить(0).ставкаНДС = Строка.ЗаявкаНаРасходование.ставкаНДС;
            ПП.РасшифровкаПлатежа.Получить(0).СуммаНДС = Строка.ЗаявкаНаРасходование.СуммаНДС;
        
			///стати
			ПП.РасшифровкаПлатежа.Получить(0).СтатьяДвиженияДенежныхСредств	 = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000001");
			
			//
			АвтоЗначенияРеквизитов = СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(
			ПП.Организация, ПП.СчетОрганизации, ПП.Контрагент, ПП.СчетКонтрагента, 
			ПП.ВидОперации);
			
			ПП.ТекстПлательщика = АвтоЗначенияРеквизитов.ТекстПлательщика;
			ПП.ИННПлательщика   = АвтоЗначенияРеквизитов.ИННПлательщика;
			ПП.КПППлательщика   = АвтоЗначенияРеквизитов.КПППлательщика;
			
			ПП.ТекстПолучателя  = АвтоЗначенияРеквизитов.ТекстПолучателя;
			ПП.ИННПолучателя    = АвтоЗначенияРеквизитов.ИННПолучателя;
			ПП.КПППолучателя    = АвтоЗначенияРеквизитов.КПППолучателя;
			
			БУ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВБухгалтерскомУчете");
			НУ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВНалоговомУчете");
			ПП.ОтражатьВБухгалтерскомУчете = ПП.Организация.ОтражатьВРегламентированномУчете И БУ;
			ПП.ОтражатьВНалоговомУчете = ПП.Организация.ОтражатьВРегламентированномУчете И НУ;
			
		строкаНомерСчета="№ "+Строка.ЗаявкаНаРасходование.НомерСчета+"от "+формат(Строка.ЗаявкаНаРасходование.Датасчета,"ДФ=dd.MM.yyyy");
		строканазначение=Строка.ЗаявкаНаРасходование.Описание;
	   

	Если ПП.РасшифровкаПлатежа.Итог("СуммаНДС")>0 Тогда
		строкаНДС= " в том числе НДС "+ПП.РасшифровкаПлатежа.Итог("СуммаНДС");
	иначе
		строкаНДС= " Без НДС ";
	КонецЕсли;
		
	    ПП.НазначениеПлатежа="Оплата по счету " + строкаНомерСчета+"за "+Строканазначение+ строкаНДС;	
		ПП.ВидПлатежа    = "Электронно";
	    ПП.ОчередностьПлатежа  =5;
        Строка.СтатьяДвиженияДенежныхСредств	 = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000001");

			
			
			
			Попытка
				ПП.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось записать документ для заявки " + Строка.ЗаявкаНаРасходование);
				Продолжить;
			КонецПопытки;
			Строка.ПлатежныйДокумент = ПП.Ссылка;
			
			ОбщегоНазначения.СообщитьИнформациюПользователю("Создан документ "+Строка(ПП));
			
			// Код Сафонова Е.
			////////////////////	
			////////////////////	Если Строка.ПлатежныйДокумент = Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка() Тогда
			////////////////////		ПлатежныйДокумент = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
			////////////////////	Иначе
			////////////////////		Продолжить;
			////////////////////	КонецЕсли;
			////////////////////	ПлатежныйДокумент.Заполнить(Строка.ЗаявкаНаРасходование);
			////////////////////	ПлатежныйДокумент.Дата = ТекущаяДата();
			//////////////////////	ПлатежныйДокумент.ЗаполнитьПоЗаявкеППУпр();
			////////////////////	ПлатежныйДокумент.Записать(РежимЗаписиДокумента.Запись);
			////////////////////	
			////////////////////	
			////////////////////	
			////////////////////	//ПлатежныйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			////////////////////	Строка.ПлатежныйДокумент = ПлатежныйДокумент.Ссылка;
			////////////////////	Сообщить ("Создан документ " + ПлатежныйДокумент);
			
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗПлатежныйКалендарьДинамическая,"ПлатежныйКалендарьДинамическая");	
КонецПроцедуры

Функция СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(Плательщик, СчетПлательщика, Получатель, СчетПолучателя, ВидОперации, ПеречислениеВБюджет = Истина) Экспорт
	
	РеквизитыПлательщика = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Плательщик, "ИНН,КПП");
	ЗначенияРеквизитов = Новый Структура;
	
	ВБюджет = (ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога)
	ИЛИ ПеречислениеВБюджет;
	
	ЗначенияРеквизитов.Вставить("ТекстПлательщика", 
	СформироватьТекстНаименованияПлательшикаПолучателя(
	"", Плательщик, СчетПлательщика));
	
	ЗначенияРеквизитов.Вставить("ИННПлательщика", РеквизитыПлательщика.ИНН);
	
	УказаниеКППплательщикаОбязательно = Истина;
	
	ЗначенияРеквизитов.Вставить("КПППлательщика", 
	?(УказаниеКППплательщикаОбязательно, 
	?(НЕ ПустаяСтрока(РеквизитыПлательщика.КПП), РеквизитыПлательщика.КПП, "0"), 
	""));
	
	Если ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПереводНаДругойСчет Тогда
		ВладелецСчетаПолучателя = Плательщик;
	Иначе
		ВладелецСчетаПолучателя = Получатель;
	КонецЕсли;
	РеквизитыВладельцаСчетаПолучателя = 
	ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВладелецСчетаПолучателя, "ИНН,КПП");
	
	ЗначенияРеквизитов.Вставить("ТекстПолучателя", 
	СформироватьТекстНаименованияПлательшикаПолучателя(
	"", ВладелецСчетаПолучателя, СчетПолучателя));
	
	ЗначенияРеквизитов.Вставить("ИННПолучателя", РеквизитыВладельцаСчетаПолучателя.ИНН);
	
	УказаниеКППполучателяОбязательно = Истина;
	
	ЗначенияРеквизитов.Вставить("КПППолучателя", 
	?(УказаниеКППполучателяОбязательно, 
	?(НЕ ПустаяСтрока(РеквизитыВладельцаСчетаПолучателя.КПП), РеквизитыВладельцаСчетаПолучателя.КПП, "0"),
	""));
	
	НепрямыеРасчетыУПлательщика = ЗначениеЗаполнено(СчетПлательщика.БанкДляРасчетов);
	БанкПлательщика = 
	?(НепрямыеРасчетыУПлательщика, СчетПлательщика.БанкДляРасчетов, СчетПлательщика.Банк);
	ЗначенияРеквизитов.Вставить("НаименованиеБанкаПлательщика", 
	БанкПлательщика.Наименование + " " + БанкПлательщика.Город);
	ЗначенияРеквизитов.Вставить("НомерСчетаПлательщика", 
	?(НепрямыеРасчетыУПлательщика, СчетПлательщика.Банк.КоррСчет, СчетПлательщика.НомерСчета));
	ЗначенияРеквизитов.Вставить("БикБанкаПлательщика", БанкПлательщика.Код);
	ЗначенияРеквизитов.Вставить("СчетБанкаПлательщика", БанкПлательщика.КоррСчет);
	
	НепрямыеРасчетыУПолучателя = ЗначениеЗаполнено(СчетПолучателя.БанкДляРасчетов);
	БанкПолучателя = 
	?(НепрямыеРасчетыУПолучателя, СчетПолучателя.БанкДляРасчетов, СчетПолучателя.Банк);
	ЗначенияРеквизитов.Вставить("НаименованиеБанкаПолучателя", 
	БанкПолучателя.Наименование + " " + БанкПолучателя.Город);
	ЗначенияРеквизитов.Вставить("НомерСчетаПолучателя", 
	?(НепрямыеРасчетыУПолучателя, СчетПолучателя.Банк.КоррСчет, СчетПолучателя.НомерСчета));
	ЗначенияРеквизитов.Вставить("БикБанкаПолучателя", БанкПолучателя.Код);
	ЗначенияРеквизитов.Вставить("СчетБанкаПолучателя", БанкПолучателя.КоррСчет);
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции //СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя()

Функция СформироватьТекстНаименованияПлательшикаПолучателя(ТекстНаименования, ВладелецСчета, БанковскийСчет, ВБюджет = Истина)
	
	ТекстРезультат = ТекстНаименования;
	Если ПустаяСтрока(ТекстРезультат) Тогда
		
		Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Организации") 
			И ВБюджет 
			И НЕ ПустаяСтрока(ВладелецСчета.НаименованиеПлательщикаПриПеречисленииНалогов) Тогда
			
			ТекстРезультат = ВладелецСчета.НаименованиеПлательщикаПриПеречисленииНалогов;
			
		ИначеЕсли ПустаяСтрока(БанковскийСчет.ТекстКорреспондента) Тогда
			
			РеквизитыВладельцаСчета =
			ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВладелецСчета, "Наименование,НаименованиеПолное");
			ТекстРезультат = ?(ПустаяСтрока(РеквизитыВладельцаСчета.НаименованиеПолное), 
			РеквизитыВладельцаСчета.Наименование, РеквизитыВладельцаСчета.НаименованиеПолное);
			Если ЗначениеЗаполнено(БанковскийСчет.БанкДляРасчетов) Тогда
				ТекстРезультат = ТекстРезультат + " р/с " + БанковскийСчет.НомерСчета
				+ " в " + БанковскийСчет.Банк + " " + БанковскийСчет.Банк.Город;
			КонецЕсли;	
			
		Иначе
			
			ТекстРезультат = БанковскийСчет.ТекстКорреспондента;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстРезультат;
	
КонецФункции // СформироватьТекстНаименованияПлательшикаПолучателя()

&НаКлиенте
Процедура СоздатьПлатДокОбъединенную(Команда)
	
	СоздатьПлатежныеДокументыОбъедНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПлатежныеДокументыОбъедНаСервере()
	ТЗПлатежныйКалендарьДинамическая = РеквизитФормыВЗначение("ПлатежныйКалендарьДинамическая");
	ДокументыОснования = Новый СписокЗначений;
	Для каждого Строка из ТЗПлатежныйКалендарьДинамическая цикл
		//Если Строка.СогласованДиректором и 	Строка.СогласованПрезидентом Тогда
		Если Строка.Флаг Тогда
			
			#Если Клиент Тогда			
				Платежки = НайтиПодчиненныеПП(Строка.ЗаявкаНаРасходование);
				Если Платежки.Количество() > 0 Тогда
					
					
					Ответ = Вопрос("Существующие платежные поручения по данной заявке будут удалены?", РежимДиалогаВопрос.ДаНетОтмена,
					60, КодВозвратаДиалога.Да, , КодВозвратаДиалога.Отмена);
					Если Ответ = КодВозвратаДиалога.Отмена Тогда
						Возврат;
					ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
						УстановитьПривилегированныйРежим(Истина);
						Для Каждого ПП Из Платежки Цикл
							ПредставлениеПП = Строка(ПП);
							ППОбъект = ПП.ПолучитьОбъект();
							ППОбъект.Удалить();
							Сообщить("Удален документ: "+ ПредставлениеПП);
						КонецЦикла;
						УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли;
				КонецЕсли;
			#Иначе
				Если ЗначениеЗаполнено(Строка.ПлатежныйДокумент) Тогда
					Продолжить;
				КонецЕсли;
			#КонецЕсли
			
		ДокументыОснования.Добавить(Строка.ЗаявкаНаРасходование);	
		КонецЕсли;	
	КонецЦикла;
		
		ПП = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
	
		// Шапка
		ПП.Дата = ТекущаяДата();
		
		Если ДокументыОснования.Количество() = 0 тогда 
			возврат	
		КонецЕсли;
		
	Основание = ДокументыОснования[0].Значение;
	
	ВидОперацииЗаявка = Основание.ВидОперации;
	
	УправлениеДенежнымиСредствами.ОпределитьОперациюПоОснованиюУпр(ПП.ВидОперации,ВидОперацииЗаявка);
	
	ПП.Организация = Основание.Организация;
	ПП.ВалютаДокумента = Основание.ВалютаДокумента;
	ПП.Контрагент = Основание.Контрагент;
	ПП.СчетКонтрагента = Основание.Контрагент.ОсновнойБанковскийСчет;
	Если ЗначениеЗаполнено(Основание.БанковскийСчетКасса) Тогда
		ПП.СчетОрганизации = Основание.БанковскийСчетКасса;
	ИначеЕсли ПП.Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств = ПП.ВалютаДокумента Тогда
		ПП.СчетОрганизации= ПП.Организация.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	ПП.Ответственный     = Основание.Ответственный;
	ПП.ДокументОснование = Основание.Ссылка;
	
	ПП.Подразделение     = Основание.ЦФО;
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Если ПП.ВалютаДокумента.Пустая() Тогда
		ПП.ВалютаДокумента = мВалютаРегламентированногоУчета;
	КонецЕсли;
	
	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ПП.ВалютаДокумента,ПП.Дата);
	ПП.КурсДокумента      = СтруктураКурсаДокумента.Курс;
	ПП.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
			
			
			
			
			
			//ПП.Заполнить(Строка.ЗаявкаНаРасходование);
			ПП.ДатаОплаты = ТекущаяДата();
			
			//ПП.СуммаДокумента = ПП.РасшифровкаПлатежа.Итог("СуммаПлатежа");
			//ЗаполнитьПоЗаявкеППУпр(ПП,ДокументыОснования);
			
			
			ПП.НазначениеПлатежа = Строка.ЗаявкаНаРасходование.Описание;
			АвтоЗначенияРеквизитов = СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(
			ПП.Организация, ПП.СчетОрганизации, ПП.Контрагент, ПП.СчетКонтрагента, 
			ПП.ВидОперации);
			
			ПП.ТекстПлательщика = АвтоЗначенияРеквизитов.ТекстПлательщика;
			ПП.ИННПлательщика   = АвтоЗначенияРеквизитов.ИННПлательщика;
			ПП.КПППлательщика   = АвтоЗначенияРеквизитов.КПППлательщика;
			
			ПП.ТекстПолучателя  = АвтоЗначенияРеквизитов.ТекстПолучателя;
			ПП.ИННПолучателя    = АвтоЗначенияРеквизитов.ИННПолучателя;
			ПП.КПППолучателя    = АвтоЗначенияРеквизитов.КПППолучателя;
			
			БУ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВБухгалтерскомУчете");
			НУ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтражатьДокументыВНалоговомУчете");
			ПП.ОтражатьВБухгалтерскомУчете = ПП.Организация.ОтражатьВРегламентированномУчете И БУ;
			ПП.ОтражатьВНалоговомУчете = ПП.Организация.ОтражатьВРегламентированномУчете И НУ;
			
			
			ПП.ОтраженоВОперУчете = Истина;
			ПП.Оплачено = Ложь;
			
			
		строкаНомерСчета="№ "+Строка.ЗаявкаНаРасходование.НомерСчета+"от "+формат(Строка.ЗаявкаНаРасходование.Датасчета,"ДФ=dd.MM.yyyy");
		строканазначение=Строка.ЗаявкаНаРасходование.Описание;
	    ЗаполнитьПоЗаявкеППУпр(ПП,ДокументыОснования);

	Если ПП.РасшифровкаПлатежа.Итог("СуммаНДС")>0 Тогда
		строкаНДС= " в том числе НДС "+ПП.РасшифровкаПлатежа.Итог("СуммаНДС");
	иначе
		строкаНДС= " Без НДС ";
	КонецЕсли;
		
	    ПП.НазначениеПлатежа="Оплата по счетам " + строкаНомерСчета+"за "+Строканазначение+ строкаНДС;	
		ПП.ВидПлатежа    = "Электронно";
	    ПП.ОчередностьПлатежа  =5;
        Строка.СтатьяДвиженияДенежныхСредств	 = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000001");
			
//		 ПП.СтавкаНДС						 = Строка.ЗаявкаНаРасходование.СтавкаНДС;

			
			
						
			ПП.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
			Попытка
				ПП.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось записать документ для заявки " + Строка.ЗаявкаНаРасходование);
				//Продолжить;
			КонецПопытки;
			
			Для каждого Строка из ТЗПлатежныйКалендарьДинамическая цикл
				//Если Строка.СогласованДиректором и 	Строка.СогласованПрезидентом Тогда
				Если Строка.Флаг Тогда
					
				Строка.ПлатежныйДокумент = ПП.Ссылка;
		       КонецЕсли;
		    КонецЦикла;
			
			
			
			ОбщегоНазначения.СообщитьИнформациюПользователю("Создан документ "+Строка(ПП));
			
			// Код Сафонова Е.
			////////////////////	
			////////////////////	Если Строка.ПлатежныйДокумент = Документы.ПлатежноеПоручениеИсходящее.ПустаяСсылка() Тогда
			////////////////////		ПлатежныйДокумент = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
			////////////////////	Иначе
			////////////////////		Продолжить;
			////////////////////	КонецЕсли;
			////////////////////	ПлатежныйДокумент.Заполнить(Строка.ЗаявкаНаРасходование);
			////////////////////	ПлатежныйДокумент.Дата = ТекущаяДата();
			//////////////////////	ПлатежныйДокумент.ЗаполнитьПоЗаявкеППУпр();
			////////////////////	ПлатежныйДокумент.Записать(РежимЗаписиДокумента.Запись);
			////////////////////	
			////////////////////	
			////////////////////	
			////////////////////	//ПлатежныйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			////////////////////	Строка.ПлатежныйДокумент = ПлатежныйДокумент.Ссылка;
			////////////////////	Сообщить ("Создан документ " + ПлатежныйДокумент);
			
		//КонецЕсли;
	//КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗПлатежныйКалендарьДинамическая,"ПлатежныйКалендарьДинамическая");	
КонецПроцедуры


// Заполняет сумму документа и сумму взаиморасчетов на основании остатка
// по заявке в регистре "ЗаявкиНаРасходованиеСредств"
//
Процедура ЗаполнитьПоЗаявкеППУпр(ПП,ДокументОснование) 
	
	// Проверяем соответствие суммы взаиморасчетов документа сумме взаиморасчетов заявки
	строкаНомерСчета="";
	строканазначение="";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК СуммаПлатежа,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Контрагент КАК Контрагент,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента.Владелец.ОсновнойБанковскийСчет КАК СчетКонтрагента,
	|	ЗаявкиНаРасходованиеСредствОстатки.Сделка КАК Сделка,
	|	ЗаявкиНаРасходованиеСредствОстатки.ДокументРасчетовСКонтрагентом,
	|	ЗаявкиНаРасходованиеСредствОстатки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаРасходованиеСредствОстатки.Проект КАК Проект,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.ВалютаВзаиморасчетовПодотчетника КАК ВалютаВзаиморасчетовРаботника,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Ссылка КАК ЗаявкаНаРасходование,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.Получатель КАК Получатель,
	|	ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование.СтавкаНДС как СтавкаНДС,
	|	ЗаявкиНаРасходованиеСредствОстатки.абс_СуммаНДСОстаток как СуммаНДС
	|ИЗ
	|	РегистрНакопления.ЛЕО_ЗаявкиНаРасходованиеСредств.Остатки(, ЗаявкаНаРасходование В (&ДокументЗаявка)) КАК ЗаявкиНаРасходованиеСредствОстатки";
	
	Запрос.УстановитьПараметр("ДокументЗаявка",ДокументОснование);
	
	СтавкаНДС=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ОсновнаяСтавкаНДС");
	
	РезультатЗапроса=Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаПлатежа < 0 тогда продолжить КонецЕсли;
		
		Если ПП.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога
			ИЛИ ПП.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств Тогда
			
			СтрокаПлатеж				 = ПП.РасшифровкаПлатежа.Добавить();
			СтрокаПлатеж.СуммаПлатежа	 = Выборка.СуммаПлатежа;
			Контрагент					 = Выборка.Контрагент;
			СтрокаПлатеж.СуммаВзаиморасчетов = Выборка.СуммаВзаиморасчетов;
			
		ИначеЕсли ПП.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеДенежныхСредствПодотчетнику
			ИЛИ ПП.ВидОперации=Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСРаботниками Тогда
			
			СтрокаПлатеж   = ПП.РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаВзаиморасчетов;
			
			Если ПП.ВалютаДокумента = Выборка.ВалютаВзаиморасчетовРаботника Тогда
				СтрокаПлатеж.КурсВзаиморасчетов      = ПП.КурсДокумента;
				СтрокаПлатеж.КратностьВзаиморасчетов = ПП.КратностьДокумента;
			Иначе
				СтруктураКурсВзаиморасчетов=МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетовРаботника,);
				СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсВзаиморасчетов.Кратность;
				
				Если (СтрокаПлатеж.СуммаВзаиморасчетов<> 0) И (ПП.КратностьДокумента <> 0) Тогда
					СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа * ПП.КурсДокумента * СтрокаПлатеж.КратностьВзаиморасчетов
					/ СтрокаПлатеж.СуммаВзаиморасчетов / ПП.КратностьДокумента;
				КонецЕсли;
				
			КонецЕсли;
			
			ФизЛицо	                      = Выборка.Получатель;
			ВалютаВзаиморасчетовРаботника = Выборка.ВалютаВзаиморасчетовРаботника;
			
		Иначе
			
			Контрагент = Выборка.Контрагент;
			
			Если ЗначениеЗаполнено(Контрагент) Тогда
				СчетКонтрагента = Выборка.СчетКонтрагента;
			КонецЕсли;
			
			СтрокаПлатеж = ПП.РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.СуммаВзаиморасчетов;
			СтрокаПлатеж.СуммаПлатежа = Выборка.СуммаПлатежа;
			
			Если ПП.ВалютаДокумента = Выборка.ВалютаВзаиморасчетов Тогда
				СтрокаПлатеж.КурсВзаиморасчетов      = ПП.КурсДокумента;
				СтрокаПлатеж.КратностьВзаиморасчетов = ПП.КратностьДокумента;
			Иначе
				
				СтруктураКурсВзаиморасчетов=МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.ВалютаВзаиморасчетов,);
				СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсВзаиморасчетов.Кратность;
				
				Если (СтрокаПлатеж.СуммаВзаиморасчетов<> 0) И (ПП.КратностьДокумента <> 0) Тогда
					СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа * ПП.КурсДокумента * СтрокаПлатеж.КратностьВзаиморасчетов
					/ СтрокаПлатеж.СуммаВзаиморасчетов / ПП.КратностьДокумента;
				КонецЕсли;
				
			КонецЕсли;
			
    	    СтрокаПлатеж.СтавкаНДС						 = Выборка.ЗаявкаНаРасходование.СтавкаНДС;
			СтрокаПлатеж.СуммаНДС						 = Выборка.СуммаНДС;
			СтрокаПлатеж.Сделка							 = Выборка.Сделка;
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом	 = Выборка.ДокументРасчетовСКонтрагентом;
			СтрокаПлатеж.ДоговорКонтрагента				 = Выборка.ДоговорКонтрагента;           
			
//			УправлениеДенежнымиСредствами.ПересчитатьСуммуНДС(СтрокаПлатеж);
			
		КонецЕсли;
		
		
		
		
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств	 = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000001");
		
		
		
		СтрокаПлатеж.Проект							 = Выборка.Проект;
		СтрокаПлатеж.ДокументПланированияПлатежа	 = Выборка.ЗаявкаНаРасходование;
		СтрокаПлатеж.СуммаПлатежаПлан				 = СтрокаПлатеж.СуммаПлатежа;
		СтрокаПлатеж.КурсВзаиморасчетовПлан			 = СтрокаПлатеж.КурсВзаиморасчетов;
		
		СтрокаНомерСчета=строкаНомерСчета+"№ "+Выборка.ЗаявкаНаРасходование.НомерСчета+"от "+Выборка.ЗаявкаНаРасходование.ДатаСчета+",";
		Строканазначение=Выборка.ЗаявкаНаРасходование.Описание;
	КонецЦикла;
	
	ПП.НазначениеПлатежа="Оплата по счетам " + строкаНомерСчета+"за "+Строканазначение+ " в том числе НДС"+ ПП.РасшифровкаПлатежа.Итог("СуммаНДС");	
	ПП.СуммаДокумента = ПП.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ПП.ВидПлатежа    = "Электронно";
	     ПП.ОчередностьПлатежа  =5;
		 
КонецПроцедуры // ЗаполнитьПоЗаявкеППУпр()



