
&НаКлиенте
Процедура ТипМетаданныхПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Объект.Наименование = Строка(Объект.ТипМетаданных);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		
		Объект.НаименованиеПолное = Строка(Объект.ТипМетаданных);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		
		Объект.НаименованиеПолное = Объект.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры
