
&НаКлиенте
Процедура Заполнить(Команда)
	Отказ=Ложь;
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) или Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не заполнен период!";
		Сообщение.Сообщить();
		Отказ=Истина;
	КонецЕсли;
	Если Объект.СценарийПрогноза18.Пустая() Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не заполнен сценарий планирования!";
		Сообщение.Сообщить();
		Отказ=Истина;
	КонецЕсли;
	Если Объект.Склады.Количество()=0 Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не выбраны склады!";
		Сообщение.Сообщить();
		Отказ=Истина;
 	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Объект.СтраховойЗапас.Количество()>0 или Объект.СкладскиеОстатки.Количество()>0 Тогда
		Если Вопрос("Перед заполнением данные будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СтраховойЗапас.Очистить();
			Объект.СкладскиеОстатки.Очистить();
			Объект.Заказы.Очистить();
			Объект.ПланПродаж.Очистить();
			Объект.МодельСкладскогоОстатка.Очистить();
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСервер();
	Этаформа.ТекущийЭлемент=ЭтаФорма.Элементы.ГруппаПланПродаж;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьДанныеДляРасчета(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед расчетом необходимо записать документ. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЭтаФорма.Записать();
		КонецЕСли;
	КонецЕсли;
	РассчитатьСервер();
	ЭтаФорма.ОбновитьОтображениеДанных();
	Этаформа.ТекущийЭлемент=ЭтаФорма.Элементы.ГруппаМодельСкладскогоОстатка;
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура РассчитатьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.РассчитатьМодельСкладскогоОстатка(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзТаблицы(Команда)
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли; 
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.абс_ПланСкладскогоОстатка.Форма.ФормаЗагрузки", СтруктураПараметров, Объект.Ссылка);
	ФормаЗагрузки.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "абс_ПланСкладскогоОстатка_ЗагрузкаИзEXCEL" Тогда
		Если Объект.МодельСкладскогоОстатка.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Заменить данные в документе?";
			Ответ = Вопрос(Текст, Режим, 0);    
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.МодельСкладскогоОстатка.Очистить();			
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТЧДокументаПоТаблицеСервер(Параметр); 
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Попытка
		ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблице(ЭтотОбъект, ТабДок);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Некорректный формат таблицы загрузки: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.МодельСкладскогоОстатка.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.МодельСкладскогоОстатка.Очистить();			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = "";
	
	Если ПоместитьВоВременноеХранилище(ВнешнийФайл, АдресФайлаВХранилище) Тогда
	
		ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище)
	
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок);
	
КонецПроцедуры

