////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ЗаполнитьСтатьиБюджета(Объект) Экспорт
	
	
	ЕстьДанные=Ложь;
	Если Объект.Сценарий=Справочники.СценарииПланирования.План Тогда
		//заполним по сценарию План
		ЗаполнитьПоСценариюПланБюджет(Объект,Справочники.СценарииПланирования.План,ДобавитьМесяц(Объект.ДатаПланирования,-1),ЕстьДанные);
		Если Не ЕстьДанные Тогда
			//если ТЧ по сценарию План не заполнена, то берем данные по сценарию Бюджет
			ЗаполнитьПоСценариюПланБюджет(Объект,Справочники.СценарииПланирования.Бюджет,НачалоГода(Объект.ДатаПланирования),ЕстьДанные);
		КонецЕсли;
	ИначеЕсли Объект.Сценарий=Справочники.СценарииПланирования.ОперативныйФакт Тогда
		ЗаполнитьПоСценариюОперФакт(Объект);
	КонецЕсли;
                                  
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ДОКУМЕНТА

Процедура ЗаполнитьПоСценариюПланБюджет(Объект,Сценарий,ДатаПланирования,ЕстьДанные=Ложь)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.Контрагент КАК Контрагент,
	|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
	|	ОборотыБюджетовОбороты.абс_ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОборотыБюджетовОбороты.абс_Регион КАК Регион,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.КоличествоОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.КоличествоОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот * -1
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СуммаУпрОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.СуммаУпрОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот * -1
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот * -1
	|	КОНЕЦ КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Регистратор,
	|			Организация = &Организация
	|				И ЦФО = &ЦФО
	|				И Сценарий = &Сценарий
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.БДРпоЦД)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	ОборотыБюджетовОбороты.Регистратор.ДатаПланирования = &ДатаПланирования
	|ИТОГИ
	|	МАКСИМУМ(ЦФО),
	|	МАКСИМУМ(Регион),
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура";
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ЦФО",Объект.ЦФО);
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Запрос.УстановитьПараметр("Период",ДатаПланирования);
	Запрос.УстановитьПараметр("ДатаПланирования",ДатаПланирования);
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ЕстьДанные=Ложь;
		Возврат;
	КонецЕсли;
	
	ЕстьДанные=Истина;
	
	ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаАналитика=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАналитика.Следующий() Цикл
			
			ВыборкаКонтрагент=ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
					
					ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл
						
						СтрокаТЧ=Объект.СоставБюджета.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаНоменклатура);
						
						ВыборкаПериод=ВыборкаНоменклатура.Выбрать();
						Пока ВыборкаПериод.Следующий() Цикл
							СтрокаТЧ["Сумма"+Месяц(ВыборкаПериод.Период)]=ВыборкаПериод.Сумма;
							СтрокаТЧ["Количество"+Месяц(ВыборкаПериод.Период)]=ВыборкаПериод.Количество;
							СтрокаТЧ["СуммаБезНДС"+Месяц(ВыборкаПериод.Период)]=ВыборкаПериод.СуммаБезНДС;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПоСценариюОперФакт(Объект)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.Контрагент КАК Контрагент,
	|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
	|	ОборотыБюджетовОбороты.абс_ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ОборотыБюджетовОбороты.абс_Регион КАК Регион,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.КоличествоОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.КоличествоОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот * -1
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СуммаУпрОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.СуммаУпрОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот * -1
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот * -1
	|	КОНЕЦ КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			&Период,
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Регистратор,
	|			Организация = &Организация
	|				И ЦФО = &ЦФО
	|				И Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.БДРпоЦД)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	ОборотыБюджетовОбороты.Регистратор.ДатаПланирования = &Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ОборотыБюджетовОбороты.Контрагент,
	|	ОборотыБюджетовОбороты.Номенклатура,
	|	ОборотыБюджетовОбороты.абс_ДоговорКонтрагента,
	|	ОборотыБюджетовОбороты.абс_Регион,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.КоличествоОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.КоличествоОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот * -1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СуммаУпрОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.СуммаУпрОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот * -1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот > 0
	|			ТОГДА ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот * -1
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -1),
	|			Регистратор,
	|			Организация = &Организация
	|				И ЦФО = &ЦФО
	|				И Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.БДРпоЦД)) КАК ОборотыБюджетовОбороты
	|ИТОГИ
	|	МАКСИМУМ(ЦФО),
	|	МАКСИМУМ(Регион),
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура";
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ЦФО",Объект.ЦФО);
	Запрос.УстановитьПараметр("Период",Объект.ДатаПланирования);
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ЕстьДанные=Ложь;
		Возврат;
	КонецЕсли;
	
	ЕстьДанные=Истина;
	
	ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаАналитика=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАналитика.Следующий() Цикл
			
			ВыборкаКонтрагент=ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
					
					ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл
						
						СтрокаТЧ=Объект.СоставБюджета.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаНоменклатура);
						
						ВыборкаПериод=ВыборкаНоменклатура.Выбрать();
						Пока ВыборкаПериод.Следующий() Цикл
							СтрокаТЧ["Сумма"+Месяц(ВыборкаПериод.Период)]=ВыборкаПериод.Сумма;
							СтрокаТЧ["Количество"+Месяц(ВыборкаПериод.Период)]=ВыборкаПериод.Количество;
							СтрокаТЧ["СуммаБезНДС"+Месяц(ВыборкаПериод.Период)]=ВыборкаПериод.СуммаБезНДС;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры                                                     

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОборотыБюджетов 
	Движения.ОборотыБюджетов.Записывать = Истина;
	Движения.ОборотыБюджетов.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	|	абс_ВводОперативногоБюджетаСоставБюджета.АналитикаБюджета КАК абс_АналитикаБюджета,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС1,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС2,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС3,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС4,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС5,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС6,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС7,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС8,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС9,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС10,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС11,
	|	абс_ВводОперативногоБюджетаСоставБюджета.СуммаБезНДС12,
	|	ВЫБОР
	|		КОГДА абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18
	|		КОГДА абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5	
	|		КОГДА абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма1,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма2,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма3,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма4,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма5,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма6,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма7,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма8,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма9,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма10,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма11,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Сумма12,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество1,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество2,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество3,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество4,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество5,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество6,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество7,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество8,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество9,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество10,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество11,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Количество12,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Номенклатура,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Контрагент,
	|	абс_ВводОперативногоБюджетаСоставБюджета.ЦФО,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Ссылка.Организация,
	|	абс_ВводОперативногоБюджетаСоставБюджета.ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА абс_ВводОперативногоБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Регион КАК абс_Регион,
	|	абс_ВводОперативногоБюджетаСоставБюджета.Ссылка.Сценарий КАК Сценарий
	|ИЗ
	|	Документ.абс_ВводОперативногоБюджета.СоставБюджета КАК абс_ВводОперативногоБюджетаСоставБюджета
	|ГДЕ
	|	абс_ВводОперативногоБюджетаСоставБюджета.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();                            
	Пока Выборка.Следующий() Цикл
		Для сч=1 по 12 Цикл
			
			//если сценарий - предварительный факт, то пишем только те суммы, для которых 
			//стоит отметка Состоялось
			Если Сценарий=Справочники.СценарииПланирования.ОперативныйФакт Тогда
				Состоялось=Выборка["Состоялось"+СокрЛП(Сч)];
				Если Не Состоялось Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Сумма=Выборка["Сумма"+СокрЛП(Сч)];
			СуммаБезНДС=Выборка["СуммаБезНДС"+СокрЛП(Сч)];
			Количество=Выборка["Количество"+СокрЛП(Сч)];
			Если СуммаБезНДС>0 Тогда
				Движение = Движения.ОборотыБюджетов.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,Выборка);
				Движение.Период = ДобавитьМесяц(ДатаПланирования,Сч-1);
				Движение.СуммаУпр=?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
				Движение.СуммаУпрБезНДС=СуммаБезНДС*Выборка.Коэффициент;
				Движение.Количество=Количество*Выборка.Коэффициент;
				Движение.абс_Бюджет=Справочники.Бюджеты.БДРпоЦД;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью()
	
		
КонецПроцедуры


