&НаКлиенте
Процедура ОбработкаКоманды(ПараметрыКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыКоманды) = Тип("ДокументСсылка.абс_СообщениеEDI") Тогда
		
		ПараметрКоманды = ПараметрыКоманды;
		
		Если ПараметрКоманды.ТипСообщения = Перечисления.абс_ТипыСообщенийEDI.Заказ Тогда
			
			СоздатьЗаказПокупателя_Сервер(ПараметрКоманды);
			
		ИначеЕсли ПараметрКоманды.ТипСообщения = Перечисления.абс_ТипыСообщенийEDI.УведомлениеОПриемке Тогда
			
			ЗагрузитьУведомлениеОПриемкеВРеализацию(ПараметрКоманды);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыКоманды) = Тип("Массив") Тогда
		
		Для Каждого ПараметрКоманды Из ПараметрыКоманды Цикл
			
			Если НЕ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.абс_СообщениеEDI") Тогда
				Продолжить;
			КонецЕсли;
						
			Если ПараметрКоманды.ТипСообщения = Перечисления.абс_ТипыСообщенийEDI.Заказ Тогда
				
				СоздатьЗаказПокупателя_Сервер(ПараметрКоманды);
				
			ИначеЕсли ПараметрКоманды.ТипСообщения = Перечисления.абс_ТипыСообщенийEDI.УведомлениеОПриемке Тогда
				
				ЗагрузитьУведомлениеОПриемкеВРеализацию(ПараметрКоманды);
				
			КонецЕсли;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаказПокупателя_Сервер(СообщениеEDI)
	
	Документы.абс_СообщениеEDI.ЗаполнитьЗаказПокупателяПоСообщениюEDI(СообщениеEDI);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУведомлениеОПриемкеВРеализацию(СообщениеEDI)
	
	Документы.абс_СообщениеEDI.ЗагрузитьУведомлениеОПриемкеВРеализацию(СообщениеEDI);
	
КонецПроцедуры
