
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДокументОснование = ДанныеЗаполнения;
 //    сообщить(ДокументОснование);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	   	
	// регистр Лео_ФакТрудозатрат Приход
	Движения.Лео_ФакТрудозатрат.Записывать = Истина;
	Движения.Лео_ФакТрудозатрат.Очистить();
	Для Каждого ТекСтрокаПерсонал Из Персонал Цикл
		Движение = Движения.Лео_ФакТрудозатрат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
		Если ЗначениеЗаполнено(ДокументОснование) тогда
			получитьстроку= ДокументОснование.Продукция.Получить(0);
			Движение.Продукция = получитьстроку.Номенклатура;
			Движение.ПродукцияСерия = получитьстроку.СерияНоменклатуры;
			Движение.Выпуск = получитьстроку.Количество;
			Движение.ОПЗС   = ДокументОснование;
		конецЕсли;
		
		Движение.Должность = ТекСтрокаПерсонал.Должность;
		Движение.Контрагент = ТекСтрокаПерсонал.Контрагент;
		Движение.Техоперация = ТекСтрокаПерсонал.ТехнологическаяОперация;
		Движение.Смена = ТекСтрокаПерсонал.Смена;
		Движение.ТипТехоперации = ТекСтрокаПерсонал.ТехнологическаяОперация.ТипОперации_лео;
		Движение.Количество = ТекСтрокаПерсонал.Количество;
		
		//+++ Жигалев 12.05.2023
		Движение.Подразделение   = ТекСтрокаПерсонал.Подразделение;
		Движение.ВидОборудования = ТекСтрокаПерсонал.ВидОборудования;
		//--- Жигалев 12.05.2023
		
	    цена=ПолучитьЦену(ТекСтрокаПерсонал);
		Движение.Сумма = цена*ТекСтрокаПерсонал.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	//+++ Жигалев 05.12.2023
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		ОПЗС = ДокументОснование.ПолучитьОбъект();
		ОПЗС.Лео_ФактТрудозатрат = Ссылка;
		ОПЗС.Записать();	
	КонецЕсли;
	//--- Жигалев 05.12.2023

	
	
	
	
КонецПроцедуры

Функция   ПолучитьЦену(ТекСтрокаПерсонал)
	      //{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_стоимостьПереработчиковСрезПоследних.ЦенаБезНДС как Цена
		|ИЗ
		|	РегистрСведений.Лео_стоимостьПереработчиков.СрезПоследних(&дата, ) КАК Лео_стоимостьПереработчиковСрезПоследних
		|ГДЕ
		|	Лео_стоимостьПереработчиковСрезПоследних.Должность = &Должность
		|	И Лео_стоимостьПереработчиковСрезПоследних.Смена = &Смена
		|	И Лео_стоимостьПереработчиковСрезПоследних.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("дата", дата);

	Запрос.УстановитьПараметр("Должность", ТекСтрокаПерсонал.Должность);
	Запрос.УстановитьПараметр("Контрагент", ТекСтрокаПерсонал.Контрагент);
	Запрос.УстановитьПараметр("Смена", ТекСтрокаПерсонал.Смена);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    цена=0;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		цена=ВыборкаДетальныеЗаписи.Цена;

		

		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
    возврат(цена);

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		// Вставить содержимое обработчика.
		
	////+++ Жигалев 05.12.2023
	//Если ЗначениеЗаполнено(ДокументОснование) тогда
	//	получитьстроку= ДокументОснование.Продукция.Получить(0);
	//	Продукция = получитьстроку.Номенклатура;
	//конецЕсли;
	////--- Жигалев 05.12.2023
		
КонецПроцедуры
