////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура РаспределитьБюджетПоЦД(Объект) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент КАК КонтрагентСсылка
	|ПОМЕСТИТЬ ВТ_СвоиКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК СуммаБезНДС,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.Вес, 0)) КАК Вес,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета
	|ПОМЕСТИТЬ ВыручкаПоЦД
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыручкаПоЦД.ЦФО,
	|	ВыручкаПоЦД.Контрагент,
	|	ВыручкаПоЦД.Номенклатура,
	|	ВыручкаПоЦД.ДоговорКонтрагента,
	|	ВыручкаПоЦД.Регион,
	|	ВыручкаПоЦД.Количество,
	|	ВыручкаПоЦД.Сумма,
	|	ВыручкаПоЦД.СуммаБезНДС,
	|	ВыручкаПоЦД.Вес,
	|	ВыручкаПоЦД.СтатьяОборотов,
	|	ВыручкаПоЦД.Период,
	|	ВыручкаПоЦД.АналитикаБюджета
	|ПОМЕСТИТЬ ВыручкаПоДКП
	|ИЗ
	|	ВыручкаПоЦД КАК ВыручкаПоЦД
	|ГДЕ
	|	(ВыручкаПоЦД.ЦФО = &ОПДистрибьюция
	|			ИЛИ ВыручкаПоЦД.ЦФО = &ОПКлючевыеПокупатели)
	|	И НЕ ВыручкаПоЦД.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК КонтрагентЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураЗатраты,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджетаЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагентаЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК РегионЗатраты,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФОЗатраты
	|ПОМЕСТИТЬ ЗатратыОборотыБюджетов
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|				И СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				И НЕ ЦФО = &СлужбаМаркетинга) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот = 0
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК КонтрагентЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|	КОНЕЦ КАК НоменклатураЗатраты,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджетаЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагентаЗатраты,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК РегионЗатраты,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФОЗатраты
	|ПОМЕСТИТЬ ЗатратыОборотыБюджетовДКП
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|				И СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				И ЦФО = &СлужбаМаркетинга) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот = 0
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыОборотыБюджетов.Период,
	|	ЗатратыОборотыБюджетов.СтатьяОборотовЗатраты КАК СтатьяОборотовЗатраты,
	|	ЗатратыОборотыБюджетов.КонтрагентЗатраты КАК КонтрагентЗатраты,
	|	ЗатратыОборотыБюджетов.НоменклатураЗатраты КАК НоменклатураЗатраты,
	|	ЗатратыОборотыБюджетов.АналитикаБюджетаЗатраты КАК АналитикаБюджетаЗатраты,
	|	ЗатратыОборотыБюджетов.ДоговорКонтрагентаЗатраты КАК ДоговорКонтрагентаЗатраты,
	|	ЗатратыОборотыБюджетов.РегионЗатраты КАК РегионЗатраты,
	|	СУММА(ЗатратыОборотыБюджетов.Сумма) КАК Сумма,
	|	СУММА(ЗатратыОборотыБюджетов.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ВыручкаПоЦД.СуммаБезНДС) КАК Выручка,
	|	СУММА(ВыручкаПоЦД.Вес) КАК Вес,
	|	ВыручкаПоЦД.ЦФО КАК ЦФОВыручка,
	|	ВыручкаПоЦД.Контрагент КАК КонтрагентВыручка,
	|	ВыручкаПоЦД.Номенклатура КАК НоменклатураВыручка,
	|	ВыручкаПоЦД.ДоговорКонтрагента КАК ДоговорКонтрагентаВыручка,
	|	ВыручкаПоЦД.Регион КАК РегионВыручка,
	|	ЗатратыОборотыБюджетов.ЦФОЗатраты КАК ЦФОЗатраты
	|ПОМЕСТИТЬ РаспределяемыеЗатраты
	|ИЗ
	|	ЗатратыОборотыБюджетов КАК ЗатратыОборотыБюджетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыручкаПоЦД КАК ВыручкаПоЦД
	|		ПО ЗатратыОборотыБюджетов.Период = ВыручкаПоЦД.Период
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетов.КонтрагентЗатраты = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоЦД.Контрагент = ЗатратыОборотыБюджетов.КонтрагентЗатраты
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетов.ДоговорКонтрагентаЗатраты = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоЦД.ДоговорКонтрагента = ЗатратыОборотыБюджетов.ДоговорКонтрагентаЗатраты
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетов.РегионЗатраты = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоЦД.Регион = ЗатратыОборотыБюджетов.РегионЗатраты
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетов.НоменклатураЗатраты = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоЦД.Номенклатура = ЗатратыОборотыБюджетов.НоменклатураЗатраты
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыОборотыБюджетов.Период,
	|	ЗатратыОборотыБюджетов.СтатьяОборотовЗатраты,
	|	ЗатратыОборотыБюджетов.КонтрагентЗатраты,
	|	ЗатратыОборотыБюджетов.НоменклатураЗатраты,
	|	ЗатратыОборотыБюджетов.АналитикаБюджетаЗатраты,
	|	ЗатратыОборотыБюджетов.ДоговорКонтрагентаЗатраты,
	|	ЗатратыОборотыБюджетов.РегионЗатраты,
	|	ВыручкаПоЦД.ЦФО,
	|	ВыручкаПоЦД.Контрагент,
	|	ВыручкаПоЦД.Номенклатура,
	|	ВыручкаПоЦД.ДоговорКонтрагента,
	|	ВыручкаПоЦД.Регион,
	|	ЗатратыОборотыБюджетов.ЦФОЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыОборотыБюджетовДКП.Период,
	|	ЗатратыОборотыБюджетовДКП.СтатьяОборотовЗатраты КАК СтатьяОборотовЗатраты,
	|	ЗатратыОборотыБюджетовДКП.КонтрагентЗатраты КАК КонтрагентЗатраты,
	|	ЗатратыОборотыБюджетовДКП.НоменклатураЗатраты КАК НоменклатураЗатраты,
	|	ЗатратыОборотыБюджетовДКП.АналитикаБюджетаЗатраты КАК АналитикаБюджетаЗатраты,
	|	ЗатратыОборотыБюджетовДКП.ДоговорКонтрагентаЗатраты КАК ДоговорКонтрагентаЗатраты,
	|	ЗатратыОборотыБюджетовДКП.РегионЗатраты КАК РегионЗатраты,
	|	СУММА(ЗатратыОборотыБюджетовДКП.Сумма) КАК Сумма,
	|	СУММА(ЗатратыОборотыБюджетовДКП.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ВыручкаПоДКП.СуммаБезНДС) КАК Выручка,
	|	СУММА(ВыручкаПоДКП.Вес) КАК Вес,
	|	ВыручкаПоДКП.ЦФО КАК ЦФОВыручка,
	|	ВыручкаПоДКП.Контрагент КАК КонтрагентВыручка,
	|	ВыручкаПоДКП.Номенклатура КАК НоменклатураВыручка,
	|	ВыручкаПоДКП.ДоговорКонтрагента КАК ДоговорКонтрагентаВыручка,
	|	ВыручкаПоДКП.Регион КАК РегионВыручка,
	|	ЗатратыОборотыБюджетовДКП.ЦФОЗатраты КАК ЦФОЗатраты
	|ПОМЕСТИТЬ РаспределяемыеЗатратыДКП
	|ИЗ
	|	ЗатратыОборотыБюджетовДКП КАК ЗатратыОборотыБюджетовДКП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыручкаПоДКП КАК ВыручкаПоДКП
	|		ПО ЗатратыОборотыБюджетовДКП.Период = ВыручкаПоДКП.Период
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетовДКП.КонтрагентЗатраты = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоДКП.Контрагент = ЗатратыОборотыБюджетовДКП.КонтрагентЗатраты
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетовДКП.ДоговорКонтрагентаЗатраты = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоДКП.ДоговорКонтрагента = ЗатратыОборотыБюджетовДКП.ДоговорКонтрагентаЗатраты
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетовДКП.РегионЗатраты = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоДКП.Регион = ЗатратыОборотыБюджетовДКП.РегионЗатраты
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗатратыОборотыБюджетовДКП.НоменклатураЗатраты = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВыручкаПоДКП.Номенклатура = ЗатратыОборотыБюджетовДКП.НоменклатураЗатраты
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыОборотыБюджетовДКП.Период,
	|	ЗатратыОборотыБюджетовДКП.СтатьяОборотовЗатраты,
	|	ЗатратыОборотыБюджетовДКП.КонтрагентЗатраты,
	|	ЗатратыОборотыБюджетовДКП.НоменклатураЗатраты,
	|	ЗатратыОборотыБюджетовДКП.АналитикаБюджетаЗатраты,
	|	ЗатратыОборотыБюджетовДКП.ДоговорКонтрагентаЗатраты,
	|	ЗатратыОборотыБюджетовДКП.РегионЗатраты,
	|	ВыручкаПоДКП.ЦФО,
	|	ВыручкаПоДКП.Контрагент,
	|	ВыручкаПоДКП.Номенклатура,
	|	ВыручкаПоДКП.ДоговорКонтрагента,
	|	ВыручкаПоДКП.Регион,
	|	ЗатратыОборотыБюджетовДКП.ЦФОЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РаспределяемыеЗатраты.Вес) КАК Вес,
	|	СУММА(РаспределяемыеЗатраты.Выручка) КАК Выручка,
	|	РаспределяемыеЗатраты.Период,
	|	РаспределяемыеЗатраты.СтатьяОборотовЗатраты,
	|	РаспределяемыеЗатраты.КонтрагентЗатраты,
	|	РаспределяемыеЗатраты.НоменклатураЗатраты,
	|	РаспределяемыеЗатраты.АналитикаБюджетаЗатраты,
	|	РаспределяемыеЗатраты.ДоговорКонтрагентаЗатраты,
	|	РаспределяемыеЗатраты.РегионЗатраты,
	|	РаспределяемыеЗатраты.ЦФОЗатраты
	|ПОМЕСТИТЬ ИтогиДляРаспределения
	|ИЗ
	|	РаспределяемыеЗатраты КАК РаспределяемыеЗатраты
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределяемыеЗатраты.Период,
	|	РаспределяемыеЗатраты.СтатьяОборотовЗатраты,
	|	РаспределяемыеЗатраты.КонтрагентЗатраты,
	|	РаспределяемыеЗатраты.НоменклатураЗатраты,
	|	РаспределяемыеЗатраты.АналитикаБюджетаЗатраты,
	|	РаспределяемыеЗатраты.ДоговорКонтрагентаЗатраты,
	|	РаспределяемыеЗатраты.РегионЗатраты,
	|	РаспределяемыеЗатраты.ЦФОЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РаспределяемыеЗатратыДКП.Вес) КАК Вес,
	|	СУММА(РаспределяемыеЗатратыДКП.Выручка) КАК Выручка,
	|	РаспределяемыеЗатратыДКП.Период,
	|	РаспределяемыеЗатратыДКП.СтатьяОборотовЗатраты,
	|	РаспределяемыеЗатратыДКП.КонтрагентЗатраты,
	|	РаспределяемыеЗатратыДКП.НоменклатураЗатраты,
	|	РаспределяемыеЗатратыДКП.АналитикаБюджетаЗатраты,
	|	РаспределяемыеЗатратыДКП.ДоговорКонтрагентаЗатраты,
	|	РаспределяемыеЗатратыДКП.РегионЗатраты,
	|	РаспределяемыеЗатратыДКП.ЦФОЗатраты
	|ПОМЕСТИТЬ ИтогиДляРаспределенияДКП
	|ИЗ
	|	РаспределяемыеЗатратыДКП КАК РаспределяемыеЗатратыДКП
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределяемыеЗатратыДКП.Период,
	|	РаспределяемыеЗатратыДКП.СтатьяОборотовЗатраты,
	|	РаспределяемыеЗатратыДКП.КонтрагентЗатраты,
	|	РаспределяемыеЗатратыДКП.НоменклатураЗатраты,
	|	РаспределяемыеЗатратыДКП.АналитикаБюджетаЗатраты,
	|	РаспределяемыеЗатратыДКП.ДоговорКонтрагентаЗатраты,
	|	РаспределяемыеЗатратыДКП.РегионЗатраты,
	|	РаспределяемыеЗатратыДКП.ЦФОЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределяемыеЗатраты.Период,
	|	РаспределяемыеЗатраты.СтатьяОборотовЗатраты КАК СтатьяОборотов,
	|	РаспределяемыеЗатраты.АналитикаБюджетаЗатраты КАК АналитикаБюджета,
	|	РаспределяемыеЗатраты.ЦФОВыручка КАК ЦФО,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатраты.КонтрагентЗатраты = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатраты.КонтрагентВыручка
	|		ИНАЧЕ РаспределяемыеЗатраты.КонтрагентЗатраты
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатраты.ДоговорКонтрагентаЗатраты = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатраты.ДоговорКонтрагентаВыручка
	|		ИНАЧЕ РаспределяемыеЗатраты.ДоговорКонтрагентаЗатраты
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатраты.РегионЗатраты = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатраты.РегионВыручка
	|		ИНАЧЕ РаспределяемыеЗатраты.РегионЗатраты
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатраты.НоменклатураЗатраты = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатраты.НоменклатураВыручка
	|		ИНАЧЕ РаспределяемыеЗатраты.НоменклатураЗатраты
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатраты.СтатьяОборотовЗатраты.абс_СпособРаспределенияЗатрат = ЗНАЧЕНИЕ(Перечисление.абс_СпособыРаспределенияЗатрат.ПоВесу)
	|			ТОГДА ВЫБОР
	|					КОГДА ИтогиДляРаспределения.Вес = 0
	|						ТОГДА 0
	|					ИНАЧЕ РаспределяемыеЗатраты.Сумма * (РаспределяемыеЗатраты.Вес / ИтогиДляРаспределения.Вес)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИтогиДляРаспределения.Выручка = 0
	|					ТОГДА 0
	|				ИНАЧЕ РаспределяемыеЗатраты.Сумма * (РаспределяемыеЗатраты.Выручка / ИтогиДляРаспределения.Выручка)
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатраты.СтатьяОборотовЗатраты.абс_СпособРаспределенияЗатрат = ЗНАЧЕНИЕ(Перечисление.абс_СпособыРаспределенияЗатрат.ПоВесу)
	|			ТОГДА ВЫБОР
	|					КОГДА ИтогиДляРаспределения.Вес = 0
	|						ТОГДА 0
	|					ИНАЧЕ РаспределяемыеЗатраты.СуммаБезНДС * (РаспределяемыеЗатраты.Вес / ИтогиДляРаспределения.Вес)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИтогиДляРаспределения.Выручка = 0
	|					ТОГДА 0
	|				ИНАЧЕ РаспределяемыеЗатраты.СуммаБезНДС * (РаспределяемыеЗатраты.Выручка / ИтогиДляРаспределения.Выручка)
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНДС
	|ПОМЕСТИТЬ РаспределенныеЗатраты
	|ИЗ
	|	РаспределяемыеЗатраты КАК РаспределяемыеЗатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиДляРаспределения КАК ИтогиДляРаспределения
	|		ПО РаспределяемыеЗатраты.Период = ИтогиДляРаспределения.Период
	|			И РаспределяемыеЗатраты.СтатьяОборотовЗатраты = ИтогиДляРаспределения.СтатьяОборотовЗатраты
	|			И РаспределяемыеЗатраты.ЦФОЗатраты = ИтогиДляРаспределения.ЦФОЗатраты
	|			И РаспределяемыеЗатраты.КонтрагентЗатраты = ИтогиДляРаспределения.КонтрагентЗатраты
	|			И РаспределяемыеЗатраты.ДоговорКонтрагентаЗатраты = ИтогиДляРаспределения.ДоговорКонтрагентаЗатраты
	|			И РаспределяемыеЗатраты.РегионЗатраты = ИтогиДляРаспределения.РегионЗатраты
	|			И РаспределяемыеЗатраты.АналитикаБюджетаЗатраты = ИтогиДляРаспределения.АналитикаБюджетаЗатраты
	|			И РаспределяемыеЗатраты.НоменклатураЗатраты = ИтогиДляРаспределения.НоменклатураЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределяемыеЗатратыДКП.Период,
	|	РаспределяемыеЗатратыДКП.СтатьяОборотовЗатраты КАК СтатьяОборотов,
	|	РаспределяемыеЗатратыДКП.АналитикаБюджетаЗатраты КАК АналитикаБюджета,
	|	РаспределяемыеЗатратыДКП.ЦФОВыручка КАК ЦФО,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатратыДКП.КонтрагентЗатраты = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатратыДКП.КонтрагентВыручка
	|		ИНАЧЕ РаспределяемыеЗатратыДКП.КонтрагентЗатраты
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатратыДКП.ДоговорКонтрагентаЗатраты = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатратыДКП.ДоговорКонтрагентаВыручка
	|		ИНАЧЕ РаспределяемыеЗатратыДКП.ДоговорКонтрагентаЗатраты
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатратыДКП.РегионЗатраты = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатратыДКП.РегионВыручка
	|		ИНАЧЕ РаспределяемыеЗатратыДКП.РегионЗатраты
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатратыДКП.НоменклатураЗатраты = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА РаспределяемыеЗатратыДКП.НоменклатураВыручка
	|		ИНАЧЕ РаспределяемыеЗатратыДКП.НоменклатураЗатраты
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатратыДКП.СтатьяОборотовЗатраты.абс_СпособРаспределенияЗатрат = ЗНАЧЕНИЕ(Перечисление.абс_СпособыРаспределенияЗатрат.ПоВесу)
	|			ТОГДА ВЫБОР
	|					КОГДА ИтогиДляРаспределенияДКП.Вес = 0
	|						ТОГДА 0
	|					ИНАЧЕ РаспределяемыеЗатратыДКП.Сумма * (РаспределяемыеЗатратыДКП.Вес / ИтогиДляРаспределенияДКП.Вес)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИтогиДляРаспределенияДКП.Выручка = 0
	|					ТОГДА 0
	|				ИНАЧЕ РаспределяемыеЗатратыДКП.Сумма * (РаспределяемыеЗатратыДКП.Выручка / ИтогиДляРаспределенияДКП.Выручка)
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА РаспределяемыеЗатратыДКП.СтатьяОборотовЗатраты.абс_СпособРаспределенияЗатрат = ЗНАЧЕНИЕ(Перечисление.абс_СпособыРаспределенияЗатрат.ПоВесу)
	|			ТОГДА ВЫБОР
	|					КОГДА ИтогиДляРаспределенияДКП.Вес = 0
	|						ТОГДА 0
	|					ИНАЧЕ РаспределяемыеЗатратыДКП.СуммаБезНДС * (РаспределяемыеЗатратыДКП.Вес / ИтогиДляРаспределенияДКП.Вес)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИтогиДляРаспределенияДКП.Выручка = 0
	|					ТОГДА 0
	|				ИНАЧЕ РаспределяемыеЗатратыДКП.СуммаБезНДС * (РаспределяемыеЗатратыДКП.Выручка / ИтогиДляРаспределенияДКП.Выручка)
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНДС
	|ПОМЕСТИТЬ РаспределенныеЗатратыДКП
	|ИЗ
	|	РаспределяемыеЗатратыДКП КАК РаспределяемыеЗатратыДКП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиДляРаспределенияДКП КАК ИтогиДляРаспределенияДКП
	|		ПО РаспределяемыеЗатратыДКП.Период = ИтогиДляРаспределенияДКП.Период
	|			И РаспределяемыеЗатратыДКП.СтатьяОборотовЗатраты = ИтогиДляРаспределенияДКП.СтатьяОборотовЗатраты
	|			И РаспределяемыеЗатратыДКП.ЦФОЗатраты = ИтогиДляРаспределенияДКП.ЦФОЗатраты
	|			И РаспределяемыеЗатратыДКП.КонтрагентЗатраты = ИтогиДляРаспределенияДКП.КонтрагентЗатраты
	|			И РаспределяемыеЗатратыДКП.ДоговорКонтрагентаЗатраты = ИтогиДляРаспределенияДКП.ДоговорКонтрагентаЗатраты
	|			И РаспределяемыеЗатратыДКП.РегионЗатраты = ИтогиДляРаспределенияДКП.РегионЗатраты
	|			И РаспределяемыеЗатратыДКП.АналитикаБюджетаЗатраты = ИтогиДляРаспределенияДКП.АналитикаБюджетаЗатраты
	|			И РаспределяемыеЗатратыДКП.НоменклатураЗатраты = ИтогиДляРаспределенияДКП.НоменклатураЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыОборотыБюджетовПоСтатьям.Период,
	|	ЗатратыОборотыБюджетовПоСтатьям.СтатьяОборотовЗатраты,
	|	ЗатратыОборотыБюджетовПоСтатьям.АналитикаБюджетаЗатраты,
	|	ЗатратыОборотыБюджетовПоСтатьям.Сумма - РаспределенныеЗатратыПоСтатьям.Сумма КАК Сумма,
	|	ЗатратыОборотыБюджетовПоСтатьям.СуммаБезНДС - РаспределенныеЗатратыПоСтатьям.СуммаБезНДС КАК СуммаБезНДС
	|ПОМЕСТИТЬ ОстаткиРаспределения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗатратыОборотыБюджетов.Период КАК Период,
	|		ЗатратыОборотыБюджетов.СтатьяОборотовЗатраты КАК СтатьяОборотовЗатраты,
	|		ЗатратыОборотыБюджетов.АналитикаБюджетаЗатраты КАК АналитикаБюджетаЗатраты,
	|		СУММА(ЗатратыОборотыБюджетов.Сумма) КАК Сумма,
	|		СУММА(ЗатратыОборотыБюджетов.СуммаБезНДС) КАК СуммаБезНДС
	|	ИЗ
	|		ЗатратыОборотыБюджетов КАК ЗатратыОборотыБюджетов
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗатратыОборотыБюджетов.СтатьяОборотовЗатраты,
	|		ЗатратыОборотыБюджетов.АналитикаБюджетаЗатраты,
	|		ЗатратыОборотыБюджетов.Период) КАК ЗатратыОборотыБюджетовПоСтатьям
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаспределенныеЗатраты.Период КАК Период,
	|			РаспределенныеЗатраты.СтатьяОборотов КАК СтатьяОборотов,
	|			РаспределенныеЗатраты.АналитикаБюджета КАК АналитикаБюджета,
	|			СУММА(РаспределенныеЗатраты.Сумма) КАК Сумма,
	|			СУММА(РаспределенныеЗатраты.СуммаБезНДС) КАК СуммаБезНДС
	|		ИЗ
	|			РаспределенныеЗатраты КАК РаспределенныеЗатраты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РаспределенныеЗатраты.Период,
	|			РаспределенныеЗатраты.АналитикаБюджета,
	|			РаспределенныеЗатраты.СтатьяОборотов) КАК РаспределенныеЗатратыПоСтатьям
	|		ПО РаспределенныеЗатратыПоСтатьям.Период = ЗатратыОборотыБюджетовПоСтатьям.Период
	|			И РаспределенныеЗатратыПоСтатьям.СтатьяОборотов = ЗатратыОборотыБюджетовПоСтатьям.СтатьяОборотовЗатраты
	|			И РаспределенныеЗатратыПоСтатьям.АналитикаБюджета = ЗатратыОборотыБюджетовПоСтатьям.АналитикаБюджетаЗатраты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыОборотыБюджетовДКППоСтатьям.Период,
	|	ЗатратыОборотыБюджетовДКППоСтатьям.СтатьяОборотовЗатраты,
	|	ЗатратыОборотыБюджетовДКППоСтатьям.АналитикаБюджетаЗатраты,
	|	ЗатратыОборотыБюджетовДКППоСтатьям.Сумма - РаспределенныеЗатратыДКППоСтатьям.Сумма КАК Сумма,
	|	ЗатратыОборотыБюджетовДКППоСтатьям.СуммаБезНДС - РаспределенныеЗатратыДКППоСтатьям.СуммаБезНДС КАК СуммаБезНДС
	|ПОМЕСТИТЬ ОстаткиРаспределенияДКП
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗатратыОборотыБюджетовДКП.Период КАК Период,
	|		ЗатратыОборотыБюджетовДКП.СтатьяОборотовЗатраты КАК СтатьяОборотовЗатраты,
	|		ЗатратыОборотыБюджетовДКП.АналитикаБюджетаЗатраты КАК АналитикаБюджетаЗатраты,
	|		СУММА(ЗатратыОборотыБюджетовДКП.Сумма) КАК Сумма,
	|		СУММА(ЗатратыОборотыБюджетовДКП.СуммаБезНДС) КАК СуммаБезНДС
	|	ИЗ
	|		ЗатратыОборотыБюджетовДКП КАК ЗатратыОборотыБюджетовДКП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗатратыОборотыБюджетовДКП.СтатьяОборотовЗатраты,
	|		ЗатратыОборотыБюджетовДКП.АналитикаБюджетаЗатраты,
	|		ЗатратыОборотыБюджетовДКП.Период) КАК ЗатратыОборотыБюджетовДКППоСтатьям
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаспределенныеЗатратыДКП.Период КАК Период,
	|			РаспределенныеЗатратыДКП.СтатьяОборотов КАК СтатьяОборотов,
	|			РаспределенныеЗатратыДКП.АналитикаБюджета КАК АналитикаБюджета,
	|			СУММА(РаспределенныеЗатратыДКП.Сумма) КАК Сумма,
	|			СУММА(РаспределенныеЗатратыДКП.СуммаБезНДС) КАК СуммаБезНДС
	|		ИЗ
	|			РаспределенныеЗатратыДКП КАК РаспределенныеЗатратыДКП
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РаспределенныеЗатратыДКП.Период,
	|			РаспределенныеЗатратыДКП.АналитикаБюджета,
	|			РаспределенныеЗатратыДКП.СтатьяОборотов) КАК РаспределенныеЗатратыДКППоСтатьям
	|		ПО ЗатратыОборотыБюджетовДКППоСтатьям.Период = РаспределенныеЗатратыДКППоСтатьям.Период
	|			И ЗатратыОборотыБюджетовДКППоСтатьям.СтатьяОборотовЗатраты = РаспределенныеЗатратыДКППоСтатьям.СтатьяОборотов
	|			И ЗатратыОборотыБюджетовДКППоСтатьям.АналитикаБюджетаЗатраты = РаспределенныеЗатратыДКППоСтатьям.АналитикаБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.КоличествоОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределенныеЗатраты.СтатьяОборотов,
	|	РаспределенныеЗатраты.ЦФО,
	|	РаспределенныеЗатраты.Контрагент,
	|	РаспределенныеЗатраты.ДоговорКонтрагента,
	|	РаспределенныеЗатраты.Регион,
	|	РаспределенныеЗатраты.Номенклатура,
	|	СУММА(0),
	|	СУММА(РаспределенныеЗатраты.Сумма),
	|	СУММА(РаспределенныеЗатраты.СуммаБезНДС),
	|	РаспределенныеЗатраты.Период,
	|	РаспределенныеЗатраты.АналитикаБюджета
	|ИЗ
	|	РаспределенныеЗатраты КАК РаспределенныеЗатраты
	|ГДЕ
	|	(НЕ РаспределенныеЗатраты.Сумма = 0
	|			ИЛИ НЕ РаспределенныеЗатраты.СуммаБезНДС = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределенныеЗатраты.СтатьяОборотов,
	|	РаспределенныеЗатраты.ЦФО,
	|	РаспределенныеЗатраты.Контрагент,
	|	РаспределенныеЗатраты.ДоговорКонтрагента,
	|	РаспределенныеЗатраты.Регион,
	|	РаспределенныеЗатраты.Номенклатура,
	|	РаспределенныеЗатраты.Период,
	|	РаспределенныеЗатраты.АналитикаБюджета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределенныеЗатратыДКП.СтатьяОборотов,
	|	РаспределенныеЗатратыДКП.ЦФО,
	|	РаспределенныеЗатратыДКП.Контрагент,
	|	РаспределенныеЗатратыДКП.ДоговорКонтрагента,
	|	РаспределенныеЗатратыДКП.Регион,
	|	РаспределенныеЗатратыДКП.Номенклатура,
	|	СУММА(0),
	|	СУММА(РаспределенныеЗатратыДКП.Сумма),
	|	СУММА(РаспределенныеЗатратыДКП.СуммаБезНДС),
	|	РаспределенныеЗатратыДКП.Период,
	|	РаспределенныеЗатратыДКП.АналитикаБюджета
	|ИЗ
	|	РаспределенныеЗатратыДКП КАК РаспределенныеЗатратыДКП
	|ГДЕ
	|	(НЕ РаспределенныеЗатратыДКП.Сумма = 0
	|			ИЛИ НЕ РаспределенныеЗатратыДКП.СуммаБезНДС = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределенныеЗатратыДКП.СтатьяОборотов,
	|	РаспределенныеЗатратыДКП.ЦФО,
	|	РаспределенныеЗатратыДКП.Контрагент,
	|	РаспределенныеЗатратыДКП.ДоговорКонтрагента,
	|	РаспределенныеЗатратыДКП.Регион,
	|	РаспределенныеЗатратыДКП.Номенклатура,
	|	РаспределенныеЗатратыДКП.Период,
	|	РаспределенныеЗатратыДКП.АналитикаБюджета
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Регион,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Период"						, ДатаПланирования);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("СлужбаМаркетинга"			, Константы.абс_СлужбаМаркетинга.Получить());
	Запрос.УстановитьПараметр("ОПДистрибьюция"				, Константы.абс_ОПДистрибьюция.Получить());
	Запрос.УстановитьПараметр("ОПКлючевыеПокупатели"		, Константы.абс_ОПКлючевыеПокупатели.Получить());
	Запрос.УстановитьПараметр("Сценарий"					, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
	Запрос.УстановитьПараметр("РаспределятьПоКонтрагентам"  , РаспределятьПоКонтрагентам);
	Запрос.УстановитьПараметр("РаспределятьПоНоменклатуре"  , РаспределятьПоНоменклатуре);
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитикаБюджета=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитикаБюджета.Следующий() Цикл
				
				ВыборкаРегион=ВыборкаАналитикаБюджета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаРегион.Следующий() Цикл
					
					ВыборкаКонтрагент=ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагент.Следующий() Цикл
												
						ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
							
							ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаНоменклатура.Следующий() Цикл
								
								СтрокаТЧ=Объект.СоставБюджета.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаНоменклатура);
								
								ВыборкаПериод=ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаПериод.Следующий() Цикл
									СтрокаТЧ["Сумма"		+ Месяц(ВыборкаПериод.Период)] = ВыборкаПериод.Сумма;
									СтрокаТЧ["Количество"	+ Месяц(ВыборкаПериод.Период)] = ВыборкаПериод.Количество;
									СтрокаТЧ["СуммаБезНДС"	+ Месяц(ВыборкаПериод.Период)] = ВыборкаПериод.СуммаБезНДС;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура РаспределитьБюджетПоЦД_РаспределитьПропорционально(Объект) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период"						, ДатаПланирования);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("СлужбаМаркетинга"			, Константы.абс_СлужбаМаркетинга.Получить());
	Запрос.УстановитьПараметр("ОПДистрибьюция"				, Константы.абс_ОПДистрибьюция.Получить());
	Запрос.УстановитьПараметр("ОПКлючевыеПокупатели"		, Константы.абс_ОПКлючевыеПокупатели.Получить());
	Запрос.УстановитьПараметр("Сценарий"					, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
	Запрос.УстановитьПараметр("РаспределятьПоКонтрагентам"  , РаспределятьПоКонтрагентам);
	Запрос.УстановитьПараметр("РаспределятьПоНоменклатуре"  , РаспределятьПоНоменклатуре);	
	
	// Таблица по выручке
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент КАК КонтрагентСсылка
	|ПОМЕСТИТЬ ВТ_СвоиКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.КоличествоОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК СуммаБезНДС,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.Вес, 0)) КАК Вес
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК СуммаБезНДС,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.Вес, 0)) КАК Вес
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	(ОборотыБюджетовОбороты.ЦФО = &ОПДистрибьюция
	|			ИЛИ ОборотыБюджетовОбороты.ЦФО = &ОПКлючевыеПокупатели)
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|				И СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				И НЕ ЦФО = &СлужбаМаркетинга) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот = 0
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|				И СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				И ЦФО = &СлужбаМаркетинга) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот = 0
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.Период,
	|	ОборотыБюджетовОбороты.СтатьяОборотов,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.ЦФО";
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//0 - Выручка общ
	//1 - Выручка
	//2 - Выручка ДКП
	//3 - Затраты
	//4 - Затраты ДКП
	
	ТаблицаВыручкиОбщ 	= РезультатЗапроса[1].Выгрузить();
	
	ТаблицаВыручки 		= РезультатЗапроса[2].Выгрузить();
	ТаблицаВыручкиДКП 	= РезультатЗапроса[3].Выгрузить();
	
	ТаблицаЗатрат 		= РезультатЗапроса[4].Выгрузить();
	ТаблицаЗатратДКП 	= РезультатЗапроса[5].Выгрузить();
	
	// Выручку просто запишем в регистр
	Для Каждого СтрВыручкиОбщ Из ТаблицаВыручкиОбщ Цикл
		
		СтрокаТЧ = Объект.СоставБюджета.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрВыручкиОбщ);

		СтрокаТЧ["Сумма"		+ Месяц(СтрВыручкиОбщ.Период)] = СтрВыручкиОбщ.Сумма;
		СтрокаТЧ["Количество"	+ Месяц(СтрВыручкиОбщ.Период)] = СтрВыручкиОбщ.Количество;
		СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрВыручкиОбщ.Период)] = СтрВыручкиОбщ.СуммаБезНДС;
		
	КонецЦикла;
	
	Для Каждого СтрЗатрат Из ТаблицаЗатрат Цикл
		
		Сумма 		= СтрЗатрат.Сумма;
		СуммаБезНДС = СтрЗатрат.СуммаБезНДС;
		
		ПоказательРаспределения = ?(СтрЗатрат.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "Сумма");
		
		СтруктураПоискаАналитикиРаспределения = Новый Структура("Период", СтрЗатрат.Период);
		
		//Если это услуги/ретро, распределим их на покупателя
		Если СтрЗатрат.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Ретро 
			И ЗначениеЗаполнено(СтрЗатрат.Контрагент) Тогда
			
			СтруктураПоискаАналитикиРаспределения.Вставить("Контрагент"			, СтрЗатрат.Контрагент);
			СтруктураПоискаАналитикиРаспределения.Вставить("ДоговорКонтрагента"	, СтрЗатрат.ДоговорКонтрагента);
			СтруктураПоискаАналитикиРаспределения.Вставить("Регион"				, СтрЗатрат.Регион);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗатрат.Номенклатура) Тогда
			СтруктураПоискаАналитикиРаспределения.Вставить("Номенклатура"		, СтрЗатрат.Номенклатура);
		КонецЕсли;
		
		БазаРаспределения = ПолучитьТаблицуРаспределенияПоОтбору(ТаблицаВыручки, СтруктураПоискаАналитикиРаспределения);
		
		Если БазаРаспределения.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": нет базы!");
			Продолжить;
		КонецЕсли;
		
		РезультатРаспределенияСумма 		= Общегоназначения.РаспределитьПропорционально(Сумма		, БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения));
		РезультатРаспределенияСуммаБезНДС 	= Общегоназначения.РаспределитьПропорционально(СуммаБезНДС	, БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения));
		
		Для Каждого СтрБазаРаспределения Из БазаРаспределения Цикл
			
			ИндексСтрокиБазы = БазаРаспределения.Индекс(СтрБазаРаспределения);
			
			СтрокаТЧ = Объект.СоставБюджета.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрЗатрат, "СтатьяОборотовПоБюджетам,АналитикаБюджета");
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");
			
			СтрокаТЧ["Сумма"		+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСумма[ИндексСтрокиБазы];
			СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы];
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрЗатрат Из ТаблицаЗатратДКП Цикл
		
		Сумма 		= СтрЗатрат.Сумма;
		СуммаБезНДС = СтрЗатрат.СуммаБезНДС;
		
		ПоказательРаспределения = ?(СтрЗатрат.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "Сумма");
		
		СтруктураПоискаАналитикиРаспределения = Новый Структура("Период", СтрЗатрат.Период);
		
		//Если это услуги/ретро, распределим их на покупателя
		Если СтрЗатрат.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Ретро 
			И ЗначениеЗаполнено(СтрЗатрат.Контрагент) Тогда
			
			СтруктураПоискаАналитикиРаспределения.Вставить("Контрагент"			, СтрЗатрат.Контрагент);
			СтруктураПоискаАналитикиРаспределения.Вставить("ДоговорКонтрагента"	, СтрЗатрат.ДоговорКонтрагента);
			СтруктураПоискаАналитикиРаспределения.Вставить("Регион"				, СтрЗатрат.Регион);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗатрат.Номенклатура) Тогда
			СтруктураПоискаАналитикиРаспределения.Вставить("Номенклатура"		, СтрЗатрат.Номенклатура);
		КонецЕсли;
		
		БазаРаспределения = ПолучитьТаблицуРаспределенияПоОтбору(ТаблицаВыручкиДКП, СтруктураПоискаАналитикиРаспределения);
		
		Если БазаРаспределения.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": нет базы!");
			Продолжить;
		КонецЕсли;
		
		РезультатРаспределенияСумма 		= Общегоназначения.РаспределитьПропорционально(Сумма		, БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения));
		РезультатРаспределенияСуммаБезНДС 	= Общегоназначения.РаспределитьПропорционально(СуммаБезНДС	, БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения));
		
		Для Каждого СтрБазаРаспределения Из БазаРаспределения Цикл
			
			ИндексСтрокиБазы = БазаРаспределения.Индекс(СтрБазаРаспределения);
			
			СтрокаТЧ = Объект.СоставБюджета.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрЗатрат, "Период,СтатьяОборотовПоБюджетам,АналитикаБюджета");
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");
			
			СтрокаТЧ["Сумма"		+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСумма[ИндексСтрокиБазы];
			СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы];
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура РаспределитьБюджетПоЦД_РаспределитьПропорционально_ВРегистр(ДвиженияОборотыБюджетов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период"						, ДатаПланирования);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("СлужбаМаркетинга"			, Константы.абс_СлужбаМаркетинга.Получить());
	Запрос.УстановитьПараметр("ОПДистрибьюция"				, Константы.абс_ОПДистрибьюция.Получить());
	Запрос.УстановитьПараметр("ОПКлючевыеПокупатели"		, Константы.абс_ОПКлючевыеПокупатели.Получить());
	Запрос.УстановитьПараметр("Сценарий"					, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
	Запрос.УстановитьПараметр("РаспределятьПоКонтрагентам"  , РаспределятьПоКонтрагентам);
	Запрос.УстановитьПараметр("РаспределятьПоНоменклатуре"  , РаспределятьПоНоменклатуре);	
	Запрос.УстановитьПараметр("РаспределятьПоРазделамБюджета",РаспределятьПоРазделамБюджета);
	Запрос.УстановитьПараметр("РаспределятьПоОрганизациям"	, РаспределятьПоОрганизациям);
	Запрос.УстановитьПараметр("ТекущийПериод"				, ТекущийПериод);
	
	// Таблица по выручке
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент КАК КонтрагентСсылка
	|ПОМЕСТИТЬ ВТ_СвоиКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.СтатьяБюджетаПоЦД, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов
	|	КОНЕЦ КАК СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка)
	|		ИНАЧЕ ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|	КОНЕЦ КАК АналитикаБюджета,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоОрганизациям
	|			ТОГДА ОборотыБюджетовОбороты.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.КоличествоОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			Месяц,
	|			Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка)
	|		ИНАЧЕ ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоОрганизациям
	|			ТОГДА ОборотыБюджетовОбороты.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.СтатьяБюджетаПоЦД, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК СуммаБезНДС,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто, 0)) КАК Вес
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот) КАК Количество,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
	|	СУММА(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК СуммаБезНДС,
	|	СУММА(ОборотыБюджетовОбороты.КоличествоОборот * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто, 0)) КАК Вес
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	(ОборотыБюджетовОбороты.ЦФО = &ОПДистрибьюция
	|			ИЛИ ОборотыБюджетовОбороты.ЦФО = &ОПКлючевыеПокупатели)
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.пустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.СтатьяБюджетаПоЦД, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов
	|	КОНЕЦ КАК СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка)
	|		ИНАЧЕ ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|	КОНЕЦ КАК АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоОрганизациям
	|			ТОГДА ОборотыБюджетовОбороты.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|				И СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				И НЕ ЦФО = &СлужбаМаркетинга) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот = 0
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.Период,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка)
	|		ИНАЧЕ ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоОрганизациям
	|			ТОГДА ОборотыБюджетовОбороты.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.СтатьяБюджетаПоЦД, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.СтатьяБюджетаПоЦД, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов
	|	КОНЕЦ КАК СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка)
	|		ИНАЧЕ ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|	КОНЕЦ КАК АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоОрганизациям
	|			ТОГДА ОборотыБюджетовОбороты.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|			ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		КОНЕЦ) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&ТекущийПериод, МЕСЯЦ),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И Сценарий = &Сценарий
	|				И ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|				И СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				И ЦФО = &СлужбаМаркетинга) КАК ОборотыБюджетовОбороты
	|ГДЕ
	|	НЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот = 0
	|	И НЕ ОборотыБюджетовОбороты.Контрагент В
	|				(ВЫБРАТЬ
	|					ВТ_СвоиКонтрагенты.КонтрагентСсылка
	|				ИЗ
	|					ВТ_СвоиКонтрагенты КАК ВТ_СвоиКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыБюджетовОбороты.Период,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоНоменклатуре
	|			ТОГДА ОборотыБюджетовОбороты.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоКонтрагентам
	|			ТОГДА ОборотыБюджетовОбороты.абс_Регион
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|	КОНЕЦ,
	|	ОборотыБюджетовОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка)
	|		ИНАЧЕ ОборотыБюджетовОбороты.абс_АналитикаБюджета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоОрганизациям
	|			ТОГДА ОборотыБюджетовОбороты.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &РаспределятьПоРазделамБюджета
	|			ТОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБРД.СтатьяБюджетаПоЦД, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов
	|	КОНЕЦ";
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//0 - Выручка общ
	//1 - Выручка
	//2 - Выручка ДКП
	//3 - Затраты
	//4 - Затраты ДКП
	
	ТаблицаВыручкиОбщ 	= РезультатЗапроса[1].Выгрузить();
	
	ТаблицаВыручки 		= РезультатЗапроса[2].Выгрузить();
	ТаблицаВыручкиДКП 	= РезультатЗапроса[3].Выгрузить();
	
	ТаблицаЗатрат 		= РезультатЗапроса[4].Выгрузить();
	ТаблицаЗатратДКП 	= РезультатЗапроса[5].Выгрузить();
	
	// Сценарий для движений
	Сценарий			= абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);
	
	// Выручку просто запишем в регистр
	Для Каждого СтрВыручкиОбщ Из ТаблицаВыручкиОбщ Цикл
		
		// Распределяем прямые затраты
		// Если затраты прямые и не указан контрагент, либо номенклатура, то их распределяем по контрагентам и номенклатуре
		Если СтрВыручкиОбщ.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = Перечисления.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов Тогда
			
			// Если это доход, то записываем в регистр без изменения
			ДобавитьДвижениеПоОборотамБюджетов(ДвиженияОборотыБюджетов, СтрВыручкиОбщ, СтрВыручкиОбщ.Количество, СтрВыручкиОбщ.Сумма, СтрВыручкиОбщ.СуммаБезНДС, Сценарий);
			
		ИначеЕсли СтрВыручкиОбщ.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = Перечисления.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов 
			И (РаспределятьПоНоменклатуре = ЗначениеЗаполнено(СтрВыручкиОбщ.Номенклатура))
			И (РаспределятьПоКонтрагентам = ЗначениеЗаполнено(СтрВыручкиОбщ.Контрагент)) 
			И (РаспределятьПоОрганизациям = ЗначениеЗаполнено(СтрВыручкиОбщ.Организация)) Тогда
			
			// Если это расход и заполнены аналитики, то записываем в регистр без изменения
			ДобавитьДвижениеПоОборотамБюджетов(ДвиженияОборотыБюджетов, СтрВыручкиОбщ, СтрВыручкиОбщ.Количество, СтрВыручкиОбщ.Сумма, СтрВыручкиОбщ.СуммаБезНДС, Сценарий);
		Иначе
			
			// Иначе будем распределять
			ЗаполненаНоменклатура 	= ЗначениеЗаполнено(СтрВыручкиОбщ.Номенклатура);
			ЗаполненКонтрагент 		= ЗначениеЗаполнено(СтрВыручкиОбщ.Контрагент);
			ЗаполненаОрганизация 	= ЗначениеЗаполнено(СтрВыручкиОбщ.Организация);
			
			Сумма 		= СтрВыручкиОбщ.Сумма;
			СуммаБезНДС = СтрВыручкиОбщ.СуммаБезНДС;
			
			Если СтрВыручкиОбщ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
				ПоказательРаспределения 		= "Количество";
				ПоказательРаспределенияБезНДС 	= "Количество";
			Иначе
				ПоказательРаспределения 		= ?(СтрВыручкиОбщ.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "Сумма");
				ПоказательРаспределенияБезНДС 	= ?(СтрВыручкиОбщ.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "СуммаБезНДС");
			КонецЕсли;
			
			СтруктураПоискаАналитикиРаспределения = Новый Структура("Период", СтрВыручкиОбщ.Период);
			
			СтруктураПоискаАналитикиРаспределения.Вставить("ЦФО"					, СтрВыручкиОбщ.ЦФО);
			
			Если ЗначениеЗаполнено(СтрВыручкиОбщ.Номенклатура) Тогда			
				СтруктураПоискаАналитикиРаспределения.Вставить("Номенклатура"		, СтрВыручкиОбщ.Номенклатура);				
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(СтрВыручкиОбщ.Контрагент) Тогда
				Если СтрВыручкиОбщ.Контрагент.Покупатель И 
					НЕ ТаблицаВыручки.НайтиСтроки(Новый Структура("Контрагент,Период,ЦФО", СтрВыручкиОбщ.Контрагент,СтрВыручкиОбщ.Период,СтрВыручкиОбщ.ЦФО)).Количество() = 0 Тогда
					
					
					СтруктураПоискаАналитикиРаспределения.Вставить("Контрагент"			, СтрВыручкиОбщ.Контрагент);
				КонецЕсли;
				//СтруктураПоискаАналитикиРаспределения.Вставить("ДоговорКонтрагента"	, СтрВыручкиОбщ.ДоговорКонтрагента);
				//СтруктураПоискаАналитикиРаспределения.Вставить("Регион"				, СтрВыручкиОбщ.Регион);			
			КонецЕсли;
			
			//Если ЗначениеЗаполнено(СтрВыручкиОбщ.Организация) Тогда			
			//	СтруктураПоискаАналитикиРаспределения.Вставить("Организация"		, СтрВыручкиОбщ.Организация);			
			//КонецЕсли;			
						
			БазаРаспределения = ПолучитьТаблицуРаспределенияПоОтбору(ТаблицаВыручки, СтруктураПоискаАналитикиРаспределения);
			
			Если БазаРаспределения.Количество() = 0 Тогда				
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрВыручкиОбщ.СтатьяОборотовПобюджетам + ": нет базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ".");
				Продолжить;
			КонецЕсли;
			
			РезультатРаспределенияСумма 		= Общегоназначения.РаспределитьПропорционально(Сумма		, БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения));
			РезультатРаспределенияСуммаБезНДС 	= Общегоназначения.РаспределитьПропорционально(СуммаБезНДС	, БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределенияБезНДС));
			
			Для Каждого СтрБазаРаспределения Из БазаРаспределения Цикл
				
				ИндексСтрокиБазы = БазаРаспределения.Индекс(СтрБазаРаспределения);
							
				СтруктураДвижения = ПолучитьСтруктуруСтрокиБюджета();
				
				ЗаполнитьЗначенияСвойств(СтруктураДвижения, СтрВыручкиОбщ, "Период,СтатьяОборотовПоБюджетам,АналитикаБюджета,Организация");	
				ЗаполнитьЗначенияСвойств(СтруктураДвижения, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");			
				
				ДобавитьДвижениеПоОборотамБюджетов(ДвиженияОборотыБюджетов, СтруктураДвижения, 0, РезультатРаспределенияСумма[ИндексСтрокиБазы], РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы], Сценарий);
				
				//СтрокаТЧ = Объект.СоставБюджета.Добавить();
				//
				//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрЗатрат, "СтатьяОборотовПоБюджетам,АналитикаБюджета");
				//
				//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");
				//
				//СтрокаТЧ["Сумма"		+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСумма[ИндексСтрокиБазы];
				//СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы];
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		
		//СтрокаТЧ = Объект.СоставБюджета.Добавить();
		//
		//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрВыручкиОбщ);		
		//
		//СтрокаТЧ["Сумма"		+ Месяц(СтрВыручкиОбщ.Период)] = СтрВыручкиОбщ.Сумма;
		//СтрокаТЧ["Количество"	+ Месяц(СтрВыручкиОбщ.Период)] = СтрВыручкиОбщ.Количество;
		//СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрВыручкиОбщ.Период)] = СтрВыручкиОбщ.СуммаБезНДС;
		
	КонецЦикла;
	
	Для Каждого СтрЗатрат Из ТаблицаЗатрат Цикл
		
		Сумма 		= СтрЗатрат.Сумма;
		СуммаБезНДС = СтрЗатрат.СуммаБезНДС;
		
		ПоказательРаспределения 		= ?(СтрЗатрат.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "Сумма");
		ПоказательРаспределенияБезНДС 	= ?(СтрЗатрат.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "СуммаБезНДС");
		
		СтруктураПоискаАналитикиРаспределения = Новый Структура("Период", СтрЗатрат.Период);
		
		//Если это услуги/ретро, распределим их на покупателя
		Если СтрЗатрат.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Ретро 
			И ЗначениеЗаполнено(СтрЗатрат.Контрагент) Тогда
			
			СтруктураПоискаАналитикиРаспределения.Вставить("Контрагент"			, СтрЗатрат.Контрагент);
			СтруктураПоискаАналитикиРаспределения.Вставить("ДоговорКонтрагента"	, СтрЗатрат.ДоговорКонтрагента);
			//СтруктураПоискаАналитикиРаспределения.Вставить("Регион"				, СтрЗатрат.Регион);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗатрат.Номенклатура) Тогда
			СтруктураПоискаАналитикиРаспределения.Вставить("Номенклатура"		, СтрЗатрат.Номенклатура);
		КонецЕсли;
		
		БазаРаспределения = ПолучитьТаблицуРаспределенияПоОтбору(ТаблицаВыручки, СтруктураПоискаАналитикиРаспределения);
		
		Если БазаРаспределения.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": нет базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ".");
			Продолжить;
		КонецЕсли;
		
		//Проверим базу коэффициенты распределения
		КоэфициентыРаспределенияСумма = БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения);
		
		СуммаКоэффициентов = 0;
		
		Для Каждого ТекКоэффициент Из КоэфициентыРаспределенияСумма Цикл
			СуммаКоэффициентов = СуммаКоэффициентов + ТекКоэффициент;
		КонецЦикла;
		
		Если СуммаКоэффициентов = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ", показатель распределения: " + ПоказательРаспределения);
			Продолжить;
		КонецЕсли;
				
		КоэфициентыРаспределенияСуммаБезНДС = БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределенияБезНДС);
		
		СуммаКоэффициентов = 0;
		
		Для Каждого ТекКоэффициент Из КоэфициентыРаспределенияСуммаБезНДС Цикл
			СуммаКоэффициентов = СуммаКоэффициентов + ТекКоэффициент;
		КонецЦикла;
		
		Если СуммаКоэффициентов = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ", показатель распределения: " + КоэфициентыРаспределенияСуммаБезНДС);
			Продолжить;
		КонецЕсли;		
		
		РезультатРаспределенияСумма 		= Общегоназначения.РаспределитьПропорционально(Сумма		, КоэфициентыРаспределенияСумма);	
		РезультатРаспределенияСуммаБезНДС 	= Общегоназначения.РаспределитьПропорционально(СуммаБезНДС	, КоэфициентыРаспределенияСуммаБезНДС);
		
		Для Каждого СтрБазаРаспределения Из БазаРаспределения Цикл
			
			ИндексСтрокиБазы = БазаРаспределения.Индекс(СтрБазаРаспределения);
						
			СтруктураДвижения = ПолучитьСтруктуруСтрокиБюджета();
			
			ЗаполнитьЗначенияСвойств(СтруктураДвижения, СтрЗатрат, "Период,СтатьяОборотовПоБюджетам,АналитикаБюджета,Организация");	
			ЗаполнитьЗначенияСвойств(СтруктураДвижения, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");			
			
			ДобавитьДвижениеПоОборотамБюджетов(ДвиженияОборотыБюджетов, СтруктураДвижения, 0, РезультатРаспределенияСумма[ИндексСтрокиБазы], РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы], Сценарий);
			
			//СтрокаТЧ = Объект.СоставБюджета.Добавить();
			//
			//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрЗатрат, "СтатьяОборотовПоБюджетам,АналитикаБюджета");
			//
			//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");
			//
			//СтрокаТЧ["Сумма"		+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСумма[ИндексСтрокиБазы];
			//СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы];
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрЗатрат Из ТаблицаЗатратДКП Цикл
		
		Сумма 		= СтрЗатрат.Сумма;
		СуммаБезНДС = СтрЗатрат.СуммаБезНДС;
		
		ПоказательРаспределения 		= ?(СтрЗатрат.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "Сумма");
		ПоказательРаспределенияБезНДС 	= ?(СтрЗатрат.СтатьяОборотовПоБюджетам.абс_СпособРаспределенияЗатрат = Перечисления.абс_СпособыРаспределенияЗатрат.ПоВесу, "Вес", "СуммаБезНДС");
		
		СтруктураПоискаАналитикиРаспределения = Новый Структура("Период", СтрЗатрат.Период);
		
		//Если это услуги/ретро, распределим их на покупателя
		Если СтрЗатрат.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Ретро 
			И ЗначениеЗаполнено(СтрЗатрат.Контрагент) Тогда
			
			СтруктураПоискаАналитикиРаспределения.Вставить("Контрагент"			, СтрЗатрат.Контрагент);
			СтруктураПоискаАналитикиРаспределения.Вставить("ДоговорКонтрагента"	, СтрЗатрат.ДоговорКонтрагента);
			//СтруктураПоискаАналитикиРаспределения.Вставить("Регион"				, СтрЗатрат.Регион);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрЗатрат.Номенклатура) Тогда
			СтруктураПоискаАналитикиРаспределения.Вставить("Номенклатура"		, СтрЗатрат.Номенклатура);
		КонецЕсли;
		
		БазаРаспределения = ПолучитьТаблицуРаспределенияПоОтбору(ТаблицаВыручкиДКП, СтруктураПоискаАналитикиРаспределения);
		
		Если БазаРаспределения.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": нет базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ".");
			Продолжить;
		КонецЕсли;
		
		//Проверим базу коэффициенты распределения
		КоэфициентыРаспределенияСумма = БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределения);
		
		СуммаКоэффициентов = 0;
		
		Для Каждого ТекКоэффициент Из КоэфициентыРаспределенияСумма Цикл
			СуммаКоэффициентов = СуммаКоэффициентов + ТекКоэффициент;
		КонецЦикла;
		
		Если СуммаКоэффициентов = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ", показатель распределения: " + ПоказательРаспределения);
			Продолжить;
		КонецЕсли;
				
		КоэфициентыРаспределенияСуммаБезНДС = БазаРаспределения.ВыгрузитьКолонку(ПоказательРаспределенияБезНДС);
		
		СуммаКоэффициентов = 0;
		
		Для Каждого ТекКоэффициент Из КоэфициентыРаспределенияСуммаБезНДС Цикл
			СуммаКоэффициентов = СуммаКоэффициентов + ТекКоэффициент;
		КонецЦикла;
		
		Если СуммаКоэффициентов = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при распределении суммы: " + Сумма + " по статье: " + СтрЗатрат.СтатьяОборотовПобюджетам + ": базы! Аналитики распределения: " + ПолучитьСтруктуруАналитикСтрокой(СтруктураПоискаАналитикиРаспределения) + ", показатель распределения: " + КоэфициентыРаспределенияСуммаБезНДС);
			Продолжить;
		КонецЕсли;		
		
		РезультатРаспределенияСумма 		= Общегоназначения.РаспределитьПропорционально(Сумма		, КоэфициентыРаспределенияСумма);
		РезультатРаспределенияСуммаБезНДС 	= Общегоназначения.РаспределитьПропорционально(СуммаБезНДС	, КоэфициентыРаспределенияСуммаБезНДС);
		
		Для Каждого СтрБазаРаспределения Из БазаРаспределения Цикл
			
			ИндексСтрокиБазы = БазаРаспределения.Индекс(СтрБазаРаспределения);
			
			СтруктураДвижения = ПолучитьСтруктуруСтрокиБюджета();
			
			ЗаполнитьЗначенияСвойств(СтруктураДвижения, СтрЗатрат, "Период,СтатьяОборотовПоБюджетам,АналитикаБюджета,Организация");	
			ЗаполнитьЗначенияСвойств(СтруктураДвижения, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");			
			
			ДобавитьДвижениеПоОборотамБюджетов(ДвиженияОборотыБюджетов, СтруктураДвижения, 0, РезультатРаспределенияСумма[ИндексСтрокиБазы], РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы], Сценарий);			
			
			//СтрокаТЧ = Объект.СоставБюджета.Добавить();
			//
			//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрЗатрат, "Период,СтатьяОборотовПоБюджетам,АналитикаБюджета");
			//
			//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрБазаРаспределения, "Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");
			//
			//СтрокаТЧ["Сумма"		+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСумма[ИндексСтрокиБазы];
			//СтрокаТЧ["СуммаБезНДС"	+ Месяц(СтрЗатрат.Период)] = РезультатРаспределенияСуммаБезНДС[ИндексСтрокиБазы];
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСтруктуруАналитикСтрокой(СтруктураАналитик)
	
	СтрокаАналитик = "";
	
	Для Каждого КлючЗначение Из СтруктураАналитик Цикл
		
		СтрокаАналитик = СтрокаАналитик + КлючЗначение.Ключ + ": " + КлючЗначение.Значение + ", ";
		
	КонецЦикла;
	
	СтрокаАналитик = Лев(СтрокаАналитик, СтрДлина(СтрокаАналитик) - 2);
	
	Возврат СтрокаАналитик;
	
КонецФункции

Функция ПолучитьСтруктуруСтрокиБюджета()
	
	С = Новый Структура("Период,СтатьяОборотовПоБюджетам,АналитикаБюджета,Организация,Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ЦФО");
	
	Возврат С;
	
КонецФункции

Процедура ДобавитьДвижениеПоОборотамБюджетов(ДвиженияОборотыБюджетов, СтруктураДвижения, Количество, Сумма, СуммаБезНДС, Сценарий)
	
	Движение = ДвиженияОборотыБюджетов.Добавить();
	
	Коэффициент = ?(СтруктураДвижения.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = Перечисления.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов, -1, 1);
	
	//ЗаполнитьЗначенияСвойств(Движение, СтруктураДвижения);
	Движение.СтатьяОборотов 		= СтруктураДвижения.СтатьяОборотовПоБюджетам;
	Движение.абс_АналитикаБюджета 	= СтруктураДвижения.АналитикаБюджета;
	
	Если РаспределятьПоКонтрагентам Тогда
		Движение.Контрагент 			= СтруктураДвижения.Контрагент;
		Движение.абс_ДоговорКонтрагента = СтруктураДвижения.ДоговорКонтрагента;
		Движение.абс_Регион 			= СтруктураДвижения.Регион;
	КонецЕсли;
	
	Если РаспределятьПоНоменклатуре Тогда
		Движение.Номенклатура 			= СтруктураДвижения.Номенклатура;
	КонецЕсли;
	
	Движение.ЦФО 					= СтруктураДвижения.ЦФО;	
	
	Если РаспределятьПоОрганизациям Тогда
		Движение.Организация			= СтруктураДвижения.Организация;
	КонецЕсли;
	
	Движение.Активность				= Истина;
	Движение.Период 				= СтруктураДвижения.Период;
	
	Движение.СуммаУпр				= Сумма 		* Коэффициент;	
	Движение.СуммаУпрБезНДС			= СуммаБезНДС	* Коэффициент;
	
	Если Движение.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка Тогда
		Движение.Количество			= Количество * Коэффициент;
	КонецЕсли;	
	
	Движение.абс_Бюджет				= Справочники.Бюджеты.БДРпоЦД;
	Движение.Сценарий				= Сценарий;
	
КонецПроцедуры

// Универсальные процедуры и функции для распределения

Функция ПолучитьТаблицуРаспределенияПоОтбору(ТаблицаБазы, Отбор)
	
	Таб = Новый ТаблицаЗначений;
	
	Таб.Колонки.Добавить("Период");
	Таб.Колонки.Добавить("ЦФО");
	Таб.Колонки.Добавить("Организация");
	Таб.Колонки.Добавить("Номенклатура");
	Таб.Колонки.Добавить("Контрагент");
	Таб.Колонки.Добавить("ДоговорКонтрагента");
	Таб.Колонки.Добавить("Регион");
	Таб.Колонки.Добавить("Количество");
	Таб.Колонки.Добавить("Сумма");
	Таб.Колонки.Добавить("СуммаБезНДС");
	Таб.Колонки.Добавить("Вес");
	
	СтрокиОтбораБазы = ТаблицаБазы.НайтиСтроки(Отбор);
	
	Для Каждого СтрОтбораБазы Из СтрокиОтбораБазы Цикл
		
		ЗаполнитьЗначенияСвойств(Таб.Добавить(), СтрОтбораБазы);
		
	КонецЦикла;
	
	Возврат Таб;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	ВидОперации			= Перечисления.абс_ВидыОперацийВводБюджета.Бюджет;
	Ответственный		= ПараметрыСеанса.ТекущийПользователь;
	ДатаПланирования 	= НачалоГода(ТекущаяДата());
	
	ТекущийПериод		= НачалоМесяца(ТекущаяДата());
	
КонецПроцедуры                                                     

Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ОборотыБюджетов 
	Движения.ОборотыБюджетов.Записывать = Истина;
	Движения.ОборотыБюджетов.Очистить();
	
	РаспределитьБюджетПоЦД_РаспределитьПропорционально_ВРегистр(Движения.ОборотыБюджетов);	
	
КонецПроцедуры

Процедура ОбработкаПроведения_НеИсп(Отказ, Режим)
		
	// регистр ОборотыБюджетов 
	Движения.ОборотыБюджетов.Записывать = Истина;
	Движения.ОборотыБюджетов.Очистить();
	
	СтруктураДляЗаполненияТЧ = Новый Структура("СоставБюджета");
	
	СтруктураДляЗаполненияТЧ.СоставБюджета = ЭтотОбъект.СоставБюджета.Выгрузить().СкопироватьКолонки();
	
	РаспределитьБюджетПоЦД_РаспределитьПропорционально(СтруктураДляЗаполненияТЧ);	
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ * Поместить ВТ_ТЧСоставБюджета  Из &ТЧСоставБюджета КАК ТЧСоставБюджета
	|
	|;
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	|	абс_ВводБюджетаПоЦДСоставБюджета.АналитикаБюджета КАК абс_АналитикаБюджета,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС1,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС2,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС3,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС4,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС5,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС6,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС7,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС8,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС9,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС10,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС11,
	|	абс_ВводБюджетаПоЦДСоставБюджета.СуммаБезНДС12,
	|	ВЫБОР
	|		КОГДА абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18  
	|		КОГДА абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма1,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма2,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма3,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма4,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма5,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма6,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма7,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма8,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма9,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма10,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма11,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Сумма12,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество1,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество2,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество3,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество4,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество5,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество6,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество7,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество8,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество9,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество10,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество11,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Количество12,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Номенклатура,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Контрагент,
	|	абс_ВводБюджетаПоЦДСоставБюджета.ЦФО,
	|	&Организация КАК Организация,
	|	абс_ВводБюджетаПоЦДСоставБюджета.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА абс_ВводБюджетаПоЦДСоставБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	абс_ВводБюджетаПоЦДСоставБюджета.Регион КАК абс_Регион
	|ИЗ
	|	ВТ_ТЧСоставБюджета КАК абс_ВводБюджетаПоЦДСоставБюджета");
	
	Запрос.УстановитьПараметр("ТЧСоставБюджета", СтруктураДляЗаполненияТЧ.СоставБюджета);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();                            
	Пока Выборка.Следующий() Цикл
		Для сч=1 по 12 Цикл
			Сумма=Выборка["Сумма"+СокрЛП(Сч)];
			СуммаБезНДС = Выборка["СуммаБезНДС"+СокрЛП(Сч)];
			Количество = Выборка["Количество"+СокрЛП(Сч)];
			Если СуммаБезНДС>0 Тогда
				Движение = Движения.ОборотыБюджетов.Добавить();
				
				ЗаполнитьЗначенияСвойств(Движение,Выборка);
				
				Движение.Период 			= ДобавитьМесяц(ДатаПланирования,Сч-1);
				Движение.СуммаУпр			= ?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
				Движение.СуммаУпрБезНДС		= СуммаБезНДС*Выборка.Коэффициент;
				
				Если Движение.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка Тогда
					Движение.Количество			= Количество*Выборка.Коэффициент;
				КонецЕсли;
				
				Движение.абс_Бюджет			= Справочники.Бюджеты.БДРпоЦД;
				Движение.Сценарий			= абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью()
	
	ЭтотОбъект.Организация = Неопределено;
	ЭтотОбъект.СоставБюджета.Очистить();
		
КонецПроцедуры



