////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

////////////////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ ДОКУМЕНТА ПО БЮДЖЕТУ

//заполняет статьи оборотов по бюджетам по ЦФО, выбранному в шапке документа
Процедура ЗаполнитьСтатьиБюджетаПоЦФО() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	//Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
	//	
	//	ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
	//	
	//	Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
	//		Для Каждого СтрБДР Из СоставБюджета Цикл
	//			
	//			СтрБДР["СуммаБезНДС" 	+ Н] = 0;
	//			СтрБДР["Сумма" 			+ Н] = 0;
	//			СтрБДР["Количество"		+ Н] = 0;
	//			
	//		КонецЦикла;		
	//	КонецЦикла;
	//		
	//Иначе
	
	//////////////////////////////////////////////////////////////////////////////////
	//ДИС Расшифровка расходов
	//Если ЦФО.Лео_ЦЗ = "ОКП" 
	Если ЦФО.Лео_ЦЗ = "ОСП (ИНД)" 
	или	 ЦФО.Лео_ЦЗ = "ЭО" 
	или	 ЦФО.Лео_ЦЗ = "ОСП (ГУ)" 

		тогда  
		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузите настройки ЦФО для заполнения в БДР !!!");
	  
	КонецЕсли;			
	
	
	
	
	
	
	
			
		СоставБюджета.Очистить();
		СоставБюджета1.Очистить();
        СоставБюджета2.Очистить();
        СоставБюджета3.Очистить();
		СоставБюджета4.Очистить();
        СоставБюджета5.Очистить();
        СоставБюджета6.Очистить();
		СоставБюджета7.Очистить();
        СоставБюджета8.Очистить();
		СоставБюджета9.Очистить();
		СоставБюджета10.Очистить();
		СоставБюджета11.Очистить();

		СоставБюджета13.Очистить();
		СоставБюджета14.Очистить();
		СоставБюджета15.Очистить();
		СоставБюджета16.Очистить();
		СоставБюджета17.Очистить();
		СоставБюджета18.Очистить();
		
		
		
		
	//КонецЕсли;	
	
	// Заполнение статей
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	абс_СтатьиБюджетаПоЦФО.АналитикаБюджета КАК АналитикаБюджета,
	|	абс_СтатьиБюджетаПоЦФО.ЦФО КАК ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.Раздел КАК Раздел,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидОплаты КАК ВидОплаты,
	|	абс_СтатьиБюджетаПоЦФО.Индекс КАК ИндексСтатьи,
	|	абс_СтатьиБюджетаПоЦФО.РодительИтог КАК РодительИтогСтатьи,
	|	абс_СтатьиБюджетаПоЦФО.Итоговая,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи КАК абс_КодБюджетнойСтатьи,
	|	абс_СтатьиБюджетаПоЦФО.НомерПредставление,
	|	абс_СтатьиБюджетаПоЦФО.Зеленая,
	|	абс_СтатьиБюджетаПоЦФО.БезЦвета,
	|	абс_СтатьиБюджетаПоЦФО.РазделРесурс
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|	И абс_СтатьиБюджетаПоЦФО.Индекс > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	абс_СтатьиБюджетаПоЦФО.Индекс";
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	Результат=Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если СокрЛП(ЦФО.Код) = "001" тогда // БДР
    		СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
		
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, Выборка, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
				
			иначеЕсли ЦФО.Лео_ЦЗ = "ФОТ" тогда // ФОТ
				
    		СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,ОтборСтрок");
		
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, Выборка, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			СтруктураАналитик.ОтборСтрок = ?(Выборка.РазделРесурс = "ОтборСтрок", Истина, Ложь);

			
			
			иначе
    		СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
		
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, Выборка, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
	   		Конецесли;		
			//СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
			
			//Если СтрокиБДР.Количество() = 0 Тогда
			
			//СоставСоставБюджета
			Если Выборка.Раздел = "СоставБюджета" тогда				
				СтрокаТЧ = СоставБюджета.Добавить();
				
				
				Если СокрЛП(ЦФО.Код) = "001" тогда // БДР
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
					
				иначеЕсли ЦФО.Лео_ЦЗ = "ФОТ" тогда // ФОТ

				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,ОтборСтрок");
				Если ЗначениеЗаполнено(СтрокаТЧ.АналитикаБюджета) тогда
				СтрокаТЧ.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(СокрЛП(СтрокаТЧ.АналитикаБюджета));	
				КонецЕсли;
				
				иначе
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
		   		Конецесли;		
				
			////БезНДС	
			//	СтрокаТЧбезНДС = СоставБюджета9.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				
			
			//БезНДС
			Если ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда // Индустриальный
				
			ИначеЕсли ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
				
			ИначеЕсли ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ
					
			ИначеЕсли ЦФО.Лео_ЦЗ = "ОКП" тогда // КП
				
			ИначеЕсли ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда // ГУ
				
			ИначеЕсли ЦФО.Лео_ЦЗ = "ЭО" тогда // ЭКС
				
            ИначеЕсли ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ" тогда // ИНТЕРНЕТ				
				
				
				
			ИначеЕсли СокрЛП(ЦФО.Код) = "001" тогда // БДР	
	
				
			иначе // остальные	
				СтрокаТЧбезНДС = СоставБюджета9.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			КонецЕсли;
			
		   КонецЕсли;
		
		   
			Если Выборка.Раздел = "_СоставБюджета" тогда // БДР old				
				СтрокаТЧ = СоставБюджета17.Добавить();
				
				
				Если СокрЛП(ЦФО.Код) = "001" тогда // БДР
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
		   		Конецесли;		
		   КонецЕсли;
		   
		   
		   
		   Если СокрЛП(ЦФО.Код) = "001" тогда // БДР
			   
				Если Выборка.Раздел = "Доходы" тогда				
					СтрокаТЧбезНДС = СоставБюджета1.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
				КонецЕсли;	
				Если Выборка.Раздел = "Производство" тогда				
					СтрокаТЧбезНДС = СоставБюджета2.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
				КонецЕсли;	
				Если Выборка.Раздел = "Коммерческие" тогда				
					СтрокаТЧбезНДС = СоставБюджета3.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
				КонецЕсли;	
				Если Выборка.Раздел = "Операционные" тогда				
					СтрокаТЧбезНДС = СоставБюджета13.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая,НомерПредставление,Зеленая,БезЦвета");
				КонецЕсли;	
				
			КонецЕсли;
		   
		   
		
		
			
			
			Если ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
				
				//Непрямым
				Если Выборка.Раздел = "СоставБюджетаНепрямым" тогда				
					СтрокаТЧбезНДС = СоставБюджета3.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
				Если Выборка.Раздел = "СоставБюджетаНепрямымБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета13.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
				
				//ТМ
				Если Выборка.Раздел = "СоставБюджетТМ" тогда				
					СтрокаТЧбезНДС = СоставБюджета15.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
				Если Выборка.Раздел = "СоставБюджетаТМБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета17.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли	
				
				
			КонецЕсли;
			
			
			Если ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
				
				
				//ТМ
				Если Выборка.Раздел = "СоставБюджетТМ" тогда				
					СтрокаТЧбезНДС = СоставБюджета15.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
				Если Выборка.Раздел = "СоставБюджетаТМБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета17.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли	
				
				
			КонецЕсли;
			
			
			Если ЦФО.Лео_ЦЗ = "ОКП" тогда // КП
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
			КонецЕсли;
			
			
			Если ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда // Индустриальный
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
			КонецЕсли;
			
			Если ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда // ГУ
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
			КонецЕсли;
			
			Если ЦФО.Лео_ЦЗ = "ЭО" тогда // ЭКС
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
			КонецЕсли;
			
			
			Если ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ" тогда // ИНТЕРНЕТ
				Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
					СтрокаТЧбезНДС = СоставБюджета9.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧбезНДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				КонецЕсли;	
			КонецЕсли;
			
			
			
			//СоставБюджетаКлиенты
			Если Выборка.Раздел = "СоставБюджетаКлиенты" тогда				
				СтрокаТЧ = СоставБюджета1.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			КонецЕсли;	
			
			
			//СоставБюджетаКлиентыБезНДС
			Если Выборка.Раздел = "СоставБюджетаКлиенты" тогда				
				СтрокаТЧ = СоставБюджета2.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			КонецЕсли;	
			
			
			////СоставБюджетаТРМ
			//Если Выборка.Раздел = "СоставБюджетаТРМ" тогда				
			//	СтрокаТЧ = СоставБюджета2.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			//	
			//	
			//КонецЕсли;	
			////СоставБюджетаНепрямым
			//Если Выборка.Раздел = "СоставБюджетаНепрямым" тогда				
			//	СтрокаТЧ = СоставБюджета3.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			//	
			//	
			//КонецЕсли;	
			
			
			//По Клиентам
			Если Выборка.Раздел = "СоставБюджетаРасшифровка" 
				
				//и  ЦФО.Лео_ЦЗ <> "ЭКСПЛУАТАЦИЯ" 
				
				тогда				
				// С НДС
				СтрокаТЧ = СоставБюджета7.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				СтрокаТЧ.абс_КодБюджетнойСтатьи = Выборка.абс_КодБюджетнойСтатьи;
				
				// БезНДС
				СтрокаТЧ = СоставБюджета10.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				СтрокаТЧ.абс_КодБюджетнойСтатьи = Выборка.абс_КодБюджетнойСтатьи;
				
				
				Если ЦФО.Лео_ЦЗ <> "ЭКСПЛУАТАЦИЯ" и ЦФО.Лео_ЦЗ <> "ИТС" тогда
				ЗаполнитьРасшифровкуВводБюджета(СтрокаТЧ,СтруктураАналитик);
				КонецЕсли;
				
				
			КонецЕсли;	
			
			
			
			//СоставБюджетаЭксплуатация
			Если Выборка.Раздел = "СоставБюджетаЭксплуатация" или Выборка.Раздел = "СоставБюджетаЭИТС" тогда				
				СтрокаТЧ = СоставБюджета6.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				СтрокаТЧ.абс_КодБюджетнойСтатьи = Выборка.абс_КодБюджетнойСтатьи;
				
				ЗаполнитьРасшифровкуВводБюджетаЭксплуатация(СтрокаТЧ,СтруктураАналитик);
			КонецЕсли;	
			
			
			//СоставБюджетаМаркетинг
			Если Выборка.Раздел = "СоставБюджетаМаркетинг" тогда				
				СтрокаТЧ = СоставБюджета6.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
				СтрокаТЧ.абс_КодБюджетнойСтатьи = Выборка.абс_КодБюджетнойСтатьи;
				
				ЗаполнитьРасшифровкуВводБюджетаЭксплуатация(СтрокаТЧ,СтруктураАналитик);
			КонецЕсли;	
			
			
			
			
			////Бюджет Без НДС
			//Если Выборка.Раздел = "СоставБюджетаБезНДС" тогда				
			//	СтрокаТЧ = СоставБюджета9.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
			//КонецЕсли;	
			
			
			
			//Иначе
			//	СтрокаТЧ = СтрокиБДР[0];			
			//КонецЕсли;			
			
			//СтрокаТЧ = СоставБюджета.Добавить();
			//ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			
		КонецЦикла;
	КонецЕсли;
	
	
	
	
	
	////////////////////////////////////////////////////////////////////////////////////
	////ДИС Расшифровка расходов
	//Если ЦФО.Лео_ЦЗ = "ОРД" тогда  //ОП Дистрибьюция ОБЩИЕ
	//   ЗаполнитьРасшифровкуОРД();
	//КонецЕсли;		
	
	
	
	
	
	
	//		Если ЦФО.Лео_ЦЗ = "ОРД" тогда //ОП Дистрибьюция ОБЩИЕ	
	//
	//
	//			контр = Справочники.Контрагенты.НайтиПоНаименованию("Неизвестный клиент (МТ_ТРМ)");
	//			Если НЕ контр.Пустая() тогда
	//				СтрокаТЧ = СоставБюджета5.Добавить();	
	//				СтрокаТЧ.Контрагент = контр;
	//				СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//				СтрокаТЧ.Регион = контр.абс_БизнесРегион;
	//			КонецЕсли;
	//			
	//			
	//			
	//			контр = Справочники.Контрагенты.НайтиПоНаименованию("Неизвестный клиент (ФАРМ_ТРМ)");
	//			Если НЕ контр.Пустая() тогда
	//				СтрокаТЧ = СоставБюджета5.Добавить();	
	//				СтрокаТЧ.Контрагент = контр;
	//				СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ТРМ");
	//				СтрокаТЧ.Регион = контр.абс_БизнесРегион;
	//			КонецЕсли;
	//			
	//
	//			контр = Справочники.Контрагенты.НайтиПоНаименованию("Неизвестный клиент (ФАРМ_ПРЕМ)");
	//			Если НЕ контр.Пустая() тогда
	//				СтрокаТЧ = СоставБюджета6.Добавить();	
	//				СтрокаТЧ.Контрагент = контр;
	//				СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ПРЕМ");
	//				СтрокаТЧ.Регион = контр.абс_БизнесРегион;
	//			КонецЕсли;
	//		КонецЕсли;	
			
			
			
	//		Если ЦФО.Лео_ЦЗ = "ОКП" тогда //ОП Ключевые покупатели	
	//
	//
	//			контр = Справочники.Контрагенты.НайтиПоНаименованию("Неизвестный клиент (МТ_ТРМ)");
	//			Если НЕ контр.Пустая() тогда
	//				СтрокаТЧ = СоставБюджета5.Добавить();	
	//				СтрокаТЧ.Контрагент = контр;
	//				СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТРМ");
	//				СтрокаТЧ.Регион = контр.абс_БизнесРегион;
	//			КонецЕсли;
	//		КонецЕсли;
			
			
			
			
	
	//ЗаполнитьБДДС();
		
КонецПроцедуры


Процедура ЗаполнитьРасшифровкуВводБюджета(СтрокаТЧ,СтруктураАналитик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_СтатьиОборотовРасшифровка.Ссылка КАК Расшифровка,
		|	Лео_СтатьиОборотовРасшифровка.Наименование,
		|	Лео_СтатьиОборотовРасшифровка.Индекс КАК Индекс,
		|	Лео_СтатьиОборотовРасшифровка.абс_КодБюджетнойСтатьи,
		|	Лео_СтатьиОборотовРасшифровка.НетИтоговой,
		|	Лео_СтатьиОборотовРасшифровка.Регион,
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов
		|ИЗ
		|	Справочник.Лео_СтатьиОборотовРасшифровка КАК Лео_СтатьиОборотовРасшифровка
		|ГДЕ
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов = &СтатьяОборотов
		|	И НЕ Лео_СтатьиОборотовРасшифровка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс";

	Запрос.УстановитьПараметр("СтатьяОборотов", СтрокаТЧ.СтатьяОборотовПоБюджетам);

	Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() тогда
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	// С НДС	
    СтрТЧ = СоставБюджета7.Добавить();		
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
	СтрТЧ.СтатьяОборотовПоБюджетам    =  ВыборкаДетальныеЗаписи.Расшифровка;
	СтрТЧ.ИндексСтатьи             	  =  СтрокаТЧ.ИндексСтатьи + 1;
	СтрТЧ.РодительИтогСтатьи          =  ?(ВыборкаДетальныеЗаписи.НетИтоговой,0,СтрокаТЧ.ИндексСтатьи);
	СтрТЧ.Итоговая                    =  Ложь;
	СтрТЧ.абс_КодБюджетнойСтатьи      =  ВыборкаДетальныеЗаписи.абс_КодБюджетнойСтатьи;
	СтрТЧ.Регион                      =  ВыборкаДетальныеЗаписи.Регион;
	СтрТЧ.СтатьяОборотовИзРасшифровки =  ВыборкаДетальныеЗаписи.СтатьяОборотов;
	
	
	//БезНДС
    СтрТЧ = СоставБюджета10.Добавить();		
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
	СтрТЧ.СтатьяОборотовПоБюджетам    =  ВыборкаДетальныеЗаписи.Расшифровка;
	СтрТЧ.ИндексСтатьи             	  =  СтрокаТЧ.ИндексСтатьи + 1;
	СтрТЧ.РодительИтогСтатьи          =  ?(ВыборкаДетальныеЗаписи.НетИтоговой,0,СтрокаТЧ.ИндексСтатьи);
	СтрТЧ.Итоговая                    =  Ложь;
	СтрТЧ.абс_КодБюджетнойСтатьи      =  ВыборкаДетальныеЗаписи.абс_КодБюджетнойСтатьи;
	СтрТЧ.Регион                      =  ВыборкаДетальныеЗаписи.Регион;
	СтрТЧ.СтатьяОборотовИзРасшифровки =  ВыборкаДетальныеЗаписи.СтатьяОборотов;
	
	
	КонецЦикла;

	
	
    КонецЕсли;
	
КонецПроцедуры	


Процедура ЗаполнитьРасшифровкуВводБюджетаЭксплуатация(СтрокаТЧ,СтруктураАналитик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_СтатьиОборотовРасшифровка.Ссылка КАК Расшифровка,
		|	Лео_СтатьиОборотовРасшифровка.Наименование,
		|	Лео_СтатьиОборотовРасшифровка.Индекс КАК Индекс,
		|	Лео_СтатьиОборотовРасшифровка.абс_КодБюджетнойСтатьи,
		|	Лео_СтатьиОборотовРасшифровка.НетИтоговой,
		|	Лео_СтатьиОборотовРасшифровка.Регион,
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов
		|ИЗ
		|	Справочник.Лео_СтатьиОборотовРасшифровка КАК Лео_СтатьиОборотовРасшифровка
		|ГДЕ
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов = &СтатьяОборотов
		|	И НЕ Лео_СтатьиОборотовРасшифровка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс";

	Запрос.УстановитьПараметр("СтатьяОборотов", СтрокаТЧ.СтатьяОборотовПоБюджетам);

	Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() тогда
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	// С НДС	
    СтрТЧ = СоставБюджета6.Добавить();		
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
	СтрТЧ.СтатьяОборотовПоБюджетам    =  ВыборкаДетальныеЗаписи.Расшифровка;
	СтрТЧ.ИндексСтатьи             	  =  СтрокаТЧ.ИндексСтатьи + 1;
	СтрТЧ.РодительИтогСтатьи          =  ?(ВыборкаДетальныеЗаписи.НетИтоговой,0,СтрокаТЧ.ИндексСтатьи);
	СтрТЧ.Итоговая                    =  Ложь;
	СтрТЧ.абс_КодБюджетнойСтатьи      =  ВыборкаДетальныеЗаписи.абс_КодБюджетнойСтатьи;
	СтрТЧ.Регион                      =  ВыборкаДетальныеЗаписи.Регион;
	СтрТЧ.СтатьяОборотовИзРасшифровки =  ВыборкаДетальныеЗаписи.СтатьяОборотов;
	
	
	////БезНДС
	//СтрТЧ = СоставБюджета10.Добавить();		
	//ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,ВидОплаты,ИндексСтатьи,РодительИтогСтатьи,Итоговая");
	//СтрТЧ.СтатьяОборотовПоБюджетам    =  ВыборкаДетальныеЗаписи.Расшифровка;
	//СтрТЧ.ИндексСтатьи             	  =  СтрокаТЧ.ИндексСтатьи + 1;
	//СтрТЧ.РодительИтогСтатьи          =  ?(ВыборкаДетальныеЗаписи.НетИтоговой,0,СтрокаТЧ.ИндексСтатьи);
	//СтрТЧ.Итоговая                    =  Ложь;
	//СтрТЧ.абс_КодБюджетнойСтатьи      =  ВыборкаДетальныеЗаписи.абс_КодБюджетнойСтатьи;
	//СтрТЧ.Регион                      =  ВыборкаДетальныеЗаписи.Регион;
	//СтрТЧ.СтатьяОборотовИзРасшифровки =  ВыборкаДетальныеЗаписи.СтатьяОборотов;
	
	
	КонецЦикла;

	
	
    КонецЕсли;
	
КонецПроцедуры	


Процедура ЗаполнитьРасшифровкуОРД()
	
	
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ДС");
	
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_УС");
	
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_БОНУС");
	
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ТРМ");
	
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ПРЕМ");
				
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ТОВ");
				
				//ФАРМ_ТОВ 
				
				СтрокаТЧ = СоставБюджета7.Добавить();
	            СтрокаТЧ.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ИСГ");
	
	
	
	
КонецПроцедуры	


//заполняет статьи выручки в зависимости от выбранной организации
//если организация - Леовит, то заполняет статьи выручки на основании заполненных бюджетов по себестоимости по всем остальным организациям
//если организация не Леовит, то заполняет суммы плана продаж по статьям выручки по всем ЦФО - центрам дохода
Процедура ЗаполнитьСтатьиВыручки() Экспорт
	
	Если Организация = Константы.абс_ОрганизацияЛеовит.Получить() Тогда		
		ЗаполнитьСтатьиВыручкиПоПлануПродаж();
		ЗаполнитьСтатьиВыручкиПоСебестоимости(Ложь);
	Иначе
		ЗаполнитьСтатьиВыручкиПоПлануПродаж();
	КонецЕсли;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

//заполняет суммы плана продаж по статьям выручки по всем ЦФО - центрам дохода. 
//У статьи оборотов по бюджетам должен быть заполнен реквизит абс_ВидЗаполнения
Процедура ЗаполнитьСтатьиВыручкиПоПлануПродаж()
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиВыручкиЦФО.ЦФО КАК ЦФО,
	|	ПланыПродажОбороты.Номенклатура КАК Номенклатура,
	|	ПланыПродажОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|		ИНАЧЕ ПланыПродажОбороты.Договор
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ПланыПродажОбороты.Период КАК Период,
	|	ПланыПродажОбороты.КоличествоОборот КАК Количество,
	|	ПланыПродажОбороты.СтоимостьОборот КАК СуммаБезНДС,
	|	ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот КАК Сумма,
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ПланыПродажОбороты.Контрагент.Регион КАК Регион
	|ИЗ
	|	СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПланыПродаж.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				Сценарий = &Сценарий
	|					И абс_Организация = &Организация
	|					И Контрагент.Регион.абс_ЦФО В
	|						(ВЫБРАТЬ
	|							СтатьиВыручкиЦФО.ЦФО
	|						ИЗ
	|							СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО)) КАК ПланыПродажОбороты
	|		ПО СтатьиВыручкиЦФО.ЦФО = ПланыПродажОбороты.Контрагент.Регион.абс_ЦФО
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаБезНДС),
	|	СУММА(Сумма),
	|	МАКСИМУМ(Регион)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	ЦФО,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Период",ДатаПланирования);
	Запрос.УстановитьПараметр("Сценарий",СценарийПродаж);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ЦФО",ЦФО);
	
	ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаЦФО=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦФО.Следующий() Цикл
			
			ВыборкаКонтрагент=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
					
					ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл
																	
						СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,Регион");
						
						ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,Регион");
						
						СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
						
						СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
						
						Если СтрокиБДР.Количество() = 0 Тогда
										
							СтрокаТЧ = СоставБюджета.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,Регион,ВидОплаты");
						Иначе
							СтрокаТЧ = СтрокиБДР[0];			
						КонецЕсли;
						
						СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = Окр(ВыборкаНоменклатура.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности / 30);
						
						//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
						
						//СтрокаТЧ.Автозаполнение = Истина;
						
						ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаПериод.Следующий() Цикл
							
							Попытка
								ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
							Исключение
								Продолжить;
							КонецПопытки;
							
							Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
							
								СтрокаТЧ["СуммаБезНДС" 		+ ИндексПериодаБДР] = СтрокаТЧ["СуммаБезНДС" 	+ ИндексПериодаБДР] + ВыборкаПериод.СуммаБезНДС;
								СтрокаТЧ["Сумма" 			+ ИндексПериодаБДР] = СтрокаТЧ["Сумма" 			+ ИндексПериодаБДР] + ВыборкаПериод.Сумма;
								СтрокаТЧ["Количество" 		+ ИндексПериодаБДР] = СтрокаТЧ["Количество"		+ ИндексПериодаБДР] + ВыборкаПериод.Количество;
								
								СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]      = Истина;
							КонецЕсли;
							
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

//заполняет статьи выручки на основании заполненных бюджетов по себестоимости по всем организациям, кроме выбранной в шапке документа
Процедура ЗаполнитьСтатьиВыручкиПоСебестоимости(Очищать = Истина)
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				Если Очищать Тогда

					СтрБДР["СуммаБезНДС" 	+ Н] = 0;
					СтрБДР["Сумма" 			+ Н] = 0;
					СтрБДР["Количество"		+ Н] = 0;
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
		Если Очищать Тогда
			СоставБюджета.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	//Заполнение
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыСвязанныеСОрганизациями.Организация,
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_КонтрагентыСвязанныеСОрганизациями
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	&ЦФО КАК ЦФО,
	|	ЕСТЬNULL(ВТ_КонтрагентыСвязанныеСОрганизациями.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
	|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК Регион,
	|	-ОборотыБюджетовОбороты.КоличествоОборот КАК Количество,
	|	-ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	-ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот КАК СуммаБезНДС,
	|	ОборотыБюджетовОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
	|				И НЕ Организация = &Организация
	|				И ЦФО = &ЦФО
	|				И Сценарий = &Сценарий) КАК ОборотыБюджетовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ПО ОборотыБюджетовОбороты.ЦФО = СтатьиВыручкиЦФО.ЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыСвязанныеСОрганизациями КАК ВТ_КонтрагентыСвязанныеСОрганизациями
	|		ПО ОборотыБюджетовОбороты.Организация = ВТ_КонтрагентыСвязанныеСОрганизациями.Организация
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	ЦФО,
	|	Регион,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("Период"		, ДатаПланирования);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
	
	ВыборкаСтатья = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАналитика.Следующий() Цикл
			
			ВыборкаЦФО = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦФО.Следующий() Цикл
				
				ВыборкаРегион = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаРегион.Следующий() Цикл
					
					ВыборкаКонтрагент = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагент.Следующий() Цикл
						
						ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
							
							ВыборкаНоменклатура = ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаНоменклатура.Следующий() Цикл
								
								СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,Регион,Номенклатура");
								
								ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,Регион,Номенклатура");
								
								СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
								
								СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
								
								Если СтрокиБДР.Количество() = 0 Тогда
												
									СтрокаТЧ = СоставБюджета.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ВидОплаты");
								Иначе
									СтрокаТЧ = СтрокиБДР[0];			
								КонецЕсли;

								СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = Окр(ВыборкаНоменклатура.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности / 30);
								
								//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
								
								ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыборкаПериод.Следующий() Цикл
									
									Попытка
										ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
									Исключение
										Продолжить;
									КонецПопытки;
								
									Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
										
										СтрокаТЧ["Сумма"			+ ИндексПериодаБДР]		= ВыборкаПериод.Сумма;
										СтрокаТЧ["Количество"		+ ИндексПериодаБДР]		= ВыборкаПериод.Количество;
										СтрокаТЧ["СуммаБезНДС"		+ ИндексПериодаБДР]		= ВыборкаПериод.СуммаБезНДС;
										
										СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]      = Истина;
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

//заполняет себестоимость по уже введенному бюджету продаж
Процедура ЗаполнитьСтатьиСебестоимости() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;	
	
	// Заполение статей себестоимости:
	// По организации Леовит заполнение производим по статьям себестоимости с указанным типом цен
	// По остальным организациям заполнение производим по нормам себестоимости
	
	Если Организация = Константы.абс_ОрганизацияЛеовит.Получить() Тогда
		
		//Запрос=Новый Запрос;
		//Запрос.Текст=
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
		//|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		//|	ВЫБОР
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		//|	КОНЕЦ КАК ТипЦенСебестоимости
		//|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		//|ИЗ
		//|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		//|ГДЕ
		//|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
		//|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		//|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		//|	ВЫБОР
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		//|	КОНЕЦ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ОборотыБюджетовОбороты.Период,
		//|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		//|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
		//|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		//|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		//|	СтатьиСебестоимостиПоЦФО.ЦФО КАК ЦФО,
		//|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		//|	ВЫБОР
		//|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		//|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		//|			ТОГДА 20
		//|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		//|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		//|			ТОГДА 18
		//|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		//|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		//|			ТОГДА 10
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК СтавкаНДС,
		//|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости.ЦенаВключаетНДС, ЛОЖЬ) КАК ЦенаВключаетНДС,
		//|	СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости КАК ТипЦен,
		//|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК абс_Регион
		//|ПОМЕСТИТЬ БюджетПродаж
		//|ИЗ
		//|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		//|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		//|				КОНЕЦПЕРИОДА(&Период, ГОД),
		//|				Месяц,
		//|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		//|					И Сценарий = &Сценарий
		//|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
		//|					И Организация = &Организация
		//|					И ЦФО = &ЦФО) КАК ОборотыБюджетовОбороты
		//|		ПО (ИСТИНА)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	БюджетПродаж.Период КАК Период,
		//|	БюджетПродаж.Контрагент КАК Контрагент,
		//|	БюджетПродаж.Номенклатура КАК Номенклатура,
		//|	БюджетПродаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
		//|	БюджетПродаж.Количество КАК Количество,
		//|	БюджетПродаж.ЦФО КАК ЦФО,
		//|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		//|	БюджетПродаж.СтавкаНДС КАК СтавкаНДС,
		//|	БюджетПродаж.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		//|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		//|ИЗ
		//|	БюджетПродаж КАК БюджетПродаж
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних
		//|		ПО БюджетПродаж.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		//|			И БюджетПродаж.ТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен
		//|ИТОГИ
		//|	СУММА(Количество),
		//|	МАКСИМУМ(СтавкаНДС),
		//|	МАКСИМУМ(ЦенаВключаетНДС),
		//|	МАКСИМУМ(Цена)
		//|ПО
		//|	СтатьяОборотовПоБюджетам,
		//|	ЦФО,
		//|	Контрагент,
		//|	ДоговорКонтрагента,
		//|	Номенклатура,
		//|	Период";
		
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ КАК ТипЦенСебестоимости
		|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		|ИЗ
		|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		|ГДЕ
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
		|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		|
		|СГРУППИРОВАТЬ ПО
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыБюджетовОбороты.Период,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		|	СтатьиСебестоимостиПоЦФО.ЦФО КАК ЦФО,
		|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости.ЦенаВключаетНДС, ЛОЖЬ) КАК ЦенаВключаетНДС,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ КАК ТипЦен,
		|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК абс_Регион
		|ПОМЕСТИТЬ БюджетПродаж
		|ИЗ
		|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		|				КОНЕЦПЕРИОДА(&Период, ГОД),
		|				Месяц,
		|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		|					И Сценарий = &Сценарий
		|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
		|					И Организация = &Организация
		|					И ЦФО = &ЦФО) КАК ОборотыБюджетовОбороты
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период,
		|	БюджетПродаж.Номенклатура,
		|	БюджетПродаж.ТипЦен
		|ПОМЕСТИТЬ ВТ_ТипЦенНоменклатураПериод
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПродаж.Период,
		|	БюджетПродаж.Номенклатура,
		|	БюджетПродаж.ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыЦен.ТипЦен,
		|	ПериодыЦен.Номенклатура,
		|	ПериодыЦен.Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатурыПоПериодам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
		|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|		МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, &ПустаяДата)) КАК ПериодЦены,
		|		ВТ_ТипЦенНоменклатураПериод.Период КАК Период
		|	ИЗ
		|		ВТ_ТипЦенНоменклатураПериод КАК ВТ_ТипЦенНоменклатураПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|			ПО ВТ_ТипЦенНоменклатураПериод.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|				И ВТ_ТипЦенНоменклатураПериод.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|				И ВТ_ТипЦенНоменклатураПериод.Период >= ЦеныНоменклатуры.Период
		|				И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЦеныНоменклатуры.ТипЦен,
		|		ЦеныНоменклатуры.Номенклатура,
		|		ВТ_ТипЦенНоменклатураПериод.Период) КАК ПериодыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ПериодыЦен.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|			И ПериодыЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ПериодыЦен.ПериодЦены = ЦеныНоменклатуры.Период
		|			И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период КАК Период,
		|	БюджетПродаж.Контрагент КАК Контрагент,
		|	БюджетПродаж.Номенклатура КАК Номенклатура,
		|	БюджетПродаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	БюджетПродаж.Количество КАК Количество,
		|	БюджетПродаж.ЦФО КАК ЦФО,
		|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	БюджетПродаж.СтавкаНДС КАК СтавкаНДС,
		|	БюджетПродаж.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатурыПоПериодам.Цена, 0) КАК Цена
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатурыПоПериодам КАК ВТ_ЦеныНоменклатурыПоПериодам
		|		ПО БюджетПродаж.Номенклатура = ВТ_ЦеныНоменклатурыПоПериодам.Номенклатура
		|			И БюджетПродаж.ТипЦен = ВТ_ЦеныНоменклатурыПоПериодам.ТипЦен
		|			И БюджетПродаж.Период = ВТ_ЦеныНоменклатурыПоПериодам.Период
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(СтавкаНДС),
		|	МАКСИМУМ(ЦенаВключаетНДС),
		|	МАКСИМУМ(Цена)
		|ПО
		|	СтатьяОборотовПоБюджетам,
		|	ЦФО,
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	Номенклатура,
		|	Период";
		
			
		Запрос.УстановитьПараметр("Период"		, ДатаПланирования);
		Запрос.УстановитьПараметр("Организация"	, Организация);
		Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
		Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
		Запрос.УстановитьПараметр("ПустаяДата"	, Дата(1, 1, 1));
		
		ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаЦФО=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦФО.Следующий() Цикл
				
				ВыборкаКонтрагент=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
						
						ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаНоменклатура.Следующий() Цикл
										
							СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
							
							СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
							
							Если СтрокиБДР.Количество() = 0 Тогда
											
								СтрокаТЧ = СоставБюджета.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,ВидОплаты");
							Иначе
								СтрокаТЧ = СтрокиБДР[0];			
							КонецЕсли;
														
							СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = 0;
							
							//СтрокаТЧ.Автозаполнение = Истина;
							//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
							
							ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаПериод.Следующий() Цикл
								
								Попытка	
									ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
								Исключение
									Продолжить;
								КонецПопытки;
								
								Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
										
									СтрокаТЧ["Количество"+ИндексПериодаБДР]=ВыборкаПериод.Количество;
									
									Если ВыборкаПериод.ЦенаВключаетНДС Тогда
										Сумма			= ВыборкаПериод.Цена*ВыборкаПериод.Количество;
										СуммаБезНДС		= Сумма/(1+ВыборкаПериод.СтавкаНДС/100);
									Иначе
										СуммаБезНДС 	= ВыборкаПериод.Цена*ВыборкаПериод.Количество;
										Сумма			= СуммаБезНДС+СуммаБезНДС*ВыборкаПериод.СтавкаНДС/100;
									КонецЕсли;
									
									СтрокаТЧ["Сумма"			+ ИндексПериодаБДР]		= Сумма;
									СтрокаТЧ["СуммаБезНДС"		+ ИндексПериодаБДР]		= СуммаБезНДС;
									
									СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]      = Истина;
									
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(абс_НормаСебестоимостиДляБюджетирования.ЦФО) КАК ЦФО,
		|	абс_НормаСебестоимостиДляБюджетирования.СтатьяОборотовПоБюджетам,
		|	абс_НормаСебестоимостиДляБюджетирования.НормаСебестоимости,
		|	абс_НормаСебестоимостиДляБюджетирования.Период
		|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		|ИЗ
		|	РегистрСведений.абс_НормаСебестоимостиДляБюджетирования КАК абс_НормаСебестоимостиДляБюджетирования
		|ГДЕ
		|	абс_НормаСебестоимостиДляБюджетирования.Организация = &Организация
		|	И абс_НормаСебестоимостиДляБюджетирования.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И КОНЕЦПЕРИОДА(&Период, ГОД)
		|
		|СГРУППИРОВАТЬ ПО
		|	абс_НормаСебестоимостиДляБюджетирования.СтатьяОборотовПоБюджетам,
		|	абс_НормаСебестоимостиДляБюджетирования.НормаСебестоимости,
		|	абс_НормаСебестоимостиДляБюджетирования.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтрагентыСвязанныеСОрганизациями.Контрагент КАК КонтрагентЛеовит
		|ПОМЕСТИТЬ ВТ_КонтрагентЛеовит
		|ИЗ
		|	Константы КАК Константы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
		|		ПО Константы.абс_ОрганизацияЛеовит = КонтрагентыСвязанныеСОрганизациями.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыБюджетовОбороты.Период,
		|	ВТ_КонтрагентЛеовит.КонтрагентЛеовит КАК Контрагент,
		|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
		|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	ОборотыБюджетовОбороты.абс_Регион,
		|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.НормаСебестоимости, 0) КАК НормаСебестоимости,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрОборот, 0) КАК СуммаУпрОборот,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот, 0) КАК СуммаУпрБезНДСОборот,
		|	ВЫБОР
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПроцентНДС
		|ПОМЕСТИТЬ БюджетПродаж
		|ИЗ
		|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		|				КОНЕЦПЕРИОДА(&Период, ГОД),
		|				Месяц,
		|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		|					И Сценарий = &Сценарий
		|					И Организация = &Организация
		|					И ЦФО = &ЦФО
		|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
		|		ПО (ИСТИНА)
		|			И (НАЧАЛОПЕРИОДА(СтатьиСебестоимостиПоЦФО.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ОборотыБюджетовОбороты.Период, МЕСЯЦ)),
		|	ВТ_КонтрагентЛеовит КАК ВТ_КонтрагентЛеовит
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период КАК Период,
		|	БюджетПродаж.Контрагент КАК Контрагент,
		|	БюджетПродаж.Номенклатура КАК Номенклатура,
		|	БюджетПродаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	БюджетПродаж.Количество КАК Количество,
		|	БюджетПродаж.ЦФО КАК ЦФО,
		|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	БюджетПродаж.абс_Регион КАК Регион,
		|	БюджетПродаж.СуммаУпрБезНДСОборот * БюджетПродаж.НормаСебестоимости КАК СуммаБезНДС,
		|	БюджетПродаж.СуммаУпрБезНДСОборот * БюджетПродаж.НормаСебестоимости * (100 + БюджетПродаж.ПроцентНДС) / 100 КАК Сумма
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Регион),
		|	СУММА(СуммаБезНДС),
		|	СУММА(Сумма)
		|ПО
		|	СтатьяОборотовПоБюджетам,
		|	ЦФО,
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	Номенклатура,
		|	Период";
		
		Запрос.УстановитьПараметр("Период"			, ДатаПланирования);
		Запрос.УстановитьПараметр("Организация"		, Организация);
		Запрос.УстановитьПараметр("ЦФО"				, ЦФО);	
		Запрос.УстановитьПараметр("Сценарий"		, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
		
		ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаЦФО=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦФО.Следующий() Цикл
				
				ВыборкаКонтрагент=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
						
						ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаНоменклатура.Следующий() Цикл
														
							СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
							
							СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
							
							Если СтрокиБДР.Количество() = 0 Тогда
											
								СтрокаТЧ = СоставБюджета.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,ВидОплаты");
							Иначе
								СтрокаТЧ = СтрокиБДР[0];			
							КонецЕсли;
							
							//СтрокаТЧ.Автозаполнение = Истина;
							//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
							
							СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = 0;
							
							ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаПериод.Следующий() Цикл
								
								Попытка
									ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
								Исключение
									Продолжить;
								КонецПопытки;
								
								Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
																		
									СтрокаТЧ["Количество"		+ ИндексПериодаБДР]	= ВыборкаПериод.Количество;
									СтрокаТЧ["Сумма"			+ ИндексПериодаБДР]	= ВыборкаПериод.Сумма;
									СтрокаТЧ["СуммаБезНДС"		+ ИндексПериодаБДР]	= ВыборкаПериод.СуммаБезНДС;	
									
									СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]  = Истина;
									
								КонецЕсли;							
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

//заполняет бюджет по премиям и услугам покупателей
Процедура ЗаполнитьСтатьиРетро() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;
	
	
	//Заполнение документа
	ТЧСоставБюджета = СоставБюджета.Выгрузить();
	
	Для НомерМесяца = 1 По 12 Цикл
		
		ТекМесяц = Дата(Год(ДатаПланирования), НомерМесяца, 1);
		
		ИндексПериодаБДР = Месяц(ТекМесяц);
							
		Если НЕ ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда			
			Продолжить;
		КонецЕсли;
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.Период КАК ТекПериодУслугиРетро,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_АналитикаСтатьиПоБюджету КАК абс_АналитикаБюджета,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Владелец КАК Контрагент,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Организация КАК Организация,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ПериодичностьНачисления,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_БазаНачисления,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ВидОплаты,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ОплатаФиксированнойСуммой,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_Процент,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_Сумма,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ЦФО,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрОборот, 0) КАК СуммаУпрОборот,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот, 0) КАК СуммаУпрБезНДСОборот
		|ИЗ
		|	РегистрСведений.абс_ДействияУслугРетроПоДоговорам.СрезПоследних(
		|			&ТекПериод,
		|			абс_ЦФО = &ЦФО
		|				И ДоговорКонтрагента.Организация = &Организация
		|				И (Лео_ДатаОкончанияПериода >= &ТекПериод
		|					ИЛИ Лео_ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК абс_ДействияУслугРетроПоДоговорамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		|				НАЧАЛОПЕРИОДА(&ТекПериод, МЕСЯЦ),
		|				КОНЕЦПЕРИОДА(&ТекПериод, МЕСЯЦ),
		|				,
		|				Организация = &Организация
		|					И ЦФО = &ЦФО
		|					И Сценарий = &Сценарий
		|					И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
		|		ПО абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Организация = ОборотыБюджетовОбороты.Организация
		|			И абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Владелец = ОборотыБюджетовОбороты.Контрагент
		|			И абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ЦФО = ОборотыБюджетовОбороты.ЦФО
		|			И (ВЫБОР
		|				КОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|					ТОГДА абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента = ОборотыБюджетовОбороты.Контрагент.ОсновнойДоговорКонтрагента
		|				ИНАЧЕ абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента = ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
		|			КОНЕЦ)");
	
		Запрос.УстановитьПараметр("Организация"	, Организация);
		Запрос.УстановитьПараметр("ТекПериод"	, ТекМесяц);
		Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
		Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекСтрокаПоАналитике = ПолучитьСтрокуПоАналитикеРетро(ТЧСоставБюджета, Выборка);
			
			РассчитатьСуммуУслугРетро(ТекСтрокаПоАналитике, НомерМесяца, Выборка);
			
			Если ЗначениеЗаполнено(ТекСтрокаПоАналитике.ДоговорКонтрагента.абс_ДопустимоеЧислоДнейЗадолженностиУслугиРетро) Тогда
				ТекСтрокаПоАналитике.МесяцевОтсрочкиОплатыДляБДДС = ОкруглитьЧислоДнейЗадолженностиУслугиРетро(ТекСтрокаПоАналитике.ДоговорКонтрагента.абс_ДопустимоеЧислоДнейЗадолженностиУслугиРетро);
			Иначе
				ТекСтрокаПоАналитике.МесяцевОтсрочкиОплатыДляБДДС = ОкруглитьЧислоДнейЗадолженностиУслугиРетро(ТекСтрокаПоАналитике.СтатьяОборотовПоБюджетам.абс_ДопустимоеЧислоДнейЗадолженности);
			КонецЕсли;
			
			ТекСтрокаПоАналитике["Автозаполнение" + НомерМесяца] = Истина;
			
		КонецЦикла;		
		
	КонецЦикла;	
	
	СоставБюджета.Загрузить(ТЧСоставБюджета);
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

Функция ПолучитьСтрокуПоАналитикеРетро(ТЧСоставБюджета, СтруктураАналитик)
	
	СтруктураПоиска = Новый Структура("ЦФО, СтатьяОборотовПоБюджетам, АналитикаБюджета, Контрагент, ДоговорКонтрагента, ВидОплаты", СтруктураАналитик.абс_ЦФО, СтруктураАналитик.СтатьяОборотов, СтруктураАналитик.абс_АналитикаБюджета, СтруктураАналитик.Контрагент, СтруктураАналитик.абс_ДоговорКонтрагента, СтруктураАналитик.абс_ВидОплаты);
	
	СтрокиПоАналитике = ТЧСоставБюджета.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиПоАналитике.Количество() > 0 Тогда
		
		Возврат СтрокиПоАналитике[0];

	КонецЕсли;
	
	НовСтрока = ТЧСоставБюджета.Добавить();
	
	ЗаполнитьЗначенияСвойств(НовСтрока, СтруктураПоиска, "ЦФО, СтатьяОборотовПоБюджетам, АналитикаБюджета, Контрагент, ДоговорКонтрагента, ВидОплаты");
	НовСтрока.Автозаполнение = Истина;
	
	Возврат НовСтрока	
	
КонецФункции

Функция ОкруглитьЧислоДнейЗадолженностиУслугиРетро(Знач ЧислоДнейЗадолженностиВДнях)
	
	ЧислоДнейЗадолженностиВМесяцах = Цел(ЧислоДнейЗадолженностиВДнях / 30);
	
	Если ЧислоДнейЗадолженностиВДнях % 30 > 1 Тогда
		
		ЧислоДнейЗадолженностиВМесяцах = ЧислоДнейЗадолженностиВМесяцах + 1;
		
	КонецЕсли;
	
	Возврат ЧислоДнейЗадолженностиВМесяцах;	
	
КонецФункции

Процедура РассчитатьСуммуУслугРетро(СтрокаБюджета, ИндексПериода,  СтруктураПараметровУслугРетро)
	
	КоэффициентПериодаНачисления = 0;
		
	Если СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Год Тогда
		КоэффициентПериодаНачисления = 12;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Полугодие Тогда
		КоэффициентПериодаНачисления = 6;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Квартал Тогда
		КоэффициентПериодаНачисления = 3;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Месяц Тогда
		КоэффициентПериодаНачисления = 1;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.РазовоеНачисление Тогда
		КоэффициентПериодаНачисления = 0;		
	КонецЕсли;
	
	Если СтруктураПараметровУслугРетро.абс_ОплатаФиксированнойСуммой Тогда
		
		Если КоэффициентПериодаНачисления = 0 И Месяц(СтруктураПараметровУслугРетро.ТекПериодУслугиРетро) = ИндексПериода Тогда
			СтрокаБюджета["Сумма" + ИндексПериода] = СтруктураПараметровУслугРетро.абс_Сумма;
		Иначе
			СтрокаБюджета["Сумма" + ИндексПериода] = СтруктураПараметровУслугРетро.абс_Сумма / КоэффициентПериодаНачисления;
		КонецЕсли;
		
		СтрокаБюджета["СуммаБезНДС" + ИндексПериода] = СтрокаБюджета["Сумма" + ИндексПериода] - УчетНДС.РассчитатьСуммуНДС(СтрокаБюджета["Сумма" + ИндексПериода], Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(СтрокаБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС));
		
	Иначе
		
		Если СтруктураПараметровУслугРетро.абс_БазаНачисления = Перечисления.абс_БазаНачисленияУслугКонтрагента.ВыручкаБезНДС Тогда
			
			СтрокаБюджета["СуммаБезНДС" + ИндексПериода] 	= СтруктураПараметровУслугРетро.СуммаУпрБезНДСОборот * СтруктураПараметровУслугРетро.абс_Процент / 100;
			СтрокаБюджета["Сумма" + ИндексПериода] 			= СтрокаБюджета["СуммаБезНДС" + ИндексПериода] + УчетНДС.РассчитатьСуммуНДС(СтрокаБюджета["СуммаБезНДС" + ИндексПериода], Истина, Ложь, УчетНДС.ПолучитьСтавкуНДС(СтрокаБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС))
			
		ИначеЕсли СтруктураПараметровУслугРетро.абс_БазаНачисления = Перечисления.абс_БазаНачисленияУслугКонтрагента.ВыручкаСНДС Тогда
			
			СтрокаБюджета["Сумма" + ИндексПериода] 			= СтруктураПараметровУслугРетро.СуммаУпрБезНДСОборот * СтруктураПараметровУслугРетро.абс_Процент / 100;
			СтрокаБюджета["СуммаБезНДС" + ИндексПериода] 	= СтрокаБюджета["Сумма" + ИндексПериода] - УчетНДС.РассчитатьСуммуНДС(СтрокаБюджета["Сумма" + ИндексПериода], Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(СтрокаБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//заполняет статьи транспортных расходов по уже введенному бюджету продаж
//на основании введенных норм расходов на транспорт 
Процедура ЗаполнитьСтатьиТранспорта() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;	
	
	//Заполнение документа
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиТранспортаПоЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Транспорт)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.Вес, 0) КАК Вес,
	|	СтатьиТранспортаПоЦФО.ЦФО КАК ЦФО,
	|	СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10 
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	ОборотыБюджетовОбороты.Контрагент.Регион КАК Регион
	|ПОМЕСТИТЬ БюджетПродаж
	|ИЗ
	|	СтатьиТранспортаПоЦФО КАК СтатьиТранспортаПоЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|					И Сценарий = &Сценарий
	|					И Организация = &Организация
	|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОборотыБюджетовОбороты.КоличествоОборот > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БюджетПродаж.Период КАК Период,
	|	БюджетПродаж.ЦФО КАК ЦФО,
	|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	БюджетПродаж.Регион КАК Регион,
	|	ЕСТЬNULL(абс_НормыРасходовНаТранспортСрезПоследних.Сумма, 0) * БюджетПродаж.Вес КАК Сумма,
	|	ЕСТЬNULL(абс_НормыРасходовНаТранспортСрезПоследних.Сумма, 0) * БюджетПродаж.Вес / (1 + БюджетПродаж.СтавкаНДС / 100) КАК СуммаБезНДС
	|ИЗ
	|	БюджетПродаж КАК БюджетПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_НормыРасходовНаТранспорт.СрезПоследних(
	|				&Период,
	|				Регион В
	|					(ВЫБРАТЬ
	|						БюджетПродаж.Регион
	|					ИЗ
	|						БюджетПродаж КАК БюджетПродаж)) КАК абс_НормыРасходовНаТранспортСрезПоследних
	|		ПО БюджетПродаж.Регион = абс_НормыРасходовНаТранспортСрезПоследних.Регион
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	ЦФО,
	|	Регион,
	|	Период";
	
	Запрос.УстановитьПараметр("Период",ДатаПланирования);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ЦФО",ЦФО);
	Сценарий = абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);
	
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	ВыборкаСтатья = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаЦФО = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦФО.Следующий() Цикл
			
			ВыборкаРегион = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРегион.Следующий() Цикл
				
				СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Регион");
				
				ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаРегион, "ЦФО,СтатьяОборотовПоБюджетам,Регион");
				
				СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
				
				СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
				
				Если СтрокиБДР.Количество() = 0 Тогда
								
					СтрокаТЧ = СоставБюджета.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Регион");
				Иначе
					СтрокаТЧ = СтрокиБДР[0];			
				КонецЕсли;				
								
				//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
				
				//СтрокаТЧ.Автозаполнение=Истина;
				
				ВыборкаПериод = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПериод.Следующий() Цикл
					
					Попытка
						ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
					Исключение
						Продолжить;
					КонецПопытки;
								
					Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
									
						СтрокаТЧ["Сумма" 		+ ИндексПериодаБДР] 	= ВыборкаПериод.Сумма;
						СтрокаТЧ["СуммаБезНДС" 	+ ИндексПериодаБДР] 	= ВыборкаПериод.СуммаБезНДС;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ ДОКУМЕНТА ПО ОПЕР. ФАКТУ

//заполняет статьи выручки в зависимости от выбранной организации
//если организация - Леовит, то заполняет статьи выручки на основании заполненных бюджетов по себестоимости по всем остальным организациям
//если организация не Леовит, то заполняет суммы плана продаж по статьям выручки по всем ЦФО - центрам дохода
Процедура ЗаполнитьСтатьиВыручкиОперФакт() Экспорт
	
	Если Организация = Константы.абс_ОрганизацияЛеовит.Получить() Тогда		
		ЗаполнитьСтатьиВыручкиПоПлануПродажОперФакт();
		ЗаполнитьСтатьиВыручкиПоСебестоимостиОперФакт(Ложь);
	Иначе
		ЗаполнитьСтатьиВыручкиПоПлануПродажОперФакт();
	КонецЕсли;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

//заполняет суммы плана продаж по статьям выручки по всем ЦФО - центрам дохода. 
//У статьи оборотов по бюджетам должен быть заполнен реквизит абс_ВидЗаполнения
Процедура ЗаполнитьСтатьиВыручкиПоПлануПродажОперФакт()
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиВыручкиЦФО.ЦФО КАК ЦФО,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА ПродажиОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|		ИНАЧЕ ПродажиОбороты.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ПродажиОбороты.Период КАК Период,
	|	ПродажиОбороты.КоличествоОборот КАК Количество,
	|	ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК СуммаБезНДС,
	|	ПродажиОбороты.СтоимостьОборот КАК Сумма,
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ПродажиОбороты.Контрагент.Регион КАК Регион
	|ИЗ
	|	СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				Организация = &Организация
	|					И Контрагент.Регион.абс_ЦФО В
	|						(ВЫБРАТЬ
	|							СтатьиВыручкиЦФО.ЦФО
	|						ИЗ
	|							СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО)) КАК ПродажиОбороты
	|		ПО СтатьиВыручкиЦФО.ЦФО = ПродажиОбороты.Контрагент.Регион.абс_ЦФО
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаБезНДС),
	|	СУММА(Сумма),
	|	МАКСИМУМ(Регион)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	ЦФО,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Период",ДатаПланирования);
	Запрос.УстановитьПараметр("Сценарий",СценарийПродаж);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ЦФО",ЦФО);
	
	ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаЦФО=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦФО.Следующий() Цикл
			
			ВыборкаКонтрагент=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
					
					ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл
																	
						СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,Регион");
						
						ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,Регион");
						
						СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
						
						СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
						
						Если СтрокиБДР.Количество() = 0 Тогда
										
							СтрокаТЧ = СоставБюджета.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,Регион,ВидОплаты");
						Иначе
							СтрокаТЧ = СтрокиБДР[0];			
						КонецЕсли;
						
						СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = Окр(ВыборкаНоменклатура.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности / 30);
						
						//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
						
						//СтрокаТЧ.Автозаполнение = Истина;
						
						ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаПериод.Следующий() Цикл
							
							Попытка
								ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
							Исключение
								Продолжить;
							КонецПопытки;
							
							Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
							
								СтрокаТЧ["СуммаБезНДС" 		+ ИндексПериодаБДР] = СтрокаТЧ["СуммаБезНДС" 	+ ИндексПериодаБДР] + ВыборкаПериод.СуммаБезНДС;
								СтрокаТЧ["Сумма" 			+ ИндексПериодаБДР] = СтрокаТЧ["Сумма" 			+ ИндексПериодаБДР] + ВыборкаПериод.Сумма;
								СтрокаТЧ["Количество" 		+ ИндексПериодаБДР] = СтрокаТЧ["Количество"		+ ИндексПериодаБДР] + ВыборкаПериод.Количество;
								
								СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]      = Истина;
							КонецЕсли;
							
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

//заполняет статьи выручки на основании заполненных бюджетов по себестоимости по всем организациям, кроме выбранной в шапке документа
Процедура ЗаполнитьСтатьиВыручкиПоСебестоимостиОперФакт(Очищать = Истина)
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				Если Очищать Тогда

					СтрБДР["СуммаБезНДС" 	+ Н] = 0;
					СтрБДР["Сумма" 			+ Н] = 0;
					СтрБДР["Количество"		+ Н] = 0;
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
		Если Очищать Тогда
			СоставБюджета.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	//Заполнение
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыСвязанныеСОрганизациями.Организация,
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_КонтрагентыСвязанныеСОрганизациями
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	&ЦФО КАК ЦФО,
	|	ЕСТЬNULL(ВТ_КонтрагентыСвязанныеСОрганизациями.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
	|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК Регион,
	|	-ОборотыБюджетовОбороты.КоличествоОборот КАК Количество,
	|	-ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	-ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот КАК СуммаБезНДС,
	|	ОборотыБюджетовОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
	|				И НЕ Организация = &Организация
	|				И ЦФО = &ЦФО
	|				И Сценарий = &Сценарий) КАК ОборотыБюджетовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ПО ОборотыБюджетовОбороты.ЦФО = СтатьиВыручкиЦФО.ЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыСвязанныеСОрганизациями КАК ВТ_КонтрагентыСвязанныеСОрганизациями
	|		ПО ОборотыБюджетовОбороты.Организация = ВТ_КонтрагентыСвязанныеСОрганизациями.Организация
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	ЦФО,
	|	Регион,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("Период"		, ДатаПланирования);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
	
	ВыборкаСтатья = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаАналитика.Следующий() Цикл
			
			ВыборкаЦФО = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦФО.Следующий() Цикл
				
				ВыборкаРегион = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаРегион.Следующий() Цикл
					
					ВыборкаКонтрагент = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагент.Следующий() Цикл
						
						ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
							
							ВыборкаНоменклатура = ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаНоменклатура.Следующий() Цикл
								
								СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,Регион,Номенклатура");
								
								ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,Регион,Номенклатура");
								
								СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
								
								СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
								
								Если СтрокиБДР.Количество() = 0 Тогда
												
									СтрокаТЧ = СоставБюджета.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,Регион,Номенклатура,ВидОплаты");
								Иначе
									СтрокаТЧ = СтрокиБДР[0];			
								КонецЕсли;

								СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = Окр(ВыборкаНоменклатура.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности / 30);
								
								//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
								
								ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыборкаПериод.Следующий() Цикл
									
									Попытка
										ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
									Исключение
										Продолжить;
									КонецПопытки;
								
									Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
										
										СтрокаТЧ["Сумма"			+ ИндексПериодаБДР]		= ВыборкаПериод.Сумма;
										СтрокаТЧ["Количество"		+ ИндексПериодаБДР]		= ВыборкаПериод.Количество;
										СтрокаТЧ["СуммаБезНДС"		+ ИндексПериодаБДР]		= ВыборкаПериод.СуммаБезНДС;
										
										СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]      = Истина;
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

//заполняет себестоимость по уже введенному бюджету продаж
Процедура ЗаполнитьСтатьиСебестоимостиОперФакт() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;	
	
	// Заполение статей себестоимости:
	// По организации Леовит заполнение производим по статьям себестоимости с указанным типом цен
	// По остальным организациям заполнение производим по нормам себестоимости
	
	Если Организация = Константы.абс_ОрганизацияЛеовит.Получить() Тогда
		
		//Запрос=Новый Запрос;
		//Запрос.Текст=
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
		//|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		//|	ВЫБОР
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		//|	КОНЕЦ КАК ТипЦенСебестоимости
		//|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		//|ИЗ
		//|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		//|ГДЕ
		//|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
		//|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		//|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		//|	ВЫБОР
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		//|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		//|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		//|	КОНЕЦ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ОборотыБюджетовОбороты.Период,
		//|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		//|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
		//|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		//|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		//|	СтатьиСебестоимостиПоЦФО.ЦФО КАК ЦФО,
		//|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		//|	ВЫБОР
		//|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		//|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		//|			ТОГДА 20
		//|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		//|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		//|			ТОГДА 18
		//|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		//|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		//|			ТОГДА 10
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК СтавкаНДС,
		//|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости.ЦенаВключаетНДС, ЛОЖЬ) КАК ЦенаВключаетНДС,
		//|	СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости КАК ТипЦен,
		//|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК абс_Регион
		//|ПОМЕСТИТЬ БюджетПродаж
		//|ИЗ
		//|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		//|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		//|				КОНЕЦПЕРИОДА(&Период, ГОД),
		//|				Месяц,
		//|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		//|					И Сценарий = &Сценарий
		//|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
		//|					И Организация = &Организация
		//|					И ЦФО = &ЦФО) КАК ОборотыБюджетовОбороты
		//|		ПО (ИСТИНА)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	БюджетПродаж.Период КАК Период,
		//|	БюджетПродаж.Контрагент КАК Контрагент,
		//|	БюджетПродаж.Номенклатура КАК Номенклатура,
		//|	БюджетПродаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
		//|	БюджетПродаж.Количество КАК Количество,
		//|	БюджетПродаж.ЦФО КАК ЦФО,
		//|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		//|	БюджетПродаж.СтавкаНДС КАК СтавкаНДС,
		//|	БюджетПродаж.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		//|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		//|ИЗ
		//|	БюджетПродаж КАК БюджетПродаж
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних
		//|		ПО БюджетПродаж.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		//|			И БюджетПродаж.ТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен
		//|ИТОГИ
		//|	СУММА(Количество),
		//|	МАКСИМУМ(СтавкаНДС),
		//|	МАКСИМУМ(ЦенаВключаетНДС),
		//|	МАКСИМУМ(Цена)
		//|ПО
		//|	СтатьяОборотовПоБюджетам,
		//|	ЦФО,
		//|	Контрагент,
		//|	ДоговорКонтрагента,
		//|	Номенклатура,
		//|	Период";
		
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ КАК ТипЦенСебестоимости
		|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		|ИЗ
		|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		|ГДЕ
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
		|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		|
		|СГРУППИРОВАТЬ ПО
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыБюджетовОбороты.Период,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		|	СтатьиСебестоимостиПоЦФО.ЦФО КАК ЦФО,
		|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10 
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5 
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости.ЦенаВключаетНДС, ЛОЖЬ) КАК ЦенаВключаетНДС,
		|	СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости КАК ТипЦен,
		|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК абс_Регион
		|ПОМЕСТИТЬ БюджетПродаж
		|ИЗ
		|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		|				КОНЕЦПЕРИОДА(&Период, ГОД),
		|				Месяц,
		|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		|					И Сценарий = &Сценарий
		|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
		|					И Организация = &Организация
		|					И ЦФО = &ЦФО) КАК ОборотыБюджетовОбороты
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период,
		|	БюджетПродаж.Номенклатура,
		|	БюджетПродаж.ТипЦен
		|ПОМЕСТИТЬ ВТ_ТипЦенНоменклатураПериод
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПродаж.Период,
		|	БюджетПродаж.Номенклатура,
		|	БюджетПродаж.ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыЦен.ТипЦен,
		|	ПериодыЦен.Номенклатура,
		|	ПериодыЦен.Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатурыПоПериодам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
		|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|		МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, &ПустаяДата)) КАК ПериодЦены,
		|		ВТ_ТипЦенНоменклатураПериод.Период КАК Период
		|	ИЗ
		|		ВТ_ТипЦенНоменклатураПериод КАК ВТ_ТипЦенНоменклатураПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|			ПО ВТ_ТипЦенНоменклатураПериод.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|				И ВТ_ТипЦенНоменклатураПериод.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|				И ВТ_ТипЦенНоменклатураПериод.Период >= ЦеныНоменклатуры.Период
		|				И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЦеныНоменклатуры.ТипЦен,
		|		ЦеныНоменклатуры.Номенклатура,
		|		ВТ_ТипЦенНоменклатураПериод.Период) КАК ПериодыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ПериодыЦен.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|			И ПериодыЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ПериодыЦен.ПериодЦены = ЦеныНоменклатуры.Период
		|			И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период КАК Период,
		|	БюджетПродаж.Контрагент КАК Контрагент,
		|	БюджетПродаж.Номенклатура КАК Номенклатура,
		|	БюджетПродаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	БюджетПродаж.Количество КАК Количество,
		|	БюджетПродаж.ЦФО КАК ЦФО,
		|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	БюджетПродаж.СтавкаНДС КАК СтавкаНДС,
		|	БюджетПродаж.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатурыПоПериодам.Цена, 0) КАК Цена
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатурыПоПериодам КАК ВТ_ЦеныНоменклатурыПоПериодам
		|		ПО БюджетПродаж.Номенклатура = ВТ_ЦеныНоменклатурыПоПериодам.Номенклатура
		|			И БюджетПродаж.ТипЦен = ВТ_ЦеныНоменклатурыПоПериодам.ТипЦен
		|			И БюджетПродаж.Период = ВТ_ЦеныНоменклатурыПоПериодам.Период
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(СтавкаНДС),
		|	МАКСИМУМ(ЦенаВключаетНДС),
		|	МАКСИМУМ(Цена)
		|ПО
		|	СтатьяОборотовПоБюджетам,
		|	ЦФО,
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	Номенклатура,
		|	Период";
		
		
		Запрос.УстановитьПараметр("Период"		, ДатаПланирования);
		Запрос.УстановитьПараметр("Организация"	, Организация);
		Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
		Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
		Запрос.УстановитьПараметр("ПустаяДата"	, Дата(1, 1, 1));		
		
		ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаЦФО=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦФО.Следующий() Цикл
				
				ВыборкаКонтрагент=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
						
						ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаНоменклатура.Следующий() Цикл
										
							СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
							
							СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
							
							Если СтрокиБДР.Количество() = 0 Тогда
											
								СтрокаТЧ = СоставБюджета.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,ВидОплаты");
							Иначе
								СтрокаТЧ = СтрокиБДР[0];			
							КонецЕсли;
														
							СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = 0;
							
							//СтрокаТЧ.Автозаполнение = Истина;
							//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
							
							ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаПериод.Следующий() Цикл
								
								Попытка	
									ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
								Исключение
									Продолжить;
								КонецПопытки;
								
								Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
										
									СтрокаТЧ["Количество"+ИндексПериодаБДР]=ВыборкаПериод.Количество;
									
									Если ВыборкаПериод.ЦенаВключаетНДС Тогда
										Сумма			= ВыборкаПериод.Цена*ВыборкаПериод.Количество;
										СуммаБезНДС		= Сумма/(1+ВыборкаПериод.СтавкаНДС/100);
									Иначе
										СуммаБезНДС 	= ВыборкаПериод.Цена*ВыборкаПериод.Количество;
										Сумма			= СуммаБезНДС+СуммаБезНДС*ВыборкаПериод.СтавкаНДС/100;
									КонецЕсли;
									
									СтрокаТЧ["Сумма"			+ ИндексПериодаБДР]		= Сумма;
									СтрокаТЧ["СуммаБезНДС"		+ ИндексПериодаБДР]		= СуммаБезНДС;
									
									СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]      = Истина;
									
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(абс_НормаСебестоимостиДляБюджетирования.ЦФО) КАК ЦФО,
		|	абс_НормаСебестоимостиДляБюджетирования.СтатьяОборотовПоБюджетам,
		|	абс_НормаСебестоимостиДляБюджетирования.НормаСебестоимости,
		|	абс_НормаСебестоимостиДляБюджетирования.Период
		|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		|ИЗ
		|	РегистрСведений.абс_НормаСебестоимостиДляБюджетирования КАК абс_НормаСебестоимостиДляБюджетирования
		|ГДЕ
		|	абс_НормаСебестоимостиДляБюджетирования.Организация = &Организация
		|	И абс_НормаСебестоимостиДляБюджетирования.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И КОНЕЦПЕРИОДА(&Период, ГОД)
		|
		|СГРУППИРОВАТЬ ПО
		|	абс_НормаСебестоимостиДляБюджетирования.СтатьяОборотовПоБюджетам,
		|	абс_НормаСебестоимостиДляБюджетирования.НормаСебестоимости,
		|	абс_НормаСебестоимостиДляБюджетирования.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтрагентыСвязанныеСОрганизациями.Контрагент КАК КонтрагентЛеовит
		|ПОМЕСТИТЬ ВТ_КонтрагентЛеовит
		|ИЗ
		|	Константы КАК Константы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
		|		ПО Константы.абс_ОрганизацияЛеовит = КонтрагентыСвязанныеСОрганизациями.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыБюджетовОбороты.Период,
		|	ВТ_КонтрагентЛеовит.КонтрагентЛеовит КАК Контрагент,
		|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
		|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10   
	    |		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5 
		|		КОГДА ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ ОборотыБюджетовОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7   
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	ОборотыБюджетовОбороты.абс_Регион,
		|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.НормаСебестоимости, 0) КАК НормаСебестоимости,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрОборот, 0) КАК СуммаУпрОборот,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот, 0) КАК СуммаУпрБезНДСОборот,
		|	ВЫБОР
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПроцентНДС
		|ПОМЕСТИТЬ БюджетПродаж
		|ИЗ
		|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		|				КОНЕЦПЕРИОДА(&Период, ГОД),
		|				Месяц,
		|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		|					И Сценарий = &Сценарий
		|					И Организация = &Организация
		|					И ЦФО = &ЦФО
		|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
		|		ПО (ИСТИНА)
		|			И (НАЧАЛОПЕРИОДА(СтатьиСебестоимостиПоЦФО.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ОборотыБюджетовОбороты.Период, МЕСЯЦ)),
		|	ВТ_КонтрагентЛеовит КАК ВТ_КонтрагентЛеовит
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период КАК Период,
		|	БюджетПродаж.Контрагент КАК Контрагент,
		|	БюджетПродаж.Номенклатура КАК Номенклатура,
		|	БюджетПродаж.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	БюджетПродаж.Количество КАК Количество,
		|	БюджетПродаж.ЦФО КАК ЦФО,
		|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	БюджетПродаж.абс_Регион КАК Регион,
		|	БюджетПродаж.СуммаУпрБезНДСОборот * БюджетПродаж.НормаСебестоимости КАК СуммаБезНДС,
		|	БюджетПродаж.СуммаУпрБезНДСОборот * БюджетПродаж.НормаСебестоимости * (100 + БюджетПродаж.ПроцентНДС) / 100 КАК Сумма
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Регион),
		|	СУММА(СуммаБезНДС),
		|	СУММА(Сумма)
		|ПО
		|	СтатьяОборотовПоБюджетам,
		|	ЦФО,
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	Номенклатура,
		|	Период";
		
		Запрос.УстановитьПараметр("Период"			, ДатаПланирования);
		Запрос.УстановитьПараметр("Организация"		, Организация);
		Запрос.УстановитьПараметр("ЦФО"				, ЦФО);	
		Запрос.УстановитьПараметр("Сценарий"		, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
		
		ВыборкаСтатья=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаЦФО=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦФО.Следующий() Цикл
				
				ВыборкаКонтрагент=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					ВыборкаДоговорКонтрагента=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
						
						ВыборкаНоменклатура=ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаНоменклатура.Следующий() Цикл
														
							СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура");
							
							СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
							
							СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
							
							Если СтрокиБДР.Количество() = 0 Тогда
											
								СтрокаТЧ = СоставБюджета.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,ДоговорКонтрагента,Номенклатура,ВидОплаты");
							Иначе
								СтрокаТЧ = СтрокиБДР[0];			
							КонецЕсли;
							
							//СтрокаТЧ.Автозаполнение = Истина;
							//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
							
							СтрокаТЧ.МесяцевОтсрочкиОплатыДляБДДС = 0;
							
							ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаПериод.Следующий() Цикл
								
								Попытка
									ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
								Исключение
									Продолжить;
								КонецПопытки;
								
								Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
																		
									СтрокаТЧ["Количество"		+ ИндексПериодаБДР]	= ВыборкаПериод.Количество;
									СтрокаТЧ["Сумма"			+ ИндексПериодаБДР]	= ВыборкаПериод.Сумма;
									СтрокаТЧ["СуммаБезНДС"		+ ИндексПериодаБДР]	= ВыборкаПериод.СуммаБезНДС;	
									
									СтрокаТЧ["Автозаполнение" 	+ ИндексПериодаБДР]  = Истина;
									
								КонецЕсли;							
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

//заполняет бюджет по премиям и услугам покупателей
Процедура ЗаполнитьСтатьиРетроОперФакт() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;
	
	
	//Заполнение документа
	ТЧСоставБюджета = СоставБюджета.Выгрузить();
	
	Для НомерМесяца = 1 По 12 Цикл
		
		ТекМесяц = Дата(Год(ДатаПланирования), НомерМесяца, 1);
		
		ИндексПериодаБДР = Месяц(ТекМесяц);
							
		Если НЕ ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда			
			Продолжить;
		КонецЕсли;
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.Период КАК ТекПериодУслугиРетро,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_АналитикаСтатьиПоБюджету КАК абс_АналитикаБюджета,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Владелец КАК Контрагент,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Организация КАК Организация,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ПериодичностьНачисления,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_БазаНачисления,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ВидОплаты,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ОплатаФиксированнойСуммой,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_Процент,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_Сумма,
		|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ЦФО,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрОборот, 0) КАК СуммаУпрОборот,
		|	ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот, 0) КАК СуммаУпрБезНДСОборот
		|ИЗ
		|	РегистрСведений.абс_ДействияУслугРетроПоДоговорам.СрезПоследних(
		|			&ТекПериод,
		|			абс_ЦФО = &ЦФО
		|				И ДоговорКонтрагента.Организация = &Организация
		|				И (Лео_ДатаОкончанияПериода >= &ТекПериод
		|					ИЛИ Лео_ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК абс_ДействияУслугРетроПоДоговорамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
		|				НАЧАЛОПЕРИОДА(&ТекПериод, МЕСЯЦ),
		|				КОНЕЦПЕРИОДА(&ТекПериод, МЕСЯЦ),
		|				,
		|				Организация = &Организация
		|					И ЦФО = &ЦФО
		|					И Сценарий = &Сценарий
		|					И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
		|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
		|		ПО абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Организация = ОборотыБюджетовОбороты.Организация
		|			И абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Владелец = ОборотыБюджетовОбороты.Контрагент
		|			И абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ЦФО = ОборотыБюджетовОбороты.ЦФО
		|			И (ВЫБОР
		|				КОГДА ОборотыБюджетовОбороты.абс_ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|					ТОГДА абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента = ОборотыБюджетовОбороты.Контрагент.ОсновнойДоговорКонтрагента
		|				ИНАЧЕ абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента = ОборотыБюджетовОбороты.абс_ДоговорКонтрагента
		|			КОНЕЦ)");
	
		Запрос.УстановитьПараметр("Организация"	, Организация);
		Запрос.УстановитьПараметр("ТекПериод"	, ТекМесяц);
		Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
		Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекСтрокаПоАналитике = ПолучитьСтрокуПоАналитикеРетро(ТЧСоставБюджета, Выборка);
			
			РассчитатьСуммуУслугРетро(ТекСтрокаПоАналитике, НомерМесяца, Выборка);
			
			Если ЗначениеЗаполнено(ТекСтрокаПоАналитике.ДоговорКонтрагента.абс_ДопустимоеЧислоДнейЗадолженностиУслугиРетро) Тогда
				ТекСтрокаПоАналитике.МесяцевОтсрочкиОплатыДляБДДС = ОкруглитьЧислоДнейЗадолженностиУслугиРетро(ТекСтрокаПоАналитике.ДоговорКонтрагента.абс_ДопустимоеЧислоДнейЗадолженностиУслугиРетро);
			Иначе
				ТекСтрокаПоАналитике.МесяцевОтсрочкиОплатыДляБДДС = ОкруглитьЧислоДнейЗадолженностиУслугиРетро(ТекСтрокаПоАналитике.СтатьяОборотовПоБюджетам.абс_ДопустимоеЧислоДнейЗадолженности);
			КонецЕсли;
			
			ТекСтрокаПоАналитике["Автозаполнение" + НомерМесяца] = Истина;
			
		КонецЦикла;		
		
	КонецЦикла;	
	
	СоставБюджета.Загрузить(ТЧСоставБюджета);
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

//заполняет статьи транспортных расходов по уже введенному бюджету продаж
//на основании введенных норм расходов на транспорт 
Процедура ЗаполнитьСтатьиТранспортаОперФакт() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДР Из СоставБюджета Цикл
				
				СтрБДР["СуммаБезНДС" 	+ Н] = 0;
				СтрБДР["Сумма" 			+ Н] = 0;
				СтрБДР["Количество"		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджета.Очистить();
		
	КонецЕсли;	
	
	//Заполнение документа
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиТранспортаПоЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Транспорт)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период,
	|	ЕСТЬNULL(ОборотыБюджетовОбороты.КоличествоОборот, 0) * ЕСТЬNULL(ОборотыБюджетовОбороты.Номенклатура.ЕдиницаХраненияОстатков.Вес, 0) КАК Вес,
	|	СтатьиТранспортаПоЦФО.ЦФО КАК ЦФО,
	|	СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10 
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	ОборотыБюджетовОбороты.Контрагент.Регион КАК Регион
	|ПОМЕСТИТЬ БюджетПродаж
	|ИЗ
	|	СтатьиТранспортаПоЦФО КАК СтатьиТранспортаПоЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|					И Сценарий = &Сценарий
	|					И Организация = &Организация
	|					И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)) КАК ОборотыБюджетовОбороты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОборотыБюджетовОбороты.КоличествоОборот > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БюджетПродаж.Период КАК Период,
	|	БюджетПродаж.ЦФО КАК ЦФО,
	|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	БюджетПродаж.Регион КАК Регион,
	|	ЕСТЬNULL(абс_НормыРасходовНаТранспортСрезПоследних.Сумма, 0) * БюджетПродаж.Вес КАК Сумма,
	|	ЕСТЬNULL(абс_НормыРасходовНаТранспортСрезПоследних.Сумма, 0) * БюджетПродаж.Вес / (1 + БюджетПродаж.СтавкаНДС / 100) КАК СуммаБезНДС
	|ИЗ
	|	БюджетПродаж КАК БюджетПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_НормыРасходовНаТранспорт.СрезПоследних(
	|				&Период,
	|				Регион В
	|					(ВЫБРАТЬ
	|						БюджетПродаж.Регион
	|					ИЗ
	|						БюджетПродаж КАК БюджетПродаж)) КАК абс_НормыРасходовНаТранспортСрезПоследних
	|		ПО БюджетПродаж.Регион = абс_НормыРасходовНаТранспортСрезПоследних.Регион
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СтатьяОборотовПоБюджетам,
	|	ЦФО,
	|	Регион,
	|	Период";
	
	Запрос.УстановитьПараметр("Период",ДатаПланирования);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ЦФО",ЦФО);
	Сценарий = абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);
	
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	ВыборкаСтатья = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаЦФО = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦФО.Следующий() Цикл
			
			ВыборкаРегион = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРегион.Следующий() Цикл
				
				СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Регион");
				
				ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаРегион, "ЦФО,СтатьяОборотовПоБюджетам,Регион");
				
				СтруктураАналитик.Вставить("ВидОплаты", СтруктураАналитик.СтатьяОборотовПоБюджетам.абс_ВидОплаты);
				
				СтрокиБДР = СоставБюджета.НайтиСтроки(СтруктураАналитик);
				
				Если СтрокиБДР.Количество() = 0 Тогда
								
					СтрокаТЧ = СоставБюджета.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,Регион");
				Иначе
					СтрокаТЧ = СтрокиБДР[0];			
				КонецЕсли;				
								
				//СтрокаТЧ.ВидОплаты = СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидОплаты;
				
				//СтрокаТЧ.Автозаполнение=Истина;
				
				ВыборкаПериод = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПериод.Следующий() Цикл
					
					Попытка
						ИндексПериодаБДР = Месяц(ВыборкаПериод.Период);
					Исключение
						Продолжить;
					КонецПопытки;
								
					Если ИндексПериодаБДР > ИндексЗакрытогоПериода Тогда
									
						СтрокаТЧ["Сумма" 		+ ИндексПериодаБДР] 	= ВыборкаПериод.Сумма;
						СтрокаТЧ["СуммаБезНДС" 	+ ИндексПериодаБДР] 	= ВыборкаПериод.СуммаБезНДС;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
	ЗаполнитьБДДС();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьТЧДокументаПоТаблице(ТабДок) Экспорт
	
	//рассчитаем количество строк
	СчСтрок = 3;
	СчКолонок = 1;
	
	ТекДанные = ТабДок.Область(СчСтрок, СчКолонок).Текст;
	     
	Пока ЗначениеЗаполнено(ТекДанные) Цикл
		
		СчСтрок = СчСтрок + 1;
		
		ТекДанные = ТабДок.Область(СчСтрок, СчКолонок).Текст;		
		
	КонецЦикла;
	
	КоличествоСтрок = СчСтрок-1;
	
	//рассчитаем количество колонок
	СчКолонок = 2;
	
	ТекДанные1 = ТабДок.Область(1, СчКолонок).Текст;
	ТекДанные2 = ТабДок.Область(2, СчКолонок).Текст;
	     
	Пока ЗначениеЗаполнено(ТекДанные1) или ЗначениеЗаполнено(ТекДанные2) Цикл
		
		СчКолонок = СчКолонок + 1;
		
		ТекДанные1 = ТабДок.Область(1, СчКолонок).Текст;
		ТекДанные2 = ТабДок.Область(2, СчКолонок).Текст;	
		
	КонецЦикла;
	
	КоличествоКолонок = СчКолонок-1;
		
	//считаем данные
	Для СчСтрок = 3 По КоличествоСтрок Цикл
		
		//ЦФО
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 1).Текст);
		Если Значение="" Тогда
			Сообщить("В строке № " + СчСтрок-2 + " не указан ЦФО");
			ЦФО = Справочники.Подразделения.ПустаяСсылка();
		Иначе
			ЦФО = Справочники.Подразделения.НайтиПоНаименованию(Значение);
			Если ЦФО.Пустая() Тогда
				Сообщить("Не найден ЦФО """ + Значение + """");
			КонецЕсли;
		КонецЕсли;
		
		//Статья оборотов
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 2).Текст);
		Если Значение="" Тогда
			Сообщить("В строке № " + СчСтрок-2 + " не указан код бюджетной статьи");
			СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка();
		Иначе
			СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи", Значение);
			Если СтатьяОборотов.Пустая() Тогда
				Сообщить("Не найдена статья оборотов по бюджетам по коду """ + Значение + """");
			КонецЕсли;
		КонецЕсли;
		
		//Аналитика бюджета
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 4).Текст);
		Если Не Значение="" Тогда
			АналитикаБюджета = Справочники.абс_АналитикиБюджета.НайтиПоНаименованию(Значение);
			Если АналитикаБюджета.Пустая() Тогда
				Сообщить("Не найдена аналитика бюджета """ + Значение + """");
			КонецЕсли;
		Иначе
			АналитикаБюджета = Справочники.абс_АналитикиБюджета.ПустаяСсылка();
		КонецЕсли;
		
		//Контрагент
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 5).Текст);
		Если Не Значение="" Тогда
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Значение);
			Если Контрагент.Пустая() Тогда
				Сообщить("Не найден контрагент """ + Значение + """");
			КонецЕсли;
		Иначе
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
		//Договор
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 6).Текст);
		Если Не Значение="" Тогда
			Договор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(Значение);
			Если Договор.Пустая() Тогда
				Сообщить("Не найден договор """ + Значение + """ контрагента """ + Контрагент + """");
			КонецЕсли;
		Иначе
			Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;

		//Регион
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 7).Текст);
		Если Не Значение="" Тогда
			Регион = Справочники.Регионы.НайтиПоНаименованию(Значение);
			Если Регион.Пустая() Тогда
				Сообщить("Не найден бизнес-регион """ + Значение + """");
			КонецЕсли;
		Иначе
			Регион = Справочники.Регионы.ПустаяСсылка();
		КонецЕсли;	
		
		//Номенклатура
		Значение = СокрЛП(ТабДок.Область(СчСтрок, 8).Текст);
		Значение = СтрЗаменить(Значение, Символы.НПП, "");
		Если Не Значение="" Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Значение);
			Если Номенклатура.Пустая() Тогда
				Сообщить("Не найдена номенклатура по артикулу """ + Значение + """");
			КонецЕсли;
		Иначе
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		НоваяСтрока = СоставБюджета.Добавить();
		НоваяСтрока.ЦФО = ЦФО;
		НоваяСтрока.СтатьяОборотовПоБюджетам = СтатьяОборотов;
		НоваяСтрока.АналитикаБюджета = АналитикаБюджета;
		НоваяСтрока.Контрагент = Контрагент;
		НоваяСтрока.ДоговорКонтрагента = Договор;
		НоваяСтрока.Регион = Регион;
		НоваяСтрока.Номенклатура = Номенклатура;
		
		//показатели количество, сумма без ндс, сумма с ндс
		Для СчКолонок = 10 По КоличествоКолонок Цикл
			
			Если СчКолонок % 3 = 1 Тогда
				
				//период
				Значение = СокрЛП(ТабДок.Область(1, СчКолонок).Текст);
				Если Значение = "" Тогда
					Сообщить("Не указан период. Колонка " + СчКолонок); 
					Продолжить;
				КонецЕсли;
				
				Попытка
					ТекПериод = Дата(Сред(Значение,7,4)+Сред(Значение,4,2)+Лев(Значение,2));
				Исключение
					Сообщить(ОписаниеОшибки() + " Колонка " + СчКолонок);
					Продолжить;
				КонецПопытки;
				
				//количество
				Значение = СокрЛП(ТабДок.Область(СчСтрок, СчКолонок).Текст);
				Значение = ?(Значение="",0,Значение);
				Попытка
					Количество = Число(Значение);
				Исключение
					Сообщить("Не удалось преобразовать значение в число. Строка " + СчСтрок + " колонка " + СчКолонок);
					Количество = 0;
				КонецПопытки;
				
				//сумма без НДС
				Значение = СокрЛП(ТабДок.Область(СчСтрок, СчКолонок+1).Текст);
				Значение = ?(Значение="",0,Значение);
				Попытка
					СуммаБезНДС = Число(Значение);
				Исключение
					Сообщить("Не удалось преобразовать значение в число. Строка " + СчСтрок + " колонка " + СчКолонок+1);
					СуммаБезНДС = 0;
				КонецПопытки;
				
				//сумма с НДС
				Значение = СокрЛП(ТабДок.Область(СчСтрок, СчКолонок+2).Текст);
				Значение = ?(Значение="",0,Значение);
				Попытка
					Сумма = Число(Значение);
				Исключение
					Сообщить("Не удалось преобразовать значение в число. Строка " + СчСтрок + " колонка " + СчКолонок+2);
					Сумма = 0;
				КонецПопытки;
				
				Если Не Количество=0 ИЛИ Не СуммаБезНДС=0 ИЛИ Не Сумма=0 Тогда
					НоваяСтрока["Количество"+Месяц(ТекПериод)] = Количество;
					НоваяСтрока["СуммаБезНДС"+Месяц(ТекПериод)] = СуммаБезНДС;
                    НоваяСтрока["Сумма"+Месяц(ТекПериод)] = Сумма;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПересчитатьИтогиТЧСоставБюджета();
	
КонецПроцедуры

//заполняет БДДС по заполненной табличной части БДР
Процедура ЗаполнитьБДДС() Экспорт
	
	// Заполняем только открытый период
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(ДатаПланирования)) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексЗакрытогоПериода = 0;
	
	Если ЗначениеЗаполнено(ЗакрытыйПериод) И ЗакрытыйПериод >= ДатаПланирования Тогда
		
		ИндексЗакрытогоПериода = Месяц(ЗакрытыйПериод);
		
		Для Н = ИндексЗакрытогоПериода + 1 по 12 Цикл
			Для Каждого СтрБДДС Из СоставБюджетаДДС Цикл
				
				СтрБДДС["СуммаБезНДС" 	+ Н] = 0;
				СтрБДДС["Сумма" 		+ Н] = 0;
				
			КонецЦикла;		
		КонецЦикла;
			
	Иначе
			
		СоставБюджетаДДС.Очистить();
		
	КонецЕсли;
		
	Для Каждого СтрБДР Из СоставБюджета Цикл
		
		// Выручка 			- заполним отсрочку платежа по условиям договора
		// Ретро 			- заполним отсрочку из условий договора
		// Себестоимость 	- отсрочку не заполняем
		// Транспорт 		- отсрочку не заполняем
		// Прочее 			- отсрочку не заполняем
		
		Если СтрБДР.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Вручную Тогда
			
			СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрБДР, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			СтрокиБДДС = СоставБюджетаДДС.НайтиСтроки(СтруктураАналитик);
			
			Если СтрокиБДДС.Количество() = 0 Тогда
							
				СтрБДДС = СоставБюджетаДДС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрБДДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			Иначе
				СтрБДДС = СтрокиБДДС[0];			
			КонецЕсли;
			
			// Цикл по периодам БДС
			Для Н = 1 по 12 Цикл
				
				ИндексПериодаБДДС = Н + СтрБДР.МесяцевОтсрочкиОплатыДляБДДС;
				
				Если ИндексПериодаБДДС > 0 И ИндексПериодаБДДС < 13 Тогда
					
					Если ИндексПериодаБДДС > ИндексЗакрытогоПериода Тогда
					
						СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" + ИндексПериодаБДДС] + СтрБДР["СуммаБезНДС" 	+ Н];
						СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 		 + ИндексПериодаБДДС] + СтрБДР["Сумма"  		+ Н];
						
						Если СтрБДДС.СтатьяОборотовПоБюджетам.абс_СтатьяЗП Тогда
							СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] * 0.87;
							СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 			+ ИндексПериодаБДДС] * 0.87;
						КонецЕсли;						
						
					КонецЕсли;
				КонецЕсли;
							
			КонецЦикла;			
			
		ИначеЕсли СтрБДР.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка Тогда
			
			СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрБДР, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			СтрокиБДДС = СоставБюджетаДДС.НайтиСтроки(СтруктураАналитик);
			
			Если СтрокиБДДС.Количество() = 0 Тогда
							
				СтрБДДС = СоставБюджетаДДС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрБДДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			Иначе
				СтрБДДС = СтрокиБДДС[0];			
			КонецЕсли;
			
			// Цикл по периодам БДС
			Для Н = 1 по 12 Цикл
				
				ИндексПериодаБДДС = Н + СтрБДР.МесяцевОтсрочкиОплатыДляБДДС;
				
				Если ИндексПериодаБДДС > 0 И ИндексПериодаБДДС < 13 Тогда
					
					Если ИндексПериодаБДДС > ИндексЗакрытогоПериода Тогда
						СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" + ИндексПериодаБДДС] + СтрБДР["СуммаБезНДС" 	+ Н];
						СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 		 + ИндексПериодаБДДС] + СтрБДР["Сумма"  		+ Н];
						
						Если СтрБДДС.СтатьяОборотовПоБюджетам.абс_СтатьяЗП Тогда
							СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] * 0.87;
							СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 			+ ИндексПериодаБДДС] * 0.87;
						КонецЕсли;
						
					КонецЕсли;
					
					
				КонецЕсли;
							
			КонецЦикла;
			
		ИначеЕсли СтрБДР.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
			
			СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрБДР, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			СтрокиБДДС = СоставБюджетаДДС.НайтиСтроки(СтруктураАналитик);
			
			Если СтрокиБДДС.Количество() = 0 Тогда
							
				СтрБДДС = СоставБюджетаДДС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрБДДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			Иначе
				СтрБДДС = СтрокиБДДС[0];			
			КонецЕсли;
			
			// Цикл по периодам БДС
			Для Н = 1 по 12 Цикл
				
				ИндексПериодаБДДС = Н + СтрБДР.МесяцевОтсрочкиОплатыДляБДДС;
				
				Если ИндексПериодаБДДС > 0 И ИндексПериодаБДДС < 13 Тогда
					
					Если ИндексПериодаБДДС > ИндексЗакрытогоПериода Тогда
						СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" + ИндексПериодаБДДС] + СтрБДР["СуммаБезНДС" 	+ Н];
						СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 		 + ИндексПериодаБДДС] + СтрБДР["Сумма"  		+ Н];
						
						Если СтрБДДС.СтатьяОборотовПоБюджетам.абс_СтатьяЗП Тогда
							СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] * 0.87;
							СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 			+ ИндексПериодаБДДС] * 0.87;
						КонецЕсли;
												
					КонецЕсли;
										
				КонецЕсли;
							
			КонецЦикла;			
			
		ИначеЕсли СтрБДР.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Ретро Тогда
			
			СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрБДР, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			СтрокиБДДС = СоставБюджетаДДС.НайтиСтроки(СтруктураАналитик);
			
			Если СтрокиБДДС.Количество() = 0 Тогда
							
				СтрБДДС = СоставБюджетаДДС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрБДДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			Иначе
				СтрБДДС = СтрокиБДДС[0];			
			КонецЕсли;			
			
			// Цикл по периодам БДС
			Для Н = 1 по 12 Цикл
				
				ТекПериод = Дата(Год(ДатаПланирования), н, 1);
				
				ЗапросУслугиРетроПоДоговору = Новый Запрос(
				"ВЫБРАТЬ
				|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ПериодичностьНачисления,
				|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ВидОплаты
				|ИЗ
				|	РегистрСведений.абс_ДействияУслугРетроПоДоговорам.СрезПоследних(
				|			&ТекПериод,
				|			ДоговорКонтрагента = &ДоговорКонтрагента
				|				И абс_СтатьяОборотовПоБюджетам = &абс_СтатьяОборотовПоБюджетам
				|				И абс_АналитикаСтатьиПоБюджету = &абс_АналитикаСтатьиПоБюджету
				|				И абс_ЦФО = &абс_ЦФО
				|				И (Лео_ДатаОкончанияПериода >= &ТекПериод
				|					ИЛИ Лео_ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК абс_ДействияУслугРетроПоДоговорамСрезПоследних");
				
				ЗапросУслугиРетроПоДоговору.УстановитьПараметр("ТекПериод"						, ТекПериод);
				ЗапросУслугиРетроПоДоговору.УстановитьПараметр("ДоговорКонтрагента"				, СтрБДР.ДоговорКонтрагента);
				ЗапросУслугиРетроПоДоговору.УстановитьПараметр("абс_СтатьяОборотовПоБюджетам"	, СтрБДР.СтатьяОборотовПоБюджетам);
				ЗапросУслугиРетроПоДоговору.УстановитьПараметр("абс_АналитикаСтатьиПоБюджету"	, СтрБДР.АналитикаБюджета);
				ЗапросУслугиРетроПоДоговору.УстановитьПараметр("абс_ЦФО"						, ЦФО);
				
				ВыборкаУслугиРетроПоДоговору = ЗапросУслугиРетроПоДоговору.Выполнить().Выбрать();
				
				Пока ВыборкаУслугиРетроПоДоговору.Следующий() Цикл
					
					//Сообщить("ТекПериод: " + ТекПериод + ", Договор: " + СтрБДР.ДоговорКонтрагента + ", Статья: " + СтрБДР.СтатьяОборотовПоБюджетам + ", Аналитика: " + СтрБДР.АналитикаБюджета + ", ЦФО: " + ЦФО + ", ВидОплаты: " + ВыборкаУслугиРетроПоДоговору.абс_ВидОплаты + ", ПереодичностьНачисления: " + ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления);
					
					Если НЕ ЗначениеЗаполнено(ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаУслугиРетроПоДоговору.абс_ВидОплаты) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаУслугиРетроПоДоговору.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Взаимозачет ИЛИ ВыборкаУслугиРетроПоДоговору.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.БесплатнаяОтгрузка Тогда
						Продолжить;
					КонецЕсли;
					
					ТекПериодБДДС = ТекПериод;
					
					Если ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Год Тогда
						ТекПериодБДДС = НачалоМесяца(КонецГода(ТекПериод));
					ИначеЕсли ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Полугодие Тогда
						ТекПериодБДДС = НачалоМесяца(ПолучитьКонецПолугодия(ТекПериод));
					ИначеЕсли ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Квартал Тогда
						ТекПериодБДДС = НачалоМесяца(КонецКвартала(ТекПериод));
					ИначеЕсли ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Месяц Тогда
						ТекПериодБДДС = НачалоМесяца(ТекПериод);
					ИначеЕсли ВыборкаУслугиРетроПоДоговору.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.РазовоеНачисление Тогда
						ТекПериодБДДС = НачалоМесяца(ТекПериод);						
					КонецЕсли;
					
					ТекПериодБДДС = ДобавитьМесяц(ТекПериодБДДС, СтрБДР.МесяцевОтсрочкиОплатыДляБДДС);
					
					Если ТекПериодБДДС > КонецГода(ДатаПланирования) ИЛИ ТекПериодБДДС < НачалоГода(ДатаПланирования) Тогда					
						Продолжить;					
					КонецЕсли;
					
					ИндексПериодаБДДС = Месяц(ТекПериодБДДС);
					
					Если ИндексПериодаБДДС > 0 И ИндексПериодаБДДС < 13 Тогда
						Если ИндексПериодаБДДС > ИндексЗакрытогоПериода Тогда
							СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" + ИндексПериодаБДДС] + СтрБДР["СуммаБезНДС" 	+ Н];
							СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 		 + ИндексПериодаБДДС] + СтрБДР["Сумма"  		+ Н];
							
							Если СтрБДДС.СтатьяОборотовПоБюджетам.абс_СтатьяЗП Тогда
								СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] * 0.87;
								СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 			+ ИндексПериодаБДДС] * 0.87;
							КонецЕсли;							
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;

			КонецЦикла;				
			
		ИначеЕсли СтрБДР.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Транспорт Тогда
			
			СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрБДР, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			
			СтрокиБДДС = СоставБюджетаДДС.НайтиСтроки(СтруктураАналитик);
			
			Если СтрокиБДДС.Количество() = 0 Тогда
							
				СтрБДДС = СоставБюджетаДДС.Добавить();
				ЗаполнитьЗначенияСвойств(СтрБДДС, СтруктураАналитик, "ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента,ВидОплаты");
			Иначе
				СтрБДДС = СтрокиБДДС[0];			
			КонецЕсли;
			
			// Цикл по периодам БДС
			Для Н = 1 по 12 Цикл
				
				ИндексПериодаБДДС = Н + СтрБДР.МесяцевОтсрочкиОплатыДляБДДС;
				
				Если ИндексПериодаБДДС > 0 И ИндексПериодаБДДС < 13 Тогда
					Если ИндексПериодаБДДС > ИндексЗакрытогоПериода Тогда
						СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" + ИндексПериодаБДДС] + СтрБДР["СуммаБезНДС" 	+ Н];
						СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 		 + ИндексПериодаБДДС] + СтрБДР["Сумма"  		+ Н];
						
						Если СтрБДДС.СтатьяОборотовПоБюджетам.абс_СтатьяЗП Тогда
							СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] = СтрБДДС["СуммаБезНДС" 	+ ИндексПериодаБДДС] * 0.87;
							СтрБДДС["Сумма" 		+ ИндексПериодаБДДС] = СтрБДДС["Сумма" 			+ ИндексПериодаБДДС] * 0.87;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
							
			КонецЦикла;			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНачалоПолугодия(Знач ТекДата)
	
	НомерМесяцаГода = Месяц(ТекДата);
	
	Возврат Дата(Год(ТекДата), ?(НомерМесяцаГода > 6, 7, 1), 1);
	
КонецФункции

Функция ПолучитьКонецПолугодия(Знач ТекДата)
	
	НомерМесяцаГода = Месяц(ТекДата);
	
	Возврат Дата(Год(ТекДата), ?(НомерМесяцаГода > 6, 12, 6), 1);
	
КонецФункции

Процедура ЗаполнитьБДДСПоПланамИЗадолженности(НачПериода, КонПериода) Экспорт
	
	// Очистим Данные БДДС
	ТекПериод = НачПериода;
	
	Пока ТекПериод < КонПериода Цикл
		
		ИндексМесяца = Месяц(ТекПериод);
		
		Для Каждого СтрокаБюджетаДДС Из СоставБюджетаДДС Цикл
			
			СтрокаБюджетаДДС["СуммаБезНДС" 	+ ИндексМесяца] = 0;
			СтрокаБюджетаДДС["Сумма" 		+ ИндексМесяца] = 0;
			
		КонецЦикла;
		
		ТекПериод = НачалоМесяца(ДобавитьМесяц(ТекПериод, 1));
		
	КонецЦикла;	
	
	// Заполним данные по планам и задолженности
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК СуммаЗадолженности,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг) КАК ДокументРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ВТ_ДанныеПоЗадолженности
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|			НАЧАЛОПЕРИОДА(&ДатаОтчета, МЕСЯЦ),
	|			Контрагент.Регион.абс_ЦФО = &ЦФО
	|				И ВидРасчетовСКонтрагентом = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовСКонтрагентами.ПоРеализации)
	|				И ДокументРасчетовСКонтрагентом ССЫЛКА Документ.РеализацияТоваровУслуг) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоЗадолженности.Контрагент КАК Контрагент,
	|	СУММА(ДанныеПоЗадолженности.СуммаЗадолженности) КАК СуммаЗадолженности,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОтчета, МЕСЯЦ), ДЕНЬ, ДанныеПоЗадолженности.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности), ДЕКАДА)) КАК ДекадаАктуальностиВзаиморасчетов,
	|	НАЧАЛОПЕРИОДА(ДанныеПоЗадолженности.ДокументРасчетовСКонтрагентом.абс_ДатаОплаты, ДЕКАДА) КАК ДекадаОплатыЗадолженности
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоКонтрагентам
	|ИЗ
	|	ВТ_ДанныеПоЗадолженности КАК ДанныеПоЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ДанныеПоЗадолженности.ДокументРасчетовСКонтрагентом.абс_ДатаОплаты, ДЕКАДА),
	|	ДанныеПоЗадолженности.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыПродажОбороты.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(ПланыПродажОбороты.СтоимостьОборот / 3 КАК ЧИСЛО(15, 2)) КАК СуммаПланаПродажБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот) / 3 КАК ЧИСЛО(15, 2))) КАК СуммаПланаПродаж,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА), ДЕКАДА, 0), ДЕНЬ, ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|					ИНАЧЕ ПланыПродажОбороты.Договор
	|				КОНЕЦ КАК Справочник.ДоговорыКонтрагентов).ДопустимоеЧислоДнейЗадолженности), ДЕКАДА) КАК ПериодОплатыПланаПродаж,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА)) КАК ПериодВыполненияПланаПродаж
	|ПОМЕСТИТЬ ВТ_ПланПродаж
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Контрагент.Регион.абс_ЦФО = &ЦФО
	|				И Сценарий = &СценарийПланаПродаж) КАК ПланыПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА), ДЕКАДА, 0), ДЕНЬ, ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|					ИНАЧЕ ПланыПродажОбороты.Договор
	|				КОНЕЦ КАК Справочник.ДоговорыКонтрагентов).ДопустимоеЧислоДнейЗадолженности), ДЕКАДА),
	|	ПланыПродажОбороты.Контрагент,
	|	ВЫРАЗИТЬ(ПланыПродажОбороты.СтоимостьОборот / 3 КАК ЧИСЛО(15, 2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланыПродажОбороты.Контрагент,
	|	ВЫРАЗИТЬ(ПланыПродажОбороты.СтоимостьОборот / 3 КАК ЧИСЛО(15, 2)),
	|	СУММА(ВЫРАЗИТЬ((ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот) / 3 КАК ЧИСЛО(15, 2))),
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА), ДЕКАДА, 1), ДЕНЬ, ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|					ИНАЧЕ ПланыПродажОбороты.Договор
	|				КОНЕЦ КАК Справочник.ДоговорыКонтрагентов).ДопустимоеЧислоДнейЗадолженности), ДЕКАДА),
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА))
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Контрагент.Регион.абс_ЦФО = &ЦФО
	|				И Сценарий = &СценарийПланаПродаж) КАК ПланыПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПродажОбороты.Контрагент,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА), ДЕКАДА, 1), ДЕНЬ, ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|					ИНАЧЕ ПланыПродажОбороты.Договор
	|				КОНЕЦ КАК Справочник.ДоговорыКонтрагентов).ДопустимоеЧислоДнейЗадолженности), ДЕКАДА),
	|	ВЫРАЗИТЬ(ПланыПродажОбороты.СтоимостьОборот / 3 КАК ЧИСЛО(15, 2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланыПродажОбороты.Контрагент,
	|	ВЫРАЗИТЬ(ПланыПродажОбороты.СтоимостьОборот / 3 КАК ЧИСЛО(15, 2)),
	|	СУММА(ВЫРАЗИТЬ((ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот) / 3 КАК ЧИСЛО(15, 2))),
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА), ДЕКАДА, 2), ДЕНЬ, ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|					ИНАЧЕ ПланыПродажОбороты.Договор
	|				КОНЕЦ КАК Справочник.ДоговорыКонтрагентов).ДопустимоеЧислоДнейЗадолженности), ДЕКАДА),
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА))
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Контрагент.Регион.абс_ЦФО = &ЦФО
	|				И Сценарий = &СценарийПланаПродаж) КАК ПланыПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПродажОбороты.Контрагент,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПланыПродажОбороты.Период, ДЕКАДА), ДЕКАДА, 2), ДЕНЬ, ВЫРАЗИТЬ(ВЫБОР
	|					КОГДА ПланыПродажОбороты.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|						ТОГДА ПланыПродажОбороты.Контрагент.ОсновнойДоговорКонтрагента
	|					ИНАЧЕ ПланыПродажОбороты.Договор
	|				КОНЕЦ КАК Справочник.ДоговорыКонтрагентов).ДопустимоеЧислоДнейЗадолженности), ДЕКАДА),
	|	ВЫРАЗИТЬ(ПланыПродажОбороты.СтоимостьОборот / 3 КАК ЧИСЛО(15, 2))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ЗадолженностьПоКонтрагентам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ВТ_ПланПродаж.Контрагент
	|		ИНАЧЕ ВТ_ЗадолженностьПоКонтрагентам.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_ЗадолженностьПоКонтрагентам.ДекадаОплатыЗадолженности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПланПродаж.ПериодОплатыПланаПродаж
	|		ИНАЧЕ ВТ_ЗадолженностьПоКонтрагентам.ДекадаОплатыЗадолженности
	|	КОНЕЦ КАК ДекадаОплаты,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ВТ_ЗадолженностьПоКонтрагентам.Контрагент ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ ВТ_ПланПродаж.Контрагент ЕСТЬ NULL 
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ_ПланПродаж.ПериодВыполненияПланаПродаж < НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕКАДА)
	|										ТОГДА ВТ_ЗадолженностьПоКонтрагентам.СуммаЗадолженности
	|									ИНАЧЕ ВТ_ПланПродаж.СуммаПланаПродаж
	|								КОНЕЦ
	|						ИНАЧЕ ВТ_ЗадолженностьПоКонтрагентам.СуммаЗадолженности
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ ВТ_ПланПродаж.Контрагент ЕСТЬ NULL 
	|						ТОГДА ВТ_ПланПродаж.СуммаПланаПродаж
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ЗадолженностьПоКонтрагентам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ПланПродаж.Контрагент ЕСТЬ NULL 
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_ПланПродаж.ПериодВыполненияПланаПродаж < НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕКАДА)
	|									ТОГДА ВЫРАЗИТЬ(ВТ_ЗадолженностьПоКонтрагентам.СуммаЗадолженности / 118 * 100 КАК ЧИСЛО(15, 2))
	|								ИНАЧЕ ВТ_ПланПродаж.СуммаПланаПродажБезНДС
	|							КОНЕЦ
	|					ИНАЧЕ ВЫРАЗИТЬ(ВТ_ЗадолженностьПоКонтрагентам.СуммаЗадолженности / 118 * 100 КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ПланПродаж.Контрагент ЕСТЬ NULL 
	|					ТОГДА ВТ_ПланПродаж.СуммаПланаПродажБезНДС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПлатежаБезНДС
	|ПОМЕСТИТЬ ВТ_ДанныеОтчета
	|ИЗ
	|	ВТ_ЗадолженностьПоКонтрагентам КАК ВТ_ЗадолженностьПоКонтрагентам
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПланПродаж КАК ВТ_ПланПродаж
	|		ПО ВТ_ЗадолженностьПоКонтрагентам.Контрагент = ВТ_ПланПродаж.Контрагент
	|			И ВТ_ЗадолженностьПоКонтрагентам.ДекадаОплатыЗадолженности = ВТ_ПланПродаж.ПериодОплатыПланаПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТ_ЗадолженностьПоКонтрагентам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ВТ_ПланПродаж.Контрагент
	|		ИНАЧЕ ВТ_ЗадолженностьПоКонтрагентам.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ЗадолженностьПоКонтрагентам.ДекадаОплатыЗадолженности ЕСТЬ NULL 
	|			ТОГДА ВТ_ПланПродаж.ПериодОплатыПланаПродаж
	|		ИНАЧЕ ВТ_ЗадолженностьПоКонтрагентам.ДекадаОплатыЗадолженности
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ЗадолженностьПоКонтрагентам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ПланПродаж.Контрагент ЕСТЬ NULL 
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_ПланПродаж.ПериодВыполненияПланаПродаж < НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕКАДА)
	|									ТОГДА ВЫРАЗИТЬ(ВТ_ЗадолженностьПоКонтрагентам.СуммаЗадолженности / 118 * 100 КАК ЧИСЛО(15, 2))
	|								ИНАЧЕ ВТ_ПланПродаж.СуммаПланаПродажБезНДС
	|							КОНЕЦ
	|					ИНАЧЕ ВЫРАЗИТЬ(ВТ_ЗадолженностьПоКонтрагентам.СуммаЗадолженности / 118 * 100 КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ПланПродаж.Контрагент ЕСТЬ NULL 
	|					ТОГДА ВТ_ПланПродаж.СуммаПланаПродажБезНДС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЗадолженности.Контрагент,
	|	СУММА(ВТ_ДанныеПоЗадолженности.СуммаЗадолженности) КАК СуммаПросроченнойЗадолженности,
	|	МАКСИМУМ(РАЗНОСТЬДАТ(ВТ_ДанныеПоЗадолженности.ДокументРасчетовСКонтрагентом.абс_ДатаОплаты, НАЧАЛОПЕРИОДА(&ДатаОтчета, МЕСЯЦ), ДЕНЬ)) КАК ПросроченоДней
	|ПОМЕСТИТЬ ВТ_СуммаПросроченнойЗадолженности
	|ИЗ
	|	ВТ_ДанныеПоЗадолженности КАК ВТ_ДанныеПоЗадолженности
	|ГДЕ
	|	ВТ_ДанныеПоЗадолженности.ДокументРасчетовСКонтрагентом.абс_ДатаОплаты < НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕКАДА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоЗадолженности.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 0) КАК Период,
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма1 КАК Сумма,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС1 КАК СуммаБезНДС
	|ПОМЕСТИТЬ ВТ_ДанныеВзаимозачета
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 1),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма2,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС2
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 2),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма3,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС3
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 3),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма4,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС4
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 4),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма5,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС5
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 5),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма6,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС6
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 6),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма7,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС7
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 7),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма8,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС8
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 8),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма9,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС9
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 9),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма10,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС10
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 10),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма11,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС11
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджетаДДС.Контрагент,
	|	ДОБАВИТЬКДАТЕ(абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ДатаПланирования, МЕСЯЦ, 11),
	|	абс_ВводБюджетаСоставБюджетаДДС.Сумма12,
	|	абс_ВводБюджетаСоставБюджетаДДС.СуммаБезНДС12
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаСоставБюджетаДДС
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджетаДДС.Ссылка.Проведен
	|	И абс_ВводБюджетаСоставБюджетаДДС.Ссылка.ВидОперации = &ВидОперации
	|	И абс_ВводБюджетаСоставБюджетаДДС.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.абс_ВидыоплатУслугКонтрагентов.Взаимозачет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОтчета.Контрагент КАК Контрагент,
	|	ВТ_ДанныеОтчета.ДекадаОплаты КАК ДекадаОплаты,
	|	СУММА(ЕСТЬNULL(ВТ_ДанныеОтчета.СуммаПлатежа, 0) - ЕСТЬNULL(ВТ_ДанныеВзаимозачета.Сумма, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ВТ_ДанныеОтчета.СуммаПлатежаБезНДС, 0) - ЕСТЬNULL(ВТ_ДанныеВзаимозачета.СуммаБезНДС, 0)) КАК СуммаБезНДС,
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	СтатьиВыручкиЦФО.ЦФО КАК ЦФО,
	|	ВТ_ДанныеОтчета.Контрагент.ОсновнойДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтчета КАК ВТ_ДанныеОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеВзаимозачета КАК ВТ_ДанныеВзаимозачета
	|			ПО ВТ_ДанныеОтчета.Контрагент = ВТ_ДанныеВзаимозачета.Контрагент
	|				И ВТ_ДанныеОтчета.ДекадаОплаты = ВТ_ДанныеВзаимозачета.Период
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВТ_ДанныеОтчета.ДекадаОплаты МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтчета, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончанияОтчета, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеОтчета.Контрагент,
	|	ВТ_ДанныеОтчета.ДекадаОплаты,
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам,
	|	СтатьиВыручкиЦФО.ЦФО,
	|	ВТ_ДанныеОтчета.Контрагент.ОсновнойДоговорКонтрагента");
	
	Запрос.УстановитьПараметр("ДатаОтчета"			, НачПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияОтчета"	, КонПериода);	
	Запрос.УстановитьПараметр("СценарийПланаПродаж"	, СценарийПродаж);
	Запрос.УстановитьПараметр("ЦФО"					, ЦФО);
	Запрос.УстановитьПараметр("ВидОперации"			, ВидОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,АналитикаБюджета,Контрагент,ДоговорКонтрагента");
		
		ЗаполнитьЗначенияСвойств(СтруктураАналитик, Выборка);
		
		СтрокиБюджетаДДС = СоставБюджетаДДС.НайтиСтроки(СтруктураАналитик);
		
		Если СтрокиБюджетаДДС.Количество() = 0 Тогда
			
			СтрокаТЧ = СоставБюджетаДДС.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураАналитик);
			
		Иначе
			
			СтрокаТЧ = СтрокиБюджетаДДС[0];
			
		КонецЕсли;
		
		СтрокаТЧ["СуммаБезНДС" 	+ Месяц(Выборка.ДекадаОплаты)] = СтрокаТЧ["СуммаБезНДС" 	+ Месяц(Выборка.ДекадаОплаты)] + Выборка.СуммаБезНДС;
		СтрокаТЧ["Сумма" 		+ Месяц(Выборка.ДекадаОплаты)] = СтрокаТЧ["Сумма" 			+ Месяц(Выборка.ДекадаОплаты)] + Выборка.Сумма;
				
	КонецЦикла;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПересчитатьИтогиТЧСоставБюджета()
	
	Для Каждого СтрСоставБюджета ИЗ СоставБюджета Цикл
		
		ПересчитатьИтогПоСтрокеТЧСоставБюджета(СтрСоставБюджета);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогКоличество 	= 0;
	ИтогСуммаБезНДС = 0;
	ИтогСумма 		= 0;
	
	Для Н = 1 По 12 Цикл
		
		ИтогКоличество 	= ИтогКоличество 	+ ТекДанные["Количество" 	+ Н];
		ИтогСуммаБезНДС = ИтогСуммаБезНДС 	+ ТекДанные["СуммаБезНДС" 	+ Н];
		ИтогСумма 		= ИтогСумма 		+ ТекДанные["Сумма" 		+ Н];
		
	КонецЦикла;
	
	ТекДанные.КоличествоИтог 	= ИтогКоличество;
	ТекДанные.СуммаБезНДСИтог 	= ИтогСуммаБезНДС;
	ТекДанные.СуммаИтог 		= ИтогСумма;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	ВидОперации=Перечисления.абс_ВидыОперацийВводБюджета.Бюджет;
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
	ДатаПланирования = НачалоГода(ТекущаяДата());
КонецПроцедуры                                                     

Процедура _ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОборотыБюджетов.Записывать = Истина;
	Движения.ОборотыБюджетов.Очистить();
	
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по БДР:
	
	//Если Состояние=Перечисления.СостоянияОбъектов.Утвержден Тогда

		Сценарий=абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
		|	абс_ВводБюджетаСоставБюджета.АналитикаБюджета КАК абс_АналитикаБюджета,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС1,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС2,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС3,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС4,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС5,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС6,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС7,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС8,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС9,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС10,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС11,
		|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС12,
		|	ВЫБОР
		|		КОГДА абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18  
		|		КОГДА абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	абс_ВводБюджетаСоставБюджета.Сумма1,
		|	абс_ВводБюджетаСоставБюджета.Сумма2,
		|	абс_ВводБюджетаСоставБюджета.Сумма3,
		|	абс_ВводБюджетаСоставБюджета.Сумма4,
		|	абс_ВводБюджетаСоставБюджета.Сумма5,
		|	абс_ВводБюджетаСоставБюджета.Сумма6,
		|	абс_ВводБюджетаСоставБюджета.Сумма7,
		|	абс_ВводБюджетаСоставБюджета.Сумма8,
		|	абс_ВводБюджетаСоставБюджета.Сумма9,
		|	абс_ВводБюджетаСоставБюджета.Сумма10,
		|	абс_ВводБюджетаСоставБюджета.Сумма11,
		|	абс_ВводБюджетаСоставБюджета.Сумма12,
		|	абс_ВводБюджетаСоставБюджета.Количество1,
		|	абс_ВводБюджетаСоставБюджета.Количество2,
		|	абс_ВводБюджетаСоставБюджета.Количество3,
		|	абс_ВводБюджетаСоставБюджета.Количество4,
		|	абс_ВводБюджетаСоставБюджета.Количество5,
		|	абс_ВводБюджетаСоставБюджета.Количество6,
		|	абс_ВводБюджетаСоставБюджета.Количество7,
		|	абс_ВводБюджетаСоставБюджета.Количество8,
		|	абс_ВводБюджетаСоставБюджета.Количество9,
		|	абс_ВводБюджетаСоставБюджета.Количество10,
		|	абс_ВводБюджетаСоставБюджета.Количество11,
		|	абс_ВводБюджетаСоставБюджета.Количество12,
		|	абс_ВводБюджетаСоставБюджета.Номенклатура,
		|	абс_ВводБюджетаСоставБюджета.Контрагент,
		|	абс_ВводБюджетаСоставБюджета.ЦФО,
		|	абс_ВводБюджетаСоставБюджета.Ссылка.Организация,
		|	абс_ВводБюджетаСоставБюджета.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
		|	абс_ВводБюджетаСоставБюджета.Регион КАК абс_Регион,
		|	ВЫБОР
		|		КОГДА абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент
		|ИЗ
		|	Документ.абс_ВводБюджета.СоставБюджета КАК абс_ВводБюджетаСоставБюджета
		|ГДЕ
		|	абс_ВводБюджетаСоставБюджета.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);		
		Выборка = Запрос.Выполнить().Выбрать();                            
		Пока Выборка.Следующий() Цикл
			Для сч=1 по 12 Цикл
				Сумма=Выборка["Сумма"+СокрЛП(Сч)];
				СуммаБезНДС=Выборка["СуммаБезНДС"+СокрЛП(Сч)];
				Количество=Выборка["Количество"+СокрЛП(Сч)];
				Если СуммаБезНДС>0 Тогда
					// регистр ОборотыБюджетов 
					Движение = Движения.ОборотыБюджетов.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Выборка);
					// Если затрата прямая - относим на ЦФО выбранное в шапке документа
					Движение.ЦФО 			= ?(Движение.СтатьяОборотов.абс_ПрямаяЗатрата, Выборка.ЦФО, Движение.СтатьяОборотов.ОсновноеЦФО);
					Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
					Движение.СуммаУпр 		= ?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
					Движение.СуммаУпрБезНДС = СуммаБезНДС*Выборка.Коэффициент;
					Движение.Количество 	= Количество*Выборка.Коэффициент;
					Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					Движение.Сценарий 		= Сценарий;
					
					
					Если Сценарий = Справочники.СценарииПланирования.ОперативныйФакт Тогда
						Если Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка ИЛИ
							 Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
							 
							// регистр ОборотыБюджетов 
							Движение = Движения.ОборотыБюджетов.Добавить();
							ЗаполнитьЗначенияСвойств(Движение, Выборка);
							// Если затрата прямая - относим на ЦФО выбранное в шапке документа
							Движение.ЦФО 			= ?(Движение.СтатьяОборотов.абс_ПрямаяЗатрата, Выборка.ЦФО, Движение.СтатьяОборотов.ОсновноеЦФО);
							Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
							Движение.СуммаУпр 		= ?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
							Движение.СуммаУпрБезНДС = СуммаБезНДС	* Выборка.Коэффициент;
							Движение.Количество 	= Количество	* Выборка.Коэффициент;
							Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
							Движение.Сценарий 		= Справочники.СценарииПланирования.Факт;
									 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				// Если это статья выручки или себестоимости, то вводим подтвержденный факт
				
			КонецЦикла;
		КонецЦикла;
	//КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по БДДС:

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС1,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС2,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС3,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС4,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС5,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС6,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС7,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС8,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС9,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС10,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС11,
	|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС12,
	|	ВЫБОР
	|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18  
	|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма1,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма2,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма3,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма4,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма5,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма6,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма7,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма8,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма9,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма10,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма11,
	|	абс_ВводБюджетаДДССоставБюджета.Сумма12,
	|	абс_ВводБюджетаДДССоставБюджета.Контрагент,
	|	абс_ВводБюджетаДДССоставБюджета.ЦФО,
	|	абс_ВводБюджетаДДССоставБюджета.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	абс_ВводБюджетаДДССоставБюджета.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	|	абс_ВводБюджетаДДССоставБюджета.АналитикаБюджета КАК абс_АналитикаБюджета
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаДДССоставБюджета
	|ГДЕ
	|	абс_ВводБюджетаДДССоставБюджета.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Сценарий 		= абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для сч = 1 по 12 Цикл
			
			Сумма		= Выборка["Сумма"		+ СокрЛП(Сч)];
			СуммаБезНДС	= Выборка["СуммаБезНДС"	+ СокрЛП(Сч)];
			
			Если СуммаБезНДС <> 0 Тогда
				
				Движение = Движения.ОборотыБюджетов.Добавить();
				
				ЗаполнитьЗначенияСвойств(Движение,Выборка);
				
				Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
				Движение.ЦФО 			= Движение.СтатьяОборотов.ОсновноеЦФО;
				Движение.СуммаУпр		= ?(Сумма=0, СуммаБезНДС + СуммаБезНДС * Выборка.СтавкаНДС / 100, Сумма) * Выборка.Коэффициент;
				Движение.СуммаУпрБезНДС	= СуммаБезНДС * Выборка.Коэффициент;
				Движение.абс_Бюджет		= Справочники.Бюджеты.БДДС;
				Движение.Сценарий		= Сценарий;
				
				
				Если ОтразитьЛимитыДДС И Выборка.СтатьяОборотов.абс_ТипСтатьи = Перечисления.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов Тогда
					
					// Контролируемые значения по бюджетам
					ДвижениеКонтролируемыеЗначения = Движения.КонтролируемыеЗначенияБюджетов.Добавить();
					
					ЗаполнитьЗначенияСвойств(ДвижениеКонтролируемыеЗначения, Выборка);
					
					ДвижениеКонтролируемыеЗначения.абс_Организация			= Выборка.Организация;
					ДвижениеКонтролируемыеЗначения.Период 					= ДобавитьМесяц(ДатаПланирования,Сч-1);
					
					ДвижениеКонтролируемыеЗначения.Активность 				= Истина;
					
					ДвижениеКонтролируемыеЗначения.КонтролирующийСценарий 	= Сценарий;
					ДвижениеКонтролируемыеЗначения.Сценарий 				= Сценарий;
					
					ДвижениеКонтролируемыеЗначения.СуммаСценарияКонтроль	= Сумма;
					ДвижениеКонтролируемыеЗначения.ИспользованиеКонтролируемогоЗначения = Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении;
					
					// Установка ограничений по бюджетам
					ДвижениеУстановкаЛимитов = Движения.УстановкаОграниченийПоБюджетам.Добавить();
					
					ЗаполнитьЗначенияСвойств(ДвижениеУстановкаЛимитов, Выборка);
					
					ДвижениеУстановкаЛимитов.абс_Организация				= Выборка.Организация;
					
					ДвижениеУстановкаЛимитов.Период 						= ДобавитьМесяц(ДатаПланирования,Сч-1);
					
					ДвижениеУстановкаЛимитов.Активность						= Истина;
					
					ДвижениеУстановкаЛимитов.КонтролирующийСценарий 		= Сценарий;					
					ДвижениеУстановкаЛимитов.Сценарий						= Сценарий;
					
					ДвижениеУстановкаЛимитов.ВидКонтролируемогоЗначения		= Перечисления.ВидыКонтролируемогоЗначенияБюджета.Ограничивающее;
					ДвижениеУстановкаЛимитов.ИспользованиеКонтролируемогоЗначения = Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении;
					
					ДвижениеУстановкаЛимитов.НачалоКонтролируемогоПериода	= ДобавитьМесяц(ДатаПланирования,Сч-1);
					
							
					
				КонецЕсли;			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	
	//Движения.ОборотыБюджетов.Записать();
	
	Движения.КонтролируемыеЗначенияБюджетов.Записать();
	
	ТабДвиженийУстановкаОграничений = Движения.УстановкаОграниченийПоБюджетам.Выгрузить();
	
	ТабДвиженийУстановкаОграничений.Свернуть("Активность,Период,Сценарий,СтатьяОборотов,ВидКонтролируемогоЗначения,ИспользованиеКонтролируемогоЗначения,ЦФО,Проект,Контрагент,Номенклатура,КонтролирующийСценарий,НачалоКонтролируемогоПериода,абс_Организация");
	
	Движения.УстановкаОграниченийПоБюджетам.Загрузить(ТабДвиженийУстановкаОграничений);
	
	Движения.УстановкаОграниченийПоБюджетам.Записать();
	
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по согласованию:
	
	//Если используется механизм согласования документов ВводБюджета, и документ еще не прошел по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета,Дата) Тогда
		Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
					МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета);
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.Активность = Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь = Ответственный;
					НоваяЗапись.Этап = МаршрутСогласования;
					НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
					
					НаборЗаписейСостояниеСогласования.Записать();
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Документ уже пошел по маршруту согласования
			Возврат;
		КонецЕсли;
		МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		НаборЗаписейСостояниеСогласования.Очистить();
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь = Ответственный;
		НоваяЗапись.Этап = МаршрутСогласования;
		НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
	
	
	
	
КонецПроцедуры	



Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Движения.ОборотыБюджетов.Записывать = Истина;
	Движения.ОборотыБюджетов.Очистить();
	
	
	Движения.Лео_ОборотыБюджетов.Записывать = Истина;
	Движения.Лео_ОборотыБюджетов.Очистить();
	
	
	//////////////////////////////////////////////////////////////////////////////////
	// Движения по БДР:
	
	
	///////////////////////////////////////////////////////////
	/// РН ОборотыБюджетов
	
	
	
	//Если Состояние=Перечисления.СостоянияОбъектов.Утвержден Тогда

		Сценарий=абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	Лео_ВводБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
		|	Лео_ВводБюджета.АналитикаБюджета КАК абс_АналитикаБюджета,
		|	Лео_ВводБюджета.СуммаБюджет1,
		|	Лео_ВводБюджета.СуммаБюджет2,
		|	Лео_ВводБюджета.СуммаБюджет3,
		|	Лео_ВводБюджета.СуммаБюджет4,
		|	Лео_ВводБюджета.СуммаБюджет5,
		|	Лео_ВводБюджета.СуммаБюджет6,
		|	Лео_ВводБюджета.СуммаБюджет7,
		|	Лео_ВводБюджета.СуммаБюджет8,
		|	Лео_ВводБюджета.СуммаБюджет9,
		|	Лео_ВводБюджета.СуммаБюджет10,
		|	Лео_ВводБюджета.СуммаБюджет11,
		|	Лео_ВводБюджета.СуммаБюджет12,
		|	ВЫБОР
		|		КОГДА Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18 
		|		КОГДА Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	Лео_ВводБюджета.Сумма1,
		|	Лео_ВводБюджета.Сумма2,
		|	Лео_ВводБюджета.Сумма3,
		|	Лео_ВводБюджета.Сумма4,
		|	Лео_ВводБюджета.Сумма5,
		|	Лео_ВводБюджета.Сумма6,
		|	Лео_ВводБюджета.Сумма7,
		|	Лео_ВводБюджета.Сумма8,
		|	Лео_ВводБюджета.Сумма9,
		|	Лео_ВводБюджета.Сумма10,
		|	Лео_ВводБюджета.Сумма11,
		|	Лео_ВводБюджета.Сумма12,
		|	Лео_ВводБюджета.СуммаПрФакт1,
		|	Лео_ВводБюджета.СуммаПрФакт2,
		|	Лео_ВводБюджета.СуммаПрФакт3,
		|	Лео_ВводБюджета.СуммаПрФакт4,
		|	Лео_ВводБюджета.СуммаПрФакт5,
		|	Лео_ВводБюджета.СуммаПрФакт6,
		|	Лео_ВводБюджета.СуммаПрФакт7,
		|	Лео_ВводБюджета.СуммаПрФакт8,
		|	Лео_ВводБюджета.СуммаПрФакт9,
		|	Лео_ВводБюджета.СуммаПрФакт10,
		|	Лео_ВводБюджета.СуммаПрФакт11,
		|	Лео_ВводБюджета.СуммаПрФакт12,
		|	Лео_ВводБюджета.СуммаФакт1,
		|	Лео_ВводБюджета.СуммаФакт2,
		|	Лео_ВводБюджета.СуммаФакт3,
		|	Лео_ВводБюджета.СуммаФакт4,
		|	Лео_ВводБюджета.СуммаФакт5,
		|	Лео_ВводБюджета.СуммаФакт6,
		|	Лео_ВводБюджета.СуммаФакт7,
		|	Лео_ВводБюджета.СуммаФакт8,
		|	Лео_ВводБюджета.СуммаФакт9,
		|	Лео_ВводБюджета.СуммаФакт10,
		|	Лео_ВводБюджета.СуммаФакт11,
		|	Лео_ВводБюджета.СуммаФакт12,
		|	Лео_ВводБюджета.Номенклатура,
		|	Лео_ВводБюджета.Контрагент,
		|	Лео_ВводБюджета.ЦФО,
		|	Лео_ВводБюджета.Ссылка.Организация,
		|	Лео_ВводБюджета.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
		|	Лео_ВводБюджета.Регион КАК абс_Регион,
		|	ВЫБОР
		|		КОГДА Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета КАК Лео_ВводБюджета
		|ГДЕ
		|	Лео_ВводБюджета.Ссылка = &Ссылка
		|	И Лео_ВводБюджета.СтатьяОборотовПоБюджетам.абс_РазделФормыБРД <> Значение(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);		
		Выборка = Запрос.Выполнить().Выбрать();                            
		Пока Выборка.Следующий() Цикл
			Для сч = 1 по 12 Цикл
				СуммаБюджет = Выборка["СуммаБюджет" + СокрЛП(Сч)];
				Сумма       = Выборка["Сумма" + СокрЛП(Сч)]; // План
				СуммаПрФакт = Выборка["СуммаПрФакт" + СокрЛП(Сч)];
                СуммаФакт   = Выборка["СуммаФакт" + СокрЛП(Сч)];
				
				мСуммСценариев = Новый Массив;
				мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.Бюджет,СуммаБюджет));
				мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.План,Сумма));
				мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.ОперативныйФакт,СуммаПрФакт));
				мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.БухгалтерскийФакт,СуммаФакт));
				
				Для каждого сц из мСуммСценариев цикл
				
				
				//Количество=Выборка["Количество"+СокрЛП(Сч)];
				Если сц.Сумма > 0 Тогда
					// регистр ОборотыБюджетов 
					Движение = Движения.ОборотыБюджетов.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Выборка);
					
					
					Движение.ЦФО 			= Выборка.ЦФО;
					Движение.Период 		= Дата(Год(ДатаПланирования),сч,1);
					Движение.СуммаУпр 		= сц.Сумма;
					Движение.СуммаУпрБезНДС = 0;
					Движение.Количество 	= 0;
					Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					Движение.Сценарий 		= сц.Сценарий;
					
					
					
					//Если Сценарий = Справочники.СценарииПланирования.ОперативныйФакт Тогда
					//	Если Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка ИЛИ
					//		 Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
					//		 
					//		// регистр ОборотыБюджетов 
					//		Движение = Движения.ОборотыБюджетов.Добавить();
					//		ЗаполнитьЗначенияСвойств(Движение, Выборка);
					//		// Если затрата прямая - относим на ЦФО выбранное в шапке документа
					//		Движение.ЦФО 			= ?(Движение.СтатьяОборотов.абс_ПрямаяЗатрата, Выборка.ЦФО, Движение.СтатьяОборотов.ОсновноеЦФО);
					//		Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
					//		Движение.СуммаУпр 		= ?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
					//		Движение.СуммаУпрБезНДС = СуммаБезНДС	* Выборка.Коэффициент;
					//		Движение.Количество 	= Количество	* Выборка.Коэффициент;
					//		Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					//		Движение.Сценарий 		= Справочники.СценарииПланирования.Факт;
					//				 
					//	КонецЕсли;
					//КонецЕсли;
				КонецЕсли;
				
				// Если это статья выручки или себестоимости, то вводим подтвержденный факт
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	//КонецЕсли;
	
	
	
	///////////////////////////////////////////////////////////
	/// РН Лео_ОборотыБюджетов
	
	
	
	
	Если ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или ЦФО.Лео_ЦЗ = "ИТС" тогда
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	|	Лео_ВводБюджетаСоставБюджета7.АналитикаБюджета КАК абс_АналитикаБюджета,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет1) КАК СуммаБюджет1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет2) КАК СуммаБюджет2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет3) КАК СуммаБюджет3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет4) КАК СуммаБюджет4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет5) КАК СуммаБюджет5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет6) КАК СуммаБюджет6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет7) КАК СуммаБюджет7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет8) КАК СуммаБюджет8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет9) КАК СуммаБюджет9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет10) КАК СуммаБюджет10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет11) КАК СуммаБюджет11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет12) КАК СуммаБюджет12,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18  
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма1) КАК Сумма1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма2) КАК Сумма2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма3) КАК Сумма3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма4) КАК Сумма4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма5) КАК Сумма5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма6) КАК Сумма6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма7) КАК Сумма7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма8) КАК Сумма8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма9) КАК Сумма9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма10) КАК Сумма10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма11) КАК Сумма11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма12) КАК Сумма12,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт1) КАК СуммаПрФакт1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт2) КАК СуммаПрФакт2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт3) КАК СуммаПрФакт3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт4) КАК СуммаПрФакт4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт5) КАК СуммаПрФакт5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт6) КАК СуммаПрФакт6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт7) КАК СуммаПрФакт7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт8) КАК СуммаПрФакт8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт9) КАК СуммаПрФакт9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт10) КАК СуммаПрФакт10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт11) КАК СуммаПрФакт11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт12) КАК СуммаПрФакт12,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт1) КАК СуммаФакт1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт2) КАК СуммаФакт2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт3) КАК СуммаФакт3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт4) КАК СуммаФакт4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт5) КАК СуммаФакт5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт6) КАК СуммаФакт6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт7) КАК СуммаФакт7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт8) КАК СуммаФакт8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт9) КАК СуммаФакт9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт10) КАК СуммаФакт10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт11) КАК СуммаФакт11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт12) КАК СуммаФакт12,
	|	Лео_ВводБюджетаСоставБюджета7.Номенклатура,
	|	Лео_ВводБюджетаСоставБюджета7.Контрагент,
	|	Лео_ВводБюджетаСоставБюджета7.ЦФО,
	|	Лео_ВводБюджетаСоставБюджета7.Ссылка.Организация,
	|	Лео_ВводБюджетаСоставБюджета7.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	|	Лео_ВводБюджетаСоставБюджета7.Регион КАК абс_Регион,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент
	|ИЗ
	|	Документ.Лео_ВводБюджета.СоставБюджета7 КАК Лео_ВводБюджетаСоставБюджета7
	|ГДЕ
	|	Лео_ВводБюджетаСоставБюджета7.Ссылка = &Ссылка
//	|	И Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам ССЫЛКА Справочник.Лео_СтатьиОборотовРасшифровка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам,
	|	Лео_ВводБюджетаСоставБюджета7.АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18   
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5    
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Лео_ВводБюджетаСоставБюджета7.Номенклатура,
	|	Лео_ВводБюджетаСоставБюджета7.Контрагент,
	|	Лео_ВводБюджетаСоставБюджета7.ЦФО,
	|	Лео_ВводБюджетаСоставБюджета7.Ссылка.Организация,
	|	Лео_ВводБюджетаСоставБюджета7.ДоговорКонтрагента,
	|	Лео_ВводБюджетаСоставБюджета7.Регион,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);		
	Выборка = Запрос.Выполнить().Выбрать();                            
	Пока Выборка.Следующий() Цикл
		Для сч = 1 по 12 Цикл
			СуммаБюджет = Выборка["СуммаБюджет" + СокрЛП(Сч)];
			Сумма       = Выборка["Сумма" + СокрЛП(Сч)]; // План
			СуммаПрФакт = Выборка["СуммаПрФакт" + СокрЛП(Сч)];
			СуммаФакт   = Выборка["СуммаФакт" + СокрЛП(Сч)];
			
			мСуммСценариев = Новый Массив;
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.Бюджет,СуммаБюджет));
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.План,Сумма));
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.ОперативныйФакт,СуммаПрФакт));
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.БухгалтерскийФакт,СуммаФакт));
			
			Для каждого сц из мСуммСценариев цикл
				
				
				//Количество=Выборка["Количество"+СокрЛП(Сч)];
				Если сц.Сумма > 0 Тогда
					// регистр Лео_ОборотыБюджетов 
					Движение = Движения.Лео_ОборотыБюджетов.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Выборка);
					
					
					Движение.ЦФО 			= Ссылка.ЦФО;
					Движение.Период 		= Дата(Год(ДатаПланирования),сч,1);
					Движение.СуммаУпр 		= сц.Сумма;
					Движение.СуммаУпрБезНДС = 0;
					Движение.Количество 	= 0;
					Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					Движение.Сценарий 		= сц.Сценарий;
					Движение.СтатьяОборотов = Выборка.СтатьяОборотов;
					//Движение.Расшифровка 	= Выборка.СтатьяОборотов;
					Движение.Расшифровка 	= Справочники.Лео_СтатьиОборотовРасшифровка.ПустаяСсылка();
					
					//Если Сценарий = Справочники.СценарииПланирования.ОперативныйФакт Тогда
					//	Если Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка ИЛИ
					//		 Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
					//		 
					//		// регистр ОборотыБюджетов 
					//		Движение = Движения.ОборотыБюджетов.Добавить();
					//		ЗаполнитьЗначенияСвойств(Движение, Выборка);
					//		// Если затрата прямая - относим на ЦФО выбранное в шапке документа
					//		Движение.ЦФО 			= ?(Движение.СтатьяОборотов.абс_ПрямаяЗатрата, Выборка.ЦФО, Движение.СтатьяОборотов.ОсновноеЦФО);
					//		Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
					//		Движение.СуммаУпр 		= ?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
					//		Движение.СуммаУпрБезНДС = СуммаБезНДС	* Выборка.Коэффициент;
					//		Движение.Количество 	= Количество	* Выборка.Коэффициент;
					//		Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					//		Движение.Сценарий 		= Справочники.СценарииПланирования.Факт;
					//				 
					//	КонецЕсли;
					//КонецЕсли;
				КонецЕсли;
				
				// Если это статья выручки или себестоимости, то вводим подтвержденный факт
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
	
		
	///////////////////////////////////////////////////////////////////////////////	
	иначе // Остальные

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	|	Лео_ВводБюджетаСоставБюджета7.АналитикаБюджета КАК абс_АналитикаБюджета,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет1) КАК СуммаБюджет1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет2) КАК СуммаБюджет2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет3) КАК СуммаБюджет3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет4) КАК СуммаБюджет4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет5) КАК СуммаБюджет5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет6) КАК СуммаБюджет6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет7) КАК СуммаБюджет7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет8) КАК СуммаБюджет8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет9) КАК СуммаБюджет9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет10) КАК СуммаБюджет10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет11) КАК СуммаБюджет11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаБюджет12) КАК СуммаБюджет12,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18 
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма1) КАК Сумма1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма2) КАК Сумма2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма3) КАК Сумма3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма4) КАК Сумма4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма5) КАК Сумма5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма6) КАК Сумма6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма7) КАК Сумма7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма8) КАК Сумма8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма9) КАК Сумма9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма10) КАК Сумма10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма11) КАК Сумма11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.Сумма12) КАК Сумма12,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт1) КАК СуммаПрФакт1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт2) КАК СуммаПрФакт2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт3) КАК СуммаПрФакт3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт4) КАК СуммаПрФакт4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт5) КАК СуммаПрФакт5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт6) КАК СуммаПрФакт6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт7) КАК СуммаПрФакт7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт8) КАК СуммаПрФакт8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт9) КАК СуммаПрФакт9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт10) КАК СуммаПрФакт10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт11) КАК СуммаПрФакт11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаПрФакт12) КАК СуммаПрФакт12,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт1) КАК СуммаФакт1,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт2) КАК СуммаФакт2,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт3) КАК СуммаФакт3,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт4) КАК СуммаФакт4,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт5) КАК СуммаФакт5,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт6) КАК СуммаФакт6,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт7) КАК СуммаФакт7,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт8) КАК СуммаФакт8,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт9) КАК СуммаФакт9,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт10) КАК СуммаФакт10,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт11) КАК СуммаФакт11,
	|	СУММА(Лео_ВводБюджетаСоставБюджета7.СуммаФакт12) КАК СуммаФакт12,
	|	Лео_ВводБюджетаСоставБюджета7.Номенклатура,
	|	Лео_ВводБюджетаСоставБюджета7.Контрагент,
	|	Лео_ВводБюджетаСоставБюджета7.ЦФО,
	|	Лео_ВводБюджетаСоставБюджета7.Ссылка.Организация,
	|	Лео_ВводБюджетаСоставБюджета7.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	|	Лео_ВводБюджетаСоставБюджета7.Регион КАК абс_Регион,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент
	|ИЗ
	|	Документ.Лео_ВводБюджета.СоставБюджета7 КАК Лео_ВводБюджетаСоставБюджета7
	|ГДЕ
	|	Лео_ВводБюджетаСоставБюджета7.Ссылка = &Ссылка
	|	И Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам ССЫЛКА Справочник.Лео_СтатьиОборотовРасшифровка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам,
	|	Лео_ВводБюджетаСоставБюджета7.АналитикаБюджета,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18  
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Лео_ВводБюджетаСоставБюджета7.Номенклатура,
	|	Лео_ВводБюджетаСоставБюджета7.Контрагент,
	|	Лео_ВводБюджетаСоставБюджета7.ЦФО,
	|	Лео_ВводБюджетаСоставБюджета7.Ссылка.Организация,
	|	Лео_ВводБюджетаСоставБюджета7.ДоговорКонтрагента,
	|	Лео_ВводБюджетаСоставБюджета7.Регион,
	|	ВЫБОР
	|		КОГДА Лео_ВводБюджетаСоставБюджета7.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);		
	Выборка = Запрос.Выполнить().Выбрать();                            
	Пока Выборка.Следующий() Цикл
		Для сч = 1 по 12 Цикл
			СуммаБюджет = Выборка["СуммаБюджет" + СокрЛП(Сч)];
			Сумма       = Выборка["Сумма" + СокрЛП(Сч)]; // План
			СуммаПрФакт = Выборка["СуммаПрФакт" + СокрЛП(Сч)];
			СуммаФакт   = Выборка["СуммаФакт" + СокрЛП(Сч)];
			
			мСуммСценариев = Новый Массив;
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.Бюджет,СуммаБюджет));
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.План,Сумма));
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.ОперативныйФакт,СуммаПрФакт));
			мСуммСценариев.Добавить(Новый Структура("Сценарий,Сумма",Справочники.СценарииПланирования.БухгалтерскийФакт,СуммаФакт));
			
			Для каждого сц из мСуммСценариев цикл
				
				
				//Количество=Выборка["Количество"+СокрЛП(Сч)];
				Если сц.Сумма > 0 Тогда
					// регистр Лео_ОборотыБюджетов 
					Движение = Движения.Лео_ОборотыБюджетов.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Выборка);
					
					
					Движение.ЦФО 			= Ссылка.ЦФО;
					Движение.Период 		= Дата(Год(ДатаПланирования),сч,1);
					Движение.СуммаУпр 		= сц.Сумма;
					Движение.СуммаУпрБезНДС = 0;
					Движение.Количество 	= 0;
					Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					Движение.Сценарий 		= сц.Сценарий;
					Движение.СтатьяОборотов = Выборка.СтатьяОборотов.СтатьяОборотов;
					Движение.Расшифровка 	= Выборка.СтатьяОборотов;
					
					//Если Сценарий = Справочники.СценарииПланирования.ОперативныйФакт Тогда
					//	Если Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка ИЛИ
					//		 Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
					//		 
					//		// регистр ОборотыБюджетов 
					//		Движение = Движения.ОборотыБюджетов.Добавить();
					//		ЗаполнитьЗначенияСвойств(Движение, Выборка);
					//		// Если затрата прямая - относим на ЦФО выбранное в шапке документа
					//		Движение.ЦФО 			= ?(Движение.СтатьяОборотов.абс_ПрямаяЗатрата, Выборка.ЦФО, Движение.СтатьяОборотов.ОсновноеЦФО);
					//		Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
					//		Движение.СуммаУпр 		= ?(Сумма=0,СуммаБезНДС+СуммаБезНДС*Выборка.СтавкаНДС/100,Сумма)*Выборка.Коэффициент;
					//		Движение.СуммаУпрБезНДС = СуммаБезНДС	* Выборка.Коэффициент;
					//		Движение.Количество 	= Количество	* Выборка.Коэффициент;
					//		Движение.абс_Бюджет 	= Справочники.Бюджеты.СводныйБДР;
					//		Движение.Сценарий 		= Справочники.СценарииПланирования.Факт;
					//				 
					//	КонецЕсли;
					//КонецЕсли;
				КонецЕсли;
				
				// Если это статья выручки или себестоимости, то вводим подтвержденный факт
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	КонецЕсли;
	
	
	
	
	
	
	
	
	
	////////////////////////////////////////////////////////////////////////////////////
	//// Движения по БДДС:

	//Запрос=Новый Запрос;
	//Запрос.Текст=
	//"ВЫБРАТЬ
	//|	абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС1,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС2,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС3,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС4,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС5,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС6,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС7,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС8,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС9,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС10,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС11,
	//|	абс_ВводБюджетаДДССоставБюджета.СуммаБезНДС12,
	//|	ВЫБОР
	//|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	//|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	//|			ТОГДА 20
	//|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	//|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	//|			ТОГДА 10
	//|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	//|				ИЛИ абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	//|			ТОГДА 18
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК СтавкаНДС,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма1,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма2,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма3,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма4,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма5,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма6,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма7,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма8,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма9,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма10,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма11,
	//|	абс_ВводБюджетаДДССоставБюджета.Сумма12,
	//|	абс_ВводБюджетаДДССоставБюджета.Контрагент,
	//|	абс_ВводБюджетаДДССоставБюджета.ЦФО,
	//|	абс_ВводБюджетаДДССоставБюджета.Ссылка.Организация,
	//|	ВЫБОР
	//|		КОГДА абс_ВводБюджетаДДССоставБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	//|			ТОГДА -1
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК Коэффициент,
	//|	абс_ВводБюджетаДДССоставБюджета.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	//|	абс_ВводБюджетаДДССоставБюджета.АналитикаБюджета КАК абс_АналитикаБюджета
	//|ИЗ
	//|	Документ.абс_ВводБюджета.СоставБюджетаДДС КАК абс_ВводБюджетаДДССоставБюджета
	//|ГДЕ
	//|	абс_ВводБюджетаДДССоставБюджета.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	
	//Сценарий 		= абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(ВидОперации);	
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Для сч = 1 по 12 Цикл
	//		
	//		Сумма		= Выборка["Сумма"		+ СокрЛП(Сч)];
	//		СуммаБезНДС	= Выборка["СуммаБезНДС"	+ СокрЛП(Сч)];
	//		
	//		Если СуммаБезНДС <> 0 Тогда
	//			
	//			Движение = Движения.ОборотыБюджетов.Добавить();
	//			
	//			ЗаполнитьЗначенияСвойств(Движение,Выборка);
	//			
	//			Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
	//			Движение.ЦФО 			= Движение.СтатьяОборотов.ОсновноеЦФО;
	//			Движение.СуммаУпр		= ?(Сумма=0, СуммаБезНДС + СуммаБезНДС * Выборка.СтавкаНДС / 100, Сумма) * Выборка.Коэффициент;
	//			Движение.СуммаУпрБезНДС	= СуммаБезНДС * Выборка.Коэффициент;
	//			Движение.абс_Бюджет		= Справочники.Бюджеты.БДДС;
	//			Движение.Сценарий		= Сценарий;
	//			
	//			
	//			Если ОтразитьЛимитыДДС И Выборка.СтатьяОборотов.абс_ТипСтатьи = Перечисления.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов Тогда
	//				
	//				// Контролируемые значения по бюджетам
	//				ДвижениеКонтролируемыеЗначения = Движения.КонтролируемыеЗначенияБюджетов.Добавить();
	//				
	//				ЗаполнитьЗначенияСвойств(ДвижениеКонтролируемыеЗначения, Выборка);
	//				
	//				ДвижениеКонтролируемыеЗначения.абс_Организация			= Выборка.Организация;
	//				ДвижениеКонтролируемыеЗначения.Период 					= ДобавитьМесяц(ДатаПланирования,Сч-1);
	//				
	//				ДвижениеКонтролируемыеЗначения.Активность 				= Истина;
	//				
	//				ДвижениеКонтролируемыеЗначения.КонтролирующийСценарий 	= Сценарий;
	//				ДвижениеКонтролируемыеЗначения.Сценарий 				= Сценарий;
	//				
	//				ДвижениеКонтролируемыеЗначения.СуммаСценарияКонтроль	= Сумма;
	//				ДвижениеКонтролируемыеЗначения.ИспользованиеКонтролируемогоЗначения = Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении;
	//				
	//				// Установка ограничений по бюджетам
	//				ДвижениеУстановкаЛимитов = Движения.УстановкаОграниченийПоБюджетам.Добавить();
	//				
	//				ЗаполнитьЗначенияСвойств(ДвижениеУстановкаЛимитов, Выборка);
	//				
	//				ДвижениеУстановкаЛимитов.абс_Организация				= Выборка.Организация;
	//				
	//				ДвижениеУстановкаЛимитов.Период 						= ДобавитьМесяц(ДатаПланирования,Сч-1);
	//				
	//				ДвижениеУстановкаЛимитов.Активность						= Истина;
	//				
	//				ДвижениеУстановкаЛимитов.КонтролирующийСценарий 		= Сценарий;					
	//				ДвижениеУстановкаЛимитов.Сценарий						= Сценарий;
	//				
	//				ДвижениеУстановкаЛимитов.ВидКонтролируемогоЗначения		= Перечисления.ВидыКонтролируемогоЗначенияБюджета.Ограничивающее;
	//				ДвижениеУстановкаЛимитов.ИспользованиеКонтролируемогоЗначения = Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении;
	//				
	//				ДвижениеУстановкаЛимитов.НачалоКонтролируемогоПериода	= ДобавитьМесяц(ДатаПланирования,Сч-1);
	//				
	//						
	//				
	//			КонецЕсли;			
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;	
	//
	//
	////Движения.ОборотыБюджетов.Записать();
	//
	//Движения.КонтролируемыеЗначенияБюджетов.Записать();
	//
	//ТабДвиженийУстановкаОграничений = Движения.УстановкаОграниченийПоБюджетам.Выгрузить();
	//
	//ТабДвиженийУстановкаОграничений.Свернуть("Активность,Период,Сценарий,СтатьяОборотов,ВидКонтролируемогоЗначения,ИспользованиеКонтролируемогоЗначения,ЦФО,Проект,Контрагент,Номенклатура,КонтролирующийСценарий,НачалоКонтролируемогоПериода,абс_Организация");
	//
	//Движения.УстановкаОграниченийПоБюджетам.Загрузить(ТабДвиженийУстановкаОграничений);
	//
	//Движения.УстановкаОграниченийПоБюджетам.Записать();
	//
	////////////////////////////////////////////////////////////////////////////////////
	//// Движения по согласованию:
	//
	////Если используется механизм согласования документов ВводБюджета, и документ еще не прошел по маршуту утверждения 
	////	- добавим запись в регистр СостоянияСогласования
	//НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	//НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	//НаборЗаписейСостояниеСогласования.Прочитать();
	//Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета,Дата) Тогда
	//	Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
	//		Запрос=Новый Запрос;
	//		Запрос.Текст=
	//		"ВЫБРАТЬ
	//		|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
	//		|ИЗ
	//		|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних";
	//		Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//		Выборка=Запрос.Выполнить().Выбрать();
	//		Если Выборка.Следующий() Тогда
	//			Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
	//				МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета);
	//				Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
	//					Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	//					ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
	//					Возврат;
	//				КонецЕсли;
	//				
	//				НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
	//				
	//				НоваяЗапись.Период = ТекущаяДата();
	//				НоваяЗапись.Активность = Истина;
	//				НоваяЗапись.ДокументДляСогласования = Ссылка;
	//				НоваяЗапись.Пользователь = Ответственный;
	//				НоваяЗапись.Этап = МаршрутСогласования;
	//				НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
	//				НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
	//				
	//				НаборЗаписейСостояниеСогласования.Записать();
	//				Возврат;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
	//		//Документ уже пошел по маршруту согласования
	//		Возврат;
	//	КонецЕсли;
	//	МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета);
	//	Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
	//		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	//		ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
	//		Возврат;
	//	КонецЕсли;
	//	//Уже есть запись с правильным маршрутом согласования
	//	Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
	//		НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
	//		Возврат;
	//	КонецЕсли;
	//	НаборЗаписейСостояниеСогласования.Очистить();
	//	НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
	//	
	//	НоваяЗапись.Период = ТекущаяДата();
	//	НоваяЗапись.Активность = Истина;
	//	НоваяЗапись.ДокументДляСогласования = Ссылка;
	//	НоваяЗапись.Пользователь = Ответственный;
	//	НоваяЗапись.Этап = МаршрутСогласования;
	//	НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
	//	НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
	//	
	//	НаборЗаписейСостояниеСогласования.Записать();
	//ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
	//	//Если есть записи по этому документу, а согласование не используется - очистим
	//	НаборЗаписейСостояниеСогласования.Очистить();
	//	НаборЗаписейСостояниеСогласования.Записать();
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью()
	
	СуммаДокумента=0;
	//Для сч=1 по 12 Цикл
	//	СуммаДокумента=СуммаДокумента+СоставБюджета.Итог("Сумма"+Сч);
	//КонецЦикла;
	
	ТЗп = СоставБюджета.Выгрузить(Новый Структура("Итоговая",Ложь));
	Для сч = 1 по 12 Цикл
		СуммаДокумента = СуммаДокумента + ТЗп.Итог("СуммаБюджет"+Сч);
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(Ссылка) И Состояние = Перечисления.СостоянияОбъектов Тогда
		
		НаборСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
		
		НаборСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
		
		НаборСогласования.Очистить();
		
		НаборСогласования.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
	ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	УровеньСогласования=0;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Удаление движений по регистру абс_СостоянияСогласованияДокументов, если документ был подготовлен
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если НаборЗаписейСостояниеСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета,Дата) Тогда
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Документ уже пошел по маршруту согласования, не следует ничего менять
			Возврат;
		КонецЕсли;
		//Если в наборе записей только одна запись - значит документ только подготовлен.
		//Очистим набор записей
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
	
КонецПроцедуры

