
Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
	
	Наименование = "";
	ЗаполнитьИндекс();
	
	
КонецПроцедуры






Процедура ЗаполнитьИндекс() экспорт 
	
КодСтатьи = СтатьяОборотов.абс_КодБюджетнойСтатьи;
	Индекс = 1;	

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лео_СтатьиОборотовРасшифровка.Индекс КАК Индекс,
		|	Лео_СтатьиОборотовРасшифровка.абс_КодБюджетнойСтатьи,
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов
		|ИЗ
		|	Справочник.Лео_СтатьиОборотовРасшифровка КАК Лео_СтатьиОборотовРасшифровка
		|ГДЕ
		|	Лео_СтатьиОборотовРасшифровка.СтатьяОборотов = &СтатьяОборотов
		|	И НЕ Лео_СтатьиОборотовРасшифровка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс УБЫВ";
		
	Запрос.УстановитьПараметр("СтатьяОборотов",СтатьяОборотов);
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Индекс = Выборка.Индекс + 1;
	КонецЕсли;
	

	абс_КодБюджетнойСтатьи =  КодСтатьи + "_" + сокрлп(Индекс);
	
КонецПроцедуры	
	
