&НаКлиенте
Функция ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла)
	
	ВыгруженоУспешно = Ложь;
	
	Попытка
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		
		ВыгруженоУспешно = Истина;
	Исключение 
		Сообщить("Не удалось записать Файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Если ВыгруженоУспешно Тогда
		Предупреждение("Файл выгрузки успешно сформирован!");
	Иначе
		Предупреждение("Произошла ошибка при записи файла, файл выгрузки не сформирован!");
	КонецЕсли;	
	
	Возврат ВыгруженоУспешно;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла(Имя,Каталог,Дата,Организация = Неопределено)
	
	Если НЕ Организация = Неопределено Тогда
		Имя = Имя + "_" + СокрЛП(Организация.Префикс);
	КонецЕсли;
	
	ИмяДата =  Формат(Дата,"ДЛФ=D");
	ИмяВремя = Формат(ТекущаяДата(),"ДЛФ=T");
	ИмяФайла =	СтрЗаменить(Имя + "_"+ ИмяДата + "_" + ИмяВремя ,".","_");  
	ИмяФайла =	СтрЗаменить(ИмяФайла," ","_");
	ИмяФайла =	СтрЗаменить(ИмяФайла,":","_");
	ИмяФайла = Каталог + "\" + ИмяФайла +".xls";
	
	Возврат ИмяФайла;
	
КонецФункции


&НаСервере
Функция ВыгрузкаВАналВТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	ОбластьШапка =  Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметров = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.Номер КАК НомерДокумента,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.Дата КАК ДатаДокумента,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент.Наименование + "" | "" + ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент.ИНН + "" | "" + ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент.КПП КАК Контрагент,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровУслугУслуги.Сумма КАК СуммаСНДС,
	               |	ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаБезНДС,
	               |	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
	               |	ПоступлениеТоваровУслугУслуги.Субконто1 КАК СтатьяЗатрат,
	               |	ПоступлениеТоваровУслугУслуги.Содержание КАК СодержаниеУслуги,
	               |	ПоступлениеТоваровУслугУслуги.Лео_СОБР.абс_КодБюджетнойСтатьи КАК Собр
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ПоступлениеТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |	И ВЫБОР
	               |			КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		КОНЕЦ";
				   
				   Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
				   Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
				   Запрос.УстановитьПараметр("Организация", Объект.Организация);

				   
	Результат = Запрос.Выполнить();
	
	ТзДокументы = Результат.Выгрузить();
	
	Для Каждого Стр Из ТзДокументы Цикл
		ОбластьПараметров.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
	
	//Каталог = "D:\";
	Каталог = Объект.ПутьКФайлу;
	ИмяФайла = СформироватьИмяФайла ("DokBudget",Каталог,ТекущаяДата());
	ВыбФайл = Новый Файл(ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		УдалитьФайлы(ВыбФайл)
	КонецЕсли;
	
	Табдок = ВыгрузкаВАналВТабДок();
	
	ЗаписатьФайлВыгрузкиНаДиск(ТабДок, ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Если Диалог.Выбрать() Тогда
        Объект.ПутьКФайлу = Диалог.Каталог + "\";
	КонецЕсли;

КонецПроцедуры
