// Формат параметра ячейки:
// П_<НомерРаздела>_<НомерПодраздела>_<НомерПунктаПодраздела>_<КодВидаБюджета>_<КодВидаИтога>_<НомерМесяца>
//	<КодВидаБюджета>: 1 - Бюджет, 2 - План, 3 - Факт
// 	<КодВидаИтога>: М - Месяц, Г - Год

Функция ПодготовитьСтруктуруПараметровМакета() Экспорт
	
	СтруктураПараметров = Новый Структура();
	
	СтруктураПараметров.Вставить("Организация"	, Организация);
	СтруктураПараметров.Вставить("ПериодГод"	, Год(Период));
	
	Для СчПериодов = 1 по 12 Цикл
		
		ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "М", СчПериодов);
					
	КонецЦикла;
	
	ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "Г", 12);
	
	ПодготовитьКолонкуСтруктурыМакета(СтруктураПараметров, "ПФ", 12);
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ПодготовитьКолонкуСтруктурыМакета(С, ТекКодВидаИтога, ТекНомерПериода)
	
	//С.Вставить("П_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
	
	Если ТекКодВидаИтога = "ПФ" Тогда
		Нач = 3;
		Кон = 3;
	ИначеЕсли ТекКодВидаИтога = "Г" Тогда 
		Нач = 1;
		Кон = 2;
	Иначе
		Нач = 1;
		Кон = 3;
	КонецЕсли;
		
	Для СчВидБюджета = Нач по Кон Цикл
		
		// Раздел 0
		С.Вставить("П_0_1_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		С.Вставить("П_0_2_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		С.Вставить("П_0_3_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		
		С.Вставить("П_1_1_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_2_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_3_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		С.Вставить("П_2_1_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		С.Вставить("П_2_2_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		С.Вставить("П_2_3_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		
		// Раздел 1
		С.Вставить("П_1_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		С.Вставить("П_1_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 2.1
		С.Вставить("П_2_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		С.Вставить("П_2_1_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_1_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);			
		
		// Раздел 2.2
		С.Вставить("П_2_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 2.3
		С.Вставить("П_2_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);			
		С.Вставить("П_2_3_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);			
		С.Вставить("П_2_3_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_3_10_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		
		// Раздел 2.4
		С.Вставить("П_2_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 2.5
		С.Вставить("П_2_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		
		// Раздел 3
		С.Вставить("П_3_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		
		// Раздел I
		С.Вставить("П_I_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
			
		// Раздел 4
		С.Вставить("П_4_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
				
		// Раздел 5
		С.Вставить("П_5_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел II
		С.Вставить("П_II_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
		
		// Раздел 6
		С.Вставить("П_6_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_6_6_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
		// Раздел 7
		С.Вставить("П_7_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_7_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_7_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_7_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_7_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_7_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_7_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
				
		// Раздел III
		С.Вставить("П_III_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
			
		// Раздел IV
		С.Вставить("П_IV_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
			
		// Раздел V
		С.Вставить("П_V_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
				
		// Раздел VI
		С.Вставить("П_VI_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);		
						
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьИтогиПараметровМакета(СтруктураДанных)
	
	Для СчПериодов = 1 по 12 Цикл
		
		РассчитатьИтогКолонкиПараметровМакета(СтруктураДанных, "М", СчПериодов);
					
	КонецЦикла;
	
	РассчитатьНакопительныйИтогПараметровМакета(СтруктураДанных, "Г", 1, 12);
	
	РассчитатьПланФактМакета(СтруктураДанных, "ПФ");
	
КонецПроцедуры

Процедура РассчитатьИтогКолонкиПараметровМакета(С, ТекКодВидаИтога, ТекНомерПериода)
	
	Для СчВидБюджета = 1 по 3 Цикл
		
		// Раздел 1
		С["П_1_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	= 
		С["П_1_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_1_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_1_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_1_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_1_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_1_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 2.1
		С["П_2_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	=	
		
		С["П_2_1_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_1_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_1_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_1_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_1_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];			
		
		// Раздел 2.2
		С["П_2_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	=
		С["П_2_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 2.3
		С["П_2_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	=
		С["П_2_3_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_3_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_3_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_3_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	+
		С["П_2_3_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+				
		С["П_2_3_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_3_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_3_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_3_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_3_10_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 2.4
		//С["П_2_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]    = 
		//С["П_2_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 2.5
		//С["П_2_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		//С["П_2_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Итог по разделу 2
		С["П_2_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	=
		С["П_2_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_2_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 3
		//С["П_3_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		//С["П_3_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел I
		С["П_I_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		С["П_1_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	-
		С["П_2_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
			
		// Раздел 4
		//С["П_4_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		//С["П_4_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
				
		// Раздел 5
		//С["П_5_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		//С["П_5_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел II
		С["П_II_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=		
		С["П_4_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	-
		С["П_5_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 6
		С["П_6_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		С["П_6_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_6_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_6_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_6_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_6_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_6_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_6_6_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
		
		// Раздел 7
		С["П_7_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода] 	=
		С["П_7_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_7_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_7_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_7_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_7_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_7_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
				
		// Раздел III
		С["П_III_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		С["П_6_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	-
		С["П_7_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
			
		// Раздел IV
		С["П_IV_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		С["П_I_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_II_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_III_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
			
		// Раздел V // Как заполнять остаток ДС?
		//С["П_V_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	=
		//С["П_V_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
				
		// Раздел VI
		С["П_VI_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	= 
		С["П_V_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода]	+
		С["П_IV_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода];
				
	КонецЦикла;	
	
КонецПроцедуры

Процедура РассчитатьПланФактМакета(С, ТекКодВидаИтога)
	
	ТекВидБюджета = 3;
	ТекНомерПериодаКон = 12;
	
	Для ТекНомерПериода = 1 По 12 Цикл
		
		Если ТекНомерПериода <= МесяцФакт Тогда
			ВидБюджетаПФ = 3;
		Иначе
			ВидБюджетаПФ = 2;
		КонецЕсли;
		
		// Раздел 1
		С["П_1_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_1_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_1_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_1_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_2_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_1_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_3_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_1_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_4_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_1_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_5_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_1_6_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_6_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_6_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 2.1
		С["П_2_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		С["П_2_1_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_1_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];			
		
		// Раздел 2.2
		С["П_2_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_2_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_2_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 2.3
		С["П_2_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_2_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_2_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_3_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_3_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_4_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_4_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_5_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_5_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];			
		С["П_2_3_6_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_6_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_6_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_7_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_7_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_7_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_8_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_8_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_8_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];			
		С["П_2_3_9_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_9_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_9_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_2_3_10_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_10_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_10_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		
		// Раздел 2.4
		С["П_2_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_4_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 2.5
		С["П_2_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_5_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		
		// Раздел 3
		С["П_3_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_3_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_3_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		
		// Раздел I
		С["П_I_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_I_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_I_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		
		// Раздел 4
		С["П_4_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 5
		С["П_5_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел II
		С["П_II_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_II_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_II_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];		
		
		// Раздел 6
		С["П_6_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_1_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_2_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_3_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_4_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_5_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_6_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_6_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_6_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_6_6_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_6_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_6_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел 7
		С["П_7_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_7_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_1_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_1_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_7_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_2_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_2_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_7_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_3_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_3_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_7_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_4_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_4_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_7_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_5_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_5_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		С["П_7_5_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_5_1_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_5_1_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел III
		С["П_III_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_III_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_III_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел IV
		С["П_IV_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_IV_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_IV_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел V
		С["П_V_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_V_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_V_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];
		
		// Раздел VI
		С["П_VI_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_VI_0_0_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_VI_0_0_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода];			
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьНакопительныйИтогПараметровМакета(С, ТекКодВидаИтога, ТекНомерПериодаНач, ТекНомерПериодаКон)
	
	Для ТекНомерПериода = ТекНомерПериодаНач По ТекНомерПериодаКон Цикл
		
		Для СчВидБюджета = 1 по 2 Цикл
						
			// Раздел 1
			С["П_1_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_1_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_1_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_1_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_2_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_1_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_3_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_1_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_4_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_1_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_5_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_1_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон]	= С["П_1_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_1_6_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];

			// Раздел 2.1
			С["П_2_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
			С["П_2_1_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_1_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_1_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_3_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_1_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_4_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_1_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_1_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_1_5_" + СчВидБюджета + "_М_" + ТекНомерПериода];			
			
			// Раздел 2.2
			С["П_2_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_2_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_2_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 2.3
			С["П_2_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_2_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_3_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_3_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_4_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_4_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_5_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_5_" + СчВидБюджета + "_М_" + ТекНомерПериода];			
			С["П_2_3_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_6_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_6_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_7_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_7_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_8_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_8_" + СчВидБюджета + "_М_" + ТекНомерПериода];			
			С["П_2_3_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_9_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_9_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_2_3_10_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_3_10_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_3_10_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
			
			// Раздел 2.4
			С["П_2_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_4_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 2.5
			С["П_2_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_2_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_2_5_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
			
			// Раздел 3
			С["П_3_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_3_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_3_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
			
			// Раздел I
			С["П_I_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_I_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_I_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
				
			// Раздел 4
			С["П_4_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_4_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_4_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
					
			// Раздел 5
			С["П_5_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_5_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_5_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел II
			С["П_II_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_II_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_II_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];		
			
			// Раздел 6
			С["П_6_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_1_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_2_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_3_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_4_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_5_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_6_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_6_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_6_6_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_6_6_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_6_6_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			
			// Раздел 7
			С["П_7_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_7_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_1_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_1_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_7_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_2_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_2_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_7_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_3_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_3_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_7_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_4_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_4_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_7_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_5_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_5_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
			С["П_7_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_7_5_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_7_5_1_" + СчВидБюджета + "_М_" + ТекНомерПериода];
					
			// Раздел III
			С["П_III_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_III_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_III_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
				
			// Раздел IV
			С["П_IV_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_IV_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_IV_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
				
			// Раздел V
			С["П_V_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_V_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_V_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];
					
			// Раздел VI
			С["П_VI_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_VI_0_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_VI_0_0_" + СчВидБюджета + "_М_" + ТекНомерПериода];			
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПараметровМакетаДанными(СтруктураДанных)
	
	ЗапросДанные = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_СобственныеКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(ОборотыБюджетовОбороты.Период) КАК КодМесяца,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|	КОНЕЦ КАК КодРаздела,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|	КОНЕЦ КАК КодПодраздела,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|	КОНЕЦ КАК КодПункта,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
	|			ТОГДА 1
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|			ТОГДА 2
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодСценария,
	|	СУММА(ВЫБОР
	|			КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ * ОборотыБюджетовОбороты.СуммаУпрОборот) КАК ЗначениеСумма
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет В (&Бюджет)
	|				И Сценарий В (&Сценарий)
	|				И ВЫБОР
	|					КОГДА &ОтборПоОрганизации
	|						ТОГДА Организация В (&Организация)
	|					ИНАЧЕ НЕ Контрагент В
	|								(ВЫБРАТЬ
	|									СобственныеКонтрагенты.Контрагент
	|								ИЗ
	|									ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|				КОНЕЦ) КАК ОборотыБюджетовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(ОборотыБюджетовОбороты.Период),
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
	|			ТОГДА 1
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|			ТОГДА 2
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|	КОНЕЦ");
	
	ЗапросДанные.УстановитьПараметр("Период"				, Период);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	ЗапросДанные.УстановитьПараметр("Организация"			, Организация);
	
	ЗапросДанные.УстановитьПараметр("Бюджет"				, Справочники.Бюджеты.БДДС);
	
	МассивСценариев = Новый Массив();
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Бюджет);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.План);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Факт);
	
	ЗапросДанные.УстановитьПараметр("Сценарий"				, МассивСценариев);
	
	Выборка = ЗапросДанные.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ТекКлючДанных = "П_" + Выборка.КодРаздела  + "_" + Выборка.КодПодраздела + "_" + Выборка.КодПункта + "_" + Выборка.КодСценария + "_М_" + Выборка.КодМесяца;
		
		СтруктураДанных.Вставить(ТекКлючДанных, Выборка.ЗначениеСумма); 
		
	КонецЦикла;	
	
	Возврат;
	
	// Заполним факт по расходу ДДС		
	ЗапросДанные = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_СобственныеКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.СтатьяОборотов КАК СтатьяОборотов,
	|	НАЧАЛОПЕРИОДА(ЗаявкиНаРасходованиеСредствОбороты.Регистратор.Дата, МЕСЯЦ) КАК Период,
	|	СУММА(ЗаявкиНаРасходованиеСредствОбороты.СуммаУпрРасход) КАК СуммаУпрОборот
	|ПОМЕСТИТЬ ВТ_ОплатыПоЗаявкам
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Регистратор,
	|			НЕ ЗаявкаНаРасходование = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеСредств.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА &ОтборПоОрганизации
	|						ТОГДА Организация В (&Организация)
	|					ИНАЧЕ НЕ Контрагент В
	|								(ВЫБРАТЬ
	|									СобственныеКонтрагенты.Контрагент
	|								ИЗ
	|									ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|				КОНЕЦ) КАК ЗаявкиНаРасходованиеСредствОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ЗаявкиНаРасходованиеСредствОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.СтатьяОборотов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(ВТ_ОплатыПоЗаявкам.Период) КАК КодМесяца,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|		ИНАЧЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|	КОНЕЦ КАК КодРаздела,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|		ИНАЧЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|	КОНЕЦ КАК КодПодраздела,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|		ИНАЧЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|	КОНЕЦ КАК КодПункта,
	|	3 КАК КодСценария,
	|	СУММА(ВТ_ОплатыПоЗаявкам.СуммаУпрОборот) КАК ЗначениеСумма
	|ИЗ
	|	ВТ_ОплатыПоЗаявкам КАК ВТ_ОплатыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(ВТ_ОплатыПоЗаявкам.Период),
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|		ИНАЧЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|		ИНАЧЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|			ТОГДА ВТ_ОплатыПоЗаявкам.СтатьяОборотов.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|		ИНАЧЕ ВТ_ОплатыПоЗаявкам.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|	КОНЕЦ");
	
	ЗапросДанные.УстановитьПараметр("Период"				, Период);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	ЗапросДанные.УстановитьПараметр("Организация"			, Организация);
	
	ЗапросДанные.УстановитьПараметр("Бюджет"				, Справочники.Бюджеты.БДДС);
	
	Выборка = ЗапросДанные.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.КодСценария = 3 Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекКлючДанных = "П_" + Выборка.КодРаздела  + "_" + Выборка.КодПодраздела + "_" + Выборка.КодПункта + "_" + Выборка.КодСценария + "_М_" + Выборка.КодМесяца;
		
		СтруктураДанных.Вставить(ТекКлючДанных, Выборка.ЗначениеСумма); 
		
	КонецЦикла;		
	
	// Заполним факт по приходу ДДС		
	ЗапросДанные = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_СобственныеКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДвиженияДенежныхСредствОбороты.СуммаУпрОборот) КАК СуммаУпрПриход,
	|	ВЫРАЗИТЬ(ДвиженияДенежныхСредствОбороты.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, МЕСЯЦ) КАК Период,
	|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ ВТ_ПриходыДС
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|				И ВЫБОР
	|					КОГДА &ОтборПоОрганизации
	|						ТОГДА Организация В (&Организация)
	|					ИНАЧЕ НЕ Контрагент В
	|								(ВЫБРАТЬ
	|									СобственныеКонтрагенты.Контрагент
	|								ИЗ
	|									ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|				КОНЕЦ) КАК ДвиженияДенежныхСредствОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ДвиженияДенежныхСредствОбороты.Контрагент КАК Справочник.Контрагенты),
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, МЕСЯЦ),
	|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ПриходыДС.СуммаУпрПриход) КАК СуммаУпрОборот,
	|	ВТ_ПриходыДС.Контрагент,
	|	ВТ_ПриходыДС.Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(абс_СоответствиеСтатейДвиженияДенежныхСредствСтатьямОборотовПоБюджетам.СтатьяОборотовПоБюджетам, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|	КОНЕЦ КАК ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотов
	|ПОМЕСТИТЬ ВТ_ВТ_ПриходыДСПоСтатьям
	|ИЗ
	|	ВТ_ПриходыДС КАК ВТ_ПриходыДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|		ПО (абс_СтатьиБюджетаПоЦФО.ЦФО = ВТ_ПриходыДС.Контрагент.Регион.абс_ЦФО)
	|			И (абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеСтатейДвиженияДенежныхСредствСтатьямОборотовПоБюджетам КАК абс_СоответствиеСтатейДвиженияДенежныхСредствСтатьямОборотовПоБюджетам
	|		ПО ВТ_ПриходыДС.СтатьяДвиженияДенежныхСредств = абс_СоответствиеСтатейДвиженияДенежныхСредствСтатьямОборотовПоБюджетам.СтатьяДДСБУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПриходыДС.Контрагент,
	|	ВТ_ПриходыДС.Период,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(абс_СоответствиеСтатейДвиженияДенежныхСредствСтатьямОборотовПоБюджетам.СтатьяОборотовПоБюджетам, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам, ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка))
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(ВТ_ВТ_ПриходыДСПоСтатьям.Период) КАК КодМесяца,
	|	ВЫБОР
	|		КОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА 3
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|					ТОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|				ИНАЧЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|			КОНЕЦ
	|	КОНЕЦ КАК КодРаздела,
	|	ВЫБОР
	|		КОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|					ТОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|				ИНАЧЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|			КОНЕЦ
	|	КОНЕЦ КАК КодПодраздела,
	|	ВЫБОР
	|		КОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|					ТОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|				ИНАЧЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|			КОНЕЦ
	|	КОНЕЦ КАК КодПункта,
	|	3 КАК КодСценария,
	|	СУММА(ВТ_ВТ_ПриходыДСПоСтатьям.СуммаУпрОборот) КАК ЗначениеСумма
	|ИЗ
	|	ВТ_ВТ_ПриходыДСПоСтатьям КАК ВТ_ВТ_ПриходыДСПоСтатьям
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(ВТ_ВТ_ПриходыДСПоСтатьям.Период),
	|	ВЫБОР
	|		КОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА 3
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|					ТОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|				ИНАЧЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодРазделаФормыБДДС
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|					ТОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|				ИНАЧЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПодразделаФормыБДДС
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов = ЗНАЧЕНИЕ(Справочник.СтатьиОборотовПоБюджетам.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФормБДДС.ПустаяСсылка)
	|					ТОГДА ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|				ИНАЧЕ ВТ_ВТ_ПриходыДСПоСтатьям.СтатьяОборотов.Родитель.абс_РазделФормыБДДС.КодПунктаФормыБДДС
	|			КОНЕЦ
	|	КОНЕЦ");
	
	ЗапросДанные.УстановитьПараметр("Период"				, Период);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	ЗапросДанные.УстановитьПараметр("Организация"			, Организация);
	
	ЗапросДанные.УстановитьПараметр("Бюджет"				, Справочники.Бюджеты.БДДС);
	
	Выборка = ЗапросДанные.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.КодСценария = 3 Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекКлючДанных = "П_" + Выборка.КодРаздела  + "_" + Выборка.КодПодраздела + "_" + Выборка.КодПункта + "_" + Выборка.КодСценария + "_М_" + Выборка.КодМесяца;
		
		СтруктураДанных.Вставить(ТекКлючДанных, Выборка.ЗначениеСумма); 
		
	КонецЦикла;		
	
КонецПроцедуры

Процедура РассчитатьФОТ_НДФЛ(СтруктураДанных)
	
	Для ТекМесяц = 1 По 12 Цикл
		
		Для ТекСценарий = 1 По 3 Цикл
			
			СтруктураДанных["П_2_3_9_" + ТекСценарий + "_М_" + ТекМесяц] = СтруктураДанных["П_2_3_9_" + ТекСценарий + "_М_" + ТекМесяц] * 0.87;
			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруДанныхБДДС() Экспорт
	
	СтруктураДанных = ПодготовитьСтруктуруПараметровМакета();
	
	ЗаполнитьСтруктуруПараметровМакетаДанными(СтруктураДанных);
	
	ЗаполнитьНачальныйОстатокПланДДС(СтруктураДанных);
	
	ЗаполнитьНачальныйОстатокФактДДС(СтруктураДанных);
	
	//РассчитатьФОТ_НДФЛ(СтруктураДанных);
	
	РассчитатьИтогиПараметровМакета(СтруктураДанных);
	
	РассчитатьИтогиПоНачальномуОстатку(СтруктураДанных);
	
	Возврат СтруктураДанных;
	
КонецФункции


Процедура ЗаполнитьНачальныйОстатокПланДДС(СтруктураДанных)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА абс_ПланОстаткиБДДССрезПоследних.Сценарий = ЗНАЧЕНИЕ(Справочник.Сценариипланирования.Бюджет)
	|				ТОГДА ЕСТЬNULL(абс_ПланОстаткиБДДССрезПоследних.СуммаОстатка, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Бюджет,
	|	СУММА(ВЫБОР
	|			КОГДА абс_ПланОстаткиБДДССрезПоследних.Сценарий = ЗНАЧЕНИЕ(Справочник.Сценариипланирования.план)
	|				ТОГДА ЕСТЬNULL(абс_ПланОстаткиБДДССрезПоследних.СуммаОстатка, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК План
	|ИЗ
	|	РегистрСведений.абс_ПланОстаткиБДДС.СрезПоследних(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			ВЫБОР
	|				КОГДА &ОтборПоОрганизации
	|					ТОГДА Организация В (&Организация)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК абс_ПланОстаткиБДДССрезПоследних");
	
	Запрос.УстановитьПараметр("Период"				, Период);
	
	Запрос.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация"			, Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураДанных.Вставить("П_V_0_0_1_М_1", 0);
	СтруктураДанных.Вставить("П_V_0_0_2_М_1", 0);

	
	Если Выборка.Следующий() Тогда
		
		Если НЕ Выборка.Бюджет = NULL Тогда
			СтруктураДанных.Вставить("П_V_0_0_1_М_1", Выборка.Бюджет);
		КонецЕсли;
		
		Если НЕ Выборка.План = NULL Тогда
			СтруктураДанных.Вставить("П_V_0_0_2_М_1", Выборка.План);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНачальныйОстатокФактДДС(СтруктураДанных)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СУММА(ДенежныеСредстваОстатки.СуммаУпрОстаток) КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			ВЫБОР
	|				КОГДА &ОтборПоОрганизации
	|					ТОГДА Организация В (&Организация)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ДенежныеСредстваОстатки");
	
	Запрос.УстановитьПараметр("Период"				, Период);
	
	Запрос.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация"			, Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураДанных.Вставить("П_V_0_0_3_М_1", Выборка.СуммаУпрОстаток);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьИтогиПоНачальномуОстатку(СтруктураДанных)
	
	Для ТекМесяц = 1 По 12 Цикл
		
		Если НЕ ТекМесяц = 1 Тогда
			СтруктураДанных["П_V_0_0_1_М_" + Строка(ТекМесяц)] = СтруктураДанных["П_VI_0_0_1_М_" + Строка(ТекМесяц - 1)];
			СтруктураДанных["П_V_0_0_2_М_" + Строка(ТекМесяц)] = СтруктураДанных["П_VI_0_0_2_М_" + Строка(ТекМесяц - 1)];
			СтруктураДанных["П_V_0_0_3_М_" + Строка(ТекМесяц)] = СтруктураДанных["П_VI_0_0_3_М_" + Строка(ТекМесяц - 1)];
		КонецЕсли;
		
		СтруктураДанных["П_VI_0_0_1_М_" + Строка(ТекМесяц)] = СтруктураДанных["П_V_0_0_1_М_" + Строка(ТекМесяц)] + СтруктураДанных["П_IV_0_0_1_М_" + Строка(ТекМесяц)]; 
		СтруктураДанных["П_VI_0_0_2_М_" + Строка(ТекМесяц)] = СтруктураДанных["П_V_0_0_2_М_" + Строка(ТекМесяц)] + СтруктураДанных["П_IV_0_0_2_М_" + Строка(ТекМесяц)]; 
		СтруктураДанных["П_VI_0_0_3_М_" + Строка(ТекМесяц)] = СтруктураДанных["П_V_0_0_3_М_" + Строка(ТекМесяц)] + СтруктураДанных["П_IV_0_0_3_М_" + Строка(ТекМесяц)]; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиРасшифровкуБДДС(Макет, ТабДок) Экспорт
	
	ОбластьБДДСДетализацияЗаголовок 	= Макет.ПолучитьОбласть("ОбластьБДДСДетализацияЗаголовок");
	ОбластьБДДСДетализацияШапка 		= Макет.ПолучитьОбласть("ОбластьБДДСДетализацияШапка");
	ОбластьБДДСДетализацияРаздел 		= Макет.ПолучитьОбласть("ОбластьБДДСДетализацияРаздел");
	ОбластьБДДСДетализацияЦФО 			= Макет.ПолучитьОбласть("ОбластьБДДСДетализацияЦФО");
	ОбластьБДДССтатья 					= Макет.ПолучитьОбласть("ОбластьБДДССтатья");
	
	СтруктураПараметров = Новый Структура("Организация", Организация);
	
	ОбластьБДДСДетализацияЗаголовок.Параметры.Заполнить(СтруктураПараметров);
	
	ТабДок.Вывести(ОбластьБДДСДетализацияЗаголовок);
	
	ВыборкаРаздел = ПолучитьЗапросРасшифровкиБДДС();
	
	Пока ВыборкаРаздел.Следующий() Цикл
		
		ОбластьБДДСДетализацияШапка.Параметры.ЗаголовокРасшифровки 	= "БДДС П." + ВыборкаРаздел.РазделБДДС.КодРазделаФормыБДДС + "." + ?(ЗначениеЗаполнено(ВыборкаРаздел.РазделБДДС.КодПодразделаФормыБДДС), "" + ВыборкаРаздел.РазделБДДС.КодПодразделаФормыБДДС + ".", "")+ ?(ЗначениеЗаполнено(ВыборкаРаздел.РазделБДДС.КодПунктаФормыБДДС), "" + ВыборкаРаздел.РазделБДДС.КодПунктаФормыБДДС + ".", "");
		
		ТабДок.Вывести(ОбластьБДДСДетализацияШапка);		
		
		ОбластьБДДСДетализацияРаздел.Параметры.КодРаздела 			= "" + ВыборкаРаздел.РазделБДДС.КодРазделаФормыБДДС + "." + ?(ЗначениеЗаполнено(ВыборкаРаздел.РазделБДДС.КодПодразделаФормыБДДС), "" + ВыборкаРаздел.РазделБДДС.КодПодразделаФормыБДДС + ".", "") + ?(ЗначениеЗаполнено(ВыборкаРаздел.РазделБДДС.КодПунктаФормыБДДС), "" + ВыборкаРаздел.РазделБДДС.КодПунктаФормыБДДС + ".", "");
		ОбластьБДДСДетализацияРаздел.Параметры.НаименованиеРаздела 	= ВыборкаРаздел.РазделБДДС.Наименование;
		
		СтруктураИтоговПоРазделу = ПолучитьИтогиПоРазделуРасшифровкиБДДС(ВыборкаРаздел);
		
		ОбластьБДДСДетализацияРаздел.Параметры.Заполнить(СтруктураИтоговПоРазделу);
				
		ТабДок.Вывести(ОбластьБДДСДетализацияРаздел);
		
		ТабДок.НачатьГруппуСтрок();
		
		ВыборкаЦФО = ВыборкаРаздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦФО.Следующий() Цикл
			
			ОбластьБДДСДетализацияЦФО.Параметры.НаименованиеЦФО		= ВыборкаЦФО.ЦФО.Наименование;			
			
			СтруктураИтоговПоЦФО = ПолучитьИтогиПоЦФОРасшифровкиБДДС(ВыборкаЦФО);
			
			ОбластьБДДСДетализацияЦФО.Параметры.Заполнить(СтруктураИтоговПоЦФО);
						
			ТабДок.Вывести(ОбластьБДДСДетализацияЦФО);
			
			ТабДок.НачатьГруппуСтрок();			
			
			ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСтатья.Следующий() Цикл
				
				СтруктураДанныхСтроки = ПолучитьСтруктуруСтрокиРасшифровки();
				
				ВыборкаКодМесяца = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКодМесяца.Следующий() Цикл
					
					ВыборкаКодСценария = ВыборкаКодМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаКодСценария.Следующий() Цикл
						
						ТекКлючДанных = "П_0_" + ВыборкаКодСценария.КодСценария + "_" + "М" + "_" + ВыборкаКодСценария.КодМесяца;
						
						СтруктураДанныхСтроки.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
												
						ВыборкаСобственный = ВыборкаКодСценария.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаСобственный.Следующий() Цикл
							
							ТекКлючДанных = "П_" + ?(ВыборкаСобственный.Собственный, 1, 2) + "_" + ВыборкаСобственный.КодСценария + "_" + "М" + "_" + ВыборкаСобственный.КодМесяца;
							
							СтруктураДанныхСтроки.Вставить(ТекКлючДанных, ВыборкаСобственный.ЗначениеСумма);
							
						КонецЦикла;
												
					КонецЦикла;
										
				КонецЦикла;	
				
				ОбластьБДДССтатья.Параметры.НаименованиеСтатьи		= ВыборкаСтатья.СтатьяОборотов.Наименование;
				
				РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураДанныхСтроки);
				
				ОбластьБДДССтатья.Параметры.Заполнить(СтруктураДанныхСтроки);
				
				ТабДок.Вывести(ОбластьБДДССтатья);
				
			КонецЦикла;
			
			ТабДок.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ТабДок.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗапросРасшифровкиБДДС()
	
	ЗапросДанные = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_СобственныеКонтрагенты
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиОборотовПоБюджетам.Ссылка КАК СтатьяОборотов,
	|	СтатьиОборотовПоБюджетам.ОсновноеЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.Период ЕСТЬ NULL 
	|			ТОГДА МЕСЯЦ(ОборотыБюджетовОбороты.Период)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КодМесяца,
	|	ВЫБОР
	|		КОГДА НЕ ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС = ЗНАЧЕНИЕ(Справочник.абс_РазделыБюджетныхФорм.ПустаяСсылка)
	|			ТОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_РазделФормыБДДС
	|		ИНАЧЕ ОборотыБюджетовОбороты.СтатьяОборотов.Родитель.абс_РазделФормыБДДС
	|	КОНЕЦ КАК СтатьяРаздел,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
	|			ТОГДА 1
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|			ТОГДА 2
	|		КОГДА ОборотыБюджетовОбороты.Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КодСценария,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОборотыБюджетовОбороты.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОборотыБюджетовОбороты.Контрагент В
	|						(ВЫБРАТЬ
	|							СобственныеКонтрагенты.Контрагент
	|						ИЗ
	|							ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК СобственныйКонтрагент,
	|	ВЫБОР
	|		КОГДА СтатьиОборотовПоБюджетам.Ссылка.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ * ЕСТЬNULL(ОборотыБюджетовОбороты.СуммаУпрОборот, 0) КАК ЗначениеСумма
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБюджетов.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				абс_Бюджет В (&Бюджет)
	|					И Сценарий В (&Сценарий)
	|					И ВЫБОР
	|						КОГДА &ОтборПоОрганизации
	|							ТОГДА Организация В (&Организация)
	|						ИНАЧЕ НЕ Контрагент В
	|									(ВЫБРАТЬ
	|										СобственныеКонтрагенты.Контрагент
	|									ИЗ
	|										ВТ_СобственныеКонтрагенты КАК СобственныеКонтрагенты)
	|					КОНЕЦ) КАК ОборотыБюджетовОбороты
	|		ПО (ОборотыБюджетовОбороты.СтатьяОборотов = СтатьиОборотовПоБюджетам.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.СтатьяОборотов,
	|	ВТ_Данные.ЦФО,
	|	ВТ_Данные.КодМесяца,
	|	ВТ_Данные.СтатьяРаздел,
	|	ВТ_Данные.КодСценария,
	|	ВТ_Данные.СобственныйКонтрагент,
	|	СУММА(ВТ_Данные.ЗначениеСумма) КАК ЗначениеСумма
	|ПОМЕСТИТЬ ВТ_ДанныеСгруппировано
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	НЕ ВТ_Данные.СтатьяРаздел ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ЦФО,
	|	ВТ_Данные.СтатьяОборотов,
	|	ВТ_Данные.СтатьяРаздел,
	|	ВТ_Данные.СобственныйКонтрагент,
	|	ВТ_Данные.КодМесяца,
	|	ВТ_Данные.КодСценария
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ЦФО КАК ЦФО,
	|	ВТ_Данные.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_Данные.КодМесяца КАК КодМесяца,
	|	ВТ_Данные.КодСценария КАК КодСценария,
	|	ВТ_Данные.СтатьяРаздел КАК РазделБДДС,
	|	ВТ_Данные.ЗначениеСумма КАК ЗначениеСумма,
	|	ВТ_Данные.СобственныйКонтрагент КАК Собственный
	|ИЗ
	|	ВТ_ДанныеСгруппировано КАК ВТ_Данные
	|ГДЕ
	|	НЕ ВТ_Данные.КодМесяца = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Данные.СтатьяРаздел.КодРазделаФормыБДДС,
	|	ВТ_Данные.СтатьяРаздел.КодПодразделаФормыБДДС,
	|	ВТ_Данные.СтатьяРаздел
	|ИТОГИ
	|	СУММА(ЗначениеСумма)
	|ПО
	|	РазделБДДС,
	|	ЦФО,
	|	СтатьяОборотов,
	|	КодМесяца,
	|	КодСценария,
	|	Собственный");
	
	ЗапросДанные.УстановитьПараметр("Период"				, Период);
	
	ЗапросДанные.УстановитьПараметр("ОтборПоОрганизации"	, ЗначениеЗаполнено(Организация));
	ЗапросДанные.УстановитьПараметр("Организация"			, Организация);
	
	ЗапросДанные.УстановитьПараметр("Бюджет"				, Справочники.Бюджеты.БДДС);
	
	МассивСценариев = Новый Массив();
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Бюджет);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.План);
	МассивСценариев.Добавить(Справочники.СценарииПланирования.Факт);
	
	ЗапросДанные.УстановитьПараметр("Сценарий"				, МассивСценариев);
	
	Возврат ЗапросДанные.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
КонецФункции

Функция ПолучитьИтогиПоРазделуРасшифровкиБДДС(ВыборкаРаздел)
	
	СтруктураИтоговПоРазделу = ПолучитьСтруктуруСтрокиРасшифровки();

	ВыборкаЦФО = ВыборкаРаздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаЦФО.Следующий() Цикл

		ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаКодМесяца = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКодМесяца.Следующий() Цикл
				
				ВыборкаКодСценария = ВыборкаКодМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКодСценария.Следующий() Цикл
					
					ТекКлючДанных = "П_0_" + ВыборкаКодСценария.КодСценария + "_" + "М" + "_" + ВыборкаКодСценария.КодМесяца;
					
					Если СтруктураИтоговПоРазделу.Свойство(ТекКлючДанных) = Неопределено Тогда
						СтруктураИтоговПоРазделу.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
					Иначе
						СтруктураИтоговПоРазделу[ТекКлючДанных] = СтруктураИтоговПоРазделу[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
					КонецЕсли;
											
					ВыборкаСобственный = ВыборкаКодСценария.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаСобственный.Следующий() Цикл
						
						ТекКлючДанных = "П_" + ?(ВыборкаСобственный.Собственный, 1, 2) + "_" + ВыборкаСобственный.КодСценария + "_" + "М" + "_" + ВыборкаСобственный.КодМесяца;
							
						Если СтруктураИтоговПоРазделу.Свойство(ТекКлючДанных) = Неопределено Тогда
							СтруктураИтоговПоРазделу.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
						Иначе
							СтруктураИтоговПоРазделу[ТекКлючДанных] = СтруктураИтоговПоРазделу[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;	
		КонецЦикла;		
	КонецЦикла;
	
	РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураИтоговПоРазделу);
	
	Возврат СтруктураИтоговПоРазделу;
	
КонецФункции

Функция ПолучитьСтруктуруСтрокиРасшифровки()
	
	СтруктураПараметров = Новый Структура();
		
	Для СчПериодов = 1 по 12 Цикл
		
		ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "М", СчПериодов);
		
	КонецЦикла;
	
	ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "Н", 12);
	
	ПодготовитьКолонкуСтрокиРасшифровки(СтруктураПараметров, "ПФ", 12, Истина);
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ПодготовитьКолонкуСтрокиРасшифровки(С, ТекКодВидаИтога, ТекНомерПериода, ЭтоПланФакт = Ложь)
	
	Если ЭтоПланФакт Тогда
		Нач = 0;
		Кон = 0;
	Иначе
		Нач = 1;
		Кон = 3;
	КонецЕсли;

	Для СчВидБюджета = Нач по Кон Цикл
		
		//Если ТекНомерПериода = 12 И СчВидБюджета = 3 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		С.Вставить("П_0_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_1_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		С.Вставить("П_2_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериода, 0);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураДанных)
	
	РассчитатьНакопительныйИтогПараметровМакетаРасшифровки(СтруктураДанных, "Н", 1, 12);
			
	РассчитатьПланФактМакетаРасшифровки(СтруктураДанных, "ПФ");
	
КонецПроцедуры

Процедура РассчитатьНакопительныйИтогПараметровМакетаРасшифровки(С, ТекКодВидаИтога, ТекНомерПериодаНач, ТекНомерПериодаКон)
	
	Для ТекНомерПериода = ТекНомерПериодаНач По ТекНомерПериодаКон Цикл
		
		Для СчКодВнутренниеВнешние = 0 по 2 Цикл
			
			Для СчВидБюджета = 1 по 2 Цикл
				
				С["П_" + СчКодВнутренниеВнешние + "_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_" + СчКодВнутренниеВнешние + "_" + СчВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_" + СчКодВнутренниеВнешние + "_" + СчВидБюджета + "_М_" + ТекНомерПериода]
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьПланФактМакетаРасшифровки(С, ТекКодВидаИтога)
	
	ТекВидБюджета = 0;
	ТекНомерПериодаКон = 12;
	
	Для ТекНомерПериода = 1 По 12 Цикл
		
		Если ТекНомерПериода <= МесяцФакт Тогда
			ВидБюджетаПФ = 3;
		Иначе
			ВидБюджетаПФ = 2;
		КонецЕсли;
	
		Для СчКодВнутренниеВнешние = 0 по 2 Цикл
			
			С["П_" + СчКодВнутренниеВнешние + "_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] = С["П_" + СчКодВнутренниеВнешние + "_" + ТекВидБюджета + "_" + ТекКодВидаИтога + "_" + ТекНомерПериодаКон] + С["П_" + СчКодВнутренниеВнешние + "_" + ВидБюджетаПФ + "_М_" + ТекНомерПериода]
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИтогиПоЦФОРасшифровкиБДДС(ВыборкаЦФО)
	
	СтруктураИтоговПоЦФО = ПолучитьСтруктуруСтрокиРасшифровки();

	ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатья.Следующий() Цикл
		
		ВыборкаКодМесяца = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКодМесяца.Следующий() Цикл
			
			ВыборкаКодСценария = ВыборкаКодМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКодСценария.Следующий() Цикл
				
				ТекКлючДанных = "П_0_" + ВыборкаКодСценария.КодСценария + "_" + "М" + "_" + ВыборкаКодСценария.КодМесяца;
				
				Если СтруктураИтоговПоЦФО.Свойство(ТекКлючДанных) = Неопределено Тогда
					СтруктураИтоговПоЦФО.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
				Иначе
					СтруктураИтоговПоЦФО[ТекКлючДанных] = СтруктураИтоговПоЦФО[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
				КонецЕсли;
										
				ВыборкаСобственный = ВыборкаКодСценария.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаСобственный.Следующий() Цикл
					
					ТекКлючДанных = "П_" + ?(ВыборкаСобственный.Собственный, 1, 2) + "_" + ВыборкаСобственный.КодСценария + "_" + "М" + "_" + ВыборкаСобственный.КодМесяца;
						
					Если СтруктураИтоговПоЦФО.Свойство(ТекКлючДанных) = Неопределено Тогда
						СтруктураИтоговПоЦФО.Вставить(ТекКлючДанных, ВыборкаКодСценария.ЗначениеСумма);
					Иначе
						СтруктураИтоговПоЦФО[ТекКлючДанных] = СтруктураИтоговПоЦФО[ТекКлючДанных] + ВыборкаКодСценария.ЗначениеСумма;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;		
	
	РассчитатьИтогиПараметровМакетаРасшифровки(СтруктураИтоговПоЦФО);
	
	Возврат СтруктураИтоговПоЦФО;
	
КонецФункции



