
&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	Ф=Новый Файл(СокрЛП(Объект.ИмяФайла));
	Если Ф.Существует()=0 Тогда
		Сообщить("Указанный файл не существует!");
		Возврат;
	КонецЕсли;
	ВыбФайл = Новый Файл(Объект.ИмяФайла);
	Если ВыбФайл.Существует() Тогда
		Объект.РасширениеФайла = ВыбФайл.Расширение;
		Объект.ID = ВыбФайл.ИмяБезРасширения;
	КонецЕсли;
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище ( Новый ДвоичныеДанные(Объект.ИмяФайла),ЭтаФорма.УникальныйИдентификатор); 
	ПолучитьФайлНаСервере(ДвоичныйФайл);

КонецПроцедуры

&НаСервере
Функция ЗагрузитьМетодом_MSADODB(Знач ФайлEXCEL, Знач ИмяЛиста, Знач СтрокаЗаголовка = 4, НачСтрока = 0, КонСтрока = 0, КолвоСтрокExcel, 
	Знач ПодключениеADODB = "MicrosoftJetOLEDB40") Экспорт
	Перем СonnectionString, ADODBConnection, ADODBRecordset, ТекстЗапроса;
	Перем КолвоКолонокExcel, Поле, Колонка, ИмяКолонки;
	Перем НоваяСтрока, НомерСтроки;
	Перем ТаблицаРезультат;
	
	// Нумерация MS ADODB начинается с 1.
	
	// Переменная "СтрокаЗаголовка", не используется, т.к. HDR=YES, а не HDR=NO.
	// HDR=YES:
	// 1. Считывание заголовков колонок с 1-ой строки.
	// 2. Считываемые данные со 2-ой и последующих строк типизированы. Для варианта HDR=NO: считываемые данные - строка.
	
	// Строка соединения - определение драйвера, который будет использован для подключения к файлу EXCEL.
	Если ПодключениеADODB = "MicrosoftACEOLEDB12" Тогда
		
		// ACE.OLEDB.12.0 - Для использования данного подключения необходимо дополнительное ПО:
		// Microsoft Access Database Engine 2010 Redistributable 32/64 bit.
		//Для корректной работы также установил:
		//http://www.microsoft.com/en-us/download/details.aspx?id=13255
		//http://www.microsoft.com/en-us/download/details.aspx?id=23734		
		
		СonnectionString = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 12.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	Иначе
		
		// Jet.OLEDB.4.0 - Стандартное подключение, как правило, не требующее установки дополнительного ПО. 
		// Рекомендуется установить последний Service Pack Windows.
		СonnectionString = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ФайлEXCEL) + ";Extended Properties=""Excel 8.0;HDR=NO;IMEX=1;""";
		
		// Еще один вариант.
		//СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls)};Dbq=" + СокрЛП(ФайлEXCEL) + ";";
		
	КонецЕсли;
	
	Попытка
		// Инициализация основного объекта ADODB.Connection. Открытие соединения.
		ADODBConnection = Новый COMОбъект("ADODB.Connection");
		ADODBConnection.ConnectionString =  СonnectionString;
		ADODBConnection.Open();
		// Импирически определенный параметр для правильного определения количества строк листа.
		ADODBConnection.CursorLocation = 3;    // По-умолчанию 2.
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	ТекстЗапроса = "SELECT * FROM [" + ИмяЛиста + "$]";
	
	// Создание Recordset. Дочерний объект ADODBConnection. Набор записей по запросу.
	Попытка
		ADODBRecordset = Новый COMОбъект("ADODB.Recordset");
		ADODBRecordset.Open(ТекстЗапроса, ADODBConnection);
		
		// Проверка заполненности листа.
		Если (ADODBRecordset.EOF ИЛИ ADODBRecordset.BOF) Тогда
			КолвоСтрокExcel = 0;
			Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
			
			// Завершение работы.
			// Закрытие Объектов.
			ADODBRecordset.Close();
			ADODBConnection.Close();
			ADODBRecordset   = Неопределено;
			ADODBConnection = Неопределено;
			
			Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
		КонецЕсли;
		
		// Импирически определенные параметры для правильного определения количества строк листа.
		ADODBRecordset.AbsolutePage     = 1;
		ADODBRecordset.AbsolutePosition = 1;
	Исключение
		Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецПопытки;
	
	// Параметр, возвращаемый в вызывающую процедуру.
	КолвоСтрокExcel = ADODBRecordset.RecordCount + 1;    // (+1) - учет Строки-Заголовока, которая "съедается".
	КолвоКолонокExcel = ADODBRecordset.Fields.Count;
	
	// Проверка заполненности листа.
	Если КолвоСтрокExcel <= 2 Тогда
		КолвоСтрокExcel = 0;
		Сообщить(НСтр("ru = '" + ИмяЛиста + ": не содержит данных.'"), СтатусСообщения.Внимание);
		
		// Завершение работы.
		// Закрытие Объектов.
		ADODBRecordset.Close();
		ADODBConnection.Close();
		ADODBRecordset   = Неопределено;
		ADODBConnection = Неопределено;
		
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из EXCEL данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла EXCEL.
	
	//ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	//ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолвоКолонокExcel Цикл
		
		Поле = ADODBRecordset.Fields.Item(ит - 1);
		ИмяКолонки = "К_" + ит;
		//ИмяКолонки = Поле.Value;
		//Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, , СокрЛП(СтрЗаменить(Поле.Name, "#", ".")));
		ИмяКолонки = ЗаменитьСимволы(ИмяКолонки);
		Колонка = ТаблицаРезультат.Колонки.Добавить(ИмяКолонки, ,ИмяКолонки);
		
		// Замена "#" на ".", т.к. при считывании ADODB "." в имени колонки заменяется на "#".
	КонецЦикла;
	
	// ТаблицаРезультат: 1-я строка - Строка-Заголовок.
	
	// Добавление этой строки обусловлено исключительно из соображений идентичности содержимого файла EXCEL и ТаблицыЗначений,
	// выводимой на форме Обработки, и дальнейшей обработки строки заголовка
	// с целью сопоставления колонок EXCEL и реквизитов 1С: для Справочников, ПВХ, Регистров, Документов.
	
	// Если в Вашей обработке в результирующей таблице в качестве 1-ой строки не нужна Строка-Заголовок, то
	// следует закомментировать следующий цикл:
	//НоваяСтрока = ТаблицаРезультат.Добавить();
	//НоваяСтрока.НомерСтроки = 1;
	//Для ит = 1 ПО КолвоКолонокExcel Цикл
	//	
	//	ИмяКолонки = "К_" + ит;
	//	Колонка = ТаблицаРезультат.Колонки.Найти(ИмяКолонки);
	//	НоваяСтрока[ИмяКолонки] = Колонка.Заголовок;
	//	
	//КонецЦикла;
	
	// ТаблицаРезультат: Формирование строк по указанному диапазону: НачСтрока - КонСтрока.
	
	НомерСтроки = 1;
	НачСтрока =  СтрокаЗаголовка+1;
	Пока ADODBRecordset.EOF() = 0 Цикл
		
		//НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки < НачСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			ADODBRecordset.MoveNext();             // Следующая строка.
			//Продолжить;
			НомерСтроки = НомерСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		Если КонСтрока > 0 И НомерСтроки > КонСтрока Тогда    // Номер строки вне диапазона считываемых строк.
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		//НоваяСтрока.НомерСтроки = НомерСтроки;
		
		Для ит = 1 ПО КолвоКолонокExcel Цикл
			
			Поле = ADODBRecordset.Fields.Item(ит - 1);
			
			Если Поле.ActualSize = 0 Тогда        // Пустое поле EXCEL.
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = Поле.Value;        // Учитывая параметр HDR=YES в строке соединения, данные считываются в соответствии с их типом.
			
			ИмяКолонки = ит-1;
			НоваяСтрока[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			//ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			//ДлинаСтроки      = СтрДлина(СокрЛП(ЗначениеЯчейки));
			//ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
			
		КонецЦикла;
		
		ADODBRecordset.MoveNext();   // Следующая строка.
		
	КонецЦикла;
	
	//УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	// Завершение работы.
	// Закрытие Объектов.
	ADODBRecordset.Close();
	ADODBConnection.Close();
	ADODBRecordset   = Неопределено;
	ADODBConnection = Неопределено;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Процедура ПолучитьФайлНаСервере(ДвоичныйФайл);
	
	ДанныеДокумента = ПолучитьИзВременногоХранилища(ДвоичныйФайл);
	ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" + Объект.ID + Объект.РасширениеФайла;
	ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	
	ФайлEXCEL = ИмяФайлаДляЗагрузки ;
	ИмяЛиста = "TDSheet";
	КолвоСтрокExcel = 1;
	СписокНоменклатуры = ЗагрузитьМетодом_MSADODB(ФайлEXCEL,ИмяЛиста,3,,, КолвоСтрокExcel,"MicrosoftACEOLEDB12");
	
	НоменклатурныеПозиции = Новый ТаблицаЗначений;
	
	НоменклатурныеПозиции.Колонки.Добавить("Тип");                         //К_4
	НоменклатурныеПозиции.Колонки.Добавить("Категория");                   //К_5
	НоменклатурныеПозиции.Колонки.Добавить("Подкатегория1");               //К_6
	НоменклатурныеПозиции.Колонки.Добавить("Подкатегория2");               //К_7
	НоменклатурныеПозиции.Колонки.Добавить("ТорговаяМарка");               //К_8
	НоменклатурныеПозиции.Колонки.Добавить("Название");       		       //К_9
	НоменклатурныеПозиции.Колонки.Добавить("Одиночные");       		       //К_19
	НоменклатурныеПозиции.Колонки.Добавить("ФорматУпаковки");   	       //К_20
	НоменклатурныеПозиции.Колонки.Добавить("СводноеНаименование");   	   //К_21
	НоменклатурныеПозиции.Колонки.Добавить("Consumer_product");     	   //К_22
	НоменклатурныеПозиции.Колонки.Добавить("Потребление");     	           //К_23
	
	
	НоменклатурныеПозиции.Колонки.Добавить("Код");                         //К_2
	НоменклатурныеПозиции.Колонки.Добавить("Артикул");                     //К_3
	НоменклатурныеПозиции.Колонки.Добавить("Наименование");                //К_10
	НоменклатурныеПозиции.Колонки.Добавить("ФокусныйАссортимент");         //К_15
	НоменклатурныеПозиции.Колонки.Добавить("Новинка");                     //К_16
	НоменклатурныеПозиции.Колонки.Добавить("КоличествоВложений");          //К_17
	НоменклатурныеПозиции.Колонки.Добавить("ВесВложения");                 //К_18
	НоменклатурныеПозиции.Колонки.Добавить("Вес");                         //К_13
	
	
	Для каждого Строка из СписокНоменклатуры Цикл
		
					
			ТекСтр = НоменклатурныеПозиции.Добавить();
			
			ТекСтр.Тип                          = Строка.К_4;
			ТекСтр.Категория                    = Строка.К_5;
			ТекСтр.Подкатегория1                = Строка.К_6;
			ТекСтр.Подкатегория2                = Строка.К_7;
			ТекСтр.ТорговаяМарка                = Строка.К_8;
			ТекСтр.Название            		    = Строка.К_9;
			ТекСтр.Одиночные            		= Строка.К_19;
			ТекСтр.ФорматУпаковки            	= Строка.К_20;
			ТекСтр.СводноеНаименование          = Строка.К_21;
			ТекСтр.Consumer_product             = Строка.К_22;
			ТекСтр.Потребление 		            = Строка.К_23;
			
			ТекСтр.Код                          = Строка.К_2;
			ТекСтр.Артикул                      = Строка.К_3;
			ТекСтр.Наименование                 = Строка.К_10;
			ТекСтр.ФокусныйАссортимент          = Строка.К_15;
			ТекСтр.Новинка                      = Строка.К_16;
			ТекСтр.КоличествоВложений           = Строка.К_17;
			ТекСтр.ВесВложения                  = Строка.К_18;
			ТекСтр.Вес                          = Строка.К_13;	
		
	КонецЦикла;

	Для каждого Строка из НоменклатурныеПозиции Цикл		
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",строка.Артикул);
			Попытка
			
				Номенклатура = Номенклатура.ПолучитьОбъект();
				НоменклатурнаяПозиция = Номенклатура.Ссылка;				
				
				// Тип
				Тип = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ТипНоменклатуры;
				Т = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Тип,Строка.Тип);
				Если НЕ ЗначениеЗаполнено(Т) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Тип,Строка.Тип);										
				КонецЕсли;
				
				// Категория
				Категория = ПланыВидовХарактеристик.СвойстваОбъектов.абс_КатегорияНоменклатуры;
				Кат = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Категория,Строка.Категория);
				Если НЕ ЗначениеЗаполнено(Кат) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Категория,Строка.Категория);														
				КонецЕсли;
				
				// Подкатегория1
				Подкатегория1 = ПланыВидовХарактеристик.СвойстваОбъектов.абс_Подкатегория1;
				ПК1 = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Подкатегория1,Строка.Подкатегория1);
				Если НЕ ЗначениеЗаполнено(ПК1) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Подкатегория1,Строка.Подкатегория1);															
				КонецЕсли;
				
				// Подкатегория2
				Подкатегория2 = ПланыВидовХарактеристик.СвойстваОбъектов.абс_Подкатегория2;
				ПК2 = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Подкатегория2,Строка.Подкатегория2);
				Если НЕ ЗначениеЗаполнено(ПК2) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Подкатегория2,Строка.Подкатегория2);														
				КонецЕсли;
				
				// ТорговаяМарка
				ТорговаяМарка = ПланыВидовХарактеристик.СвойстваОбъектов.ТорговаяМарка;
				ТогМар = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,ТорговаяМарка,Строка.ТорговаяМарка);
				Если НЕ ЗначениеЗаполнено(ТогМар) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,ТорговаяМарка,Строка.ТорговаяМарка);						
				КонецЕсли;
				
				// Название
				Название = ПланыВидовХарактеристик.СвойстваОбъектов.абс_НазваниеНоменклатуры;
				Наз = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Название,Строка.Название);
				Если НЕ ЗначениеЗаполнено(Наз) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Название,Строка.Название);				
				КонецЕсли;
				
				// Одиночные
				Одиночные = ПланыВидовХарактеристик.СвойстваОбъектов.абс_Одиночные;
				ОДН = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Одиночные,Строка.Одиночные);
				Если НЕ ЗначениеЗаполнено(ОДН) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Одиночные,Строка.Одиночные);			
				КонецЕсли;
				
				// ФорматУпаковки
				ФорматУпаковки = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ФорматУпаковки;
				ФУ = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,ФорматУпаковки,Строка.ФорматУпаковки);
				Если НЕ ЗначениеЗаполнено(ФУ) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,ФорматУпаковки,Строка.ФорматУпаковки);			
				КонецЕсли;
				
				// СводноеНаименование
				СводноеНаименование = ПланыВидовХарактеристик.СвойстваОбъектов.абс_СводноеНаименование;
				СН = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,СводноеНаименование,Строка.СводноеНаименование);
				Если НЕ ЗначениеЗаполнено(СН) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,СводноеНаименование,Строка.СводноеНаименование);			
				КонецЕсли;
				
				// Consumer_product
				Consumer_product = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ConsumerProduct;
				СР = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Consumer_product,Строка.Consumer_product);
				Если НЕ ЗначениеЗаполнено(СР) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Consumer_product,Строка.Consumer_product);					
				КонецЕсли;
				
				// Потребление
				Потребление = ПланыВидовХарактеристик.СвойстваОбъектов.абс_Потребление;
				Потр = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Потребление,Строка.Потребление);
				Если НЕ ЗначениеЗаполнено(Потр) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Потребление,Строка.Потребление);		
				КонецЕсли;
				
				// Фокусный ассортимент
				ФокусныйАссортимент = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ФокусныйАссортимент;
				ФА = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,ФокусныйАссортимент,Строка.ФокусныйАссортимент);
				Если ФА = СокрЛП("") Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,ФокусныйАссортимент,Строка.ФокусныйАссортимент);			
				КонецЕсли;	
				
				// Новинка
				Новинка = ПланыВидовХарактеристик.СвойстваОбъектов.лео_Новинка;
				Нов = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,Новинка,Строка.Новинка);
				Если Нов = СокрЛП("") Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,Новинка,Строка.Новинка);		
				КонецЕсли;	
				
				// КоличествоВложенийМаркетинг
				КоличествоВложенийМаркетинг = ПланыВидовХарактеристик.СвойстваОбъектов.лео_КоличествоВложенийМаркетинг;
				КВМ = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,КоличествоВложенийМаркетинг,Строка.КоличествоВложений);
				Если НЕ ЗначениеЗаполнено(КВМ) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,КоличествоВложенийМаркетинг,Строка.КоличествоВложений);
				КонецЕсли;	
				
				// ВесВложенияМаркетинг
				ВесВложенияМаркетинг = ПланыВидовХарактеристик.СвойстваОбъектов.лео_ВесВложенияМаркетинг;
				ВВМ = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,ВесВложенияМаркетинг,Строка.ВесВложения);
				Если НЕ ЗначениеЗаполнено(ВВМ) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,ВесВложенияМаркетинг,Строка.ВесВложения);
				КонецЕсли;		
				
				//ВесМаркетинг
				ВесМаркетинг = ПланыВидовХарактеристик.СвойстваОбъектов.лео_ВесМаркетинг;
				ВМ = ПрочитатьЗначениеСвойства(НоменклатурнаяПозиция,ВесМаркетинг,Строка.Вес);
				Если НЕ ЗначениеЗаполнено(ВМ) Тогда					
					ЗаписатьЗначениеСвойства(НоменклатурнаяПозиция,ВесМаркетинг,Строка.Вес);	
				КонецЕсли;										
				
			Исключение 
				Сообщить("Не найдена позиция: " + Строка.Артикул);
           КонецПопытки;	
				
	   КонецЦикла;	
	   
	   Сообщить("Загрузка завершена!");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначениеСвойства(Объект, Свойство, Значение)
	
	НаборЗаписейРегистра = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.Объект.Установить(Объект);
	НаборЗаписейРегистра.Отбор.Свойство.Установить(Свойство);
	
	СтрокаНабора = НаборЗаписейРегистра.Добавить();
	СтрокаНабора.Объект = Объект;
	СтрокаНабора.Свойство = Свойство;
	СтрокаНабора.Значение = Значение;
	
	НаборЗаписейРегистра.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьЗначениеСвойства(Объект, Свойство, Значение)

	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Объект);
	Отбор.Вставить("Свойство", Свойство);
	Структура = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор);
	
	Возврат СокрЛП(Структура.Значение);
	
КонецФункции		


&НаСервере
Функция ЗаменитьСимволы(Стр)
	Стр = СтрЗаменить(Стр, " ", "");
	Стр = СтрЗаменить(Стр, "-", "");
	Стр = СтрЗаменить(Стр, "/", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, ".", "");
	Стр = СтрЗаменить(Стр, "№", "");
	Стр = СтрЗаменить(Стр, "(", "");
	Стр = СтрЗаменить(Стр, ")", "");
	Возврат Стр;
КонецФункции

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ФильтрРасширенияФайлов = "" Тогда
		Объект.ФильтрРасширенияФайлов = "Документ Exel (*.xls)|*.xls|Документ Exel 2007(*.xlsx)|*.xlsx";
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Exel(*.xls)|*.xls|Документ Exel 2007(*.xmlx)|*.xlsx";//Объект.ФильтрРасширенияФайлов;
	Если Диалог.Выбрать() Тогда
		Объект.ИмяФайла = Диалог.ПолноеИмяФайла; 
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ФайлОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.ИмяФайла);
	
КонецПроцедуры


	