Функция ПолучитьХозяйственнуюОперациюДляДокументаПоУмолчанию(ИмяДокумента) Экспорт
	
	//Возврат Неопределено;
	
	ТипДокумента = Тип("ДокументСсылка." + ИмяДокумента);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ХозяйственныеОперацииПУБ77.Ссылка
	|ИЗ
	|	Справочник.абс_ХозяйственныеОперацииПУБ77 КАК абс_ХозяйственныеОперацииПУБ77
	|ГДЕ
	|	абс_ХозяйственныеОперацииПУБ77.ТипМетаданных.ТипМетаданныхСсылка = &ТипЗначенияПустаяСсылка
	|	И абс_ХозяйственныеОперацииПУБ77.ОсновнаяНастройка");
	
	Запрос.УстановитьПараметр("ТипЗначенияПустаяСсылка", Новый(Тип("ДокументСсылка." + ИмяДокумента)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
