
&НаКлиенте
Процедура КомандаВвестиФакт(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ФактСумма"		, ФактСумма);
	СтруктураПараметров.Вставить("ФактСуммаБезНДС"	, ФактСуммаБезНДС);
	СтруктураПараметров.Вставить("ФактКоличество"	, ФактКоличество);
		
	ЭтаФорма.Закрыть(СтруктураПараметров);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ФактСумма			= ЭтаФорма.Параметры.ФактСумма;
	ЭтаФорма.ФактСуммаБезНДС	= ЭтаФорма.Параметры.ФактСуммаБезНДС;
	
	ЭтаФорма.ФактКоличество		= ЭтаФорма.Параметры.ФактКоличество;

КонецПроцедуры
