
&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	 	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	

	//ЛефЭкспо -----------------------------------------------------------------------------------------------------------------------
	
	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;
	
		//Леовит
	
		Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095"); //Леовит
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095"); //Леовит
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;
	
	// Эйкос -----------------------------------------------------------------------------------------------------------------------
	
	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7715889630"); // Эйкос
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Eikos_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7715889630"); // Эйкос
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Eikos_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7715889630");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Eikos_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7715889630");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Eikos_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\air\sales\cube\1С\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;

	
КонецПроцедуры
