
&НаКлиенте
Процедура СвойствоПриИзменении(Элемент)
	
	Если Объект.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения") Тогда
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Номенклатура");	
	Иначе
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Свойство");
	КонецЕсли;
	
	УстановитьВидимостьКолонкиСвойство();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения") Тогда
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Номенклатура");	
	Иначе
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Свойство");
	КонецЕсли;

	УстановитьВидимостьКолонкиСвойство();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонкиСвойство()
	
	Если ЗначениеЗаполнено(Объект.Свойство) Тогда
		МассивСтрокКУдалению = Новый Массив;
		Для Каждого СтрокаТаб ИЗ Объект.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТаб.Свойство) И СтрокаТаб.Свойство <> Объект.Свойство Тогда
				МассивСтрокКУдалению.Добавить(СтрокаТаб);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСтрокКУдалению.Количество() > 0 
			И Вопрос("В строках табличной части присутствуют строки со свойством, отличным от свойства, указанного в шапке. Удалить такие строки?",
			РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлементМассива Из МассивСтрокКУдалению Цикл
			Объект.Товары.Удалить(ЭлементМассива);
		КонецЦикла;
		
		Элементы.Товары.ПодчиненныеЭлементы.ТоварыСвойство.Видимость = Ложь;
		
	Иначе
		Элементы.Товары.ПодчиненныеЭлементы.ТоварыСвойство.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И ЗначениеЗаполнено(Объект.Свойство) Тогда
		Элементы.Товары.ТекущиеДанные.Свойство = Объект.Свойство;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора(ПутьКДанным)
	
	Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", ПутьКДанным);
	Связи = Новый Массив;
	Связи.Добавить(Связь);
	Элементы.ТоварыЗначениеСвойства.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыСвойствоПриИзменении(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения") Тогда
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Номенклатура");	
	Иначе
		УстановитьСвязиПараметровВыбора("Элементы.Товары.ТекущиеДанные.Свойство");
	КонецЕсли;

КонецПроцедуры

