
Перем ТЗвыпуск, ТЗвыпускЗатраты, ТЗзатрат, _ПромТЗ, ТЗ_Прод ;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
	
КонецПроцедуры



&НаКлиенте
Процедура Заполнить(Команда)
	// Вставить содержимое обработчика.
	
	Объект.УчетЗатрат.Очистить();
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	
	 ПолучитьТЗ(Объект.Дата);
	
	
КонецПроцедуры


Функция ПолучитьТЗ(Период)
	
	ТЗвыпускЗатраты = Новый ТаблицаЗначений;
	
	
	ТЗвыпускЗатраты.Колонки.Добавить("АналитикаВидаУчета");
	ТЗвыпускЗатраты.Колонки.Добавить("АналитикаРаспределенияЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("П_АналитикаРаспределенияЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("КоличествоВыпуска");
	ТЗвыпускЗатраты.Колонки.Добавить("СтоимостьВыпуска");
	ТЗвыпускЗатраты.Колонки.Добавить("Продукция");
	ТЗвыпускЗатраты.Колонки.Добавить("НоменклатурнаяГруппа");
	ТЗвыпускЗатраты.Колонки.Добавить("СерияПродукции");
	ТЗвыпускЗатраты.Колонки.Добавить("Спецификация");
	ТЗвыпускЗатраты.Колонки.Добавить("Подразделение");
	
	ТЗвыпускЗатраты.Колонки.Добавить("Затрата");
	ТЗвыпускЗатраты.Колонки.Добавить("КоличествоЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("СтоимостьЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("СтатьяЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("НоменклатураЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("СерияЗатраты");
	ТЗвыпускЗатраты.Колонки.Добавить("АналитикаВидаУчетаЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("ВидВоспроизводства");
	ТЗвыпускЗатраты.Колонки.Добавить("ПоискПроизведен");
	ТЗвыпускЗатраты.Колонки.Добавить("ТЗ");
	ТЗвыпускЗатраты.Колонки.Добавить("ТЗРодительКоличество");
	ТЗвыпускЗатраты.Колонки.Добавить("КоличествоСогласноНормативуНаЕд");
	ТЗвыпускЗатраты.Колонки.Добавить("ВесПродукции");
	ТЗвыпускЗатраты.Колонки.Добавить("ВесПродукцииЕд");

	
	
	
	// Затраты
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.Ссылка
	|ПОМЕСТИТЬ АналитикаВыпуска
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ГДЕ
	|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетЗатрат.КорАналитикаРаспределенияЗатрат КАК АналитикаРаспределенияЗатрат,
	|	УчетЗатрат.Стоимость КАК СтоимостьЗатрат,
	|	УчетЗатрат.Количество * ВЫБОР
	|		КОГДА РегистрАналитикаУчетаЗатрат.Затрата = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ &ЕдиницыКоличестваВОтчете = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	|			ТОГДА РегистрАналитикаУчетаЗатрат.Затрата.ЕдиницаХраненияОстатков.Коэффициент
	|		ИНАЧЕ РегистрАналитикаУчетаЗатрат.Затрата.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаУчетаЗатрат.Затрата.ЕдиницаДляОтчетов.Коэффициент
	|	КОНЕЦ КАК КоличествоЗатрат,
	|	ВЫБОР
	|		КОГДА РегистрАналитикаУчетаЗатрат.Затрата = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА РегистрАналитикаУчетаЗатрат.СтатьяЗатрат
	|		ИНАЧЕ РегистрАналитикаУчетаЗатрат.Затрата
	|	КОНЕЦ КАК Затрата,
	|	РегистрАналитикаУчетаЗатрат.СтатьяЗатрат,
	|	РегистрАналитикаУчетаЗатрат.Затрата КАК НоменклатураЗатрат,
	|	РегистрАналитикаУчетаЗатрат.ХарактеристикаЗатраты,
	|	РегистрАналитикаУчетаЗатрат.СерияЗатраты,
	|	РегистрАналитикаУчетаЗатрат.Качество,
	|	РегистрАналитикаУчетаЗатрат.ХарактерЗатрат,
	|	РегистрАналитикаУчетаЗатрат.СпособРаспределенияЗатрат,
	|	УчетЗатрат.КорАналитикаВидаУчета КАК АналитикаВидаУчета
	|ИЗ
	|	РегистрНакопления.УчетЗатрат КАК УчетЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаЗатрат КАК РегистрАналитикаУчетаЗатрат
	|		ПО УчетЗатрат.АналитикаУчетаЗатрат = РегистрАналитикаУчетаЗатрат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
	|		ПО УчетЗатрат.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
	|			И (РегистрАналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Затраты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрКорАналитикаВидаУчета
	|		ПО УчетЗатрат.АналитикаВидаУчета = РегистрКорАналитикаВидаУчета.Ссылка
	|			И (РегистрКорАналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.ЗатратыНаВыпуск)
	|				ИЛИ РегистрКорАналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск))
	|ГДЕ
	|	УчетЗатрат.Активность
	|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И УчетЗатрат.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УчетЗатрат.КорАналитикаВидаУчета В
	|			(ВЫБРАТЬ
	|				АналитикаВыпуска.Ссылка
	|			ИЗ
	|				АналитикаВыпуска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АналитикаРаспределенияЗатрат";
	//|	И УчетЗатрат.Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену";
	
	ЕдиницыКоличестваВОтчете = 1;
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(Период,-1)));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		ТЗзатрат = Результат.Выгрузить();
	КонецЕсли;
	
	
	
	
	
	ФактВыпускиЗаПериод(Период);	
	
	
	// соберем выходную таблицу
	
	ТЗ_Прод = Новый ТаблицаЗначений;
	
	ТЗ_Прод.Колонки.Добавить("Номенклатура");
	ТЗ_Прод.Колонки.Добавить("НоменклатураАртикул");
	ТЗ_Прод.Колонки.Добавить("НоменклатураКоличество");
	ТЗ_Прод.Колонки.Добавить("СерияНоменклатуры");
	ТЗ_Прод.Колонки.Добавить("Продукция");
	ТЗ_Прод.Колонки.Добавить("ПродукцияАртикул");
	ТЗ_Прод.Колонки.Добавить("СерияПродукции");
	ТЗ_Прод.Колонки.Добавить("ПродукцияКоличество");
	ТЗ_Прод.Колонки.Добавить("СтоимостьВыпуска");
	ТЗ_Прод.Колонки.Добавить("Спецификация");
	ТЗ_Прод.Колонки.Добавить("КоличествоЗатрат");
	ТЗ_Прод.Колонки.Добавить("КоличествоНаЕдиницу");	
	ТЗ_Прод.Колонки.Добавить("Цена");
	ТЗ_Прод.Колонки.Добавить("СтоимостьЗатратПрайс");
	ТЗ_Прод.Колонки.Добавить("СтоимостьЗатрат");
	ТЗ_Прод.Колонки.Добавить("ВесПродукции");
	ТЗ_Прод.Колонки.Добавить("ВесПродукцииЕд");
	ТЗ_Прод.Колонки.Добавить("СтатьяЗатрат");
	ТЗ_Прод.Колонки.Добавить("ВидВоспроизводства");
	
	ТЗ_Прод.Колонки.Добавить("СерияЗатраты");
	
	
	
	
	Для каждого стр из ТЗвыпуск цикл
		
		//мСтр = ТЗвыпускЗатраты.НайтиСтроки(Новый Структура("Продукция,СерияПродукции",стр.Продукция,стр.СерияПродукции));  
		мСтр = ТЗвыпускЗатраты.НайтиСтроки(Новый Структура("П_АналитикаРаспределенияЗатрат",стр.АналитикаРаспределенияЗатрат));  
		Если мСтр.Количество() > 0 тогда 
			Для каждого ее из мСтр цикл
				Если ее.ТЗ <> неопределено тогда
					Если ее.ТЗ.Количество() > 0 тогда // п/ф
						ЗаполнитьТЗ_Прод(ее.ТЗ,стр);	
					иначе // выпуск полуфабриката произведен в другом периоде	 
						лл = ТЗ_Прод.Добавить();
						ЗаполнитьЗначенияСвойств(лл,ее);
						_ЗаполнитьЗначенияТЗ_Прод(лл,ее);
					КонецЕсли;	 
				иначе
					лл = ТЗ_Прод.Добавить();
					ЗаполнитьЗначенияСвойств(лл,ее);
					_ЗаполнитьЗначенияТЗ_Прод(лл,ее);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	
	
	// в отдельных колонках вид номенклатуры
	ТЗ_Прод.Колонки.Добавить("ГруппаПродукции");
	ТЗ_Прод.Колонки.Добавить("ГруппаНоменклатуры");
	Для каждого стр из ТЗ_Прод цикл
		стр.ГруппаПродукции = стр.Продукция.ВидНоменклатуры; 
		стр.ГруппаНоменклатуры = стр.Номенклатура.ВидНоменклатуры;
	КонецЦикла;
	
	
	
	
	ТЗ_Прод.Свернуть("Продукция,СерияПродукции,Номенклатура,СерияЗатраты,СтатьяЗатрат,ПродукцияКоличество,ВидВоспроизводства","КоличествоЗатрат,СтоимостьЗатрат");
	ТЗ_Прод.Сортировать("Продукция,СерияПродукции,Номенклатура");
	
	Объект.УчетЗатрат.Очистить();
	Для каждого нн из ТЗ_Прод цикл
		  стр = Объект.УчетЗатрат.Добавить();
		  стр.Продукция           = нн.Продукция;
		  стр.ПродукцияСерия      = нн.СерияПродукции;
		  стр.Номенклатура        = нн.Номенклатура;
		  стр.СерияНоменклатуры   = нн.СерияЗатраты;
		  стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
		  стр.КоличествоПродукции = нн.ПродукцияКоличество;
		  стр.КоличествоЗатрат    = нн.КоличествоЗатрат;
		  стр.СтоимостьЗатрат     = нн.СтоимостьЗатрат;
		  стр.ВидНоменклатуры     = нн.Номенклатура.ВидНоменклатуры;
		  
		// Сахар измельченный
		Если стр.Номенклатура.Артикул = "П0001145" или стр.Номенклатура.Артикул = "П0001145_ИКГ17_250" или
			 стр.Номенклатура.Артикул = "П0001145_ИГК19_390" или стр.Номенклатура.Артикул = "П0001145_ИГК19_000" тогда
			 
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000001012"); //Сахар
		КонецЕсли;	 
			
		//Кислота лимонная измельченная П/Ф
		Если стр.Номенклатура.Артикул = "П0000287" или стр.Номенклатура.Артикул = "П0000287_ИГК19_000" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000000341");
		КонецЕсли;
		
		//Соль измельченная
		Если стр.Номенклатура.Артикул = "П0001149" или стр.Номенклатура.Артикул = "П0001149_ИГК19_000"
			или стр.Номенклатура.Артикул = "П0001149_ИГК19_390"
			тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000001074");
		КонецЕсли;
		
		  
		//Курага стерильная высушенная (пониженная влажность)  
		Если стр.Номенклатура.Артикул = "П0001811" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000048446");
     		 стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1176.470; // спецификация

		КонецЕсли;
		  
		
		//Изюм высушенный (пониженная влажность)
		Если стр.Номенклатура.Артикул = "П0001662" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000003986");
     		 стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1020.408; // спецификация

		КонецЕсли;
		
		//Хлопья овсяные НТВ сушеные
		Если стр.Номенклатура.Артикул = "П0000623" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000000174");
     		 стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1081.090; // спецификация

		КонецЕсли;
		
		
		
		
		//Сок черной смородины с аскорбиновой кислотой, кг П/Ф
		Если стр.Номенклатура.Артикул = "П0001581" тогда
			
			//Сок черной смородины
		  //стр = Объект.УчетЗатрат.Добавить();
		  стр.Продукция           = нн.Продукция;
		  стр.ПродукцияСерия      = нн.СерияПродукции;
		  стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
		  стр.КоличествоПродукции = нн.ПродукцияКоличество;
		  стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000048426");
     	  стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1111.111; // спецификация
		  стр.СтоимостьЗатрат     = 0;

			 // Кислота аскорбиновая
		  стр = Объект.УчетЗатрат.Добавить();
		  стр.Продукция           = нн.Продукция;
		  стр.ПродукцияСерия      = нн.СерияПродукции;
		  стр.Номенклатура        = Справочники.Номенклатура.НайтиПоКоду("М0000000340");;
		  стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
		  стр.КоличествоПродукции = нн.ПродукцияКоличество;
		  стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 0.270; // спецификация
		  стр.СтоимостьЗатрат     = 0;
			 
			 
		КонецЕсли;
		
		
		
		///////////////////////////////////////////////////////////////////////////////
		// Если полуфабрикат, то ищем по нормативам
		Если стр.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004")  // полуфабрикат 
				И нн.ВидВоспроизводства <> Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка			
           тогда
			
			
			_ПФ = стр.Номенклатура; _ПФкол = стр.КоличествоЗатрат;
			//_спец = абс_Дистрибуция._пОпределитьСпецификациюПоУмолчанию(стр.Номенклатура,,,);
			_спец = пОпределитьСпецификациюПоУмолчанию(стр.Номенклатура,,,);			
			Если _спец <> неопределено тогда
				_УрРазузлования = абс_Дистрибуция.Лео_ПолучитьКоличествоУровнейРазузлования(_спец,стр.КоличествоЗатрат,1,КонецДня(Период));
				_Стр = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(_спец,стр.КоличествоЗатрат,_УрРазузлования,1,_спец.ДатаУтверждения);
				
				Если _Стр.ИсходныеКомплектующие.Количество() > 0 тогда
					_счИсхКомп = 0;
					Для каждого ее из _Стр.ИсходныеКомплектующие цикл
						
						Если _счИсхКомп = 1 тогда				  
							стр = Объект.УчетЗатрат.Добавить();
						Конецесли;
						стр.Продукция           = нн.Продукция;
						стр.ПродукцияСерия      = нн.СерияПродукции;
						стр.Номенклатура        = ее.Номенклатура;
						стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
						стр.КоличествоПродукции = нн.ПродукцияКоличество;
						стр.КоличествоЗатрат    = ее.Количество; // спецификация
						стр.СтоимостьЗатрат     = 0;
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("! Продукция: " + сокрлп(стр.Продукция) + " Серия: " + сокрлп(стр.ПродукцияСерия)); 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("+ П/Ф: " + сокрлп(_ПФ) + " Количество: " + сокрлп(_ПФкол)); 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура: " + сокрлп(стр.Номенклатура) + " КоличествоЗатрат: " + сокрлп(стр.КоличествоЗатрат)); 
						
						_счИсхКомп = 1;	  
					КонецЦикла;
				Конецесли;
			КонецЕсли;				
		КонецЕсли;				
		
		
		
    стр.ПродукцияСерияСтрока      = сокрлп(стр.ПродукцияСерия);
    стр.ВидНоменклатуры           = стр.Номенклатура.ВидНоменклатуры;
		
		
	КонецЦикла;
	  
	
	
	// Свернуть Объект.УчетЗатрат
	ТЗсвернуть = Объект.УчетЗатрат.Выгрузить();  
	ТЗсвернуть.Свернуть("Продукция,ПродукцияСерия,Номенклатура,СерияНоменклатуры,ВидНоменклатуры,СтатьяЗатрат,КоличествоПродукции,ПродукцияСерияСтрока","КоличествоЗатрат,СтоимостьЗатрат");
	Объект.УчетЗатрат.Очистить();
	Для каждого хх из ТЗсвернуть цикл
		дд = Объект.УчетЗатрат.Добавить();
		ЗаполнитьЗначенияСвойств(дд,хх);
	КонецЦикла;
	  
	
	Объект.УчетЗатрат.Сортировать("Продукция,ПродукцияСерия,КоличествоПродукции,ВидНоменклатуры,Номенклатура");
	возврат ТЗ_Прод;
	
	
	
	
КонецФункции



Функция пОпределитьСпецификациюПоУмолчанию(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, Момент, Подразделение = Неопределено) Экспорт

	Спецификация = Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
	
	
	//// Плановая
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Лео_ПлановыеСпецификацииНоменклатуры.СпецификацияНоменклатуры КАК СпецификацияНоменклатуры,
	//|	1 КАК Приоритет
	//|ИЗ
	//|	РегистрСведений.Лео_ПлановыеСпецификацииНоменклатуры.СрезПоследних(
	//|			&Дата,
	//|			Номенклатура = &Номенклатура
	//|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//|				И Подразделение = &Подразделение) КАК Лео_ПлановыеСпецификацииНоменклатуры
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Приоритет");
	//
	//Запрос.УстановитьПараметр("Дата", ?(ТипЗнч(Момент) = Тип("Дата"), Момент, ТекущаяДата()));
	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ХарактеристикаНоменклатуры = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры));
	//Запрос.УстановитьПараметр("ХарактеристикаНоменклатурыПустаяСсылка", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	//Запрос.УстановитьПараметр("Подразделение", ?(Подразделение = Неопределено, Справочники.Подразделения.ПустаяСсылка(), Подразделение));
	//Запрос.УстановитьПараметр("ПодразделениеПустаяСсылка", Справочники.Подразделения.ПустаяСсылка());
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	Спецификация = Выборка.СпецификацияНоменклатуры;
	//	
	//КонецЕсли;
	
	Если Спецификация.Пустая() тогда
		//Основная
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лео_ПлановыеСпецификацииНоменклатуры.СпецификацияНоменклатуры КАК СпецификацияНоменклатуры,
		|	1 КАК Приоритет
		|ИЗ
		|	РегистрСведений.ОсновныеСпецификацииНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|				И Подразделение = &Подразделение) КАК Лео_ПлановыеСпецификацииНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет");
		
		Запрос.УстановитьПараметр("Дата", ?(ТипЗнч(Момент) = Тип("Дата"), Момент, ТекущаяДата()));
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ХарактеристикаНоменклатуры = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры));
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатурыПустаяСсылка", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("Подразделение", ?(Подразделение = Неопределено, Справочники.Подразделения.ПустаяСсылка(), Подразделение));
		Запрос.УстановитьПараметр("ПодразделениеПустаяСсылка", Справочники.Подразделения.ПустаяСсылка());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Спецификация = Выборка.СпецификацияНоменклатуры;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Спецификация.Пустая() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена спецификация для " + Номенклатура.Артикул); 
	КонецЕсли;
	//Сообщить("************");
	//Сообщить(Номенклатура);
	//Сообщить(Спецификация);
	Возврат Спецификация;

КонецФункции // ОпределитьСпецификациюПоУмолчанию()




Процедура ЗаполнитьСтоимостьВыпуска(сс,Период)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АналитикаВидаУчета.Ссылка
		|ПОМЕСТИТЬ АналитикаВыпуска
		|ИЗ
		|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
		|ГДЕ
		|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ первые 1
		|	ЗатратыОбороты.АналитикаВидаУчета,
		|	ЗатратыОбороты.АналитикаРаспределенияЗатрат,
		|	ЗатратыОбороты.КоличествоРасход * ВЫБОР
		|		КОГДА &ЕдиницыКоличестваВОтчете = 0
		|			ТОГДА 1
		|		КОГДА &ЕдиницыКоличестваВОтчете = 1
		|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
		|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
		|	КОНЕЦ КАК КоличествоВыпуска,
		|	ЗатратыОбороты.СтоимостьРасход КАК СтоимостьВыпуска,
		|	РегистрАналитикаРаспределенияЗатрат.Продукция,
		|	РегистрАналитикаРаспределенияЗатрат.НоменклатурнаяГруппа,
		|	РегистрАналитикаРаспределенияЗатрат.СерияПродукции,
		|	РегистрАналитикаРаспределенияЗатрат.Спецификация,
		|	РегистрАналитикаВидаУчета.Подразделение
		|ИЗ
		|	РегистрНакопления.УчетЗатрат.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			АналитикаВидаУчета В
		|				(ВЫБРАТЬ
		|					АналитикаВыпуска.Ссылка
		|				ИЗ
		|					АналитикаВыпуска)) КАК ЗатратыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаРаспределенияЗатрат КАК РегистрАналитикаРаспределенияЗатрат
		|		ПО ЗатратыОбороты.АналитикаРаспределенияЗатрат = РегистрАналитикаРаспределенияЗатрат.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
		|		ПО ЗатратыОбороты.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
		|ГДЕ
		|	РегистрАналитикаРаспределенияЗатрат.Продукция = &Продукция
		|{ГДЕ
		|	РегистрАналитикаРаспределенияЗатрат.СерияПродукции = &СерияПродукции}";
		
	ЕдиницыКоличестваВОтчете = 1;
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода" , КонецМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Продукция", сс.Продукция);
	Запрос.УстановитьПараметр("СерияПродукции", сс.СерияПродукции);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 сс.СтоимостьВыпуска = Выборка.СтоимостьВыпуска;
	КонецЕсли;
	
	
	
КонецПроцедуры


Процедура ФактВыпускиЗаПериод(Период)
	
	// Выпуск
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.Ссылка
	|ПОМЕСТИТЬ АналитикаВыпуска
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ГДЕ
	|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗатратыОбороты.АналитикаВидаУчета,
	|	ЗатратыОбороты.АналитикаРаспределенияЗатрат,
	|	ЗатратыОбороты.КоличествоРасход * ВЫБОР
	|		КОГДА &ЕдиницыКоличестваВОтчете = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
	|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
	|	КОНЕЦ КАК КоличествоВыпуска,
	|	ЗатратыОбороты.СтоимостьРасход КАК СтоимостьВыпуска,
	|	РегистрАналитикаРаспределенияЗатрат.Продукция,
	|	РегистрАналитикаРаспределенияЗатрат.НоменклатурнаяГруппа,
	|	РегистрАналитикаРаспределенияЗатрат.СерияПродукции,
	|	РегистрАналитикаРаспределенияЗатрат.Спецификация,
	|	РегистрАналитикаВидаУчета.Подразделение,
	|	РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.ВесНетто КАК ВесНетто
	|ИЗ
	|	РегистрНакопления.УчетЗатрат.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			АналитикаВидаУчета В
	|				(ВЫБРАТЬ
	|					АналитикаВыпуска.Ссылка
	|				ИЗ
	|					АналитикаВыпуска)) КАК ЗатратыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаРаспределенияЗатрат КАК РегистрАналитикаРаспределенияЗатрат
	|		ПО ЗатратыОбороты.АналитикаРаспределенияЗатрат = РегистрАналитикаРаспределенияЗатрат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
	|		ПО ЗатратыОбороты.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
	//|ГДЕ
	//|	РегистрАналитикаРаспределенияЗатрат.Продукция В (&Продукция)";
	|";
	ЕдиницыКоличестваВОтчете = 1;	
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	//Запрос.УстановитьПараметр("КонецПериода",  Дата('20190130160600'));
	//Запрос.УстановитьПараметр("КонецПериода",  Дата('20190121170200'));
	
	//мПродукции = Новый Массив;
	//
	//мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","131107"));
	//мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","П0001067"));
	//мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","П0001038"));
	////мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","П0001145"));
	
	//мПродукции = _ПолучитьМассивПродукции();
	//Запрос.УстановитьПараметр("Продукция", мПродукции);
	
	
	
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		ТЗвыпуск = Результат.Выгрузить();
	КонецЕсли;
	
	
	////СтоимостьВыпуска
	//Для каждого сс из ТЗвыпуск цикл
	//	ЗаполнитьСтоимостьВыпуска(сс,Период);
	//КонецЦикла;
	
	
	
	
	
	кКол =  ТЗвыпуск.количество();сч = 0;
	Для каждого сс из ТЗвыпуск цикл
		
		// Выпуск с пустой спецификации пропускаем
		Если сс.Спецификация.Пустая() тогда продолжить Конецесли;
		
		//ОбработкаПрерыванияПользователя();
		//Состояние("1.Учет выпусков, обработано: " + сокрлп(сч) + " из " + сокрлп(кКол)); 
		//сч = сч + 1;
		
		
		//мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат,АналитикаВидаУчета", сс.АналитикаРаспределенияЗатрат,сс.АналитикаВидаУчета));
		мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат", сс.АналитикаРаспределенияЗатрат));
		Если мЗатрат.Количество() > 0 тогда
			Для каждого тт из мЗатрат цикл
				//Если тт.КоличествоЗатрат = 0 тогда продолжить КонецЕсли;				
				// появились ФОТ
				
				стр = ТЗвыпускЗатраты.Добавить();
				ЗаполнитьЗначенияСвойств(стр,сс);
				ЗаполнитьЗначенияСвойств(стр,тт);
				стр.АналитикаВидаУчетаЗатрат = тт.АналитикаВидаУчета;
				Если ТипЗнч(тт.Затрата) = Тип("СправочникСсылка.Номенклатура") тогда 
					стр.ВидВоспроизводства = тт.Затрата.ВидВоспроизводства;
				КонецЕсли;
				
				Если тт.КоличествоЗатрат = 0 тогда // ФОТ
					стр.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка;
				КонецЕсли;
				
				стр.ПоискПроизведен = Ложь;
				стр.П_АналитикаРаспределенияЗатрат  = сс.АналитикаРаспределенияЗатрат;
				
				Если стр.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
					стр.П_АналитикаРаспределенияЗатрат  = ПолучитьАналитикаРаспределенияЗатратДляЗатраты(стр.Затрата,стр.СерияПродукции.Наименование,стр.КоличествоЗатрат,стр.Подразделение,Период);
				Если  стр.П_АналитикаРаспределенияЗатрат = неопределено тогда // поиск по сериям не удался
				стр.П_АналитикаРаспределенияЗатрат  = _ПолучитьАналитикаРаспределенияЗатратДляЗатраты(стр.Затрата,стр.СерияПродукции.Наименование,стр.КоличествоЗатрат,стр.Подразделение,Период);
				Конецесли;
				КонецЕсли;	
				
		      стр.ВесПродукции = сс.Продукция.ЕдиницаДляОтчетов.ВесНетто * сс.КоличествоВыпуска;
			  стр.ВесПродукцииЕд =  сс.Продукция.ЕдиницаДляОтчетов.ВесНетто;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	
	//!Собрать тз ХЗН (набор полуфабрикатов)
	мПолуфабрикатов = ТЗвыпускЗатраты.НайтиСтроки(Новый Структура("ВидВоспроизводства",Перечисления.ВидыВоспроизводстваНоменклатуры.Производство));
	ТЗ_ХЗН = ТЗвыпускЗатраты.СкопироватьКолонки();
	Для каждого жж из мПолуфабрикатов цикл
		    зз = ТЗ_ХЗН.Добавить();
			ЗаполнитьЗначенияСвойств(зз,жж);
	КонецЦикла;	
	ТЗ_ХЗН.Свернуть("Продукция,СерияПродукции,Затрата");
	Для каждого дд из ТЗвыпускЗатраты цикл
		  мПоиск = ТЗ_ХЗН.НайтиСтроки(Новый Структура("Продукция,СерияПродукции",дд.Продукция,дд.СерияПродукции));
		  Если мПоиск.Количество()> 2 тогда
				дд.ПоискПроизведен = Истина;
				дд.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка;
				дд.П_АналитикаРаспределенияЗатрат = дд.АналитикаРаспределенияЗатрат;
		  Конецесли;	  
	КонецЦикла;	
	ТЗ_ХЗН.Колонки.Добавить("КоличествоПолуфабрикатов");
	ТЗ_ХЗН.ЗаполнитьЗначения(1,"КоличествоПолуфабрикатов");
	ТЗ_ХЗН.Свернуть("Продукция,СерияПродукции","КоличествоПолуфабрикатов");
	Для каждого нн из ТЗ_ХЗН цикл
		  Если нн.КоличествоПолуфабрикатов > 2 и нн.Продукция.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008")  тогда  //Конечная продукция
  		   хх = Объект.ХЗНУчетЗатрат.Добавить();
		   ЗаполнитьЗначенияСвойств(хх,нн);
	  КонецЕсли;	   
	КонецЦикла;	
	//!
	////////////////////////////////////////////
	
	
	
	
	_ПромТЗ = ТЗвыпускЗатраты.СкопироватьКолонки();
	кКол =  ТЗвыпускЗатраты.количество();сч = 0;
	Для каждого нн из ТЗвыпускЗатраты цикл
		
		
		
		//Если нн.КоличествоЗатрат = 0 тогда продолжить КонецЕсли; // без ФОТ				
		
		//ОбработкаПрерыванияПользователя();
		//Состояние("2.Учет затрат, обработано: " + сокрлп(сч) + " из " + сокрлп(кКол)); 
		//сч = сч + 1;
		
		Если нн.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
			ФактВыпускиЗаПериодПродукция(Период,нн);
			Если нн.ТЗ.Количество() > 0 тогда
				Для каждого нн1 из нн.ТЗ цикл
					Если нн1.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
						ФактВыпускиЗаПериодПродукция(Период,нн1);
						Если нн1.ТЗ.Количество() > 0 тогда
							Для каждого нн2 из нн1.ТЗ цикл
								Если нн2.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
									ФактВыпускиЗаПериодПродукция(Период,нн2);
									Если нн2.ТЗ.Количество() > 0 тогда
										Для каждого нн3 из нн2.ТЗ цикл
											Если нн3.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
												ФактВыпускиЗаПериодПродукция(Период,нн3);
												Если нн3.ТЗ.Количество() > 0 тогда
													Для каждого нн4 из нн3.ТЗ цикл
														Если нн4.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
															ФактВыпускиЗаПериодПродукция(Период,нн4);
															Если нн4.ТЗ.Количество() > 0 тогда
																Для каждого нн5 из нн4.ТЗ цикл
																	Если нн5.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
																		ФактВыпускиЗаПериодПродукция(Период,нн5);
																		
																	КонецЕсли;
																	нн5.ПоискПроизведен = Истина;
																КонецЦикла;
															Конецесли;
														КонецЕсли;
														нн4.ПоискПроизведен = Истина;
													КонецЦикла;
												Конецесли;
											КонецЕсли;
											нн3.ПоискПроизведен = Истина;
										КонецЦикла;
									Конецесли;
								КонецЕсли;
								нн2.ПоискПроизведен = Истина;
							КонецЦикла;
						Конецесли;
					КонецЕсли;
					нн1.ПоискПроизведен = Истина;
				КонецЦикла;
			Конецесли;
		КонецЕсли;
		нн.ПоискПроизведен = Истина;
	КонецЦикла;
	
	
	
	
КонецПроцедуры


Процедура ФактВыпускиЗаПериодПродукция(Период,сТЗ)
	

	_ПромТЗ.Очистить();
	
	мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат,АналитикаВидаУчета", сТЗ.П_АналитикаРаспределенияЗатрат,сТЗ.АналитикаВидаУчета));
	
	Если мЗатрат.Количество() = 0 тогда
	мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат", сТЗ.П_АналитикаРаспределенияЗатрат));
	КонецЕсли;

	Если мЗатрат.Количество() > 0 тогда
		Для каждого тт из мЗатрат цикл
			//Если тт.КоличествоЗатрат = 0 тогда продолжить КонецЕсли; // ФОТ				
			стр = _ПромТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(стр,сТЗ);
			ЗаполнитьЗначенияСвойств(стр,тт);
			//стр.КоличествоЗатрат = сТЗ.КоличествоЗатрат;
			стр.АналитикаВидаУчетаЗатрат = тт.АналитикаВидаУчета;
			Если ТипЗнч(тт.Затрата) = Тип("СправочникСсылка.Номенклатура") тогда 
				стр.ВидВоспроизводства = тт.Затрата.ВидВоспроизводства;
			КонецЕсли;
			
			Если стр.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
				стр.П_АналитикаРаспределенияЗатрат  = ПолучитьАналитикаРаспределенияЗатратДляЗатраты(стр.Затрата,стр.СерияПродукции.Наименование,стр.КоличествоЗатрат,стр.Подразделение,Период);
				Если  стр.П_АналитикаРаспределенияЗатрат = неопределено тогда // поиск по сериям не удался
				стр.П_АналитикаРаспределенияЗатрат  = _ПолучитьАналитикаРаспределенияЗатратДляЗатраты(стр.Затрата,стр.СерияПродукции.Наименование,стр.КоличествоЗатрат,стр.Подразделение,Период);
				Конецесли;
			КонецЕсли;	
			
			//ПЕРЕПАКОВКА Перемещение товаров LVNP0002485 от 22.01.2019 8:34:46
			//Если сТЗ.П_АналитикаРаспределенияЗатрат = стр.П_АналитикаРаспределенияЗатрат
			
			
			
			стр.ПоискПроизведен = Ложь;
        	стр.ТЗРодительКоличество = сТЗ.КоличествоЗатрат;   
			стр.КоличествоСогласноНормативуНаЕд = ПолучитьКоличествоСогласноНормативу(сТЗ.П_АналитикаРаспределенияЗатрат,стр.НоменклатураЗатрат);
			
			
			////////////////////////////////////////////////////////////////////////////
			//Берем согласно нормативу, по аналитике затрат (факт в РН УчетЗатрат КоличествоЗатрат) бывает в разы меньше 
			//Сахар измельченный
		пЗатрата = сТЗ.Затрата;
		Если пЗатрата.Артикул = "П0001145" или пЗатрата.Артикул = "П0001145_ИКГ17_250" или
			 пЗатрата.Артикул = "П0001145_ИГК19_390" или пЗатрата.Артикул = "П0001145_ИГК19_000" тогда
			 
     	 стр.КоличествоЗатрат    = (сТЗ.КоличествоЗатрат / 1000) * 1010.101; // спецификация
		КонецЕсли;	 
			//Соль измельченная 
		Если пЗатрата.Артикул = "П0001149" или пЗатрата.Артикул = "П0001149_ИГК19_000"
			или пЗатрата.Артикул = "П0001149_ИГК19_390" тогда
			 
     	 стр.КоличествоЗатрат    = (сТЗ.КоличествоЗатрат / 1000) * 1010.101; // спецификация
		КонецЕсли;	 
		//Кислота лимонная измельченная П/Ф
		Если пЗатрата.Артикул = "П0000287" или пЗатрата.Артикул = "П0000287_ИГК19_000" тогда
			
     	 стр.КоличествоЗатрат    = (сТЗ.КоличествоЗатрат / 1000) * 1010.101; // спецификация
		КонецЕсли;
			////////////////////////////////////////////////////////////////////////////
			
		КонецЦикла;
		
		иначе//////////////////////////////
		
			
			
			////////////////////////////////////////////////////////////////////////////
			//Берем согласно нормативу, по аналитике затрат (факт в РН УчетЗатрат КоличествоЗатрат) бывает в разы меньше 
			//Сахар измельченный
		пЗатрата = сТЗ.Затрата;
		Если ТипЗнч(пЗатрата) = Тип("СправочникСсылка.Номенклатура") тогда	
		Если пЗатрата.Артикул = "П0001145" или пЗатрата.Артикул = "П0001145_ИКГ17_250" или
			 пЗатрата.Артикул = "П0001145_ИГК19_390" или пЗатрата.Артикул = "П0001145_ИГК19_000" тогда
			 
     	 сТЗ.КоличествоЗатрат    = (сТЗ.КоличествоЗатрат / 1000) * 1010.101; // спецификация
		КонецЕсли;	 
			//Соль измельченная 
		Если пЗатрата.Артикул = "П0001149" или пЗатрата.Артикул = "П0001149_ИГК19_000"
			или пЗатрата.Артикул = "П0001149_ИГК19_390" тогда
			 
     	 сТЗ.КоличествоЗатрат    = (сТЗ.КоличествоЗатрат / 1000) * 1010.101; // спецификация
		КонецЕсли;	 
		//Кислота лимонная измельченная П/Ф
		Если пЗатрата.Артикул = "П0000287" или пЗатрата.Артикул = "П0000287_ИГК19_000" тогда
			
     	 сТЗ.КоличествоЗатрат    = (сТЗ.КоличествоЗатрат / 1000) * 1010.101; // спецификация
		КонецЕсли;
			////////////////////////////////////////////////////////////////////////////
		КонецЕсли;
	КонецЕсли;
	//КонецЦикла;
	
	
	
	///////////////////////////////////////////////////////////////////
	// ИСКЛЮЧЕНИЯ !!!
	//Если разузлование не произошло записываем полуфабрикат
	//пример: "Полуфабрикат; БАД Витаминно-минеральный комплекс "КомплеТабс" 1таб по 0,73 г, П/Ф; 07.05.2019; Основные Ф 0374"
	Если мЗатрат.Количество() = 0 и НЕ сТЗ.ПоискПроизведен тогда
			стр = _ПромТЗ.Добавить();
			сТЗ.ПоискПроизведен = Истина;
			ЗаполнитьЗначенияСвойств(стр,сТЗ);
			сТЗ.П_АналитикаРаспределенияЗатрат = сТЗ.АналитикаРаспределенияЗатрат;
  	Конецесли;
	
	
	
	
	
	
	
	
	сТЗ.ТЗ = _ПромТЗ.Скопировать();
	
	//!Собрать тз ХЗН (набор полуфабрикатов)
	Если сТЗ.ПоискПроизведен тогда
    сТЗ.ТЗ.Очистить();
  	Конецесли;
	//!
	/////////////////////////////////////\
	
	
	
КонецПроцедуры


Функция ПолучитьКоличествоСогласноНормативу(П_АналитикаРаспределенияЗатрат,Номенклатура)
	кНоратив = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналитикаРаспределенияЗатрат.Спецификация,
		|	АналитикаРаспределенияЗатрат.Спецификация.ИсходныеКомплектующие.(
		|		Количество
		|	) КАК КоличествоИ,
		|	АналитикаРаспределенияЗатрат.Спецификация.ВыходныеИзделия.(
		|		Количество
		|	) КАК КоличествоП
		|ИЗ
		|	РегистрСведений.АналитикаРаспределенияЗатрат КАК АналитикаРаспределенияЗатрат
		|ГДЕ
		|	АналитикаРаспределенияЗатрат.Ссылка = &Ссылка
		|	И АналитикаРаспределенияЗатрат.Спецификация.ИсходныеКомплектующие.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", П_АналитикаРаспределенияЗатрат);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
		  ТЗ = Результат.выгрузить();
		  КоличествоП = ТЗ[0].КоличествоП[0].Количество;
		  КоличествоИ = ТЗ[0].КоличествоИ[0].Количество;
		  Если КоличествоП > 0 тогда
		  кНоратив = КоличествоИ/КоличествоП;
		  КонецЕсли;
	КонецЕсли;	
	  
	возврат кНоратив;  
	
КонецФункции	


Функция ПолучитьАналитикаРаспределенияЗатратДляЗатраты(Продукция,Серия,КоличествоЗатрат,Подразделение,Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.Ссылка
	|ПОМЕСТИТЬ АналитикаВыпуска
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ГДЕ
	|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ Первые 1
	|	ЗатратыОбороты.АналитикаВидаУчета,
	|	ЗатратыОбороты.АналитикаРаспределенияЗатрат,
	|	ЗатратыОбороты.КоличествоРасход * ВЫБОР
	|		КОГДА &ЕдиницыКоличестваВОтчете = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
	|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
	|	КОНЕЦ КАК КоличествоВыпуска,
	|	РегистрАналитикаРаспределенияЗатрат.Продукция,
	|	РегистрАналитикаРаспределенияЗатрат.НоменклатурнаяГруппа,
	|	РегистрАналитикаРаспределенияЗатрат.ХарактеристикаПродукции,
	|	РегистрАналитикаРаспределенияЗатрат.СерияПродукции,
	|	РегистрАналитикаРаспределенияЗатрат.Спецификация,
	|	РегистрАналитикаРаспределенияЗатрат.ВариантВыпускаПродукции,
	|	РегистрАналитикаВидаУчета.Организация,
	|	РегистрАналитикаВидаУчета.Подразделение,
	|	РегистрАналитикаВидаУчета.Проект,
	|	РегистрАналитикаВидаУчета.Склад
	|ИЗ
	|	РегистрНакопления.УчетЗатрат.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			АналитикаВидаУчета В
	|				(ВЫБРАТЬ
	|					АналитикаВыпуска.Ссылка
	|				ИЗ
	|					АналитикаВыпуска)) КАК ЗатратыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаРаспределенияЗатрат КАК РегистрАналитикаРаспределенияЗатрат
	|		ПО ЗатратыОбороты.АналитикаРаспределенияЗатрат = РегистрАналитикаРаспределенияЗатрат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
	|		ПО ЗатратыОбороты.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
	|ГДЕ
	|	РегистрАналитикаРаспределенияЗатрат.Продукция = &Продукция
	//|	И ЗатратыОбороты.КоличествоРасход * ВЫБОР
	//|		КОГДА &ЕдиницыКоличестваВОтчете = 0
	//|			ТОГДА 1
	//|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	//|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
	//|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
	//|	КОНЕЦ >= &КоличествоЗатрат
	//|	И ЗатратыОбороты.СтоимостьРасход > 0
//	|	И РегистрАналитикаВидаУчета.Подразделение = &Подразделение
	//|ГДЕ
	| И	РегистрАналитикаРаспределенияЗатрат.СерияПродукции = &СерияПродукции
	|";
	
	ЕдиницыКоличестваВОтчете = 1;
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период.ДатаНачала));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Период));
	Запрос.УстановитьПараметр("Продукция", Продукция);
	//Запрос.УстановитьПараметр("СерияПродукции", Серия);
	//Запрос.УстановитьПараметр("КоличествоЗатрат", КоличествоЗатрат);
	
	Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") тогда
	_Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Серия,,,Продукция);
	иначе
	_Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("СерияПродукции", _Серия);
	
	
	// Используется подразделение выпуска, а не производства, закомментим пока
	//Запрос.УстановитьПараметр("Подразделение", Подразделение); 

	
	АналитикаРаспределенияЗатрат = неопределено;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		АналитикаРаспределенияЗатрат =  Выборка.АналитикаРаспределенияЗатрат;
		
	КонецЕсли;
	
	возврат АналитикаРаспределенияЗатрат;
	
	
КонецФункции


Функция _ПолучитьАналитикаРаспределенияЗатратДляЗатраты(Продукция,Серия,КоличествоЗатрат,Подразделение,Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.Ссылка
	|ПОМЕСТИТЬ АналитикаВыпуска
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ГДЕ
	|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ Первые 1
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ЗатратыОбороты.АналитикаВидаУчета,
	|	ЗатратыОбороты.АналитикаРаспределенияЗатрат,
	|	ЗатратыОбороты.КоличествоРасход * ВЫБОР
	|		КОГДА &ЕдиницыКоличестваВОтчете = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
	|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
	|	КОНЕЦ КАК КоличествоВыпуска,
	|	РегистрАналитикаРаспределенияЗатрат.Продукция,
	|	РегистрАналитикаРаспределенияЗатрат.НоменклатурнаяГруппа,
	|	РегистрАналитикаРаспределенияЗатрат.ХарактеристикаПродукции,
	|	РегистрАналитикаРаспределенияЗатрат.СерияПродукции,
	|	РегистрАналитикаРаспределенияЗатрат.Спецификация,
	|	РегистрАналитикаРаспределенияЗатрат.ВариантВыпускаПродукции,
	|	РегистрАналитикаВидаУчета.Организация,
	|	РегистрАналитикаВидаУчета.Подразделение,
	|	РегистрАналитикаВидаУчета.Проект,
	|	РегистрАналитикаВидаУчета.Склад
	|ИЗ
	|	РегистрНакопления.УчетЗатрат.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			АналитикаВидаУчета В
	|				(ВЫБРАТЬ
	|					АналитикаВыпуска.Ссылка
	|				ИЗ
	|					АналитикаВыпуска)) КАК ЗатратыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаРаспределенияЗатрат КАК РегистрАналитикаРаспределенияЗатрат
	|		ПО ЗатратыОбороты.АналитикаРаспределенияЗатрат = РегистрАналитикаРаспределенияЗатрат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
	|		ПО ЗатратыОбороты.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
	|ГДЕ
	|	РегистрАналитикаРаспределенияЗатрат.Продукция = &Продукция
	//|	И ЗатратыОбороты.КоличествоРасход * ВЫБОР
	//|		КОГДА &ЕдиницыКоличестваВОтчете = 0
	//|			ТОГДА 1
	//|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	//|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
	//|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
	//|	КОНЕЦ >= &КоличествоЗатрат
	//|	И ЗатратыОбороты.СтоимостьРасход > 0
//	|	И РегистрАналитикаВидаУчета.Подразделение = &Подразделение
	//|ГДЕ
	//| И	РегистрАналитикаРаспределенияЗатрат.СерияПродукции = &СерияПродукции
	|";
	
	ЕдиницыКоличестваВОтчете = 1;
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период.ДатаНачала));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Период));
	Запрос.УстановитьПараметр("Продукция", Продукция);
	
	
	//Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Серия,,,Продукция);
	//
	//Запрос.УстановитьПараметр("СерияПродукции", Серия);
	
	
	//Запрос.УстановитьПараметр("КоличествоЗатрат", КоличествоЗатрат);
	
	// Используется подразделение выпуска, а не производства, закомментим пока
	//Запрос.УстановитьПараметр("Подразделение", Подразделение); 

	
	АналитикаРаспределенияЗатрат = неопределено;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		
		ТЗнаналРаспр = Результат.Выгрузить();
		ТЗнаналРаспр.Сортировать("Продукция,СерияПродукции Убыв,КоличествоВыпуска Убыв");
		Для каждого шш из ТЗнаналРаспр цикл
			
		Если КоличествоЗатрат <= шш.КоличествоВыпуска тогда	
		   АналитикаРаспределенияЗатрат =  шш.АналитикаРаспределенияЗатрат;
		   прервать;
		КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	возврат АналитикаРаспределенияЗатрат;
	
	
КонецФункции




Процедура _ЗаполнитьЗначенияТЗ_Прод(лл,ее)
	
	
	Если ТипЗнч(ее.Затрата) = Тип("СправочникСсылка.Номенклатура") тогда 
	лл.Номенклатура           = ее.Затрата;
      иначе
	  Ном =  Справочники.Номенклатура.НайтиПоНаименованию(сокрлп(ее.Затрата.Наименование));	  
	  Если Ном.Пустая() тогда
		    Сообщить("Не найдена номенклатура для затраты: " + сокрлп(ее.Затрата.Наименование));
			возврат;
		Конецесли;	
	лл.Номенклатура           = Ном;
	КонецЕсли;
	лл.НоменклатураАртикул    = лл.Номенклатура.Артикул;
	лл.НоменклатураКоличество = ее.КоличествоЗатрат;
	           
	//лл.Цена                     = 1;
	//лл.СтоимостьЗатратНаЕдиницу = 0;
	лл.КоличествоЗатрат      = ее.КоличествоЗатрат;
	
	лл.ПродукцияАртикул       = лл.Продукция.Артикул;
	лл.ПродукцияКоличество    = ее.КоличествоВыпуска;
	
	
	лл.Цена = РегистрыСведений.Лео_ПартияНоменклатуры.ПолучитьПоследнее(,Новый Структура("Номенклатура",лл.Номенклатура)).Цена; 
		
    Если лл.Цена = 0 тогда
		лл.Цена = абс_Дистрибуция.ПолучитьЦенуПоПрайсуЛеоНастройки(КонецДня(ТекущаяДата()),лл.Номенклатура,"Фрешнес_ТипЦен");
	Конецесли;
	
		лл.Цена = абс_Дистрибуция.ПолучитьЦенуПоПрайсуЛеоНастройкиЗапрос(КонецДня(ТекущаяДата()),лл.Номенклатура.Артикул,"7мес2019_ТипЦен");
	
	
	
	Если лл.ПродукцияКоличество > 0 тогда
	лл.КоличествоНаЕдиницу = лл.КоличествоЗатрат/лл.ПродукцияКоличество;
      иначе
	лл.КоличествоНаЕдиницу = 0;
    КонецЕсли;
	
	лл.СтоимостьЗатратПрайс = лл.КоличествоНаЕдиницу * лл.Цена;

	лл.СтоимостьЗатрат      = лл.КоличествоЗатрат * лл.Цена;
	
	
	//мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат", сс.АналитикаРаспределенияЗатрат));

	
	//мСтоимостьВыпуска = ТЗвыпуск.НайтиСтроки(Новый Структура("Продукция,СерияПродукции", лл.Продукция, лл.СерияПродукции));
	//Если мСтоимостьВыпуска.Количество() > 0 тогда
	//лл.СтоимостьВыпуска = мСтоимостьВыпуска[0].СтоимостьВыпуска;
	//КонецЕсли;
	
КонецПроцедуры	


Процедура ЗаполнитьТЗ_Прод(_ТЗ,стр)
	
	
	Для каждого сс из _ТЗ цикл
		
		Если сс.ТЗ <> неопределено тогда
			Если сс.ТЗ.Количество() > 0 тогда  // п/ф
				ЗаполнитьТЗ_Прод(сс.ТЗ,стр);
				
			иначе // выпуск полуфабриката произведен в другом периоде	 
				лл = ТЗ_Прод.Добавить();
				ЗаполнитьЗначенияСвойств(лл,сс);
				_ЗаполнитьЗначенияТЗ_Прод(лл,сс);
			КонецЕсли;	 
		иначе
			лл = ТЗ_Прод.Добавить();
			
			Если сс.ТЗРодительКоличество * 2 < сс.КоличествоЗатрат тогда // исправить !!!
			сс.КоличествоЗатрат = сс.КоличествоСогласноНормативуНаЕд * сс.ТЗРодительКоличество;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(лл,сс);
			_ЗаполнитьЗначенияТЗ_Прод(лл,сс);
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьОтбор(Команда)
	// Вставить содержимое обработчика.
	Объект.УчетЗатрат.Очистить();
	
	ЗаполнитьНаСервереОтбор();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереОтбор()
	
	
	 ПолучитьТЗотбор(Объект.Дата);
	
	
КонецПроцедуры



Функция ПолучитьТЗотбор(Период)
	
	ТЗвыпускЗатраты = Новый ТаблицаЗначений;
	
	
	ТЗвыпускЗатраты.Колонки.Добавить("АналитикаВидаУчета");
	ТЗвыпускЗатраты.Колонки.Добавить("АналитикаРаспределенияЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("П_АналитикаРаспределенияЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("КоличествоВыпуска");
	ТЗвыпускЗатраты.Колонки.Добавить("СтоимостьВыпуска");
	ТЗвыпускЗатраты.Колонки.Добавить("Продукция");
	ТЗвыпускЗатраты.Колонки.Добавить("НоменклатурнаяГруппа");
	ТЗвыпускЗатраты.Колонки.Добавить("СерияПродукции");
	ТЗвыпускЗатраты.Колонки.Добавить("Спецификация");
	ТЗвыпускЗатраты.Колонки.Добавить("Подразделение");
	
	ТЗвыпускЗатраты.Колонки.Добавить("Затрата");
	ТЗвыпускЗатраты.Колонки.Добавить("КоличествоЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("СтоимостьЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("СтатьяЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("НоменклатураЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("СерияЗатраты");
	ТЗвыпускЗатраты.Колонки.Добавить("АналитикаВидаУчетаЗатрат");
	ТЗвыпускЗатраты.Колонки.Добавить("ВидВоспроизводства");
	ТЗвыпускЗатраты.Колонки.Добавить("ПоискПроизведен");
	ТЗвыпускЗатраты.Колонки.Добавить("ТЗ");
	ТЗвыпускЗатраты.Колонки.Добавить("ТЗРодительКоличество");
	ТЗвыпускЗатраты.Колонки.Добавить("КоличествоСогласноНормативуНаЕд");
	ТЗвыпускЗатраты.Колонки.Добавить("ВесПродукции");
	ТЗвыпускЗатраты.Колонки.Добавить("ВесПродукцииЕд");

	
	
	
	// Затраты
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.Ссылка
	|ПОМЕСТИТЬ АналитикаВыпуска
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ГДЕ
	|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетЗатрат.КорАналитикаРаспределенияЗатрат КАК АналитикаРаспределенияЗатрат,
	|	УчетЗатрат.Стоимость КАК СтоимостьЗатрат,
	|	УчетЗатрат.Количество * ВЫБОР
	|		КОГДА РегистрАналитикаУчетаЗатрат.Затрата = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ &ЕдиницыКоличестваВОтчете = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	|			ТОГДА РегистрАналитикаУчетаЗатрат.Затрата.ЕдиницаХраненияОстатков.Коэффициент
	|		ИНАЧЕ РегистрАналитикаУчетаЗатрат.Затрата.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаУчетаЗатрат.Затрата.ЕдиницаДляОтчетов.Коэффициент
	|	КОНЕЦ КАК КоличествоЗатрат,
	|	ВЫБОР
	|		КОГДА РегистрАналитикаУчетаЗатрат.Затрата = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА РегистрАналитикаУчетаЗатрат.СтатьяЗатрат
	|		ИНАЧЕ РегистрАналитикаУчетаЗатрат.Затрата
	|	КОНЕЦ КАК Затрата,
	|	РегистрАналитикаУчетаЗатрат.СтатьяЗатрат,
	|	РегистрАналитикаУчетаЗатрат.Затрата КАК НоменклатураЗатрат,
	|	РегистрАналитикаУчетаЗатрат.ХарактеристикаЗатраты,
	|	РегистрАналитикаУчетаЗатрат.СерияЗатраты,
	|	РегистрАналитикаУчетаЗатрат.Качество,
	|	РегистрАналитикаУчетаЗатрат.ХарактерЗатрат,
	|	РегистрАналитикаУчетаЗатрат.СпособРаспределенияЗатрат,
	|	УчетЗатрат.КорАналитикаВидаУчета КАК АналитикаВидаУчета
	|ИЗ
	|	РегистрНакопления.УчетЗатрат КАК УчетЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаЗатрат КАК РегистрАналитикаУчетаЗатрат
	|		ПО УчетЗатрат.АналитикаУчетаЗатрат = РегистрАналитикаУчетаЗатрат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
	|		ПО УчетЗатрат.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
	|			И (РегистрАналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Затраты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрКорАналитикаВидаУчета
	|		ПО УчетЗатрат.АналитикаВидаУчета = РегистрКорАналитикаВидаУчета.Ссылка
	|			И (РегистрКорАналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.ЗатратыНаВыпуск)
	|				ИЛИ РегистрКорАналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск))
	|ГДЕ
	|	УчетЗатрат.Активность
	|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И УчетЗатрат.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УчетЗатрат.КорАналитикаВидаУчета В
	|			(ВЫБРАТЬ
	|				АналитикаВыпуска.Ссылка
	|			ИЗ
	|				АналитикаВыпуска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АналитикаРаспределенияЗатрат";
	//|	И УчетЗатрат.Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену";
	
	ЕдиницыКоличестваВОтчете = 1;
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(Период,-6)));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		ТЗзатрат = Результат.Выгрузить();
	КонецЕсли;
	
	
	
	
	
	ФактВыпускиЗаПериодОтбор(Период);	
	
	
	// соберем выходную таблицу
	
	ТЗ_Прод = Новый ТаблицаЗначений;
	
	ТЗ_Прод.Колонки.Добавить("Номенклатура");
	ТЗ_Прод.Колонки.Добавить("НоменклатураАртикул");
	ТЗ_Прод.Колонки.Добавить("НоменклатураКоличество");
	ТЗ_Прод.Колонки.Добавить("Продукция");
	ТЗ_Прод.Колонки.Добавить("ПродукцияАртикул");
	ТЗ_Прод.Колонки.Добавить("СерияПродукции");
	ТЗ_Прод.Колонки.Добавить("ПродукцияКоличество");
	ТЗ_Прод.Колонки.Добавить("СтоимостьВыпуска");
	ТЗ_Прод.Колонки.Добавить("Спецификация");
	ТЗ_Прод.Колонки.Добавить("КоличествоЗатрат");
	ТЗ_Прод.Колонки.Добавить("КоличествоНаЕдиницу");	
	ТЗ_Прод.Колонки.Добавить("Цена");
	ТЗ_Прод.Колонки.Добавить("СтоимостьЗатратПрайс");
	ТЗ_Прод.Колонки.Добавить("СтоимостьЗатрат");
	ТЗ_Прод.Колонки.Добавить("ВесПродукции");
	ТЗ_Прод.Колонки.Добавить("ВесПродукцииЕд");
	ТЗ_Прод.Колонки.Добавить("СтатьяЗатрат");
	ТЗ_Прод.Колонки.Добавить("ВидВоспроизводства");
	
	
	Для каждого стр из ТЗвыпуск цикл
		
		//мСтр = ТЗвыпускЗатраты.НайтиСтроки(Новый Структура("Продукция,СерияПродукции",стр.Продукция,стр.СерияПродукции));  
		мСтр = ТЗвыпускЗатраты.НайтиСтроки(Новый Структура("П_АналитикаРаспределенияЗатрат",стр.АналитикаРаспределенияЗатрат));  
		Если мСтр.Количество() > 0 тогда 
			Для каждого ее из мСтр цикл
				Если ее.ТЗ <> неопределено тогда
					Если ее.ТЗ.Количество() > 0 тогда // п/ф
						ЗаполнитьТЗ_Прод(ее.ТЗ,стр);	
					иначе // выпуск полуфабриката произведен в другом периоде	 
						лл = ТЗ_Прод.Добавить();
						ЗаполнитьЗначенияСвойств(лл,ее);
						_ЗаполнитьЗначенияТЗ_Прод(лл,ее);
					КонецЕсли;	 
				иначе
					лл = ТЗ_Прод.Добавить();
					ЗаполнитьЗначенияСвойств(лл,ее);
					_ЗаполнитьЗначенияТЗ_Прод(лл,ее);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	
	
	// в отдельных колонках вид номенклатуры
	ТЗ_Прод.Колонки.Добавить("ГруппаПродукции");
	ТЗ_Прод.Колонки.Добавить("ГруппаНоменклатуры");
	Для каждого стр из ТЗ_Прод цикл
		стр.ГруппаПродукции = стр.Продукция.ВидНоменклатуры; 
		стр.ГруппаНоменклатуры = стр.Номенклатура.ВидНоменклатуры;
	КонецЦикла;
	
	
	
	
	ТЗ_Прод.Свернуть("Продукция,СерияПродукции,Номенклатура,СтатьяЗатрат,ПродукцияКоличество,ВидВоспроизводства","КоличествоЗатрат,СтоимостьЗатрат");
	ТЗ_Прод.Сортировать("Продукция,СерияПродукции,Номенклатура");
	
	Объект.УчетЗатрат.Очистить();
	Для каждого нн из ТЗ_Прод цикл
		  стр = Объект.УчетЗатрат.Добавить();
		  стр.Продукция           = нн.Продукция;
		  стр.ПродукцияСерия      = нн.СерияПродукции;
		  стр.Номенклатура        = нн.Номенклатура;
		  стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
		  стр.КоличествоПродукции = нн.ПродукцияКоличество;
		  стр.КоличествоЗатрат    = нн.КоличествоЗатрат;
		  стр.СтоимостьЗатрат     = нн.СтоимостьЗатрат;
		  стр.ВидНоменклатуры     = нн.Номенклатура.ВидНоменклатуры;
		  
		  
		// Сахар измельченный
		Если стр.Номенклатура.Артикул = "П0001145" или стр.Номенклатура.Артикул = "П0001145_ИКГ17_250" или
			 стр.Номенклатура.Артикул = "П0001145_ИГК19_390" или стр.Номенклатура.Артикул = "П0001145_ИГК19_000" тогда
			 
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000001012"); //Сахар
		КонецЕсли;	 
			
		//Кислота лимонная измельченная П/Ф
		Если стр.Номенклатура.Артикул = "П0000287" или стр.Номенклатура.Артикул = "П0000287_ИГК19_000" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000000341");
		КонецЕсли;
		
		//Соль измельченная
		Если стр.Номенклатура.Артикул = "П0001149" или стр.Номенклатура.Артикул = "П0001149_ИГК19_000"
			или стр.Номенклатура.Артикул = "П0001149_ИГК19_390"
			тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000001074");
		КонецЕсли;
		
		  
		//Курага стерильная высушенная (пониженная влажность)  
		Если стр.Номенклатура.Артикул = "П0001811" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000048446");
     		 стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1176.470; // спецификация

		КонецЕсли;
		  
		
		//Изюм высушенный (пониженная влажность)
		Если стр.Номенклатура.Артикул = "П0001662" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000003986");
     		 стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1020.408; // спецификация

		КонецЕсли;
		
		//Хлопья овсяные НТВ сушеные
		Если стр.Номенклатура.Артикул = "П0000623" тогда
			
			 стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000000174");
     		 стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1081.090; // спецификация

		КонецЕсли;
		
		
		
		
		//Сок черной смородины с аскорбиновой кислотой, кг П/Ф
		Если стр.Номенклатура.Артикул = "П0001581" тогда
			
			//Сок черной смородины
		  //стр = Объект.УчетЗатрат.Добавить();
		  стр.Продукция           = нн.Продукция;
		  стр.ПродукцияСерия      = нн.СерияПродукции;
		  стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
		  стр.КоличествоПродукции = нн.ПродукцияКоличество;
		  стр.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("М0000048426");
     	  стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 1111.111; // спецификация
		  стр.СтоимостьЗатрат     = 0;

			 // Кислота аскорбиновая
		  стр = Объект.УчетЗатрат.Добавить();
		  стр.Продукция           = нн.Продукция;
		  стр.ПродукцияСерия      = нн.СерияПродукции;
		  стр.Номенклатура        = Справочники.Номенклатура.НайтиПоКоду("М0000000340");;
		  стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
		  стр.КоличествоПродукции = нн.ПродукцияКоличество;
		  стр.КоличествоЗатрат    = (нн.КоличествоЗатрат / 1000) * 0.270; // спецификация
		  стр.СтоимостьЗатрат     = 0;
			 
			 
		КонецЕсли;
		
		
		
		///////////////////////////////////////////////////////////////////////////////
		// Если полуфабрикат, то ищем по нормативам
		Если стр.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004")
			И нн.ВидВоспроизводства <> Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка			
			
			тогда // полуфабрикат 
			
			_ПФ = стр.Номенклатура; _ПФкол = стр.КоличествоЗатрат;
			_спец = абс_Дистрибуция._пОпределитьСпецификациюПоУмолчанию(стр.Номенклатура,,,);
			Если _спец <> неопределено тогда
				_УрРазузлования = абс_Дистрибуция.Лео_ПолучитьКоличествоУровнейРазузлования(_спец,стр.КоличествоЗатрат,0,КонецДня(Период));
				_Стр = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(_спец,стр.КоличествоЗатрат,_УрРазузлования,0,_спец.ДатаУтверждения);
				
				Если _Стр.ИсходныеКомплектующие.Количество() > 0 тогда
					_счИсхКомп = 0;
					Для каждого ее из _Стр.ИсходныеКомплектующие цикл
						
						Если _счИсхКомп = 1 тогда				  
							стр = Объект.УчетЗатрат.Добавить();
						Конецесли;
						стр.Продукция           = нн.Продукция;
						стр.ПродукцияСерия      = нн.СерияПродукции;
						стр.Номенклатура        = ее.Номенклатура;
						стр.СтатьяЗатрат        = нн.СтатьяЗатрат;
						стр.КоличествоПродукции = нн.ПродукцияКоличество;
						стр.КоличествоЗатрат    = ее.Количество; // спецификация
						стр.СтоимостьЗатрат     = 0;
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("! Продукция: " + сокрлп(стр.Продукция) + " Серия: " + сокрлп(стр.ПродукцияСерия)); 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("+ П/Ф: " + сокрлп(_ПФ) + " Количество: " + сокрлп(_ПФкол)); 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура: " + сокрлп(стр.Номенклатура) + " КоличествоЗатрат: " + сокрлп(стр.КоличествоЗатрат)); 
						
						_счИсхКомп = 1;	  
					КонецЦикла;
				Конецесли;
			КонецЕсли;				
		КонецЕсли;				
		
		
		
		
    стр.ПродукцияСерияСтрока      = сокрлп(стр.ПродукцияСерия);
    стр.ВидНоменклатуры           = стр.Номенклатура.ВидНоменклатуры;
		
		
	КонецЦикла;
	  
	
	// Свернуть Объект.УчетЗатрат
	ТЗсвернуть = Объект.УчетЗатрат.Выгрузить();  
	ТЗсвернуть.Свернуть("Продукция,ПродукцияСерия,Номенклатура,ВидНоменклатуры,СтатьяЗатрат,КоличествоПродукции,ПродукцияСерияСтрока","КоличествоЗатрат,СтоимостьЗатрат");
	Объект.УчетЗатрат.Очистить();
	Для каждого хх из ТЗсвернуть цикл
		дд = Объект.УчетЗатрат.Добавить();
		ЗаполнитьЗначенияСвойств(дд,хх);
	КонецЦикла;
	
	Объект.УчетЗатрат.Сортировать("Продукция,ПродукцияСерия,ВидНоменклатуры,Номенклатура");
	
	
	возврат ТЗ_Прод;
	
	
	
	
КонецФункции



Процедура ФактВыпускиЗаПериодОтбор(Период)
	
	// Выпуск
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналитикаВидаУчета.Ссылка
	|ПОМЕСТИТЬ АналитикаВыпуска
	|ИЗ
	|	РегистрСведений.АналитикаВидаУчета КАК АналитикаВидаУчета
	|ГДЕ
	|	АналитикаВидаУчета.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчета.Выпуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗатратыОбороты.АналитикаВидаУчета,
	|	ЗатратыОбороты.АналитикаРаспределенияЗатрат,
	|	ЗатратыОбороты.КоличествоРасход * ВЫБОР
	|		КОГДА &ЕдиницыКоличестваВОтчете = 0
	|			ТОГДА 1
	|		КОГДА &ЕдиницыКоличестваВОтчете = 1
	|			ТОГДА РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент
	|		ИНАЧЕ РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.Коэффициент / РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаДляОтчетов.Коэффициент
	|	КОНЕЦ КАК КоличествоВыпуска,
	|	ЗатратыОбороты.СтоимостьРасход КАК СтоимостьВыпуска,
	|	РегистрАналитикаРаспределенияЗатрат.Продукция,
	|	РегистрАналитикаРаспределенияЗатрат.НоменклатурнаяГруппа,
	|	РегистрАналитикаРаспределенияЗатрат.СерияПродукции,
	|	РегистрАналитикаРаспределенияЗатрат.Спецификация,
	|	РегистрАналитикаВидаУчета.Подразделение,
	|	РегистрАналитикаРаспределенияЗатрат.Продукция.ЕдиницаХраненияОстатков.ВесНетто КАК ВесНетто
	|ИЗ
	|	РегистрНакопления.УчетЗатрат.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			АналитикаВидаУчета В
	|				(ВЫБРАТЬ
	|					АналитикаВыпуска.Ссылка
	|				ИЗ
	|					АналитикаВыпуска)) КАК ЗатратыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаРаспределенияЗатрат КАК РегистрАналитикаРаспределенияЗатрат
	|		ПО ЗатратыОбороты.АналитикаРаспределенияЗатрат = РегистрАналитикаРаспределенияЗатрат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаВидаУчета КАК РегистрАналитикаВидаУчета
	|		ПО ЗатратыОбороты.АналитикаВидаУчета = РегистрАналитикаВидаУчета.Ссылка
	|ГДЕ
	|	РегистрАналитикаРаспределенияЗатрат.Продукция В (&Продукция)";
	//|";
	ЕдиницыКоличестваВОтчете = 1;	
	Запрос.УстановитьПараметр("ЕдиницыКоличестваВОтчете", ЕдиницыКоличестваВОтчете);
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(Период,-6)));
	//Запрос.УстановитьПараметр("КонецПериода",  Дата('20190130160600'));
	//Запрос.УстановитьПараметр("КонецПериода",  Дата('20190121170200'));
	
	//мПродукции = Новый Массив;
	//
	//мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","131107"));
	//мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","П0001067"));
	//мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","П0001038"));
	////мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","П0001145"));
	
	мПродукции = Новый Массив; 
	мРазСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Объект.мПродукции,",");
	Для каждого лл из мРазСтрок цикл
		Если НЕ ЗначениеЗаполнено(лл) тогда продолжить конецесли;
		мПродукции.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",лл));
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Продукция", мПродукции);
	
	
	
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		ТЗвыпуск = Результат.Выгрузить();
	КонецЕсли;
	
	
	////СтоимостьВыпуска
	//Для каждого сс из ТЗвыпуск цикл
	//	ЗаполнитьСтоимостьВыпуска(сс,Период);
	//КонецЦикла;
	
	
	
	
	
	кКол =  ТЗвыпуск.количество();сч = 0;
	Для каждого сс из ТЗвыпуск цикл
		
		// Выпуск с пустой спецификации пропускаем
		Если сс.Спецификация.Пустая() тогда продолжить Конецесли;
		
		//ОбработкаПрерыванияПользователя();
		//Состояние("1.Учет выпусков, обработано: " + сокрлп(сч) + " из " + сокрлп(кКол)); 
		//сч = сч + 1;
		
		
		//мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат,АналитикаВидаУчета", сс.АналитикаРаспределенияЗатрат,сс.АналитикаВидаУчета));
		мЗатрат = ТЗзатрат.НайтиСтроки(Новый Структура("АналитикаРаспределенияЗатрат", сс.АналитикаРаспределенияЗатрат));
		Если мЗатрат.Количество() > 0 тогда
			Для каждого тт из мЗатрат цикл
				//Если тт.КоличествоЗатрат = 0 тогда продолжить КонецЕсли;				
				// появились ФОТ
				
				стр = ТЗвыпускЗатраты.Добавить();
				ЗаполнитьЗначенияСвойств(стр,сс);
				ЗаполнитьЗначенияСвойств(стр,тт);
				стр.АналитикаВидаУчетаЗатрат = тт.АналитикаВидаУчета;
				Если ТипЗнч(тт.Затрата) = Тип("СправочникСсылка.Номенклатура") тогда 
					стр.ВидВоспроизводства = тт.Затрата.ВидВоспроизводства;
				КонецЕсли;
				
				Если тт.КоличествоЗатрат = 0 тогда // ФОТ
					стр.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка;
				КонецЕсли;
				
				стр.ПоискПроизведен = Ложь;
				стр.П_АналитикаРаспределенияЗатрат  = сс.АналитикаРаспределенияЗатрат;
				
				Если стр.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
					стр.П_АналитикаРаспределенияЗатрат  = ПолучитьАналитикаРаспределенияЗатратДляЗатраты(стр.Затрата,стр.СерияПродукции.Наименование,стр.КоличествоЗатрат,стр.Подразделение,Период);
				Если  стр.П_АналитикаРаспределенияЗатрат = неопределено тогда // поиск по сериям не удался
				стр.П_АналитикаРаспределенияЗатрат  = _ПолучитьАналитикаРаспределенияЗатратДляЗатраты(стр.Затрата,стр.СерияПродукции.Наименование,стр.КоличествоЗатрат,стр.Подразделение,Период);
				Конецесли;
				КонецЕсли;	
				
		      стр.ВесПродукции = сс.Продукция.ЕдиницаДляОтчетов.ВесНетто * сс.КоличествоВыпуска;
			  стр.ВесПродукцииЕд =  сс.Продукция.ЕдиницаДляОтчетов.ВесНетто;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	
	//!Собрать тз ХЗН (набор полуфабрикатов)
	мПолуфабрикатов = ТЗвыпускЗатраты.НайтиСтроки(Новый Структура("ВидВоспроизводства",Перечисления.ВидыВоспроизводстваНоменклатуры.Производство));
	ТЗ_ХЗН = ТЗвыпускЗатраты.СкопироватьКолонки();
	Для каждого жж из мПолуфабрикатов цикл
		    зз = ТЗ_ХЗН.Добавить();
			ЗаполнитьЗначенияСвойств(зз,жж);
	КонецЦикла;	
	ТЗ_ХЗН.Свернуть("Продукция,СерияПродукции,Затрата");
	Для каждого дд из ТЗвыпускЗатраты цикл
		  мПоиск = ТЗ_ХЗН.НайтиСтроки(Новый Структура("Продукция,СерияПродукции",дд.Продукция,дд.СерияПродукции));
		  Если мПоиск.Количество()> 2 тогда
				дд.ПоискПроизведен = Истина;
				дд.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка;
				дд.П_АналитикаРаспределенияЗатрат = дд.АналитикаРаспределенияЗатрат;
		  Конецесли;	  
	КонецЦикла;	
	ТЗ_ХЗН.Колонки.Добавить("КоличествоПолуфабрикатов");
	ТЗ_ХЗН.ЗаполнитьЗначения(1,"КоличествоПолуфабрикатов");
	ТЗ_ХЗН.Свернуть("Продукция,СерияПродукции","КоличествоПолуфабрикатов");
	Для каждого нн из ТЗ_ХЗН цикл
		  Если нн.КоличествоПолуфабрикатов > 2 и нн.Продукция.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008")  тогда  //Конечная продукция
  		   хх = Объект.ХЗНУчетЗатрат.Добавить();
		   ЗаполнитьЗначенияСвойств(хх,нн);
	  КонецЕсли;	   
	КонецЦикла;	
	//!
	////////////////////////////////////////////
	
	
	
	
	
	
	
	
	
	_ПромТЗ = ТЗвыпускЗатраты.СкопироватьКолонки();
	кКол =  ТЗвыпускЗатраты.количество();сч = 0;
	Для каждого нн из ТЗвыпускЗатраты цикл
		
		//Если нн.КоличествоЗатрат = 0 тогда продолжить КонецЕсли; // без ФОТ				
		
		//ОбработкаПрерыванияПользователя();
		//Состояние("2.Учет затрат, обработано: " + сокрлп(сч) + " из " + сокрлп(кКол)); 
		//сч = сч + 1;
		
		Если нн.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
			ФактВыпускиЗаПериодПродукция(Период,нн);
			Если нн.ТЗ.Количество() > 0 тогда
				Для каждого нн1 из нн.ТЗ цикл
					Если нн1.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
						ФактВыпускиЗаПериодПродукция(Период,нн1);
						Если нн1.ТЗ.Количество() > 0 тогда
							Для каждого нн2 из нн1.ТЗ цикл
								Если нн2.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
									ФактВыпускиЗаПериодПродукция(Период,нн2);
									Если нн2.ТЗ.Количество() > 0 тогда
										Для каждого нн3 из нн2.ТЗ цикл
											Если нн3.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
												ФактВыпускиЗаПериодПродукция(Период,нн3);
												Если нн3.ТЗ.Количество() > 0 тогда
													Для каждого нн4 из нн3.ТЗ цикл
														Если нн4.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
															ФактВыпускиЗаПериодПродукция(Период,нн4);
															Если нн4.ТЗ.Количество() > 0 тогда
																Для каждого нн5 из нн4.ТЗ цикл
																	Если нн5.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство тогда
																		ФактВыпускиЗаПериодПродукция(Период,нн5);
																		
																	КонецЕсли;
																	нн5.ПоискПроизведен = Истина;
																КонецЦикла;
															Конецесли;
														КонецЕсли;
														нн4.ПоискПроизведен = Истина;
													КонецЦикла;
												Конецесли;
											КонецЕсли;
											нн3.ПоискПроизведен = Истина;
										КонецЦикла;
									Конецесли;
								КонецЕсли;
								нн2.ПоискПроизведен = Истина;
							КонецЦикла;
						Конецесли;
					КонецЕсли;
					нн1.ПоискПроизведен = Истина;
				КонецЦикла;
			Конецесли;
		КонецЕсли;
		нн.ПоискПроизведен = Истина;
	КонецЦикла;
	
	
	
	
КонецПроцедуры



Функция _ПолучитьМассивПродукции()
	
	мМассив = неопределено;
	
	
	
	_ПолучитьКоэфф = ПолучитьКоэфф();
	
	
	
	
	
	
	возврат мМассив;
	
КонецФункции


Функция ПолучитьКоэфф()
	
	
	стКоэф = Новый Структура;
	
	
    Кофф = 1;
    КолЗатратСахар = 1;
	мПродукции = Новый Массив;
	
    Запрос = Новый Запрос;
	ЗапТекст = 
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка как ОПзС
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Продукция
		|	И ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры = &СерияПродукции
		|	И ОтчетПроизводстваЗаСменуПродукция.Количество = &Количество
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|";
   	Запрос.Текст = ЗапТекст;

		
	Запрос.УстановитьПараметр("Количество",Объект.ПродукцияКоличествоОтбор);
	Запрос.УстановитьПараметр("Продукция", Объект.ПродукцияОтбор);
	Запрос.УстановитьПараметр("СерияПродукции", Объект.ПродукцияСерияОтбор);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.Дата));

	мПродукции.Добавить(Объект.ПродукцияОтбор);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
	   Выборка = Результат.Выбрать();
	   Выборка.Следующий();
	   РаскрутитьОПзС(Выборка.ОПзС,мПродукции,Кофф,Объект.ПродукцияКоличествоОтбор,СокрЛП(Объект.ПродукцияСерияОтбор), Объект.ПродукцияОтбор,КолЗатратСахар,Истина);
	   
	   
	   иначе //поиск без количества по серии
	   
	ЗапТекст1 = 
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка как ОПзС
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Продукция
		|	И ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры = &СерияПродукции
		//|	И ОтчетПроизводстваЗаСменуПродукция.Количество = &Количество
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|";
   	Запрос.Текст = ЗапТекст1;
	//Запрос.УстановитьПараметр("Количество", ии.КоличествоПродукции);
	Запрос.УстановитьПараметр("Продукция", Объект.ПродукцияОтбор);
	Запрос.УстановитьПараметр("СерияПродукции", Объект.ПродукцияСерияОтбор);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.Дата));


	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
	   Выборка = Результат.Выбрать();
	   Выборка.Следующий();
	   РаскрутитьОПзС(Выборка.ОПзС,мПродукции,Кофф,Объект.ПродукцияКоличествоОтбор,СокрЛП(Объект.ПродукцияСерияОтбор), Объект.ПродукцияОтбор,КолЗатратСахар,Истина);
	КонецЕсли;
	КонецЕсли;
	
	стКоэф.Вставить("Кофф",Кофф);
	стКоэф.Вставить("КолЗатратСахар",КолЗатратСахар);
	стКоэф.Вставить("КолЗатратСахар",мПродукции);
	
	Возврат стКоэф;
	
КонецФункции


Процедура  РаскрутитьОПзС(ОПзС,мПродукции,Кофф,пКоличество,НаимСерииПродукции,пНом,КолЗатратСахар,фСерия)
	

    мПродукции.Добавить(пНом);


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСменуМатериалы.Номенклатура,
		|	ОтчетПроизводстваЗаСменуМатериалы.Количество,
		|	ОтчетПроизводстваЗаСменуМатериалы.СерияНоменклатуры
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Материалы КАК ОтчетПроизводстваЗаСменуМатериалы
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуМатериалы.Ссылка = &ОПзС
		|	И ОтчетПроизводстваЗаСменуМатериалы.Номенклатура.ВидВоспроизводства = &ВидВоспроизводства";

	Запрос.УстановитьПараметр("ВидВоспроизводства", Перечисления.ВидыВоспроизводстваНоменклатуры.Производство);
	Запрос.УстановитьПараметр("ОПзС", ОПзС);

	Результат = Запрос.Выполнить();

	
	Если НЕ Результат.Пустой() тогда
		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() цикл
	ВыборкаДетальныеЗаписи.Следующий();
		
	_ОПзС = неопределено;
	
	сСерияНом = Справочники.СерииНоменклатуры.НайтиПоНаименованию(НаимСерииПродукции,,,пНом);
	Если фСерия тогда
	мПр = ОПзС.Продукция.НайтиСтроки(Новый Структура("Номенклатура,СерияНоменклатуры",пНом,сСерияНом));
	иначе
	мПр = ОПзС.Продукция.НайтиСтроки(Новый Структура("Номенклатура",пНом));
	КонецЕсли;
	
	Если мПр.Количество() > 0 тогда
	// может быть несколько выпусков продукции и серии
	Если фСерия тогда
	кКоличество = пПолучитьКоличествоОПзС(пНом,сСерияНом);
	иначе
	кКоличество = пПолучитьКоличествоОПзСбезСерии(пНом);
    КонецЕсли;

	//от = ?(мПр[0].Количество > пКоличество,пКоличество/мПр[0].Количество, 1); // п/ф не может быть больше продукции
	от = ?(мПр[0].Количество > пКоличество,пКоличество/кКоличество, 1); // п/ф не может быть больше продукции
	Кофф = Кофф * от;
	
	_ОПзС = фНайтиОПзС(ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Количество,НаимСерииПродукции,ОПзС.Дата);
	Если _ОПзС = Неопределено тогда // ищем с другой серией
	_ОПзС = фНайтиОПзСбезСерии(ВыборкаДетальныеЗаписи.Номенклатура,ОПзС.Дата);
	фСерия = Ложь;
	КонецЕсли;	
	
	НаимСахар = сокрлп(ВыборкаДетальныеЗаписи.Номенклатура);
	Если Найти(НаимСахар,"Сахар") > 0 тогда
	  КолЗатратСахар = ВыборкаДетальныеЗаписи.Количество;
	КонецЕсли;
	
	
	Если _ОПзС <> Неопределено тогда
		
		РаскрутитьОПзС(_ОПзС,мПродукции,Кофф,ВыборкаДетальныеЗаписи.Количество,НаимСерииПродукции,ВыборкаДетальныеЗаписи.Номенклатура,КолЗатратСахар,фСерия);
	
	
	КонецЕсли;
    КонецЕсли;
    //КонецЦикла;
    КонецЕсли;
	
КонецПроцедуры	

Функция пПолучитьКоличествоОПзС(пНом,сСерияНом)
	кКоличество = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура,
		|	СУММА(ОтчетПроизводстваЗаСменуПродукция.Количество) КАК Количество,
		|	ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Номенклатура
		|	И ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры = &СерияНоменклатуры
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура,
		|	ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры";

	Запрос.УстановитьПараметр("Номенклатура", пНом);
	Запрос.УстановитьПараметр("СерияНоменклатуры", сСерияНом);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.Дата));
	
	Результат = Запрос.Выполнить();

	
	Если НЕ Результат.Пустой() тогда
		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	кКоличество = ВыборкаДетальныеЗаписи.Количество;
	
    КонецЕсли;

    возврат кКоличество;

	
КонецФункции	


Функция пПолучитьКоличествоОПзСбезСерии(пНом)
	кКоличество = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура,
		|	СУММА(ОтчетПроизводстваЗаСменуПродукция.Количество) КАК Количество,
		|	ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Номенклатура
	//	|	И ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры = &СерияНоменклатуры
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура,
		|	ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры";

	Запрос.УстановитьПараметр("Номенклатура", пНом);
	//Запрос.УстановитьПараметр("СерияНоменклатуры", сСерияНом);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.Дата));
	
	Результат = Запрос.Выполнить();

	
	Если НЕ Результат.Пустой() тогда
		
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	кКоличество = ВыборкаДетальныеЗаписи.Количество;
	
    КонецЕсли;

    возврат кКоличество;

	
КонецФункции	



Функция фНайтиОПзС(_Продукция,_Количество,_СерияПродукции,_Дата)
	
	ОпзС = неопределено;
    	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка как ОПзС
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Продукция
		|	И ОтчетПроизводстваЗаСменуПродукция.СерияНоменклатуры = &СерияПродукции
	//	|	И ОтчетПроизводстваЗаСменуПродукция.Количество = &Количество
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";

	//Запрос.УстановитьПараметр("Количество", _Количество);
	Запрос.УстановитьПараметр("Продукция", _Продукция);
	Запрос.УстановитьПараметр("СерияПродукции", Справочники.СерииНоменклатуры.НайтиПоНаименованию(_СерияПродукции,,,_Продукция));
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(_Дата));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(_Дата));


	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
	   Выборка = Результат.Выбрать();
	   Выборка.Следующий();
	   ОпзС = Выборка.ОПзС;
	КонецЕсли;
	
	Возврат ОпзС;
	
КонецФункции


Функция фНайтиОПзСбезСерии(_Продукция,_Дата)
	
	ОпзС = неопределено;
    	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка КАК ОПзС
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|ГДЕ
		|	ОтчетПроизводстваЗаСменуПродукция.Номенклатура = &Продукция
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|	И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата УБЫВ";

	//Запрос.УстановитьПараметр("Количество", _Количество);
	Запрос.УстановитьПараметр("Продукция", _Продукция);
	//Запрос.УстановитьПараметр("СерияПродукции", Справочники.СерииНоменклатуры.НайтиПоНаименованию(_СерияПродукции,,,_Продукция));
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ДобавитьМесяц(_Дата,-6)));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(_Дата));


	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
	   Выборка = Результат.Выбрать();
	   Выборка.Следующий();
	   ОпзС = Выборка.ОПзС;
	КонецЕсли;
	
	Возврат ОпзС;
	
КонецФункции





