
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Записывать = Истина;
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Очистить();
	
	
	ТЗ_Факт = Факт.Выгрузить(,"ТорговаяТочка, Товарооборот, Премия, ФиксированнаяСуммаПремии");
	ТЗ_Факт.Свернуть("ТорговаяТочка", "Товарооборот, Премия, ФиксированнаяСуммаПремии");
	
	
	Для Каждого ТекСтрокаФакт Из ТЗ_Факт Цикл
		Если ТекСтрокаФакт.Премия > 0 Тогда
			Движение = Движения.Лео_ПланФактПримииНепрямымКлиентам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = НачалоПериода;
			Движение.Контрагент = Контрагент;
			Движение.Сеть = Сеть;
			Движение.ТорговаяТочка = ТекСтрокаФакт.ТорговаяТочка;
			Движение.Товарооборот = ТекСтрокаФакт.Товарооборот;
			Движение.ФиксированнаяСумма = ТекСтрокаФакт.ФиксированнаяСуммаПремии;
			Движение.Премия = ТекСтрокаФакт.Премия;	
		КонецЕсли;
	КонецЦикла;
	
	КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ответственный = Справочники.Пользователи.ПустаяСсылка() Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
