
&НаСервере
Процедура ЗаполнитьНаСервере()
	// Вставить содержимое обработчика.
	
	
	Объект.ТабАУП.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	//|	СУММА(ВЫБОР
	//|			КОГДА Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	//|				ТОГДА Лео_ФакТрудозатратОПЗС_Свод.СуммаФакт / Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ФактТрудозатратНаЕд,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	//|ГДЕ
	//|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	//|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	//|	И Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	//|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТЗ.Продукция КАК Номенклатура,
	//|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	//|	СУММА(ТЗ.ОбъемПартииФакт) КАК Выпуск,
	//|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) КАК Поле1,
	//|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) / СУММА(ТЗ.ОбъемПартииФакт) КАК ФактическаяСтоимостьТрудаНаЕд
	//|ИЗ
	//|	ТЗ КАК ТЗ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТЗ.Продукция,
	//|	ТЗ.ПродукцияСерия"; 
	
	
	
	"ВЫБРАТЬ
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб
	|ИЗ
	|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	|ГДЕ
	|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ФакТрудозатратОПЗС_Свод.Регистратор,
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗоб.ПродукцияСерия,
	|	СУММА(ТЗоб.ОбъемПартииФакт) КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб_1
	|ИЗ
	|	ТЗоб КАК ТЗоб
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗоб.ПродукцияСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	СУММА(ВЫБОР
	|			КОГДА Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	|				ТОГДА Лео_ФакТрудозатратОПЗС_Свод.СуммаФакт / Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФактТрудозатратНаЕд,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	|ГДЕ
	|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Продукция КАК Номенклатура,
	|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	|	СУММА(ТЗ.ОбъемПартииФакт) КАК ОбъемПартииФакт,
	|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) КАК Поле1,
	|	СУММА(ТЗ.ФактТрудозатратНаЕд * ТЗ.ОбъемПартииФакт) / СУММА(ТЗ.ОбъемПартииФакт) КАК ФактическаяСтоимостьТрудаНаЕд,
	|	МАКСИМУМ(ТЗоб_1.ОбъемПартииФакт) КАК Выпуск
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗоб_1 КАК ТЗоб_1
	|		ПО ТЗ.ПродукцияСерия = ТЗоб_1.ПродукцияСерия
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Продукция,
	|	ТЗ.ПродукцияСерия";	
	
	
	
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008"));//Конечная продукция
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			стр = Объект.ТабАУП.Добавить();
			ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи);
			стр.ФактическаяСтоимостьТрудаНаОбъем = стр.Выпуск * стр.ФактическаяСтоимостьТрудаНаЕд;
			
		КонецЦикла;
		
		
		ЗаполнитьАУП();
		
	КонецЕсли;
	
	Объект.ТабАУП.Сортировать("Номенклатура");
	
КонецПроцедуры     

Процедура ЗаполнитьАУП()
	
	_ФактическаяСтоимостьТрудаНаОбъем = 0; 
	_ИтогоТрудозатратыПолные = 0; 
	_ФОТАУПФактВыплата = 0;
	Для каждого стр из Объект.ТабАУП цикл
		_ФактическаяСтоимостьТрудаНаОбъем = _ФактическаяСтоимостьТрудаНаОбъем + стр.ФактическаяСтоимостьТрудаНаОбъем; 
	КонецЦикла;
	
	Для каждого стр из Объект.ТабАУП цикл
		стр.ФОТПрямойФактВыплата = стр.ФактическаяСтоимостьТрудаНаОбъем/_ФактическаяСтоимостьТрудаНаОбъем * Объект.ФОТПрямой; 	
		стр.ФОТАУПФактВыплата = стр.ФактическаяСтоимостьТрудаНаОбъем/_ФактическаяСтоимостьТрудаНаОбъем * Объект.ФОТАУП; 	
		стр.ИтогоТрудозатратыПолные = стр.ФОТПрямойФактВыплата + стр.ФОТАУПФактВыплата;	
		стр.ФактСтоимостьТрудозатратПолныеНаЕд = стр.ИтогоТрудозатратыПолные/стр.Выпуск;	
		_ИтогоТрудозатратыПолные = _ИтогоТрудозатратыПолные + стр.ИтогоТрудозатратыПолные;
		_ФОТАУПФактВыплата = _ФОТАУПФактВыплата + стр.ФОТАУПФактВыплата;
	КонецЦикла;
	
	//Объект.Коэффициент = _ИтогоТрудозатратыПолные/_ФактическаяСтоимостьТрудаНаОбъем;
	Объект.Коэффициент = (Объект.ФОТПрямой + _ФОТАУПФактВыплата)/Объект.ФОТПрямой;
	        
	
КонецПроцедуры	


Процедура ЗаполнитьОсновные()
	
	_МатериальнаяСебестоимость = 0; 
	_Трудозатраты = 0;
	Для каждого стр из Объект.Таб цикл
		_МатериальнаяСебестоимость = _МатериальнаяСебестоимость + стр.МатериальнаяСебестоимость; 
		_Трудозатраты = _Трудозатраты + стр.Трудозатраты; 
	КонецЦикла;
	
	Для каждого стр из Объект.Таб цикл
		стр.ОбщепроизводственныеРасходы = Объект.ОбщепроизводственныеРасходы/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.Логистика = Объект.Логистика/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.КоммунальныеУслуги = Объект.КоммунальныеУслуги/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.Амортизация = Объект.Амортизация/(_МатериальнаяСебестоимость + _Трудозатраты)*(стр.МатериальнаяСебестоимость +  стр.Трудозатраты); 	
		стр.ПроизводственнаяСебестоимость = стр.МатериальнаяСебестоимость+стр.Трудозатраты+ стр.ОбщепроизводственныеРасходы+ стр.Логистика+ стр.КоммунальныеУслуги+ стр.Амортизация; 
		стр.ПроизводственнаяСебестоимостьЕд = стр.ПроизводственнаяСебестоимость / стр.Количество;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика 
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФОТПрямойПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьАУП();
КонецПроцедуры

&НаКлиенте
Процедура ФОТАУППриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьАУП();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОсновнаяНаСервере()
	// Вставить содержимое обработчика. 
	
	Объект.Таб.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	//|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	//|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска,
	//|	СУММА(Лео_УчетЗатратОПЗС_Свод.КоличествоФакт / Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска * Лео_УчетЗатратОПЗС_Свод.ЦенаФакт) КАК СуммаСИМсПотерямиФактЕд
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	РегистрНакопления.Лео_УчетЗатратОПЗС_Свод КАК Лео_УчетЗатратОПЗС_Свод
	//|ГДЕ
	//|	Лео_УчетЗатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	////|	И Лео_УчетЗатратОПЗС_Свод.Продукция.ВидНоменклатуры = &ВидНоменклатуры
	//|	И Лео_УчетЗатратОПЗС_Свод.Продукция В (&Продукция)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	//|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	//|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТЗ.Продукция КАК Номенклатура,
	//|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	//|	СУММА(ТЗ.ОбъемВыпуска) КАК Количество,
	//|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСтоимостьНаЕд,
	//|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) * СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСебестоимость
	//|ИЗ
	//|	ТЗ КАК ТЗ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТЗ.Продукция,
	//|	ТЗ.ПродукцияСерия"; 
	
	
	"ВЫБРАТЬ
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб
	|ИЗ
	|	РегистрНакопления.Лео_ФакТрудозатратОПЗС_Свод КАК Лео_ФакТрудозатратОПЗС_Свод
	|ГДЕ
	|	Лео_ФакТрудозатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_ФакТрудозатратОПЗС_Свод.Продукция В(&Продукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_ФакТрудозатратОПЗС_Свод.Регистратор,
	|	Лео_ФакТрудозатратОПЗС_Свод.Продукция,
	|	Лео_ФакТрудозатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_ФакТрудозатратОПЗС_Свод.ОбъемПартииФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗоб.ПродукцияСерия,
	|	СУММА(ТЗоб.ОбъемПартииФакт) КАК ОбъемПартииФакт
	|ПОМЕСТИТЬ ТЗоб_1
	|ИЗ
	|	ТЗоб КАК ТЗоб
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗоб.ПродукцияСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска,
	|	СУММА(Лео_УчетЗатратОПЗС_Свод.КоличествоФакт / Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска * Лео_УчетЗатратОПЗС_Свод.ЦенаФакт) КАК СуммаСИМсПотерямиФактЕд
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрНакопления.Лео_УчетЗатратОПЗС_Свод КАК Лео_УчетЗатратОПЗС_Свод
	|ГДЕ
	|	Лео_УчетЗатратОПЗС_Свод.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Лео_УчетЗатратОПЗС_Свод.Продукция В(&Продукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	Лео_УчетЗатратОПЗС_Свод.Продукция,
	|	Лео_УчетЗатратОПЗС_Свод.ПродукцияСерия,
	|	Лео_УчетЗатратОПЗС_Свод.ОбъемВыпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Продукция КАК Номенклатура,
	|	ТЗ.ПродукцияСерия КАК СерияНоменклатуры,
	|	СУММА(ТЗ.ОбъемВыпуска) КАК Количество_1,
	|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСтоимостьНаЕд,
	|	СУММА(ТЗ.СуммаСИМсПотерямиФактЕд * ТЗ.ОбъемВыпуска) / СУММА(ТЗ.ОбъемВыпуска) * СУММА(ТЗ.ОбъемВыпуска) КАК МатериальнаяСебестоимость,
	|	МАКСИМУМ(ТЗоб_1.ОбъемПартииФакт) КАК Количество
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗоб_1 КАК ТЗоб_1
	|		ПО ТЗ.ПродукцияСерия = ТЗоб_1.ПродукцияСерия
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Продукция,
	|	ТЗ.ПродукцияСерия";
	
	
	
	
	//Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008"));//Конечная продукция
	Запрос.УстановитьПараметр("Продукция",РеквизитФормыВЗначение("Объект").ТабАУП.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			стр = Объект.Таб.Добавить();
			ЗаполнитьЗначенияСвойств(стр,ВыборкаДетальныеЗаписи);  
						
		КонецЦикла;
		
		ЗаполнитьФОТданными();
		
		//ЗаполнитьОПР_Логистика();
		
	КонецЕсли;
	
	ЗаполнитьОсновные();
	
	Объект.Таб.Сортировать("Номенклатура");
	
КонецПроцедуры 


Процедура ЗаполнитьФОТданными()

	Для каждого стр из Объект.Таб цикл
		
		
		мПоиска = Объект.ТабАУП.НайтиСтроки(Новый Структура("Номенклатура,СерияНоменклатуры",стр.Номенклатура,стр.СерияНоменклатуры));
		Если мПоиска.Количество() > 0 тогда
			
			//стр.Трудозатраты = мПоиска[0].ФактическаяСтоимостьТрудаНаОбъем;
			стр.Трудозатраты = мПоиска[0].ИтогоТрудозатратыПолные;
					
		Конецесли;
		
		
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсновная(Команда)
	ЗаполнитьОсновнаяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбщепроизводственныеРасходыПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры

&НаКлиенте
Процедура ЛогистикаПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры

&НаКлиенте
Процедура КоммунальныеУслугиПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры

&НаКлиенте
Процедура АмортизацияПриИзменении(Элемент)
	ЗаполнитьОсновные();
КонецПроцедуры
