
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Лео_УчетЗатрат Приход
	Движения.Лео_УчетЗатрат.Записывать = Истина;
	Движения.Лео_УчетЗатрат.Очистить();
	Для Каждого ТекСтрокаУчетЗатрат Из УчетЗатрат Цикл
		Движение = Движения.Лео_УчетЗатрат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукция = ТекСтрокаУчетЗатрат.Продукция;
		Движение.ПродукцияСерия = ТекСтрокаУчетЗатрат.ПродукцияСерия;
		Движение.Номенклатура = ТекСтрокаУчетЗатрат.Номенклатура;
		Движение.СерияНоменклатуры = ТекСтрокаУчетЗатрат.СерияНоменклатуры;
		Движение.СтатьяЗатрат = ТекСтрокаУчетЗатрат.СтатьяЗатрат;
		Движение.КоличествоПродукции = ТекСтрокаУчетЗатрат.КоличествоПродукции;
		Движение.КоличествоЗатрат = ТекСтрокаУчетЗатрат.КоличествоЗатрат;
		Движение.СтоимостьЗатрат = ТекСтрокаУчетЗатрат.СтоимостьЗатрат;
		Движение.КоличествоПродукцииРеквизит = ТекСтрокаУчетЗатрат.КоличествоПродукции;
	КонецЦикла;

КонецПроцедуры
