#Область СлужебныеПроцедурыИФункции

// Возвращает структуру параметров, необходимых для работы
// конфигурации на клиенте при запуске, т.е. в обработчиках событий
// - ПередНачаломРаботыСистемы,
// - ПриНачалеРаботыСистемы
//
// Важно: при запуске недопустимо использовать команды сброса кэша
// повторно используемых модулей, иначе запуск может привести
// к непредсказуемым ошибкам и лишним серверным вызовам
// 
// Возвращаемое значение:
//   ФиксированнаяСтруктура - структура параметров работы клиента при запуске.
//
Функция ПараметрыРаботыКлиентаПриЗапуске() Экспорт
	
	ПервыйЗапросПараметров = Ложь;
	//Если ТипЗнч(ПараметрыРаботыКлиентаПриОбновлении) <> Тип("Структура") Тогда
	//	ПараметрыРаботыКлиентаПриОбновлении = Новый Структура;
	//КонецЕсли;
	//Если ПараметрыРаботыКлиентаПриОбновлении.Свойство("ПервыйЗапросПараметров") Тогда
	//	ПервыйЗапросПараметров = Истина;
	//	ПараметрыРаботыКлиентаПриОбновлении.Удалить("ПервыйЗапросПараметров");
	//КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	//ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	//              ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;

	Параметры = Новый Структура;
	Параметры.Вставить("ПервыйЗапросПараметров", ПервыйЗапросПараметров);
	Параметры.Вставить("ПараметрЗапуска", ПараметрЗапуска);
	Параметры.Вставить("СтрокаСоединенияИнформационнойБазы", СтрокаСоединенияИнформационнойБазы());
	
	//Параметры.Вставить("ЭтоВебКлиент", ЭтоВебКлиент());
	//Параметры.Вставить("ЭтоLinuxКлиент", ОбщегоНазначенияКлиент.ЭтоLinuxКлиент());
	//Параметры.Вставить("ЭтоMacOSКлиент", ОбщегоНазначенияКлиент.ЭтоMacOSКлиент());
	//Параметры.Вставить("ЭтоWindowsКлиент", ОбщегоНазначенияКлиент.ЭтоWindowsКлиент());
	//Параметры.Вставить("ЭтоМобильныйКлиент", ЭтоМобильныйКлиент());
	//Параметры.Вставить("ИспользуемыйКлиент", ИспользуемыйКлиент());
	//Параметры.Вставить("КаталогПрограммы", ТекущийКаталогПрограммы());
	//Параметры.Вставить("ИдентификаторКлиента", ИдентификаторКлиента());
	//Параметры.Вставить("СкрытьРабочийСтолПриНачалеРаботыСистемы", Ложь);
	//Параметры.Вставить("ОперативнаяПамять", ОбщегоНазначенияКлиент.ОперативнаяПамятьДоступнаяКлиентскомуПриложению());
	//Параметры.Вставить("РазрешениеОсновногоЭкрана", РазрешениеОсновногоЭкрана());
	//
	//// Установка даты клиента непосредственно перед вызовом, чтобы уменьшить погрешность.
	//Параметры.Вставить("ТекущаяДатаНаКлиенте", ТекущаяДата()); // Для расчета ПоправкаКВремениСеанса.
	//Параметры.Вставить("ТекущаяУниверсальнаяДатаВМиллисекундахНаКлиенте", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат СтандартныеПодсистемыВызовСервера.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
	
КонецФункции

// Возвращает структуру параметров, необходимых для работы
// конфигурации на клиенте.
// 
Функция ПараметрыРаботыКлиента() Экспорт
	
	Возврат СтандартныеПодсистемыВызовСервераПереопределяемый.ПараметрыРаботыКлиента();
	
КонецФункции

#КонецОбласти
