Функция ПечатьМаршрута(МаршрутСсылка) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ТранспортныйМаршрут");
	
	//вывод реквизитов шапки
	ЗапросПоШапке = Новый Запрос;
	ЗапросПоШапке.Текст = 
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрут.Номер КАК НомерМаршрута,
	|	абс_ТранспортныйМаршрут.Дата КАК ДатаМаршрута,
	|	абс_ТранспортныйМаршрут.ВодительЭкспедитор КАК Водитель,
	|	абс_ТранспортныйМаршрут.ТранспортноеСредство.Марка КАК МаркаТС,
	|	абс_ТранспортныйМаршрут.ТранспортноеСредство.ГосНомер КАК ГосНомер,
	|	абс_ТранспортныйМаршрут.ТКПеревозчик КАК ТранспортнаяКомпания
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	|ГДЕ
	|	абс_ТранспортныйМаршрут.Ссылка = &Ссылка";
	ЗапросПоШапке.УстановитьПараметр("Ссылка",МаршрутСсылка);
	
	Шапка = ЗапросПоШапке.Выполнить().Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	Если Шапка.Следующий() Тогда         
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Шапка);
		ТабДокумент.Вывести(ОбластьШапка);
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	//вывод табличной части
	ОбластьСтрокаТабЧасти = Макет.ПолучитьОбласть("СтрокаТабЧасти");
	
	ЗапросПоТабЧасти = Новый Запрос;
	ЗапросПоТабЧасти.Текст =
    //{Лео Катанович}
	// БЫЛО
	//"ВЫБРАТЬ
	//|	Задания.ЗаявкаНаТранспорт.СуммаДокумента КАК СуммаДокумента,
	//|	Задания.ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
	//|	Задания.ЗаявкаНаТранспорт.АдресКонтрагента КАК АдресКонтрагента,
	//|	Задания.ЗаявкаНаТранспорт.ЗаказПокупателя.Номер КАК НомерЗаявки,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоВес КАК ВесБрутто,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоОбъем КАК Объем,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК КоличествоПалет,
	//|	Задания.ЗаявкаНаТранспорт.Склад КАК Склад,
	//|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.СпособДоставки КАК СпособДоставки,
	//|	Задания.ЗаявкаНаТранспорт.ОтветственныйМенеджер КАК Менеджер,
	//|	Задания.ЗаявкаНаТранспорт.КонтактыОтветственногоМенеджера КАК КонтактыМенеджера,
	//|	ВЫРАЗИТЬ(Задания.ЗаявкаНаТранспорт.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	//|	Задания.ЗаявкаНаТранспорт.ТКНазначения КАК ТКНазначения,
	//|	Задания.ЗаявкаНаТранспорт.АдресПромежуточный КАК АдресДоставки,
	//|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.УсловиеДоставки КАК УсловияДоставки,
	//|	Задания.ЗаявкаНаТранспорт.Контрагент,
	//|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Телефон
	//|ИЗ
	//|	Документ.абс_ТранспортныйМаршрут.Задания КАК Задания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|		ПО Задания.ЗаявкаНаТранспорт.Контрагент = КонтактнаяИнформация.Объект
	//|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	//|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	//|ГДЕ
	//|	Задания.Ссылка = &Ссылка
	//|ИТОГИ
	//|	СУММА(СуммаДокумента),
	//|	СУММА(ВесБрутто),
	//|	СУММА(Объем),
	//|	СУММА(КоличествоПалет)
	//|ПО
	//|	ОБЩИЕ";
	
	// Изменено	
	
	"ВЫБРАТЬ
	|	Задания.ЗаявкаНаТранспорт.СуммаДокумента КАК СуммаДокумента,
	|	Задания.ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
	|	Задания.ЗаявкаНаТранспорт.АдресКонтрагента КАК АдресКонтрагента,
	|	Задания.ЗаявкаНаТранспорт.ЗаказПокупателя.Номер КАК НомерЗаявки,
	|	Задания.ЗаявкаНаТранспорт.ДокументОснование КАК _ДокументОснование,
	|	Задания.ЗаявкаНаТранспорт.ВсегоВес КАК ВесБрутто,
	|	Задания.ЗаявкаНаТранспорт.ВсегоОбъем КАК Объем,
	|	Задания.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК КоличествоПалет,
	|	Задания.ЗаявкаНаТранспорт.Склад КАК Склад,
	|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.СпособДоставки КАК СпособДоставки,
	|	Задания.ЗаявкаНаТранспорт.ОтветственныйМенеджер КАК Менеджер,
	|	Задания.ЗаявкаНаТранспорт.КонтактыОтветственногоМенеджера КАК КонтактыМенеджера,
	|	ВЫРАЗИТЬ(Задания.ЗаявкаНаТранспорт.Комментарий КАК СТРОКА(300)) КАК Комментарий,
	|	Задания.ЗаявкаНаТранспорт.ТКНазначения КАК ТКНазначения,
	|	Задания.ЗаявкаНаТранспорт.АдресПромежуточный КАК АдресДоставки,
	|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.УсловиеДоставки КАК УсловияДоставки,
	|	Задания.ЗаявкаНаТранспорт.Контрагент,
	|	ЕСТЬNULL(ВложенныйЗапрос.Представление, """") КАК Телефон,
	|	Задания.ЗаявкаНаТранспорт.ЗаказПокупателя.НомерПоДаннымПокупателя КАК НомерЗаказаКонтрагента,
	|	Задания.ЗаявкаНаТранспорт.Контрагент.Лео_КлиентEDI КАК КлиентЭДО
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК Задания
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтактнаяИнформация.Объект КАК Объект,
	|			МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))) КАК Представление,
	|			МАКСИМУМ(КонтактнаяИнформация.абс_ДатаАктуальностиКИ) КАК абс_ДатаАктуальностиКИ
	|		ИЗ
	|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ГДЕ
	|			КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КонтактнаяИнформация.Объект) КАК ВложенныйЗапрос
	|		ПО Задания.ЗаявкаНаТранспорт.Контрагент = ВложенныйЗапрос.Объект
	|ГДЕ
	|	Задания.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(СуммаДокумента),
	|	СУММА(ВесБрутто),
	|	СУММА(Объем),
	|	СУММА(КоличествоПалет)
	|ПО
	|	ОБЩИЕ";
    //Лео Катанович} 
	ЗапросПоТабЧасти.УстановитьПараметр("Ссылка",МаршрутСсылка);
	
	ВыборкаИтоги = ЗапросПоТабЧасти.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтоги.Следующий();
	
	НомерСтроки = 0;
	ВыборкаСтроки = ВыборкаИтоги.Выбрать();
	Пока ВыборкаСтроки.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТабЧасти.Параметры, ВыборкаСтроки);
		ОбластьСтрокаТабЧасти.Параметры.Контрагент = ВыборкаСтроки.Контрагент.НаименованиеПолное;
		ОбластьСтрокаТабЧасти.Параметры.НомерСтроки = НомерСтроки;
		//ОбластьСтрокаТабЧасти.Параметры.КонтактыМенеджера = ВыборкаСтроки.Телефон + ?(ЗначениеЗаполнено(ВыборкаСтроки.КонтактыМенеджера),"; " + ВыборкаСтроки.КонтактыМенеджера ,"");
		
		// zhiga {
	    // Перемещение (Щербинина)
		Если НЕ ЗначениеЗаполнено(ВыборкаСтроки.АдресДоставки) и ЗначениеЗаполнено(ВыборкаСтроки._ДокументОснование) 
			И ТипЗнч(ВыборкаСтроки._ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
			_ДокОсн = ВыборкаСтроки._ДокументОснование;
			ОбластьСтрокаТабЧасти.Параметры.АдресДоставки =	?(ТипЗнч(_ДокОсн.абс_ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"),_ДокОсн.абс_ДокументОснование.АдресДоставки,"");
		КонецЕсли;
		// zhiga }
		
		//// zhiga {
		//// Убоженко, водители путают адрес доставки и везут на адрес Контрагента
		//ОсновнойСпособДоставки = ВыборкаСтроки.Контрагент.абс_ОсновнойСпособДоставки;
		//ОбластьСтрокаТабЧасти.Параметры.АдресКонтрагента = ОсновнойСпособДоставки.АдресДоставки;
		//// zhiga }
		
		//По запросу Глуховой
		//ЛЕО Зароднюк В
		Если ВыборкаСтроки.КлиентЭДО Тогда
		ОбластьСтрокаТабЧасти.Параметры.Фото1 = "ДА";
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаТабЧасти);
	КонецЦикла;
	
	//итоги
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ИтогоСуммаДокумента  = ВыборкаИтоги.СуммаДокумента;
	ОбластьПодвал.Параметры.ИтогоВесБрутто       = ВыборкаИтоги.ВесБрутто;
	ОбластьПодвал.Параметры.ИтогоОбъем           = ВыборкаИтоги.Объем;
	ОбластьПодвал.Параметры.ИтогоКоличествоПалет = ВыборкаИтоги.КоличествоПалет;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьПутевогоЛиста(МаршрутСсылка) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ПутевойЛист");
	
	ОбластьЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
	ОбластьОборотнаяСторона = Макет.ПолучитьОбласть("ОборотнаяСторона");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрут.Дата,
	|	абс_ТранспортныйМаршрут.ВодительЭкспедитор.Представление КАК Водитель,
	|	абс_ТранспортныйМаршрут.ТранспортноеСредство.Марка КАК МаркаАвтомобиля,
	|	абс_ТранспортныйМаршрут.ТранспортноеСредство.МаркаПрицепа КАК МаркаПрицепа,
	|	абс_ТранспортныйМаршрут.ТранспортноеСредство.ГосНомерПрицепа КАК НомерПрицепа,
	|	абс_ТранспортныйМаршрут.ТранспортноеСредство.ГосНомер КАК ГосНомер,
	|	абс_ТранспортныйМаршрут.Организация.Представление КАК Организация,
	|	абс_ТранспортныйМаршрут.СерияПутевогоЛиста,
	|	абс_ТранспортныйМаршрут.НомерПутевогоЛиста,
	|	ЕСТЬNULL(абс_ТранспортныйМаршрут.ВодительЭкспедитор.абс_СерияВУ, """") КАК СерияВУ,
	|	ЕСТЬNULL(абс_ТранспортныйМаршрут.ВодительЭкспедитор.абс_НомерВУ, """") КАК НомерВУ
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	|ГДЕ
	|	абс_ТранспортныйМаршрут.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МаршрутСсылка);
	
	ЗапросЗаказчики = Новый Запрос;
	ЗапросЗаказчики.Текст = 
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрутЗадания.НомерСтроки КАК НомерСтроки,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.ДокументОтгрузки.Номер КАК НомерТТД,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Организация.Представление КАК Организация
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Организация";
	
	ЗапросЗаказчики.УстановитьПараметр("Ссылка", МаршрутСсылка);
	ПервыйЗаказчик = "";
	ВторойЗаказчик = "";
	НомерТТД1 = "";
	НомерТТД2 = "";
	
	ВыборкаОрганизации = ЗапросЗаказчики.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОрганизации.Следующий() Тогда
		ПервыйЗаказчик = ВыборкаОрганизации.Организация;
		ВыборкаТТД = ВыборкаОрганизации.Выбрать();
		Пока ВыборкаТТД.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаТТД.НомерТТД) Тогда
				НомерТТД1 = НомерТТД1 + ВыборкаТТД.НомерТТД + ", ";
			КонецЕсли;
		КонецЦикла;
		Если ВыборкаОрганизации.Следующий() Тогда
			ВторойЗаказчик = ВыборкаОрганизации.Организация;
			ВыборкаТТД = ВыборкаОрганизации.Выбрать();
			Пока ВыборкаТТД.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаТТД.НомерТТД) Тогда
					НомерТТД2 = НомерТТД2 + ВыборкаТТД.НомерТТД + ", ";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	
	Если НомерТТД1<>"" Тогда
		НомерТТД1 = Лев(СокрЛП(НомерТТД1),СтрДлина(СокрЛП(НомерТТД1))-1);
	КонецЕсли;
	Если НомерТТД2<>"" Тогда
		НомерТТД2 = Лев(СокрЛП(НомерТТД2),СтрДлина(СокрЛП(НомерТТД2))-1);
	КонецЕсли;
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьЛицеваяСторона.Параметры, Выборка);
		ОбластьЛицеваяСторона.Параметры.ДатаПутевогоЛиста = Формат(Выборка.Дата, "ДЛФ=ддММММгггг");
		ОбластьЛицеваяСторона.Параметры.НомерВУ = Выборка.СерияВУ + " " +Выборка.НомерВУ;
		ЗаполнитьЗначенияСвойств(ОбластьОборотнаяСторона.Параметры, Выборка);
	КонецЕсли;
	
	ОбластьОборотнаяСторона.Параметры.ПервыйЗаказчик = ПервыйЗаказчик;
	ОбластьОборотнаяСторона.Параметры.ВторойЗаказчик = ВторойЗаказчик;
	ОбластьОборотнаяСторона.Параметры.НомерТТД1 = НомерТТД1;
	ОбластьОборотнаяСторона.Параметры.НомерТТД2 = НомерТТД2;
	
	ТабДокумент.Вывести(ОбластьЛицеваяСторона);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДокумент.Вывести(ОбластьОборотнаяСторона);
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьТранспортнойНакладной(СводнаяЗаявкаНаТранспорт, ТранспортныйМаршрут, ЗаявкаНаТранспорт) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ТранспортнаяНакладная");
	
	ОбластьЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
	ОбластьОборотнаяСторона = Макет.ПолучитьОбласть("ОборотнаяСторона");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.Ссылка.ДатаИсполнения,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ТКНазначения.ОсновнойМенеджерПокупателя КАК ГрузоотправительОтветственный,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ТКНазначения.ОсновноеКонтактноеЛицо КАК ГрузополучательОтветственный,
	|	СУММА(абс_ЗаявкаНаТранспортТовары.КоличествоМест) КАК КоличествоМест,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК КоличествоПалет,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ВсегоВес КАК Вес,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки.Номер КАК ДокументОтгрузкиНомер,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки.Дата КАК ДокументОтгрузкиДата,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """") КАК НомерСФ,
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСФ,
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК СчетФактура,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки КАК ДокументОтгрузки,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ВодительЭкспедитор.Представление КАК Водитель,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство.Марка КАК МаркаТС,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство.ГосНомер КАК НомерТС,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование.Номер КАК ДокументОснованиеНомер,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование.Дата КАК ДокументОснованиеДата,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование КАК ДокументОснование,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство КАК ТранспортноеСредство,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство.СобственноеТС КАК СобственноеТС,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТКПеревозчик КАК ТКПеревозчик,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ПеремещениеТоваров)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование.абс_ДокументОснование
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|	КОНЕЦ КАК Организация,
	|	абс_ЗаявкаНаТранспортТовары.Ссылка.АдресПромежуточный,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя.абс_НомерЗаказаEDI КАК НомерЗаказаEDI
	|ИЗ
	|	Документ.абс_СводнаяЗаявкаНаТранспорт.Маршруты КАК абс_СводнаяЗаявкаНаТранспортМаршруты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗаявкаНаТранспорт.Товары КАК абс_ЗаявкаНаТранспортТовары
	|		ПО абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт = абс_ЗаявкаНаТранспортТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки = СчетФактураВыданный.ДокументОснование
	|			И (НЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка))
	|ГДЕ
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.Ссылка = &СводнаяЗаявкаНаТранспорт
	|	И абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = &ТранспортныйМаршрут
	|	И абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.Ссылка.ДатаИсполнения,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ТКНазначения.ОсновнойМенеджерПокупателя,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ТКНазначения.ОсновноеКонтактноеЛицо,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ВсегоКоличествоПалет,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ВсегоВес,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки.Номер,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки.Дата,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """"),
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОтгрузки,
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)),
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ВодительЭкспедитор.Представление,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство.Марка,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство.ГосНомер,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование.Номер,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование.Дата,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТКПеревозчик,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ТранспортноеСредство.СобственноеТС,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ПеремещениеТоваров)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование.абс_ДокументОснование
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя
	|	КОНЕЦ,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.АдресДоставки,
	|	абс_ЗаявкаНаТранспортТовары.Ссылка.АдресПромежуточный,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя.абс_НомерЗаказаEDI,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя.Грузополучатель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|				И ТИПЗНАЧЕНИЯ(абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Контрагент
	|		ИНАЧЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт.Организация
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("СводнаяЗаявкаНаТранспорт", СводнаяЗаявкаНаТранспорт);
	Запрос.УстановитьПараметр("ТранспортныйМаршрут", ТранспортныйМаршрут);
	Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", ЗаявкаНаТранспорт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДокументОтгрузкиНомер) Тогда
		НомерДок = ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ДокументОтгрузки);
	КонецЕсли;
	

	ОбластьЛицеваяСторона.Параметры.Дата = Формат(Выборка.ДатаИсполнения, "ДФ=дд.ММ.гггг");
	//ОбластьЛицеваяСторона.Параметры.НомерЗаказаПокупателя = Выборка.НомерЗаказаEDI;
	
	Если ЗначениеЗаполнено(Выборка.НомерЗаказаEDI) тогда
		ОбластьЛицеваяСторона.Параметры.НомерЗаказаПокупателя = Выборка.НомерЗаказаEDI;
	иначеЕсли ЗначениеЗаполнено(Выборка.ЗаказПокупателя) тогда //zhiga
		//{Лео Катанович
		Попытка
		   ОбластьЛицеваяСторона.Параметры.НомерЗаказаПокупателя = Выборка.ЗаказПокупателя.абс_НомерЗаказаEDI;
	    Исключение
		   ОбластьЛицеваяСторона.Параметры.НомерЗаказаПокупателя = "б/н";
	    КонецПопытки;
	    //Лео Катанович}
	Конецесли;
	
	
	ОбластьЛицеваяСторона.Параметры.НомерРеализации = НомерДок;
	ОбластьЛицеваяСторона.Параметры.НомерУПД = Выборка.НомерСФ;	
	ОбластьОборотнаяСторона.Параметры.Дата = Формат(Выборка.ДатаИсполнения, "ДФ=дд.ММ.гггг");
	
	КонтрагентСклада = Неопределено;
	Если ЗначениеЗаполнено(Выборка.ЗаказПокупателя) И ТипЗнч(Выборка.ЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя")  Тогда
		Если ТипЗнч(Выборка.ЗаказПокупателя.СкладГруппа) = Тип("СправочникСсылка.Склады") Тогда
			//+Лео Сафонов ЕА 30.06.2016
			//КонтрагентСклада = Выборка.ЗаказПокупателя.СкладГруппа.абс_Контрагент;
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Лео_СоответствиеСкладОрганизацияГрузотправительСрезПоследних.Контрагент
					|ИЗ
					|	РегистрСведений.Лео_СоответствиеСкладОрганизацияГрузотправитель.СрезПоследних(
					|			&ДатаДокумента,
					|			Организация = &Организация
					|				И Склад = &Склад) КАК Лео_СоответствиеСкладОрганизацияГрузотправительСрезПоследних";

			Запрос.УстановитьПараметр("ДатаДокумента", Выборка.ЗаказПокупателя.Дата);
			Запрос.УстановитьПараметр("Организация", Выборка.ЗаказПокупателя.Организация);
			Запрос.УстановитьПараметр("Склад",Выборка.ЗаказПокупателя.СкладГруппа);

			Результат = Запрос.Выполнить();

			ВыборкаДетальныеЗаписи = Результат.Выбрать();
            Если ВыборкаДетальныеЗаписи.Количество()> 0  тогда
			 	ВыборкаДетальныеЗаписи.Следующий();
				Грузоотправитель = ВыборкаДетальныеЗаписи.Контрагент;
			Иначе
				КонтрагентСклада = Выборка.ЗаказПокупателя.СкладГруппа.абс_Контрагент;
			КонецЕсли;
			//-Лео Сафонов ЕА 30.06.2016

		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
		
		Если ТипЗнч(Выборка.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		     КонтрагентСклада = Выборка.ДокументОснование.СкладОтправитель.абс_Контрагент;
		 Иначе	 
			 КонтрагентСклада = Выборка.ДокументОснование.Склад.абс_Контрагент;
		КонецЕсли;
	КонецЕсли;

	
	//Если ЗначениеЗаполнено(КонтрагентСклада) Тогда
	//	СведенияОГрузоотправителе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(КонтрагентСклада, Выборка.ДатаИсполнения);
	//Иначе
	//	СведенияОГрузоотправителе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузоотправитель, Выборка.ДатаИсполнения);
	//КонецЕсли;
	СведенияОГрузоотправителе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация, Выборка.ДатаИсполнения);
	// Leo + Никитин
	//Грузоотправитель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование,ФактическийАдрес,Телефоны"); 
	Грузоотправитель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
	//- Никитин
	
	ОбластьЛицеваяСторона.Параметры.Грузоотправитель = Грузоотправитель;
	//ОбластьОборотнаяСторона.Параметры.Грузоотправитель = Грузоотправитель;
	
	ТелефонГрузоотправительОтветственный = УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Выборка.ГрузоотправительОтветственный, Справочники.ВидыКонтактнойИнформации.РабочийТелефонКонтактногоЛицаКонтрагента);
	ТелефонГрузополучательОтветственный = УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(Выборка.ГрузополучательОтветственный, Справочники.ВидыКонтактнойИнформации.РабочийТелефонКонтактногоЛицаКонтрагента);
	
	ОбластьЛицеваяСторона.Параметры.ГрузоотправительОтветственный = "" + Выборка.ГрузоотправительОтветственный + " " + ТелефонГрузоотправительОтветственный;
	ОбластьОборотнаяСторона.Параметры.ГрузоотправительОтветственный = "" + Выборка.ГрузоотправительОтветственный + " " + ТелефонГрузоотправительОтветственный;
	ОбластьЛицеваяСторона.Параметры.ГрузополучательОтветственный = "" + Выборка.ГрузополучательОтветственный + " " + ТелефонГрузополучательОтветственный;
	
	Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
		СведенияОКонтрагенте = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Контрагент,  Выборка.ДатаИсполнения);
		ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"); 
	ИначеЕсли ЗначениеЗаполнено(Выборка.ЗаказПокупателя) Тогда
		//Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
		//	СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаИсполнения);
		//	ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ФактическийАдрес,Телефоны"); 
		//Иначе
			Если ЗначениеЗаполнено(Выборка.ЗаказПокупателя.Грузополучатель) Тогда
				СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ЗаказПокупателя.Грузополучатель,  Выборка.ДатаИсполнения);
			Иначе
				СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ЗаказПокупателя.Контрагент,  Выборка.ДатаИсполнения);
			КонецЕсли;
			ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"); 
		//КонецЕсли;
	Иначе
		СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаИсполнения);
		ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"); 
	КонецЕсли;
	
	//ОбластьЛицеваяСторона.Параметры.КоличествоМест = "" + Выборка.КоличествоПалет + " паллет" + ?(Выборка.КоличествоМест=0,""," ("+Выборка.КоличествоМест+") шт.");
	//сообщить("*********************************************");
	//сообщить(Выборка.ДокументОснование);

	//сообщить(Выборка.ЗаказПокупателя);
	//   сообщить(ОбластьЛицеваяСторона.Параметры.Грузополучатель);
	//сообщить(Выборка.КоличествоМест);
	//сообщить(Выборка.ДокументОтгрузкиНомер);

	ОбластьЛицеваяСторона.Параметры.КоличествоМест = ?(Выборка.КоличествоМест=0,"","" +?( (Выборка.КоличествоМест-Цел(Выборка.КоличествоМест))>0,(Цел(Выборка.КоличествоМест)+1),Выборка.КоличествоМест)   + " Короб.");
		
	
	
	ОбластьЛицеваяСторона.Параметры.Вес = ?(Выборка.Вес = 0, "", "" + Выборка.Вес + " кг");
	
	СопроводительныеДокументы = "";
	ПечатьУпд = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Контрагент
		|	И ЗначенияСвойствОбъектов.Свойство.Код = ""00000000162""";

	Запрос.УстановитьПараметр("Контрагент", Выборка.ДокументОтгрузки.Контрагент);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ПечатьУпд = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;


	Если   ПечатьУпд    Тогда
		Если ЗначениеЗаполнено(Выборка.ДокументОтгрузки) Тогда
			СопроводительныеДокументы = "Номер Заказа " + Выборка.НомерЗаказаEDI;
			Если ЗначениеЗаполнено(Выборка.СчетФактура) Тогда
				СопроводительныеДокументы = СопроводительныеДокументы + " Номер УПД " + 
				ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.СчетФактура) + " от " + Формат(Выборка.СчетФактура.Дата,"ДФ=дд.ММ.гггг");
			КонецЕсли;
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(Выборка.ДокументОтгрузки) Тогда
			СопроводительныеДокументы = "Накладная № " + ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ДокументОтгрузки) +  
				" от "+ Формат(Выборка.ДокументОтгрузкиДата,"ДФ=дд.ММ.гггг");
			Если ЗначениеЗаполнено(Выборка.СчетФактура) Тогда
				СопроводительныеДокументы = СопроводительныеДокументы + " счет-фактура № " + 
				ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.СчетФактура) + " от " + Формат(Выборка.СчетФактура.Дата,"ДФ=дд.ММ.гггг");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	ОбластьЛицеваяСторона.Параметры.СопроводительныеДокументы = СопроводительныеДокументы;
	
	АдресГрузополучателя = "";
	Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
		Если ТипЗнч(Выборка.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			
			ОбластьЛицеваяСторона.Параметры.АдресПогрузки = Выборка.ДокументОснование.абс_ПунктПогрузки;
			ОбластьЛицеваяСторона.Параметры.АдресВыгрузки = Выборка.ДокументОснование.абс_ПунктРазгрузки;
		Иначе
			ОбластьЛицеваяСторона.Параметры.АдресПогрузки = ЗаявкаНаТранспорт.АдресПромежуточный;
		КонецЕсли;
	Иначе
		
		//{Лео Катанович     - по заявке Марчука Д. от 27.12.2016
		//АдресГрузополучателя = "";
		//Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
		//	АдресГрузополучателя = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.Грузополучатель);
		//ИначеЕсли ЗначениеЗаполнено(Выборка.АдресДоставки) Тогда
		//	АдресГрузополучателя = Выборка.АдресДоставки;
		//Иначе 
		//	Если ЗначениеЗаполнено(Выборка.ЗаказПокупателя) Тогда
		//		АдресГрузополучателя = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.Контрагент);
		//		Если Не ЗначениеЗаполнено(АдресГрузополучателя) Тогда
		//			АдресГрузополучателя = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.ЗаказПокупателя.Контрагент);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
			Если  ЗначениеЗаполнено(Выборка.АдресПромежуточный) Тогда
				АдресГрузополучателя = СокрЛП(Выборка.АдресПромежуточный);
			Иначе	  
				Если ЗначениеЗаполнено(Выборка.ДокументОтгрузки.Грузополучатель) Тогда
					СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ДокументОтгрузки.Грузополучатель,  Выборка.ДатаИсполнения);
					АдресГрузополучателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "АдресДоставки");
					Если НЕ ЗначениеЗаполнено(АдресГрузополучателя) Тогда
						АдресГрузополучателя = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.ДокументОтгрузки.Грузополучатель);
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Выборка.АдресДоставки) Тогда
					АдресГрузополучателя = Выборка.АдресДоставки;
				Иначе	 
					АдресГрузополучателя = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.Контрагент);
				КонецЕсли;
			КонецЕсли;

		//Лео Катанович     - по заявке Марчука Д. от 27.12.2016}
		ОбластьЛицеваяСторона.Параметры.АдресВыгрузки = АдресГрузополучателя;
		
		КонтрагентСклада = Неопределено;
		Если ЗначениеЗаполнено(Выборка.ЗаказПокупателя) Тогда
			

			Если ТипЗнч(Выборка.ЗаказПокупателя.СкладГруппа) = Тип("СправочникСсылка.Склады") Тогда
				КонтрагентСклада = Выборка.ЗаказПокупателя.СкладГруппа.абс_Контрагент;
				//+Лео Сафонов ЕА 30.06.2016
				//КонтрагентСклада = Выборка.ЗаказПокупателя.СкладГруппа.абс_Контрагент;
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
						|	Лео_СоответствиеСкладОрганизацияГрузотправительСрезПоследних.Контрагент
						|ИЗ
						|	РегистрСведений.Лео_СоответствиеСкладОрганизацияГрузотправитель.СрезПоследних(
						|			&ДатаДокумента,
						|			Организация = &Организация
						|				И Склад = &Склад) КАК Лео_СоответствиеСкладОрганизацияГрузотправительСрезПоследних";

				Запрос.УстановитьПараметр("ДатаДокумента", Выборка.ЗаказПокупателя.Дата);
				Запрос.УстановитьПараметр("Организация", Выборка.ЗаказПокупателя.Организация);
				Запрос.УстановитьПараметр("Склад",Выборка.ЗаказПокупателя.СкладГруппа);

				Результат = Запрос.Выполнить();

				ВыборкаДетальныеЗаписи = Результат.Выбрать();
	            Если ВыборкаДетальныеЗаписи.Количество()> 0  тогда
				 	ВыборкаДетальныеЗаписи.Следующий();
			//		Грузоотправитель = ВыборкаДетальныеЗаписи.Контрагент;
					КонтрагентСклада = ВыборкаДетальныеЗаписи.Контрагент;

				Иначе
					КонтрагентСклада = Выборка.ЗаказПокупателя.СкладГруппа.абс_Контрагент;
				КонецЕсли;
				//-Лео Сафонов ЕА 30.06.2016
			КонецЕсли;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(КонтрагентСклада) Тогда
			// LEO + 01.04.16 Никитин
			//ОбластьЛицеваяСторона.Параметры.АдресПогрузки = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(КонтрагентСклада);
			искомыйАдрес=абс_ТранспортнаяЛогистика.ПолучитьФактическийАдресКонтрагента(КонтрагентСклада);
			
			Если ЗначениеЗаполнено(искомыйАдрес)Тогда 
				

				ОбластьЛицеваяСторона.Параметры.АдресПогрузки =ИскомыйАдрес; 
		    Иначе  
				

				ОбластьЛицеваяСторона.Параметры.АдресПогрузки = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(КонтрагентСклада);
            КонецЕсли;
			//-
		Иначе
						ОбластьЛицеваяСторона.Параметры.АдресПогрузки = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.Грузоотправитель);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьЛицеваяСторона.Параметры.МассаКоличествоМест = "" + Выборка.Вес + " кг, " + Выборка.КоличествоМест+ " Короб.";
	
	Если ЗначениеЗаполнено(Выборка.ДокументОтгрузкиНомер) Тогда
		НомерДок = ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ДокументОтгрузки);
		//ОбластьЛицеваяСторона.Параметры.НаименованиеГруза = "Реализаця товаров и услуг №" + НомерДок + " от " + Формат(Выборка.ДокументОтгрузкиДата, "ДФ=дд.ММ.гггг");
		ОбластьЛицеваяСторона.Параметры.НаименованиеГруза =  "Товар, производитель ООО ""ЛЕОВИТ нутрио""" ;

	Иначе
		НомерДок = ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ДокументОснование);
		ОбластьЛицеваяСторона.Параметры.НаименованиеГруза = "Перемещение товаров №" + НомерДок + " от " + Формат(Выборка.ДокументОснованиеДата, "ДФ=дд.ММ.гггг");
	КонецЕсли;	                                                                         
	
	ОбластьОборотнаяСторона.Параметры.Водитель = Выборка.Водитель;
	ОбластьОборотнаяСторона.Параметры.МаркаТС = Выборка.МаркаТС;
	ОбластьОборотнаяСторона.Параметры.НомерТС = Выборка.НомерТС;
	
	Если Выборка.СобственноеТС = Истина Тогда 
		ОбластьОборотнаяСторона.Параметры.Перевозчик = Грузоотправитель;
	Иначе
		СведенияОПеревозчике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ТКПеревозчик, Выборка.ДатаИсполнения);
		ТКПеревозчик = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
		ОбластьОборотнаяСторона.Параметры.Перевозчик = ТКПеревозчик;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЛицеваяСторона);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДокумент.Вывести(ОбластьОборотнаяСторона);
	
	//Возврат ТабДокумент;
	
	//+Лео zhiga
	//Если ЗаявкаНаТранспорт.Дата < '20210101' Тогда 
	Если ЗаявкаНаТранспорт.Дата < '20210101' Тогда 
	    Возврат ТабДокумент;
    иначе 
		//ТабДокумент = ЗаполнитьТабличныйДокументТН_2021(ОбластьЛицеваяСторона,ОбластьОборотнаяСторона,ЗаявкаНаТранспорт);
		
		//Сертификаты
		ТабДокумент = ЗаполнитьТабличныйДокументТН_2021(ОбластьЛицеваяСторона,ОбластьОборотнаяСторона,ЗаявкаНаТранспорт,Выборка.ЗаказПокупателя);

		
		ТабДокумент.АвтоМасштаб=Истина;
	    Возврат ТабДокумент;
	КонецЕсли; 
	//-Лео zhiga
	
	
КонецФункции

//{Лео Катанович
Функция ПечатьСводнойДоверенности(ДокументСсылка) Экспорт

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент",  ДокументСсылка.Ссылка);
	Запрос.УстановитьПараметр("ПустаяСсылка",  Документы.Доверенность.ПустаяСсылка());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрут.Номер,
	|	абс_ТранспортныйМаршрут.Дата КАК ДатаДокумента,
	|	абс_ТранспортныйМаршрут.Организация КАК Организация,
	|	абс_ТранспортныйМаршрут.Организация КАК Руководители,
	|	абс_ТранспортныйМаршрут.ВодительЭкспедитор КАК ФизЛицо,
	|	абс_ТранспортныйМаршрут.Задания.(
	|		Доверенность,
	|		Доверенность.НаПолучениеОт
	|	),
	|	абс_ТранспортныйМаршрут.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	|ГДЕ
	|	абс_ТранспортныйМаршрут.Ссылка = &ТекущийДокумент
	|	И абс_ТранспортныйМаршрут.Задания.Доверенность <> &ПустаяСсылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если НЕ Шапка.Следующий() Тогда
		 Возврат Неопределено;
	КонецЕсли;	 
	
	ВыборкаСтрокТовары = Шапка.Задания.Выбрать();
	ТЗ_Склад = Шапка.Задания.Выгрузить();
	ТЗ_СкладОтправитель = ТЗ_Склад.Скопировать();
    ТЗ_СкладОтправитель.Свернуть("ДоверенностьНаПолучениеОт");
    Если ТЗ_СкладОтправитель.Количество() <> 1 Тогда
		 //Предупреждение("Невозможно сформировать сводную доверенность по документу!" + ДокументСсылка); 
		 Возврат Неопределено;
	Иначе
	     Поставщик = ТЗ_СкладОтправитель[0].ДоверенностьНаПолучениеОт;	  
	КонецЕсли;	

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Доверенность_М2";

	Макет = ПолучитьОбщийМакет("М2");

	ФамилияИмяОтчествоФизЛица     = ФормированиеПечатныхФормСервер.ФамилияИмяОтчество(Шапка.ФизЛицо, Шапка.ДатаДокумента);
	ПодразделениеДолжностьФизЛица = ПолныеПрава.СведенияОСотруднике(Шапка.ФизЛицо, Шапка.ДатаДокумента, Шапка.Организация);

	ФамилияИмяОтчествоДоверенного = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
	ДолжностьДоверенного          = ?(НЕ ЗначениеЗаполнено(ПодразделениеДолжностьФизЛица.Должность),"",ПодразделениеДолжностьФизЛица.Должность);;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Отрез");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.НомерДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСсылка);
		ОбластьМакета.Параметры.ФИОДоверенного = ДолжностьДоверенного + " " + ОбщегоНазначения.ФамилияИнициалыФизЛица(ФамилияИмяОтчествоДоверенного);
		ОбластьМакета.Параметры.ПоставщикПредставление  = Поставщик.НаименованиеПолное;
		ОбластьМакета.Параметры.СрокДействия = Шапка.ДатаДокумента + 10*(3600*24);
		ТабДокумент.Вывести(ОбластьМакета);
		НазваниеФормы = "Типовая межотраслевая форма № М-2";

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Шапка.Руководители, Шапка.ДатаДокумента);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;

	ПаспортФизЛица        = ОбщегоНазначения.ПаспортныеДанные(Шапка.ФизЛицо, Шапка.ДатаДокумента);
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента,, Шапка.БанковскийСчет);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.НомерДокумента                = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСсылка);
	ОбластьМакета.Параметры.НазваниеФормы                 = НазваниеФормы;
	ОбластьМакета.Параметры.ОрганизацияПредставление      = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ОбластьМакета.Параметры.Поставщик                     = Поставщик;
	ОбластьМакета.Параметры.ПоставщикПредставление        = Поставщик.НаименованиеПолное;
	ОбластьМакета.Параметры.РеквизитыСчета                = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации, "НомерСчета,Банк,БИК,КоррСчет,");
	ОбластьМакета.Параметры.РеквизитыПотребителя          = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ОбластьМакета.Параметры.ОрганизацияКодПоОКПО          = СведенияОбОрганизации.КодПоОКПО;
	ОбластьМакета.Параметры.ДолжностьДоверенного          = ДолжностьДоверенного;
	ОбластьМакета.Параметры.ФамилияИмяОтчествоДоверенного = ФамилияИмяОтчествоДоверенного;
	ОбластьМакета.Параметры.ПаспортСерия                  = ПаспортФизЛица.Серия;
	ОбластьМакета.Параметры.ПаспортНомер                  = ПаспортФизЛица.Номер;
	ОбластьМакета.Параметры.ПаспортВыдан                  = ПаспортФизЛица.Выдан;
	ОбластьМакета.Параметры.ПаспортДатаВыдачи             = ПаспортФизЛица.ДатаВыдачи;
	ОбластьМакета.Параметры.ДатаДокумента                 = Формат(Шапка.ДатаДокумента,"ДФ = ""дд ММММ гггг """"г.""");
	ОбластьМакета.Параметры.СрокДействия                  = Формат(Шапка.ДатаДокумента + 10*(3600*24),"ДФ = ""дд ММММ гггг """"г.""");
	ОбластьМакета.Параметры.НазначениеДоверенности        = "на получение от" ;
	
	СписокДокументов = "Товарным накладным: ";
	ТЗ_СписокДок = Шапка.Задания.Выгрузить();
	Для каждого Строка из ТЗ_СписокДок   цикл
		СписокДокументов = СписокДокументов + Строка.Доверенность.ПоДокументу + "; ";
	КонецЦикла;
	ОбластьМакета.Параметры.РеквизитыДокументаНаПолучение = СписокДокументов;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомСтр = 1;
	Пока ВыборкаСтрокТовары.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);                 
			ОбластьМакета.Параметры.Номер = НомСтр;
			ОбластьМакета.Параметры.ЦеннностиПредставление = "ТМЦ согласно товарной накладной " + ВыборкаСтрокТовары.Доверенность.ПоДокументу;
			ТабДокумент.Вывести(ОбластьМакета);
			НомСтр = НомСтр + 1;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если Шапка.Организация = Справочники.Организации.НайтиПоКоду("О00000001") Тогда//организация Леотон
		ОбластьМакета.Параметры.ПриказФамилия01 = "По приказу №8-п от 01.07.12 Петрушин Д.Н.";
		ОбластьМакета.Параметры.ПриказФамилия02 = "По приказу №8-п от 01.07.12 Глухова С.Л.";
	ИначеЕсли Шапка.Организация = Справочники.Организации.НайтиПоКоду("О00000003") Тогда//организация Леовит
		ОбластьМакета.Параметры.ПриказФамилия01 = "По приказу №11-п от 05.02.14 Рангелова С.С.";
	//	ОбластьМакета.Параметры.ПриказФамилия02 = "По приказу №11-п от 05.02.14 Марчук Д.С.";
		ОбластьМакета.Параметры.ПриказФамилия02 = "";

	КонецЕсли;

	Если ЗначениеЗаполнено(Руководитель) Тогда
		ОбластьМакета.Параметры.ФИОРуководителя       = Руководитель;
		ОбластьМакета.Параметры.Руководитель          = Руководитель;
	КонецЕсли;

	Если ЗначениеЗаполнено(Бухгалтер) Тогда
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Бухгалтер;
		ОбластьМакета.Параметры.ГлавныйБухгалтер      = Бухгалтер;
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьСводнойДоверенности()
//}Лео Катанович

//+Лео Сафонов
Функция ПечатьЭкспедиторскаяРасписка(ДокументСсылка, Орг) Экспорт

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент",  ДокументСсылка.Ссылка);
	Запрос.УстановитьПараметр("ПустаяСсылка",  Документы.Доверенность.ПустаяСсылка());


	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭкспедиторскаяРасписка";

	Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ЭкспедиторскаяРасписка");

	//СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДокументСсылка.Организация, ДокументСсылка.Дата,,);
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Орг, ДокументСсылка.Дата,,); // zhiga

	
	СведенияОбТКПеревозчик = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДокументСсылка.ТКПеревозчик, ДокументСсылка.Дата,,);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДокумента                = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСсылка);
	ОбластьМакета.Параметры.ДатаДокумента                 = Формат(ДокументСсылка.Дата, "ДЛФ=D");
	ОбластьМакета.Параметры.Грузоотправитель              = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеСокращенное,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ОбластьМакета.Параметры.Экспедитор              	  = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбТКПеревозчик, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	
	ТабДокумент.Вывести(ОбластьМакета);


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		// zhiga { - 1
		|	Задания.ЗаявкаНаТранспорт.Организация КАК Организация, 
		// zhiga } - 2

		|	Задания.ЗаявкаНаТранспорт.СуммаДокумента КАК Стоимость,
		|	Задания.ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
		|	Задания.ЗаявкаНаТранспорт.АдресКонтрагента КАК АдресКонтрагента,
		|	Задания.ЗаявкаНаТранспорт.ЗаказПокупателя.Номер КАК НомерДокумента,
		|	Задания.ЗаявкаНаТранспорт.ВсегоВес КАК ВесБрутто,
		|	Задания.ЗаявкаНаТранспорт.ВсегоОбъем КАК Объем,
		|	Задания.ЗаявкаНаТранспорт.ВсегоКоличествоКоробов КАК КоличествоМест,
		|	Задания.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК КоличествоПалет
		|ИЗ
		|	Документ.абс_ТранспортныйМаршрут.Задания КАК Задания
		|ГДЕ
		|	Задания.ЗаявкаНаТранспорт.Организация = &Организация И
		|	Задания.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	// zhiga { - 1
	Запрос.УстановитьПараметр("Организация", Орг);
	// zhiga } - 2
	
	Результат = Запрос.Выполнить();

	ТзЗадания = Результат.Выгрузить();
	
	НомСтр = 1;
	Для каждого СтрокаЗадание из  ТзЗадания Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(СтрокаЗадание);                 
			ОбластьМакета.Параметры.ПП = НомСтр;
			ОбластьМакета.Параметры.ВидУпаковки	 = "паллет";
			ТабДокумент.Вывести(ОбластьМакета);
			НомСтр = НомСтр + 1;
	КонецЦикла;
		
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакета.Параметры.Стоимость 		= ТзЗадания.Итог("Стоимость");
	ОбластьМакета.Параметры.ВесБрутто 		= ТзЗадания.Итог("ВесБрутто");
	ОбластьМакета.Параметры.Объем 			= ТзЗадания.Итог("Объем");
	ОбластьМакета.Параметры.КоличествоПалет = ТзЗадания.Итог("КоличествоПалет");
	
	ОбластьМакета.Параметры.ЭкспедиторНаименование = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОбТКПеревозчик, "ПолноеНаименование");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Фамилия КАК Фамилия,
		|	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Имя КАК Имя,
		|	КонтактныеЛицаКонтрагентов.КонтактноеЛицо.Отчество КАК Отчество
		|ИЗ
		|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
		|ГДЕ
		|	КонтактныеЛицаКонтрагентов.Владелец = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", ДокументСсылка.ТКПеревозчик);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ФамилияИмяОтчествоДоверенного = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФамилияИмяОтчествоДоверенного = "" + ВыборкаДетальныеЗаписи.Фамилия + " " + Лев(ВыборкаДетальныеЗаписи.Имя,1) + "." + Лев(ВыборкаДетальныеЗаписи.Отчество,1);
	КонецЦикла;
	
	ОбластьМакета.Параметры.РуководительЭкспедитора = ФамилияИмяОтчествоДоверенного;
	
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции 
//-Лео Сафонов



//+Лео zhiga 
Функция ЗаполнитьТабличныйДокументТН_2021(_ОбластьЛицеваяСторона, _ОбластьОборотнаяСторона, ДанныеПечати, ЗаказПокупателя)
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу  = 0;
	
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	
	//Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
	//	СведенияОКонтрагенте = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Контрагент,  Выборка.ДатаИсполнения);
	//	ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОКонтрагенте, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"); 
	//ИначеЕсли ЗначениеЗаполнено(Выборка.ЗаказПокупателя) Тогда
	//	//Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
	//	//	СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаИсполнения);
	//	//	ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ФактическийАдрес,Телефоны"); 
	//	//Иначе
	Если ЗначениеЗаполнено(ДанныеПечати.ЗаказПокупателя.Грузополучатель) Тогда
		СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеПечати.ЗаказПокупателя.Грузополучатель,  ДанныеПечати.ПланируемаяДатаОтгрузки);
		Лео_грузополучатель=ДанныеПечати.ЗаказПокупателя.Контрагент;
	Иначе
		
		Если ТипЗнч(ДанныеПечати.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеПечати.Контрагент,  ДанныеПечати.ПланируемаяДатаОтгрузки);
			Лео_грузополучатель = ДанныеПечати.Контрагент; // ## Жигалев ##
		Иначе
			СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеПечати.Организация,  ДанныеПечати.ПланируемаяДатаОтгрузки);
			Лео_грузополучатель = ДанныеПечати.Организация; 
		КонецЕсли;
	КонецЕсли;
	//		ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"); 
	//	//КонецЕсли;
	//Иначе
	//	СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаИсполнения);
	//	ОбластьЛицеваяСторона.Параметры.Грузополучатель = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"); 
	//КонецЕсли;

	
	
	
	Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ПФ_MXL_ТранспортнаяНакладная2200");
	
	////Сертификаты
	////Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ПФ_MXL_ТранспортнаяНакладная2201");
	Если ДанныеПечати.Дата  >    '20220301'   Тогда
	Макет = Документы.абс_ТранспортныйМаршрут.ПолучитьМакет("ПФ_MXL_ТранспортнаяНакладная2203");	
	КонецЕсли;
	//  
	
       
	
	//КоличествоТН = 0;
	//КоличествоТН1208 = 0;
	//КоличествоТН1529 = 0;
	//КоличествоТН2200 = 0;
	//
	//Для Каждого ДанныеПечати Из ТаблицаДанныхДляПечати Цикл
	//	
	//	Если НЕ ПервыйДокумент Тогда
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ПервыйДокумент = Ложь;
	//	
	//	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	Если ДанныеПечати.Дата < '20120313' Тогда
	//		ВариантПечатиНакладной = "ТранспортнаяНакладная";
	//	ИначеЕсли ДанныеПечати.Дата < '20210101' Тогда
	//		ВариантПечатиНакладной = "ТранспортнаяНакладная1208";
	//	Иначе
	//		ВариантПечатиНакладной = "ТранспортнаяНакладная2200";
	//	КонецЕсли; 
	//	
	//	Если ВариантПечатиНакладной = "ТранспортнаяНакладная" Тогда
	//		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная");
	//		КоличествоТН = КоличествоТН + 1;
	//	ИначеЕсли ДанныеПечати.Дата < '20171222' Тогда 
	//		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная1208");
	//		КоличествоТН1208 = КоличествоТН1208 + 1;
	//	ИначеЕсли ДанныеПечати.Дата < '20210101' Тогда
	//		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная1529");
	//		КоличествоТН1529 = КоличествоТН1529 + 1;
	//	Иначе
	//		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная2200");
	//		КоличествоТН2200 = КоличествоТН2200 + 1;
	//	КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
		ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
		
		ПараметрыМакета = Новый Структура;
		
		//СведенияОГрузополучателе  = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
		//СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
		//СведенияОПеревозчике      = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик,       ДанныеПечати.Дата);
		
		ПредставлениеГрузоотправителя = "";
		Грузоотправитель              = "";
		
		//Если СведенияОГрузополучателе.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		//	ПараметрыМакета.Вставить("Пункт2_1", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузополучателе, 
		//	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны"));
		//ИначеЕсли ВариантПечатиНакладной = "ТранспортнаяНакладная2200" Тогда
		//	ПараметрыМакета.Вставить("Пункт2_2", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузополучателе, 
		//	"ПолноеНаименование,ИНН, ФактическийАдрес,Телефоны"));
		//Иначе
		//	ПараметрыМакета.Вставить("Пункт2_2", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузополучателе, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны"));
		//КонецЕсли;
		
		//Если СведенияОГрузоотправителе.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		//	ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузоотправителе, 
		//	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		//	ПараметрыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
		//	Грузоотправитель = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование");
		//ИначеЕсли ВариантПечатиНакладной = "ТранспортнаяНакладная2200" Тогда
		//	ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузоотправителе, 
		//	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		//	ПараметрыМакета.Вставить("Пункт1_2", ПредставлениеГрузоотправителя);
		//	Грузоотправитель = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование");
		//Иначе
			//ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузоотправителе, 
			//"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	ПараметрыМакета.Вставить("Пункт1_2", ПредставлениеГрузоотправителя);
		//	Грузоотправитель = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование");
		//КонецЕсли;
		
		ПараметрыМакета.Вставить("НомерЗаказаПокупателя", _ОбластьЛицеваяСторона.Параметры.НомерЗаказаПокупателя);
		ПараметрыМакета.Вставить("НомерУПД", _ОбластьЛицеваяСторона.Параметры.НомерУПД);

		
		ПараметрыМакета.Вставить("Пункт0_2", Формат(ДанныеПечати.ДокументОтгрузки.Дата,"ДФ=dd.MM.yyyy"));
		ПараметрыМакета.Вставить("Пункт0_3", ДанныеПечати.ДокументОтгрузки.Номер);
		
		
		ПараметрыМакета.Вставить("Пункт1_2", _ОбластьЛицеваяСторона.Параметры.Грузоотправитель);
		//ПараметрыМакета.Вставить("Пункт0_2", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		//
		//ПараметрыМакета.Вставить("Пункт3_1", ДанныеПечати.КраткоеНаименованиеГруза);
		//
		//ПараметрыМакета.Вставить("Пункт4_1", ДанныеПечати.СопроводительныеДокументы);
		//
		//ПараметрыМакета.Вставить("Пункт6_1", СведенияОГрузоотправителе.ФактическийАдрес);
		
		//Лео Владимир Задание Петрушин 25.05.2023
		Если ТипЗнч(ДанныеПечати.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ПараметрыМакета.Вставить("Пункт3_1", _ОбластьЛицеваяСторона.Параметры.НаименованиеГруза);
		Иначе
			ПараметрыМакета.Вставить("Пункт3_1", "");
		КонецЕсли;
		//Лео Владимир Задание Петрушин 25.05.2023
		ПараметрыМакета.Вставить("Пункт3_2", _ОбластьЛицеваяСторона.Параметры.КоличествоМест);
		ПараметрыМакета.Вставить("Пункт3_3", _ОбластьЛицеваяСторона.Параметры.Вес);
		
		
		//ПараметрыМакета.Вставить("Пункт3_5", Строка(ДанныеПечати.ДокументОтгрузки.СуммаДокумента) + " руб.");
		//zhiga
		Попытка
			Если ДанныеПечати.ДокументОтгрузки.СуммаДокумента = 0 и ЗначениеЗаполнено(ЗаказПокупателя) тогда
				ПараметрыМакета.Вставить("Пункт3_5", Строка(ЗаказПокупателя.СуммаДокумента) + " руб.");
			иначе
				ПараметрыМакета.Вставить("Пункт3_5", Строка(ДанныеПечати.ДокументОтгрузки.СуммаДокумента) + " руб.");
			Конецесли;
		Исключение
		КонецПопытки;	
		//Лео Владимир Задание Петрушин 25.05.2023
		Если ТипЗнч(ДанныеПечати.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ПараметрыМакета.Вставить("Пункт3_5", "");
		КонецЕсли;
		//Лео Владимир Задание Петрушин 25.05.2023
		
		
		//ПараметрыМакета.Вставить("Пункт4_1", _ОбластьЛицеваяСторона.Параметры.СопроводительныеДокументы);
		СчетФактура = Документы.СчетФактураВыданный.НайтиПоРеквизиту("ДокументОснование",ДанныеПечати.ДокументОтгрузки);

		
		_НакладнаяСчетФактура = "Накладная № " + ДанныеПечати.ДокументОтгрузки.Номер + " от " + Формат(ДанныеПечати.ДокументОтгрузки.Дата,"ДФ=dd.MM.yyyy") + 
		" счет-фактура № "+ СчетФактура.Номер + " от "+Формат(СчетФактура.Дата,"ДФ=dd.MM.yyyy"); 
		ПараметрыМакета.Вставить("Пункт4_1", _НакладнаяСчетФактура);
		//Лео Владимир Задание Петрушин 25.05.2023
		Если ТипЗнч(ДанныеПечати.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ПараметрыМакета.Вставить("Пункт4_1", "");
		КонецЕсли;
		//Лео Владимир Задание Петрушин 25.05.2023
		
		
		////Сертификаты
		//ПараметрыМакета.Вставить("Пункт4_2", _ЗаполнитьСертификатыПоЗаказу(ЗаказПокупателя));
		ПараметрыМакета.Вставить("Пункт4_2", "Перечень прилагаемых сертификатов содержится в Приложении (Реестр сертификатов номенклатуры)");
		
		
		ПараметрыМакета.Вставить("Пункт6_1", _ОбластьЛицеваяСторона.Параметры.АдресПогрузки);
		
		// zhiga {
	    // Перемещение (Щербинина)
		Если НЕ ЗначениеЗаполнено(_ОбластьЛицеваяСторона.Параметры.АдресВыгрузки) и ЗначениеЗаполнено(ЗаказПокупателя)    тогда
			 Если НЕ ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.Лео_ЗаявкаНаОбразцы") И НЕ ТипЗнч(ЗаказПокупателя) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда  //роман
			_ОбластьЛицеваяСторона.Параметры.АдресВыгрузки = ЗаказПокупателя.АдресДоставки;
			КонецЕсли;

		КонецЕсли;
		// zhiga }
		
		ПараметрыМакета.Вставить("Пункт7_1", _ОбластьЛицеваяСторона.Параметры.АдресВыгрузки);
		
		
		ПараметрыМакета.Вставить("Пункт6_2",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакета.Вставить("Пункт6_3",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакета.Вставить("Пункт6_31", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		
		
		ПараметрыМакета.Вставить("Пункт7_2",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакета.Вставить("Пункт7_3",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакета.Вставить("Пункт7_31", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		
		
		ПараметрыМакета.Вставить("Пункт6_5",  _ОбластьЛицеваяСторона.Параметры.Вес);
		ПараметрыМакета.Вставить("Пункт6_51", _ОбластьЛицеваяСторона.Параметры.КоличествоМест);
		
		
		Если ДанныеПечати.Дата  >    '20220301'   Тогда

		ПараметрыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
	//	ПараметрыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН"));
	  //СведенияОГрузополучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(_ОбластьЛицеваяСторона.Параметры.Грузополучатель, ДанныеПечати.Дата);
	  Если   Лео_грузополучатель.Код="УТ0009686" Тогда   ///для яндекса выводим грузополучателя с юр адресом
	        ПараметрыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,ЮридическийАдрес"));
      ИначеЕсли   ДанныеПечати.Контрагент.Код="УТ0010344" Тогда    //для контрагента БЕТА ПРО
	      ПараметрыМакета.Вставить("Пункт2_1", ДанныеПечати.ДокументОтгрузки.Грузополучатель.НаименованиеПолное);
      Иначе
	      ПараметрыМакета.Вставить("Пункт2_1", Лео_грузополучатель.НаименованиеПолное+",ИНН "+Лео_грузополучатель.ИНН);
	   КонецЕсли;
    //{Катанович 11082022 
	//ПараметрыМакета.Вставить("Пункт2_2",  _ОбластьЛицеваяСторона.Параметры.АдресВыгрузки);
	
	Если ДанныеПечати.Контрагент.Код="УТ0010344" Тогда //для контрагента БЕТА ПРО
		ПараметрыМакета.Вставить("Пункт2_2", ДанныеПечати.ЗаказПокупателя.АдресДоставки+", ОГРГ "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.ОГРН+", ИНН "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.ИНН+", КПП "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.КПП);
		ПараметрыМакета.Вставить("Пункт7_1", ДанныеПечати.ДокументОтгрузки.Грузополучатель.НаименованиеПолное+", "+ДанныеПечати.ЗаказПокупателя.АдресДоставки+", ОГРГ "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.ОГРН+", ИНН "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.ИНН+", КПП "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.КПП); 
	ИначеЕсли ТипЗнч(ДанныеПечати.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ПараметрыМакета.Вставить("Пункт2_2",  ДанныеПечати.АдресКонтрагента);
	Иначе
		ПараметрыМакета.Вставить("Пункт2_2", 	СведенияОГрузополучателе.ЮридическийАдрес); 
		ПараметрыМакета.Вставить("Пункт7_1",   СведенияОГрузополучателе.ФактическийАдрес); 
	КонецЕсли;	 
	
	//Катанович}
	
	  //ПараметрыМакета.Вставить("Пункт11_1", ДанныеПечати.МаркаАвтомобиля);
	  //  ПараметрыМакета.Вставить("Пункт11_2", ДанныеПечати.РегистрационныйЗнакАвтомобиля);
	  //	 ПараметрыМакета.Вставить("Пункт10_1", _ОбластьОборотнаяСторона.Параметры.Перевозчик);
	  //  ПараметрыМакета.Вставить("Пункт10_3", _ОбластьОборотнаяСторона.Параметры.Водитель);
		
		ПараметрыМакета.Вставить("Пункт10_1", _ОбластьОборотнаяСторона.Параметры.Перевозчик);
		ПараметрыМакета.Вставить("Пункт10_3", _ОбластьОборотнаяСторона.Параметры.Водитель);
		ПараметрыМакета.Вставить("Пункт11_1", _ОбластьОборотнаяСторона.Параметры.МаркаТС);
		ПараметрыМакета.Вставить("Пункт11_2", _ОбластьОборотнаяСторона.Параметры.НомерТС);

		
		
		
		

КонецЕсли;

		
		
		
		//Если ВариантПечатиНакладной = "ТранспортнаяНакладная1208" Тогда     
		//	
		//	Если ЗначениеЗаполнено(ДанныеПечати.ОтпускПроизвел) Тогда 
		//		ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ДанныеПечати.Организация, ДанныеПечати.ОтпускПроизвел, ДанныеПечати.Дата);
		//		ПараметрыМакета.Вставить("Пункт6_6", СокрЛП(СтрШаблон(НСтр("ru = '%1 %2 %3 %4'"), ДанныеФизЛица.Должность, ДанныеФизЛица.Фамилия, ДанныеФизЛица.Имя, ДанныеФизЛица.Отчество)));
		//	КонецЕсли;
		//	
		//	ПараметрыМакета.Вставить("Пункт6_7", ДанныеПечати.Водитель);
		//	ПараметрыМакета.Вставить("Пункт7_7", ДанныеПечати.Водитель);
		//	ПараметрыМакета.Вставить("Пункт9_1", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		//КонецЕсли;
		
		//ПараметрыМакета.Вставить("Пункт7_1", ДанныеПечати.АдресДоставки);
		
		ОбластьМакета.Параметры.Заполнить(ПараметрыМакета);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ПараметрыМакетаОборотная = Новый Структура;
		
		//Если СведенияОПеревозчике.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		//	
		//	ПредставлениеПеревозчика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПеревозчике, 
		//								"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		//	ПараметрыМакетаОборотная.Вставить("Пункт10_1", ПредставлениеПеревозчика);
		//	Перевозчик = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//ИначеЕсли ВариантПечатиНакладной = "ТранспортнаяНакладная2200" Тогда
		//	ПредставлениеПеревозчика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПеревозчике, 
		//								"ПолноеНаименование, ИНН, ФактическийАдрес,Телефоны");
		//	ПараметрыМакетаОборотная.Вставить("Пункт10_2", ПредставлениеПеревозчика);
		//	Перевозчик = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//Иначе
		//	ПредставлениеПеревозчика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПеревозчике, 
		//								"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	ПараметрыМакетаОборотная.Вставить("Пункт10_2", ПредставлениеПеревозчика);
		//	Перевозчик = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//КонецЕсли;
		
		//Если ВариантПечатиНакладной = "ТранспортнаяНакладная" Тогда
		//	ПараметрыМакетаОборотная.Вставить("Пункт10_4", ДанныеПечати.Водитель);
		//Иначе
		//	ПараметрыМакетаОборотная.Вставить("Пункт10_3", ДанныеПечати.Водитель);
		//КонецЕсли;
		
		//ПараметрыМакетаОборотная.Вставить("Пункт11_1", ДанныеПечати.МаркаАвтомобиля);
		//ПараметрыМакетаОборотная.Вставить("Пункт11_2", ДанныеПечати.РегистрационныйЗнакАвтомобиля);
		//
		//ПараметрыМакетаОборотная.Вставить("Пункт16_1", Грузоотправитель);
		//ПараметрыМакетаОборотная.Вставить("Пункт16_2", Перевозчик);
		//
		//Если ВариантПечатиНакладной <> "ТранспортнаяНакладная"  Тогда
		//	ПараметрыМакетаОборотная.Вставить("Пункт16_11", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		//	ПараметрыМакетаОборотная.Вставить("Пункт16_21", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		//КонецЕсли;
		
		ПараметрыМакетаОборотная.Вставить("Пункт10_2", _ОбластьОборотнаяСторона.Параметры.Перевозчик);
		ПараметрыМакетаОборотная.Вставить("Пункт8_8", _ОбластьОборотнаяСторона.Параметры.Водитель);
		ПараметрыМакетаОборотная.Вставить("Пункт10_8", _ОбластьОборотнаяСторона.Параметры.Водитель);
		ПараметрыМакетаОборотная.Вставить("Пункт12_13", _ОбластьОборотнаяСторона.Параметры.Водитель);

		
		ПараметрыМакетаОборотная.Вставить("Пункт11_1", _ОбластьОборотнаяСторона.Параметры.МаркаТС);
		ПараметрыМакетаОборотная.Вставить("Пункт11_2", _ОбластьОборотнаяСторона.Параметры.НомерТС);
		
		ПараметрыМакетаОборотная.Вставить("Пункт16_11", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакетаОборотная.Вставить("Пункт16_21", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		
		
		
	Если ДанныеПечати.Дата  >    '20220301'   Тогда
		
		ПараметрыМакетаОборотная.Вставить("Пункт1_2", _ОбластьЛицеваяСторона.Параметры.Грузоотправитель);
		ПараметрыМакетаОборотная.Вставить("Пункт6_1", _ОбластьЛицеваяСторона.Параметры.АдресПогрузки);
		ПараметрыМакетаОборотная.Вставить("Пункт6_2",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакетаОборотная.Вставить("Пункт6_3",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакетаОборотная.Вставить("Пункт6_31", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		
		     
		Если ДанныеПечати.Контрагент.Код="УТ0010344" Тогда //для контрагента БЕТА ПРО
			ПараметрыМакетаОборотная.Вставить("Пункт7_1", ДанныеПечати.ДокументОтгрузки.Грузополучатель.НаименованиеПолное+", "+ДанныеПечати.ЗаказПокупателя.АдресДоставки+", ОГРГ "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.ОГРН+", ИНН "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.ИНН+", КПП "+ДанныеПечати.ДокументОтгрузки.Грузополучатель.КПП); 
		ИначеЕсли ТипЗнч(ДанныеПечати.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ПараметрыМакетаОборотная.Вставить("Пункт7_1",  _ОбластьЛицеваяСторона.Параметры.АдресВыгрузки);
		Иначе
		    ПараметрыМакетаОборотная.Вставить("Пункт7_1",   СведенияОГрузополучателе.ФактическийАдрес); 
		КонецЕсли;	 
	
 		ПараметрыМакетаОборотная.Вставить("Пункт7_2",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакетаОборотная.Вставить("Пункт7_3",  Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		ПараметрыМакетаОборотная.Вставить("Пункт7_31", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
		
		
		ПараметрыМакетаОборотная.Вставить("Пункт6_5",  _ОбластьЛицеваяСторона.Параметры.Вес);
		ПараметрыМакетаОборотная.Вставить("Пункт6_51", _ОбластьЛицеваяСторона.Параметры.КоличествоМест);
	КонецЕсли;

		
		
		
		
		ОбластьМакетаОборотная.Параметры.Заполнить(ПараметрыМакетаОборотная);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	//КонецЦикла;
	
	//Если КоличествоТН = 0 И КоличествоТН1208 = 0 И КоличествоТН1529 = 0 Тогда
	//	ИмяМакета = "Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная2200";
	//ИначеЕсли КоличествоТН = 0 И КоличествоТН1208 = 0 И КоличествоТН2200 = 0 Тогда
	//	ИмяМакета = "Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная1529";
	//ИначеЕсли КоличествоТН = 0 И КоличествоТН1529 = 0 И КоличествоТН2200 = 0 Тогда
	//	ИмяМакета = "Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная1208";
	//ИначеЕсли КоличествоТН1208 = 0 И КоличествоТН1529 = 0 И КоличествоТН2200 = 0 Тогда
	//	ИмяМакета = "Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная";
	//КонецЕсли;
	
	
	   Возврат ТабличныйДокумент;
	
   КонецФункции
   
   
   
Функция _ЗаполнитьСертификатыПоЗаказу(ЗаказПокупателя)   

	   СтрокаСертификатов = "";
       //ТЗсертификатов = ЗаказПокупателя.Товары.ВыгрузитьКолонки("абс_СертификатДекларацияСоответствия, абс_СертификатСвидетельствоОГосрегистрации, абс_СертификатСоответствия, абс_СертификатДекларацияТаможенногоСоюза");
	
	   Для каждого сс из ЗаказПокупателя.Товары цикл
		   
		   
		   
		   Если ЗначениеЗаполнено(сс.абс_СертификатДекларацияСоответствия) тогда
			   Если ЗначениеЗаполнено(СтрокаСертификатов) тогда СтрокаСертификатов = СтрокаСертификатов + ", "; КонецЕсли;		
			    СтрокаСертификатов = СтрокаСертификатов + сокрлп(сс.абс_СертификатДекларацияСоответствия.Номер);
		   КонецЕсли;
		   Если ЗначениеЗаполнено(сс.абс_СертификатСвидетельствоОГосрегистрации) тогда
			   Если ЗначениеЗаполнено(СтрокаСертификатов) тогда СтрокаСертификатов = СтрокаСертификатов + ", "; КонецЕсли;		
			    СтрокаСертификатов = СтрокаСертификатов + сокрлп(сс.абс_СертификатСвидетельствоОГосрегистрации.Номер);
		   КонецЕсли;
		   Если ЗначениеЗаполнено(сс.абс_СертификатСоответствия) тогда
			   Если ЗначениеЗаполнено(СтрокаСертификатов) тогда СтрокаСертификатов = СтрокаСертификатов + ", "; КонецЕсли;		
			    СтрокаСертификатов = СтрокаСертификатов + сокрлп(сс.абс_СертификатСоответствия.Номер);
		   КонецЕсли;
		   Если ЗначениеЗаполнено(сс.абс_СертификатДекларацияТаможенногоСоюза) тогда
			   Если ЗначениеЗаполнено(СтрокаСертификатов) тогда СтрокаСертификатов = СтрокаСертификатов + ", "; КонецЕсли;		
			    СтрокаСертификатов = СтрокаСертификатов + сокрлп(сс.абс_СертификатДекларацияТаможенногоСоюза.Номер);
		   КонецЕсли;
			
	
	   КонецЦикла;

	   
	   //СтрокаСертификатов = Лев(СтрокаСертификатов,СтрДлина(СтрокаСертификатов)-1);
	   
	   Возврат СтрокаСертификатов;
	
КонецФункции

   
   
//-Лео zhiga
