
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Номер = "";
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если Организация.Пустая() Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Не указана организация", Отказ);
	//КонецЕсли;
	//
	//Если ЭтотОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт И НЕ ЭтотОбъект.Ссылка.Статус = ЭтотОбъект.Статус Тогда
	//	ЭтотОбъект.ДатаЗакрытияТранспортногоМаршрута = ТекущаяДата();		
	//КонецЕсли
	
КонецПроцедуры

//номер должен быть в формате "ММ/ДД-НННН", где НННН - порядковый номер документа в данном дне
//
Функция ПолучитьНомерНовогоТранспортногоМаршрута() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	абс_ТранспортныйМаршрут.Номер КАК Номер,
	               |	ПОДСТРОКА(абс_ТранспортныйМаршрут.Номер, 10, 4) КАК ПорядковыйНомерЗаДень
	               |ИЗ
	               |	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	               |ГДЕ
	               |	абс_ТранспортныйМаршрут.Дата МЕЖДУ &НачДата И &КонДата";
	
	Запрос.УстановитьПараметр("НачДата",НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонДата",КонецДня(Дата));
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Ссылка <> &Ссылка
		|";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомерЗаДень УБЫВ
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЧислоПорядковыйНомер = Число(Выборка.ПорядковыйНомерЗаДень);
		Если ТипЗнч(ЧислоПорядковыйНомер) = Тип("Число") Тогда
			ЧислоПорядковыйНомер = ЧислоПорядковыйНомер + 1;
			ДлинаНомера = СтрДлина(ЧислоПорядковыйНомер);
			ПорядковыйНомерСтрока = "";
			Для сч = 1 по 4-ДлинаНомера Цикл
				ПорядковыйНомерСтрока = ПорядковыйНомерСтрока + "0";
			КонецЦикла;
			ПорядковыйНомерСтрока = ПорядковыйНомерСтрока + Строка(ЧислоПорядковыйНомер);
		Иначе //не удалось преобразовать фрагмент номера в число
			Возврат "";
		КонецЕсли;
	Иначе
		ПорядковыйНомерСтрока = "0001";
	КонецЕсли;
	
	Префикс = Организация.Префикс;
	
	Возврат Префикс + Сред(Дата,4,2) + "/" + Лев(Дата,2) + "-" + ПорядковыйНомерСтрока;
	
КонецФункции

Процедура ПроверитьТранспортноеСредствоПоМаршруту(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрут.Ссылка
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	|ГДЕ
	|	абс_ТранспортныйМаршрут.СводнаяЗаявкаНаТранспорт.ДатаИсполнения = &ДатаИсполнения
	|	И абс_ТранспортныйМаршрут.ТранспортноеСредство = &ТранспортноеСредство
	|	И абс_ТранспортныйМаршрут.Ссылка <> &Ссылка");
	
	Запрос.УстановитьПараметр("ДатаИсполнения"		, СводнаяЗаявкаНаТранспорт.ДатаИсполнения);
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Запрос.УстановитьПараметр("Ссылка"				, Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщенияОбОшибке = "Транспортное средство уже использовано в ";
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Строка(Выборка.Ссылка) + " ";
		
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Отказ);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьЗаявкиВМаршруте(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка КАК ТранспортныйМаршрут,
	|	ТекущийТранспортныйМаршрут.ЗаявкаНаТранспорт
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК ТекущийТранспортныйМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|		ПО ТекущийТранспортныйМаршрут.ЗаявкаНаТранспорт = абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка <> &Ссылка
	|	И ТекущийТранспортныйМаршрут.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке("" + Выборка.ЗаявкаНаТранспорт + " уже включена в " + Выборка.ТранспортныйМаршрут);
		КонецЦикла;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//ПроверитьЗаявкиВМаршруте(Отказ);
	//ПроверитьТранспортноеСредствоПоМаршруту(Отказ);
	////{Лео_Катанович
	//ПроверитьТребованияКТС(Отказ);	
	////Лео_Катанович}
	
КонецПроцедуры

Процедура ПроверитьТребованияКТС(Отказ)
	
	ТекстСообщенияОбОшибке= "";
	
	Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Контрагент
	|ПОМЕСТИТЬ ТЗ_Контрагенты
	|ИЗ
	|	Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|ГДЕ
	|	абс_ТранспортныйМаршрутЗадания.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ_Контрагенты.ЗаявкаНаТранспортКонтрагент КАК Контрагент,
	|	ВложенныйЗапрос.ШиринаКузова,
	|	ВложенныйЗапрос.ВысотаПолаКузова,
	|	ВложенныйЗапрос.ТемпературныйРежим,
	|	ВложенныйЗапрос.МедицинскаяКнижка,
	|	ВложенныйЗапрос.СанитарнаяОбработка
	|ИЗ
	|	ТЗ_Контрагенты КАК ТЗ_Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Контрагенты.ШиринаКузова КАК ШиринаКузова,
	|			Контрагенты.ВысотаПолаКузова КАК ВысотаПолаКузова,
	|			Контрагенты.ТемпературныйРежим КАК ТемпературныйРежим,
	|			Контрагенты.МедицинскаяКнижка КАК МедицинскаяКнижка,
	|			Контрагенты.СанитарнаяОбработка КАК СанитарнаяОбработка,
	|			Контрагенты.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Контрагенты КАК Контрагенты) КАК ВложенныйЗапрос
	|		ПО ТЗ_Контрагенты.ЗаявкаНаТранспортКонтрагент = ВложенныйЗапрос.Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТранспортноеСредство.ШиринаКузова <  Выборка.ШиринаКузова Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Ширина кузова ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		КонецЕсли;
		
		Если ТранспортноеСредство.ВысотаПолаКузова <  Выборка.ВысотаПолаКузова Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Высота пола кузова ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		КонецЕсли;
		
		Если (ТранспортноеСредство.ТемпературныйРежим = Ложь И Выборка.ТемпературныйРежим = Истина) Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Температурный режим ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		КонецЕсли;
						
		Если  Выборка.МедицинскаяКнижка Тогда
			Если ТранспортноеСредство.МедицинскаяКнижка = Ложь Тогда
				ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Медицинская книжка не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
			КонецЕсли;
			Если  ТранспортноеСредство.МедицинскаяКнижкаСрокДействияДо < Ссылка.Дата Тогда
				ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Срок действия медицинской книжки не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.СанитарнаяОбработка Тогда
		     Если ТранспортноеСредство.СанитарнаяОбработка = Ложь Тогда
			      ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Санитарная обработка ТС не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
		     КонецЕсли;
		     Если ТранспортноеСредство.СанитарнаяОбработкаСрокДействияДо < Ссылка.Дата Тогда
			      ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Срок действия санитарной обработки не соответствует требованиям " + Выборка.Контрагент + Символы.ВК;
			 КонецЕсли;
		КонецЕсли;
	  
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщенияОбОшибке) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Отказ);
	Иначе
		//Если  ТранспортноеСредство.МедицинскаяКнижкаСрокДействияДо < Ссылка.Дата Тогда
		//		ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + "Внимание! Срок действия медицинской книжки завершен!";
		//КонецЕсли;
		//Если ТранспортноеСредство.СанитарнаяОбработкаСрокДействияДо < Ссылка.Дата Тогда
		//		  ТекстСообщенияОбОшибке = "Внимание! Срок действия санитарной обработки завершен!" ;
		//КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
//Лео_Катанович}
