
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ТипДокументаДляСогласования") Тогда
		ТипДокументаДляСогласования=ЭтаФорма.Параметры.ТипДокументаДляСогласования;
		УстановитьОтборПоТипуДокумента();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТипуДокумента()
	Если Список.Отбор.Элементы.Количество()>0 Тогда
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;
	ЭлементОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТипДокументаДляСогласования");
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=ТипДокументаДляСогласования;
	ЭлементОтбора.Использование=Истина;
	ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=Истина;
	ОткрытьФорму("Справочник.абс_МаршрутыСогласованияДокументов.Форма.ФормаЭлементаУправляемая",Новый Структура("ТипДокументаДляСогласования",ТипДокументаДляСогласования));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыборе(Значение);
КонецПроцедуры
