
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрКоманды.ВидОперации = Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.Взаимозачет
		И НЕ ПараметрКоманды.Закрыта
		И ПараметрКоманды.Проведен
		И (ПараметрКоманды.Состояние = Перечисления.СостоянияОбъектов.Утвержден Или
			ПараметрКоманды.Состояние = Перечисления.СостоянияОбъектов.Согласован) Тогда		
		ЗакрытьЗаявку_Сервер(ПараметрКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьЗаявку_Сервер(Ссылка)
	обЗаявка = Ссылка.ПолучитьОБъект();
	обЗаявка.Закрыта = Истина;
	Попытка
		обЗаявка.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры