

&НаКлиенте
Процедура ФактТоварооборотПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ФактПроцентПремииПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ФактФиксированнаяСуммаПремииПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтроки(ТекСтрока)
	
	Если  ТекСтрока.Товарооборот > 0 Тогда
		Если ТекСтрока.ПроцентПремии  > 0 Тогда
			ТекСтрока.Премия =  ТекСтрока.Товарооборот / 100 *  ТекСтрока.ПроцентПремии +  ТекСтрока.ФиксированнаяСуммаПремии;
		Иначе
			ТекСтрока.Премия = ТекСтрока.ФиксированнаяСуммаПремии;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФактПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если   НоваяСтрока Тогда
		ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
		СтруктураПараметров =  ПолучитьПараметрыРасчета(Объект.Дата,Объект.Сеть);
		Если НЕ СтруктураПараметров = Неопределено Тогда
			ТекСтрока.ПроцентПремии = СтруктураПараметров.ПроцентПремии;
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПараметрыРасчета(ДатаСреза,Сеть)
	
	СтруктураПараметров  = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ГодовойТоварооборот,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Действует
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам.СрезПоследних(
		|			&ДатаСреза,
		|			Сеть = &Сеть
		|				И Действует = ИСТИНА) КАК Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сеть", Сеть);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметров = Новый Структура("ПроцентПремии, ФиксированнаяСумма", ВыборкаДетальныеЗаписи.ПроцентПремии ,ВыборкаДетальныеЗаписи.ФиксированнаяСумма);

	КонецЦикла;

	Возврат СтруктураПараметров 	
КонецФункции