
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						=	"Текст(*.xls;*.xlsx)|*.xls;*.xlsx";
	ДиалогВыбораФайла.Расширение					=	"xls;*.xlsx";
	ДиалогВыбораФайла.МножественныйВыбор 			=   Ложь;
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл Excel для документа";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	ПутьКФайлу;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	// Вставить содержимое обработчика.
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	
	
	НачСтрока = 65;
КонецПроцедуры
