
&НаКлиенте
Процедура ОК(Команда)
	// Вставить содержимое обработчика.
	
	
	//Оповестить("ПереброситьСумму",новый Структура("СтатьяОборотов, Сумма", СтатьяОборотов,Сумма);
	
	Закрыть(новый Структура("СтатьяОборотов, Сумма", СтатьяОборотов,Сумма));
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	
	Если ТипЗнч(СтатьяОборотовОтбор) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка")
		тогда
		
		
		_Ф = Справочники.Лео_СтатьиОборотовРасшифровка.ПолучитьФормуВыбора(,ЭтаФорма);
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.ВидСравнения  = ВидСравнения.Равно;
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.Использование = Истина;
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.Значение      = СтатьяОборотовОтбор.СтатьяОборотов;
		_Ф.ОтборСтатьяОборотов                                 = СтатьяОборотовОтбор.СтатьяОборотов;

	
	ИначеЕсли	  ТипЗнч(СтатьяОборотовОтбор) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам")
		тогда
		
		
		_Ф = Справочники.СтатьиОборотовПоБюджетам.ПолучитьФормуВыбора(,ЭтаФорма);
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.ВидСравнения  = ВидСравнения.Равно;
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.Использование = Истина;
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.Значение      = СтатьяОборотовОтбор;
		_Ф.ОтборСтатьяОборотов                                 = СтатьяОборотовОтбор;
		
		
	КонецЕсли;	
		
		Если Не _Ф.Открыта() Тогда
			_Ф.Открыть();
		КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
	
	Если ИмяСобытия = "_ПередатьСтатью" тогда
		Источник.СтатьяОборотовОтбор = Параметр;
	КонецЕсли;
	   
	   
	Если ИмяСобытия = "Лео_СтатьиОборотовРасшифровка" тогда
		   СтатьяОборотов = Параметр;
	КонецЕсли;
	
КонецПроцедуры
