
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.БюджетКоличество	= ЭтаФорма.Параметры.БюджетКоличество;
	ЭтаФорма.БюджетСуммаБезНДС	= ЭтаФорма.Параметры.БюджетСуммаБезНДС;
	ЭтаФорма.БюджетСумма		= ЭтаФорма.Параметры.БюджетСумма;
	ЭтаФорма.ПланКоличество		= ЭтаФорма.Параметры.ПланКоличество;
	ЭтаФорма.ПланСуммаБезНДС	= ЭтаФорма.Параметры.ПланСуммаБезНДС;
	ЭтаФорма.ПланСумма			= ЭтаФорма.Параметры.ПланСумма;
	ЭтаФорма.ФактКоличество		= ЭтаФорма.Параметры.ФактКоличество;
	ЭтаФорма.ФактСуммаБезНДС	= ЭтаФорма.Параметры.ФактСуммаБезНДС;
	ЭтаФорма.ФактСумма			= ЭтаФорма.Параметры.ФактСумма;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(Команда)
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("БюджетКоличество",ЭтаФорма.БюджетКоличество);
	СтруктураПараметров.Вставить("БюджетСуммаБезНДС",ЭтаФорма.БюджетСуммаБезНДС);
	СтруктураПараметров.Вставить("БюджетСумма",ЭтаФорма.БюджетСумма);
	СтруктураПараметров.Вставить("ПланКоличество",ЭтаФорма.ПланКоличество);
	СтруктураПараметров.Вставить("ПланСуммаБезНДС",ЭтаФорма.ПланСуммаБезНДС);
	СтруктураПараметров.Вставить("ПланСумма",ЭтаФорма.ПланСумма);
	СтруктураПараметров.Вставить("ФактКоличество",ЭтаФорма.ФактКоличество);
	СтруктураПараметров.Вставить("ФактСуммаБезНДС",ЭтаФорма.ФактСуммаБезНДС);
	СтруктураПараметров.Вставить("ФактСумма",ЭтаФорма.ФактСумма);
	Оповестить("УстановитьВидимость",СтруктураПараметров,ЭтаФорма);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
