&НаКлиенте
Процедура Выгрузить(Команда)
	РезультатФормы = ОткрытьФормуМодально(ПолучитьПолноеИмяФормы("ФормаВыбора"), , ЭтаФорма);
	
	
	Если РезультатФормы = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	Отчет.ПутьФайла = РезультатФормы.ПутьФайла;
	Отчет.Нетто = РезультатФормы.Нетто;
	Отчет.КУ = РезультатФормы.КУ;
	Отчет.РПЛ = РезультатФормы.РПЛ;
	
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки() ;// Получаем настройки отчета 
	
	//ТекСтруктура = Отчет.КомпоновщикНастроек.Настройки.Структура..Структура.Получить();
	
	//Отчет.КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	
	СхемаКомпоновкиДанных = ПолучитьМакетНаСервере();
	
	
	
	КомпоновщикНастроекВыгрузки = Новый КомпоновщикНастроекКомпоновкиДанных;
	//	КомпоновщикНастроекВыгрузки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//КомпоновщикНастроекВыгрузки.Инициализировать(
	Если Настройки <> Неопределено Тогда
		КомпоновщикНастроекВыгрузки.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	КомпоновщикНастроекВыгрузки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	
	//////////////НастройкиДляВыгрузки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	// НастройкиДляВыгрузки = скд.НастройкиПоУмолчанию;
	//настройкиИсточник = КомпоновщикНастроек.ПолучитьНастройки();
	
	//////////////////ЗаполнитьЭлементы(НастройкиДляВыгрузки.ПараметрыДанных, Настройки.ПараметрыДанных);
	//////////////////СкопироватьЭлементы(НастройкиДляВыгрузки.Отбор, Настройки.Отбор);
	//////////////////
	//////////////////Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиДляВыгрузки);
	
	
	// Для Каждого Отбор Из Настройки.Отбор.Элементы Цикл
	
	//	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Отбор);
	//	Если Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Отбор))<>Неопределено Тогда
	//		ЗначениеОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЗначениеОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	//		ЗначениеОтбора.ЛевоеЗначение	= ПолеКомпоновки;
	//		ЗначениеОтбора.ПравоеЗначение 	= Отбор.Значение;
	//		ЗначениеОтбора.Использование	= Истина;
	//	КонецЕсли;
	//КонецЦикла;
	
	
	ДанныеРасшифровкиВыгрузки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки
	
	
	//СхемаКомпоновкиДанных = ПолучитьМакетНаСервере();
	
	//КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Очистить();
	
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "ПериодВыгрузки");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "Контрагентабс_ОтделНаименование");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "Отдел");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "Канал");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "Номенклатура");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "Количество");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "ВыручкаПоБазовомуПрайсЛисту");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "ВыручкаПоРПЛ");
	//ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроекВыгрузки, "ФактическаяВыручка");
	
	//	
	//ТиповыеОтчеты.УдалитьГруппировку(КомпоновщикНастроекВыгрузки);
	//ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроекВыгрузки, );
	
	
	//Если  КомпоновщикНастроекВыгрузки.Выбор.ДоступныеПоляВыбора.Элементы.Найти("ПериодВыгрузки") = Неопределено Тогда
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "ПериодМесяц";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ПериодМесяц"); 
	//КонецЕсли;
	//
	//Если  Настройки.Выбор.Элементы.Получить("Контрагентабс_ОтделНаименование") = Неопределено Тогда
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "Контрагентабс_ОтделНаименование";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Контрагентабс_ОтделНаименование"); 
	//КонецЕсли;
	
	//	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "Отдел";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Отдел"); 
	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "Канал";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Канал"); 
	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "Номенклатура";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Номенклатура"); 
	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "Количество";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Количество"); 
	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "ВыручкаПоБазовомуПрайсЛисту";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ВыручкаПоБазовомуПрайсЛисту"); 
	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "ВыручкаПоРПЛ";
	ВыбранноеПоле.Использование = Истина; 
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ВыручкаПоРПЛ"); 
	
	ВыбранноеПоле = КомпоновщикНастроекВыгрузки.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок     = "ФактическаяВыручка";
	ВыбранноеПоле.Использование = Истина; 
	//		ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ФактическаяВыручка"); 
	
	ТиповыеОтчеты.УдалитьГруппировку(КомпоновщикНастроекВыгрузки);
	ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроекВыгрузки,);
	
	//ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек,);
	
	МакетКомпоновки_ТЗ = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекВыгрузки.Настройки, ДанныеРасшифровкиВыгрузки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки_ТЗ, , ДанныеРасшифровкиВыгрузки , Истина);
	
	// Выводим результат в таблицу значений
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ_Номенклатура =  Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ_Номенклатура);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ДатаНач = МакетКомпоновки_ТЗ.ЗначенияПараметров.ДатаС.Значение;
	ДатаКон = МакетКомпоновки_ТЗ.ЗначенияПараметров.ДатаПо.Значение;
	
	ВыгрузитьвExcel(ТЗ_Номенклатура,ДатаНач,ДатаКон);
	//Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
	Макет = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхДляВыгрузки"); 
	//Макет = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	
	Возврат Макет; 
КонецФункции

&НаКлиенте
Процедура ВыгрузитьвExcel(ТЗ_Номенклатура,ДатаНач, ДатаКон)
	ПутьФайла = Отчет.ПутьФайла;
	
	// ТЗ_Номенклатура = УниверсальныйОтчет.ПолучитьРезультат().Выгрузить();
	// ТЗ_Номенклатура.Колонки.Добавить("Контрагентабс_ОтделНаименование", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	МассивПериодов = Новый Массив();
	
	ПериодМесяц = ДатаНач;
	
	
	Пока ПериодМесяц <= ДатаКон Цикл
		//НоваяСтрока = МассивПериодов.Добавить();
		МассивПериодов.Добавить(ПериодМесяц);
		
		//НоваяСтрока.ПериодМесяц = ПериодМесяц;
		ПериодМесяц = ДобавитьМесяц(ПериодМесяц, 1);
	КонецЦикла;	  
	
	НулевыеСтроки = ТЗ_Номенклатура.НайтиСтроки(Новый Структура("ПериодМесяц", Неопределено));
	
	Для Каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		ТЗ_Номенклатура.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	ИндустриальныйСтроки = ТЗ_Номенклатура.НайтиСтроки(Новый Структура("Контрагентабс_ОтделНаименование", "ДИСТРИБЬЮЦИЯ"));
	
	Для Каждого СтрокаТаблицы Из ИндустриальныйСтроки Цикл
		СтрокаТаблицы.Контрагентабс_ОтделНаименование = СтрокаТаблицы.Контрагентабс_ОтделНаименование + " " + СтрокаТаблицы.Канал.Наименование;
	КонецЦикла;
	
	//ТЗ_Номенклатура.Свернуть("ПериодМесяц, Отдел, Номенклатура, Количество, ВыручкаПоБазовомуПрайсЛисту, ВыручкаПоРПЛ, ФактическаяВыручка");
	ТЗ_Номенклатура.Свернуть("ПериодМесяц, Контрагентабс_ОтделНаименование, Номенклатура", "Количество, ВыручкаПоБазовомуПрайсЛисту, ВыручкаПоРПЛ, ФактическаяВыручка");
	
	//Дополним пустыми значениями отсутствующие периоды
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = ТЗ_Номенклатура.Скопировать();   
	ТЗ.Свернуть("Контрагентабс_ОтделНаименование, Номенклатура");
	
	Для Каждого Строка из ТЗ Цикл
		Для Каждого СтрокаПериод из  МассивПериодов Цикл
			НайденнаяСтрока =  ТЗ_Номенклатура.НайтиСтроки(Новый Структура("ПериодМесяц, Контрагентабс_ОтделНаименование, Номенклатура", СтрокаПериод, Строка.Контрагентабс_ОтделНаименование,Строка.Номенклатура));
			Если НайденнаяСтрока.Количество() = 0 Тогда
				НоваяСтрока = ТЗ_Номенклатура.Добавить();
				НоваяСтрока.ПериодМесяц = СтрокаПериод;
				НоваяСтрока.Контрагентабс_ОтделНаименование = Строка.Контрагентабс_ОтделНаименование;
				НоваяСтрока.Номенклатура =  Строка.Номенклатура;
				НоваяСтрока.Количество =  0;
				НоваяСтрока.ФактическаяВыручка =  0;
				НоваяСтрока.ВыручкаПоБазовомуПрайсЛисту =  0;
				НоваяСтрока.ВыручкаПоРПЛ =  0;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
	ТЗ_Номенклатура.Сортировать("Контрагентабс_ОтделНаименование Возр, Номенклатура Возр, ПериодМесяц Возр"); 
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = False;
		#Если Клиент Тогда
			Состояние("Подключение к файлу " + ПутьФайла + "...");
		#КонецЕсли
		Книга = Эксель.WorkBooks.Open(ПутьФайла);
		#Если Клиент Тогда
			Состояние("Загрузка данных файла " + ПутьФайла + "...");
		#КонецЕсли
		Лист1 = Книга.WorkSheets("РЕАЛ_ШТ");    //Количество
		Лист2 = Книга.WorkSheets("РЕАЛ_НЕТТО"); //Сумма
		Лист3 = Книга.WorkSheets("РЕАЛ_КУ");    //Сумма
		Лист4 = Книга.WorkSheets("РЕАЛ_РПЛ");   //Сумма
		
		
		ВсегоКолонок = Лист1.Cells(1,1).SpecialCells(11).Column;
		ВсегоСтрок = Лист1.Cells(1,1).SpecialCells(11).Row;   
		
		//НачПозицияВставка = ВсегоСтрок + 1;
		НачПозицияВставка = 1500; // По запросу Елиной Н.
		
		// Параметры поиска
		ГраницаКолонокДляПлана_Count = ExcelColumnNameToNumber("XW");
		ГраницаКолонокДляПлана_Amount = ExcelColumnNameToNumber("XQ");
		ДельтаГраницаКолонок =  ГраницаКолонокДляПлана_Count - ГраницаКолонокДляПлана_Amount;
		SelectionForArt =  Лист1.Range(Лист1.Cells(1,1),Лист1.Cells(ВсегоСтрок,10));                               // Ограничимся 10 колонками для поиска артикула
		Selection_Count =   Лист1.Range(Лист1.Cells(1,ГраницаКолонокДляПлана_Count),Лист1.Cells(10,ВсегоКолонок));      
		Selection_Amount =  Лист2.Range(Лист2.Cells(1,ГраницаКолонокДляПлана_Amount),Лист2.Cells(10,ВсегоКолонок)); 
		
		After_count  = Лист1.Range("A1:A1");
		After_amount = Лист2.Range("A1:A1");
		
		//LookIn
		xlComments = -4144; // Comments.
		xlFormulas = -4123; // Formulas.
		xlValues = -4163; // Values.
		
		//LookAt
		xlPart = 2;
		xlWhole = 1;
		
		Для Каждого Строка из ТЗ_Номенклатура Цикл
			//1. Поиск Номенклатуры по строкам файла Excel
			Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;	 
			
			МассивАртикулов = ПолучитьВсеАртикулыНоменклатуры(Строка.Номенклатура);
			Для Каждого Артикул ИЗ МассивАртикулов Цикл
				
				Попытка            
					What = Артикул;
					Поиск = SelectionForArt.Find(What, After_count, xlValues, xlWhole);
					АдресСтроки = Поиск.Row;
					РезультатПоискаНоменклатуры = Истина;
				Исключение
					РезультатПоискаНоменклатуры = Ложь;
				КонецПопытки;
				
				Если РезультатПоискаНоменклатуры Тогда
					Прервать;     // Нашли, по артикулам замены не ищем 
				КонецЕсли;
				
			КонецЦикла;	
			//2.  Поиск по колонкам файла Excel
			
			Если РезультатПоискаНоменклатуры = Ложь Тогда
				АдресСтроки  = НачПозицияВставка;
				
				Лист1.Cells(АдресСтроки, 1).Value =  Артикул;
				Лист1.Cells(АдресСтроки, 4).Value =  Строка.Номенклатура.Наименование;
				Лист2.Cells(АдресСтроки, 1).Value =  Артикул;
				Лист2.Cells(АдресСтроки, 4).Value =  Строка.Номенклатура.Наименование;
				Лист3.Cells(АдресСтроки, 1).Value =  Артикул;
				Лист3.Cells(АдресСтроки, 4).Value =  Строка.Номенклатура.Наименование;
				Лист4.Cells(АдресСтроки, 1).Value =  Артикул;
				Лист4.Cells(АдресСтроки, 4).Value =  Строка.Номенклатура.Наименование;
				
				SelectionForArt =  Лист1.Range(Лист1.Cells(1,1),Лист1.Cells(НачПозицияВставка,10));  
				
				НачПозицияВставка = НачПозицияВставка + 1;
				РезультатПоискаНоменклатуры = Истина;
				
			КонецЕсли;	 
			
			
			//Попытка
			Подразделение =  СокрЛП(Строка.Контрагентабс_ОтделНаименование);
			
			What = Подразделение;
			//Для штук ищем в своем диапазоне
			//Поиск = Selection_Count.Find(What, After_count, xlValues, xlWhole);
			Поиск = Selection_Count.Find(What);
			
			Попытка
				АдресКолонки = Поиск.Column;
				АдресКолонкиМесяца_шт = АдресКолонки + 3*(Месяц(Строка.ПериодМесяц))-1; // 
				РезультатПоискаПодразделения_шт = Истина;
				
			Исключение
				РезультатПоискаПодразделения_шт = Ложь;
			КонецПопытки; 
			
			//КонецЕсли;	
			
			
			//3. Присвоить значение ячейке Excel
			Если  РезультатПоискаНоменклатуры И РезультатПоискаПодразделения_шт Тогда
				Попытка
					Лист1.Cells(АдресСтроки, АдресКолонкиМесяца_шт).Value = Лист1.Cells(АдресСтроки, АдресКолонкиМесяца_шт).Value + Строка.Количество;
				Исключение
					Лист1.Cells(АдресСтроки, АдресКолонкиМесяца_шт).Value = Строка.Количество;
				КонецПопытки;	
				Если Отчет.Нетто Тогда
					Попытка
						Лист2.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value = Лист2.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value + Строка.ФактическаяВыручка;
					Исключение
						Лист2.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value = Строка.ФактическаяВыручка;
					КонецПопытки;	
				КонецЕсли;
				Если Отчет.КУ Тогда 
					Попытка
						Лист3.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value =  Лист3.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value + Строка.ВыручкаПоБазовомуПрайсЛисту;
					Исключение
						Лист3.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value = Строка.ВыручкаПоБазовомуПрайсЛисту;
					КонецПопытки;	
				КонецЕсли;
				Если Отчет.РПЛ Тогда 
					Попытка
						Лист4.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value =  Лист4.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value + Строка.ВыручкаПоРПЛ;
					Исключение
						Лист4.Cells(АдресСтроки, АдресКолонкиМесяца_шт - ДельтаГраницаКолонок).Value = Строка.ВыручкаПоРПЛ;
					КонецПопытки;	
				КонецЕсли;	   
				
				Сообщить("Загружен: Артикул " + Артикул + " (" + Подразделение + ") " + Формат(Строка.ПериодМесяц,"ДФ=dd.MM.yyyy"));
			Иначе 
				Сообщить("Не найдено: Артикул " + Артикул + " (" +  СокрЛП(Строка.Контрагентабс_ОтделНаименование) + ")");
				// Куда и как добавлять
				// Selection =  Лист1.Range(Лист1.Cells(1,1),Лист1.Cells(ВсегоСтрок,ВсегоКолонок));
				// After = Лист1.Range("A1:A1");
				
				
				
			КонецЕсли;	                 
			
		КонецЦикла;	//по ТЗ
		
		
		
		/////////////////////////////
		
		#Если Клиент Тогда
			Состояние("Сохранение файла " + ПутьФайла + "...");
		#КонецЕсли
		
		
		Книга.Save();
		Книга.Close();
		Эксель.Quit();
		
	Исключение
		
		Сообщить("Не удалось сформировать файл Excel" + ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьВсеАртикулыНоменклатуры(Номенклатура)
	МассивАртикулов = Новый Массив;
	АртикулЗамены = Номенклатура.Артикул;
	
	Пока ЗначениеЗаполнено(АртикулЗамены) Цикл
		МассивАртикулов.Добавить(АртикулЗамены);
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", АртикулЗамены);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Объект",Номенклатура);
		Отбор.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Артикул замены"));
		
		Индекс = МассивАртикулов.Найти(РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор).Значение);
		Если Индекс = Неопределено Тогда
			АртикулЗамены = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор).Значение;
		Иначе	
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивАртикулов;
КонецФункции	

Функция ПрочитатьЗначениеСвойства(Объект)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Объект);
	Отбор.Вставить("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Канал);
	Структура = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор);
	
	Возврат СокрЛП(Структура.Значение);
	
КонецФункции

Функция ExcelColumnNameToNumber(тИмяКолонки)   
	тЛатАлфавит = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	тДлинаНомера = СтрДлина(тИмяКолонки);
	
	тНомерКолонки = 0;
	
	Для тСчет = 1 По тДлинаНомера Цикл
		тПоз = Найти(тЛатАлфавит, Сред(тИмяКолонки, (тДлинаНомера + 1 - тСчет), 1));
		тНомерКолонки = тНомерКолонки + тПоз * Pow(26, тСчет - 1);
	КонецЦикла;
	
	Возврат тНомерКолонки;
КонецФункции

&НаКлиенте 
Функция ПолучитьПолноеИмяФормы(ИмяФормы)
	
	СимволТочка = ".";
	ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
	Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла; //
	Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;
	
КонецФункции

