
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ПланКоличество			= ЭтаФорма.Параметры.ПланКоличество;
	ЭтаФорма.ПланСуммаБезНДС		= ЭтаФорма.Параметры.ПланСуммаБезНДС;
	ЭтаФорма.ПланСумма				= ЭтаФорма.Параметры.ПланСумма;
	
	ЭтаФорма.ОперФактКоличество		= ЭтаФорма.Параметры.ОперФактКоличество;
	ЭтаФорма.ОперФактСуммаБезНДС	= ЭтаФорма.Параметры.ОперФактСуммаБезНДС;
	ЭтаФорма.ОперФактСумма			= ЭтаФорма.Параметры.ОперФактСумма;
	
	ЭтаФорма.Подтверждено			= ЭтаФорма.Параметры.Подтверждено;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(Команда)
	
	СтруктураПараметров = Новый Структура;

	СтруктураПараметров.Вставить("ПланКоличество"		, ЭтаФорма.ПланКоличество);
	СтруктураПараметров.Вставить("ПланСуммаБезНДС"		, ЭтаФорма.ПланСуммаБезНДС);
	СтруктураПараметров.Вставить("ПланСумма"			, ЭтаФорма.ПланСумма);
	СтруктураПараметров.Вставить("ОперФактКоличество"	, ЭтаФорма.ОперФактКоличество);
	СтруктураПараметров.Вставить("ОперФактСуммаБезНДС"	, ЭтаФорма.ОперФактСуммаБезНДС);
	СтруктураПараметров.Вставить("ОперФактСумма"		, ЭтаФорма.ОперФактСумма);
	СтруктураПараметров.Вставить("Подтверждено"			, ЭтаФорма.Подтверждено);
	
	Оповестить("УстановитьВидимость", СтруктураПараметров,ЭтаФорма);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
