
&НаКлиенте
Процедура ИспользоватьВзаимозачетПриИзменении(Элемент)
	Если НЕ Объект.ИспользоватьВзаимозачет Тогда
		Объект.ДоговорПоставки = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Истина;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Объект.ИспользоватьВзаимозачет Тогда
		Объект.ДоговорПоставки = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ДоговорПоставки.Доступность = Истина;
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура КнопкаПечать(Команда)
	УниверсальныеМеханизмы.ОткрытьФормуВыбораПечатныхФормОбъекта(ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Лео_РасчетПремииНепрямымКлиентам")), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруИзСоответствия(Команда)
	
	Если Объект.Номенклатура.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	
	ПолучитьНоменклатуруИзРегистраСоответствия(Объект.Контрагент,Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруИзРегистраСоответствия(Контрагент,ДатаСреза);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.СрезПоследних(&ДатаСреза, ) КАК Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних
		|ГДЕ
		|	Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Контрагент = &Контрагент
		|	И Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Регистратор.Дата >= &НачалоРегистрации
		|	И Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.НаименованиеВСистемеКлиента <> &ПустаяСТрока
		|
		|СГРУППИРОВАТЬ ПО
		|	Лео_СоответствиеНоменклатурыНепрямыхКлиентовСрезПоследних.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Запрос.УстановитьПараметр("НачалоРегистрации", началогода(ДатаСреза));     ///по ТЗ Коваль К. и Ципулиной П. ограичиваем началом года
	Запрос.УстановитьПараметр("ПустаяСТрока", "");
	Результат = Запрос.Выполнить();


	Результат = Запрос.Выполнить();

	ТзНоменклатура = Результат.Выгрузить();

	Если ТзНоменклатура.Количество()>0 Тогда
	    Объект.Номенклатура.Очистить();
		Объект.Номенклатура.Загрузить(ТзНоменклатура);
	КонецЕсли;


	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоФокусномуАссортименту(Команда)
	Если Объект.Номенклатура.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Выбрано = Справочники.Лео_ФокусныйАссортимент.ПустаяСсылка();
	ФормаВыбора = Справочники.Лео_ФокусныйАссортимент.ПолучитьФормуВыбора( , ЭтаФорма); 
    ФормаВыбора.Заголовок	= "Выберите фокусный ассортимент!";
    Выбрано = ФормаВыбора.ОткрытьМодально(); 
	
	Если НЕ Выбрано = Справочники.Лео_ФокусныйАссортимент.ПустаяСсылка() Тогда
		ПолучитьНоменклатуруИзФокусногоАссортимента(Выбрано);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруИзФокусногоАссортимента(ФокусныйАссортимент);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ФокусныйАссортиментСписокНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.Лео_ФокусныйАссортимент.СписокНоменклатуры КАК Лео_ФокусныйАссортиментСписокНоменклатуры
		|ГДЕ
		|	Лео_ФокусныйАссортиментСписокНоменклатуры.Ссылка = &ФокусныйАссортимент";

	Запрос.УстановитьПараметр("ФокусныйАссортимент", ФокусныйАссортимент);

	Результат = Запрос.Выполнить();

	ТзНоменклатура = Результат.Выгрузить();
	
	Если ТзНоменклатура.Количество()>0 Тогда
	    	Объект.Номенклатура.Очистить();
		    Объект.Номенклатура.Загрузить(ТзНоменклатура);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТорговыеТочкиПоДаннымФакта(Команда)
	Если Объект.ТорговыеТочки.Количество()>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Перед заполнением табличная часть будет очищена, продолжить?";
     	Ответ = Вопрос(Текст, Режим, 0);
        Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТорговыеТочкиПоДаннымФактаНаСервере();
	 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТорговыеТочкиПоДаннымФактаНаСервере()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка   как ТорговыеТочки
		|ИЗ
		|	РегистрНакопления.Лео_ПланФактПримииНепрямымКлиентам КАК Лео_ПланФактПримииНепрямымКлиентам
		|ГДЕ
		|	Лео_ПланФактПримииНепрямымКлиентам.Период МЕЖДУ &ДатаС И &ДатаПо
		|	И Лео_ПланФактПримииНепрямымКлиентам.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	Лео_ПланФактПримииНепрямымКлиентам.ТорговаяТочка";

	Запрос.УстановитьПараметр("ДатаПо", Объект.КонецПериода);
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);

	Результат = Запрос.Выполнить();

	ТзТорговыеТочки = Результат.Выгрузить();

	Если ТзТорговыеТочки.Количество()>0 Тогда
	    Объект.ТорговыеТочки.Очистить();
		Объект.ТорговыеТочки.Загрузить(ТзТорговыеТочки);
	КонецЕсли;                                                            

КонецПроцедуры
