Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;
Перем мВалютаУправленческогоУчета Экспорт;

// Хранят группировочные признаки вида операции
Перем ЕстьРасчетыСКонтрагентами Экспорт;
Перем ЕстьРасчетыПоКредитам Экспорт;

Перем ТабПроверкиОборотов; // Таблица для проверки контролируемых значений

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		// Напечатаем внешную печатную форму
		
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		Если ТабДокумент <> Неопределено Тогда
			УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		КонецЕсли; 
		
	Иначе
		// Напечатаем встроенную печатную форму
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Ссылка);
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.ЗаявкаНаРасходованиеСредств", ИмяМакета, 
										ПараметрКоманды, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ЗаявкаНаРасходованиеСредств", ИмяМакета, 
										ПараметрКоманды, Неопределено, Неопределено);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПечатьЗаявки","Заявка на расходование средств");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Проверяет значение, необходимое при проведении
Процедура ПроверитьЗначение(Значение, ИмяРеквизита, ТекстСообщения, НомерСтроки, Отказ)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда 
		
		ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("РасшифровкаПлатежа", НомерСтроки, ИмяРеквизита);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение табличной части документа
//
Процедура ПроверитьЗаполнениеТЧ(Отказ)
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Для Каждого Платеж Из РасшифровкаПлатежа Цикл
		
		///никитин
		Если  не ЗначениеЗаполнено(Платеж.Лео_СтатьяОборотов)  Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнена статья БДР!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			КонецЕсли;

		
		
		Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
			
			Если НЕ Платеж.ДоговорКонтрагента.Пустая()
				И (Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам
					ИЛИ Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) Тогда
					
				ТекстСообщения = НСтр("ru = 'Не заполнена сделка'");
				ПроверитьЗначение(Платеж.Сделка, "Сделка", ТекстСообщения, Платеж.НомерСтроки, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) 
				И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
				ТекстСообщения = НСтр("ru = 'Выбран договор контрагента, не соответствующий организации, указанной в документе!'");
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
			КонецЕсли;
            			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры 

// Процедура выполняет заполнение суммы документа,
// по регистру "СуммыЗаказов".
//
// Параметры:
//  ДокументОснование  - документ ссылка (Заказ покупателя, Заказ поставщику).
//  ВалютаДокумента    - валюта документа (валюта регламентированного учета организаций)
//  КурсВзаиморасчетов - курс взаиморасчетов по договору
//  КратностьВзаиморасчетов - кратность взаиморасчетов по договору
//
Процедура ЗаполнитьПоЗаказу(ДокументОснование, СтрокаПлатеж)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);

	Запрос.Текст ="ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.Сделка Как Сделка,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(, Сделка = &Заказ) КАК РасчетыСКонтрагентамиОстатки";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаПлатеж.Сделка=Выборка.Сделка;
		Если Выборка.Сумма < 0 Тогда
			СтрокаПлатеж.СуммаВзаиморасчетов=Выборка.Сумма*(-1);
			СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов,
			                            СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, 
			                            ВалютаДокумента,
			                            СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
			                            СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
			СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;							
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоЗаказу()

// Процедура выполняет заполнение суммы документа,
// суммы взаиморасчетов по регистру "ВзаиморасчетыСПодотчетнымиЛицами".
//
Процедура ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицом(СтрокаПлатеж) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("РасчетныйДокумент", РасчетныйДокумент);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетовПодотчетника", ВалютаВзаиморасчетовПодотчетника);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммаВзаиморасчетовОстаток КАК СуммаДолга // в валюте взаиморасчетов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПодотчетнымиЛицами.Остатки(,
	|	                                                           ФизЛицо = &Получатель
	|	                                                         И РасчетныйДокумент = &РасчетныйДокумент
	|	                                                         И Валюта = &ВалютаВзаиморасчетовПодотчетника)
	|ГДЕ
	|	СуммаВзаиморасчетовОстаток < 0
	|";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = - Выборка.СуммаДолга;
		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, 
		                            ВалютаВзаиморасчетовПодотчетника, ВалютаДокумента,
		                            СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
		                            СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
									
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;							
									
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицом()

Функция ПроверкаКонтролируемыхЗначений(СтруктураДанныхШапки,ТабКонтролируемыхОборотов)
	
	// Получение списка контролирующих сценариев для выбранного периода и измерений бюджетирования
	
	Для Каждого СтрокаПлатеж Из ТабПроверкиОборотов Цикл
	
	Запрос=Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ
	|	УстановкаОграниченийПоБюджетам.КонтролирующийСценарий КАК КонтролирующийСценарий,
	|	УстановкаОграниченийПоБюджетам.СтатьяОборотов КАК СтатьяОборотов,
	|	УстановкаОграниченийПоБюджетам.ЦФО КАК ЦФО,
	|	УстановкаОграниченийПоБюджетам.Проект КАК Проект,
	|	УстановкаОграниченийПоБюджетам.Контрагент КАК Контрагент,
	|	УстановкаОграниченийПоБюджетам.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.УстановкаОграниченийПоБюджетам КАК УстановкаОграниченийПоБюджетам
	|
	|ГДЕ
	|	УстановкаОграниченийПоБюджетам.Период = &Период И
	|	УстановкаОграниченийПоБюджетам.СтатьяОборотов = &СтатьяОборотов И
	|	УстановкаОграниченийПоБюджетам.Сценарий = &Сценарий И
	|	(УстановкаОграниченийПоБюджетам.ЦФО = &ЦФО ИЛИ УстановкаОграниченийПоБюджетам.ЦФО = &ПустойЦФО) И
	|	(УстановкаОграниченийПоБюджетам.Проект = &Проект ИЛИ УстановкаОграниченийПоБюджетам.Проект = &ПустойПроект) И
	|	(УстановкаОграниченийПоБюджетам.Контрагент = &Контрагент ИЛИ УстановкаОграниченийПоБюджетам.Контрагент = &ПустойКонтрагент) И
	|	(УстановкаОграниченийПоБюджетам.Номенклатура = &Номенклатура ИЛИ УстановкаОграниченийПоБюджетам.Номенклатура = Неопределено) И
	|	УстановкаОграниченийПоБюджетам.ИспользованиеКонтролируемогоЗначения = &ИспользованиеКонтролируемогоЗначения И
	|	УстановкаОграниченийПоБюджетам.ВидКонтролируемогоЗначения = &ВидКонтролируемогоЗначения";
	
	Запрос.УстановитьПараметр("Период",ОбщегоНазначения.ДатаНачалаПериода(ДатаРасхода,СтруктураДанныхШапки.СценарийПериодичность));
	Запрос.УстановитьПараметр("СтатьяОборотов",СтатьяОборотов);
	Запрос.УстановитьПараметр("ИспользованиеКонтролируемогоЗначения",Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении);
	Запрос.УстановитьПараметр("ВидКонтролируемогоЗначения",Перечисления.ВидыКонтролируемогоЗначенияБюджета.Ограничивающее);
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	Запрос.УстановитьПараметр("ЦФО",ЦФО);
	Запрос.УстановитьПараметр("ПустойЦФО",Новый(Тип("СправочникСсылка.Подразделения")));
	
	Запрос.УстановитьПараметр("Проект",СтрокаПлатеж.Проект);
	Запрос.УстановитьПараметр("ПустойПроект",Новый(Тип("СправочникСсылка.Проекты")));
	
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ПустойКонтрагент",Новый(Тип("СправочникСсылка.Контрагенты")));
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	ТабРезультата=Запрос.Выполнить().Выгрузить();
	
	Если ТабРезультата.Количество()=0 Тогда
		
		Продолжить;
		
	Иначе
		
		ТабРезультата.Колонки.Добавить("СуммаСценарияИсполнение");
		ТабРезультата.Колонки.Добавить("Период");
		
		Для каждого СтрокаПроверки Из ТабРезультата Цикл
			
			ТекущийСценарий=?(СтрокаПроверки.КонтролирующийСценарий.Пустая(),Сценарий,СтрокаПроверки.КонтролирующийСценарий);
			
			ДатаНачала = ОбщегоНазначения.ДатаНачалаПериода(ДатаРасхода, ТекущийСценарий.Периодичность);
			ДатаКонца  = ОбщегоНазначения.ДатаКонцаПериода (ДатаНачала,  ТекущийСценарий.Периодичность);
			
			СтруктруаКурсаСценария = Бюджетирование.КурсВалютыПоСценарию(Сценарий.Валюта, ДатаНачала,Сценарий);
			КурсСценария      = СтруктруаКурсаСценария.Курс;
			КратностьСценария = СтруктруаКурсаСценария.Кратность;
			
			Если СтрокаПлатеж.СуммаПлатежа>0 ИЛИ ТабПроверкиОборотов.Колонки.Найти("СуммаУпр")=Неопределено Тогда
				
				СуммаСценария=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа, ВалютаДокумента, СтруктураДанныхШапки.СценарийВалюта, КурсДокумента, КурсСценария, 
				КратностьДокумента, КратностьСценария);
				
			Иначе
				
				СуммаСценария=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаУпр, , СтруктураДанныхШапки.СценарийВалюта, СтрокаПлатеж.КурсУпрУчета, КурсСценария, 
				СтрокаПлатеж.КратностьУпрУчета, КратностьСценария);
				
			КонецЕсли;
			
			Запрос.Текст="ВЫБРАТЬ
			|	СУММА(КонтролируемыеЗначенияБюджетовОбороты.СуммаСценарияКонтрольОборот) КАК СуммаКонтроль,
			|	СУММА(КонтролируемыеЗначенияБюджетовОбороты.СуммаСценарияИсполнениеОборот) КАК СуммаИсполнение
			|ИЗ
			|	РегистрНакопления.КонтролируемыеЗначенияБюджетов.Обороты(&ДатаНачала, &ДатаНачала, , 
			|					Контрагент = &Контрагент И 
			|					КонтролирующийСценарий=&КонтролирующийСценарий И
			|					Номенклатура=&Номенклатура И 
			|					Проект=&Проект И 
			|					СтатьяОборотов=&СтатьяОборотов И 
			|					Сценарий=&Сценарий И 
			|					ЦФО=&ЦФО И 
			|					ИспользованиеКонтролируемогоЗначения=&ИспользованиеКонтролируемогоЗначения
			|					) КАК КонтролируемыеЗначенияБюджетовОбороты";
			
			
			
			
			Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
			Запрос.УстановитьПараметр("Контрагент",СтрокаПроверки.Контрагент);
			Запрос.УстановитьПараметр("КонтролирующийСценарий",СтрокаПроверки.КонтролирующийСценарий);
			Запрос.УстановитьПараметр("Номенклатура",СтрокаПроверки.Номенклатура);
			Запрос.УстановитьПараметр("Проект",СтрокаПроверки.Проект);
			Запрос.УстановитьПараметр("СтатьяОборотов",СтрокаПроверки.СтатьяОборотов);
			Запрос.УстановитьПараметр("Сценарий",Сценарий);
			Запрос.УстановитьПараметр("ЦФО",СтрокаПроверки.ЦФО);
			Запрос.УстановитьПараметр("ИспользованиеКонтролируемогоЗначения",Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении);
			
			СуммаКонтроль=0;
			СуммаИсполнение=0;
			
			Результат = Запрос.Выполнить();
			Выборка=Результат.Выбрать();
			Если Выборка.Следующий() И (НЕ Выборка["СуммаКонтроль"]=NULL) И (НЕ Выборка["СуммаИсполнение"]=NULL) Тогда
				СуммаКонтроль=Выборка["СуммаКонтроль"];
				СуммаИсполнение=Выборка["СуммаИсполнение"]+СуммаСценария;
			КонецЕсли;
			
			Если СуммаИсполнение>СуммаКонтроль Тогда
				
				ТекстСообщения="Оборот приведет к превышению контролируемого значения!
				|Контролирующий сценарий: "+ ТекущийСценарий+"
				|Период планирования: "+Формат(ДатаНачала,"ДФ=dd.MM.yyyy")+" - "+Формат(ДатаКонца,"ДФ=dd.MM.yyyy")+"
				|Статья оборотов: "+СтрокаПроверки.СтатьяОборотов;
				
			Если Не СтрокаПроверки.ЦФО.Пустая() Тогда
				
				ТекстСообщения=ТекстСообщения+"
				|ЦФО: "+СтрокаПроверки.ЦФО;
			
			КонецЕсли;
			
			Если Не СтрокаПроверки.Проект.Пустая() Тогда
				
				ТекстСообщения=ТекстСообщения+"
				|Проект: "+СтрокаПроверки.Проект;
				
			КонецЕсли;
			
			Если Не СтрокаПроверки.Контрагент.Пустая() Тогда
				
				ТекстСообщения=ТекстСообщения+"
				|Контрагент: "+СтрокаПроверки.Контрагент;
				
			КонецЕсли;
			
			Если Не СтрокаПроверки.Номенклатура=Неопределено Тогда
				
				ТекстСообщения=ТекстСообщения+"
				|Номенклатура: "+СтрокаПроверки.Номенклатура;
				
			КонецЕсли;

			ТекстСообщения=ТекстСообщения+"
				|Контролируемое значение: "+СуммаКонтроль+" "+Сценарий.Валюта+"
				|Значение с учетом суммы по заявке: "+СуммаИсполнение+" "+Сценарий.Валюта;
				
				Сообщить(ТекстСообщения);
				
				Если НЕ УправлениеДопПравамиПользователей.РазрешеноПревышениеКонтролируемыхЗначенийПоБюджетам() Тогда
					Возврат Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаПроверки.СуммаСценарияИсполнение=СуммаСценария;
			СтрокаПроверки.Период=ДатаНачала;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТабРезультата,ТабКонтролируемыхОборотов);
	
	КонецЦикла;
	
	Возврат ТабКонтролируемыхОборотов;
	
КонецФункции // ПроверкаКонтролируемыхЗначений()


// Формирует движения по регистрам
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(СтруктураДанныхШапки, Отказ, Заголовок, СтруктураКурсыВалют)
	
	РасчетыВозврат    = УправлениеДенежнымиСредствами.НаправленияДвиженияДляДокументаДвиженияДенежныхСредствУпр(ВидОперации);
	КоэффициентСторно = ?(РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат, -1, 1);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЕстьРасчетыСКонтрагентами", ЕстьРасчетыСКонтрагентами);
	СтруктураПараметров.Вставить("ЕстьРасчетыПоКредитам", ЕстьРасчетыПоКредитам);
	СтруктураПараметров.Вставить("ВидОперации", ВидОперации);
	СтруктураПараметров.Вставить("ДатаРасхода", ДатаРасхода);
	ТабПроверкиОборотов = Бюджетирование.СформироватьТаблицуДляКонтроля(Ссылка, СтруктураПараметров);
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		
		НаборДвижений = Движения.КонтролируемыеЗначенияБюджетов;
		ТабКонтролируемыхЗначений=НаборДвижений.ВыгрузитьКолонки();
		
		ТабКонтролируемыхЗначений=ПроверкаКонтролируемыхЗначений(СтруктураДанныхШапки,ТабКонтролируемыхЗначений);
		
		Если ТипЗнч(ТабКонтролируемыхЗначений)=Тип("Булево") И НЕ ТабКонтролируемыхЗначений Тогда
			Сообщить("Превышение контролируемого значения. Проведение отменено!");
			Отказ=Истина;
			Возврат;
		Иначе
			
			Если ТабКонтролируемыхЗначений.Количество()>0 Тогда
				
				// По регистру "КонтролируемыеЗначенияБюджетов"
				ТабКонтролируемыхЗначений.ЗаполнитьЗначения(Сценарий,"Сценарий");
				ТабКонтролируемыхЗначений.ЗаполнитьЗначения(Перечисления.ИспользованиеКонтролируемыхЗначенийБюджетов.ПриИсполнении,"ИспользованиеКонтролируемогоЗначения");
				ТабКонтролируемыхЗначений.ЗаполнитьЗначения(Истина,"Активность");
				
				НаборДвижений = Движения.КонтролируемыеЗначенияБюджетов;
				НаборДвижений.мТаблицаДвижений = ТабКонтролируемыхЗначений;
				
				Движения.КонтролируемыеЗначенияБюджетов.ВыполнитьДвижения();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РазмещениеЗаявки.Количество()>0 Тогда
		
		ТабРазмещениеЗаявки=РазмещениеЗаявки.Выгрузить();
		ТабРазмещениеЗаявки.Свернуть("МестоРазмещения","СуммаПлатежа");
		
		НаборРазмещение=Движения.РазмещениеЗаявокНаРасходованиеСредств;
		ТаблицаРазмещение=НаборРазмещение.ВыгрузитьКолонки();
		
		НаборРезерв=Движения.ДенежныеСредстваВРезерве;
		ТаблицаРезерв=НаборРезерв.ВыгрузитьКолонки();

		Для Каждого Строка Из ТабРазмещениеЗаявки Цикл
			
			Если Строка.МестоРазмещения=Неопределено Тогда
				Продолжить;
			ИначеЕсли ТипЗнч(Строка.МестоРазмещения)= Тип("ДокументСсылка.ПланируемоеПоступлениеДенежныхСредств") Тогда
				
				ОстатокКРазмещению=УправлениеДенежнымиСредствами.ПолучитьНеразмещенныйостаток(Строка.МестоРазмещения,КонецДня(ДатаРасхода),Ссылка);
				
				Если ОстатокКРазмещению<Строка.СуммаПлатежа Тогда
					Сообщить(Заголовок+"
					|Размещаемая сумма превышает неразмещенный остаток
					|по "+Строка.МестоРазмещения+".
					|Возможный к использованию остаток: "+Формат(ОстатокКРазмещению,"ЧЦ=15; ЧДЦ=2; ЧН=0")+" "+ВалютаДокумента+"
					|Резервируемая сумма = "+Формат(Строка.СуммаПлатежа,"ЧЦ=15; ЧДЦ=2")+" "+ВалютаДокумента);
					
					Отказ = Истина;
					Возврат;
					
				КонецЕсли;
				
				СтрокаРазмещение=ТаблицаРазмещение.Добавить();
				СтрокаРазмещение.ДокументПланирования=Строка.МестоРазмещения;
				СтрокаРазмещение.ДокументРезервирования=Ссылка;
				СтрокаРазмещение.Сумма=Строка.СуммаПлатежа;
				
			Иначе
				
				// Проверяем остаток доступных денежных средств
				СвободныйОстаток=УправлениеДенежнымиСредствами.ПолучитьСвободныйОстатокДС(Строка.МестоРазмещения,КонецДня(ДатаРасхода),Ссылка);
				Если СвободныйОстаток<Строка.СуммаПлатежа Тогда
					Сообщить(Заголовок+"
					|Резервируемая сумма превышает возможный к использованию остаток денежных средств
					|по "+Строка.МестоРазмещения.Наименование+".
					|Возможный к использованию остаток: "+Формат(СвободныйОстаток,"ЧЦ=15; ЧДЦ=2; ЧН=0")+" "+ВалютаДокумента+"
					|Резервируемая сумма = "+Формат(Строка.СуммаПлатежа,"ЧЦ=15; ЧДЦ=2")+" "+ВалютаДокумента);
					
					Если НЕ УправлениеДопПравамиПользователей.ПравоРазрешитьПревышениеСвободногоОстаткаДС() Тогда
						Отказ = Истина;
						Возврат;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаРезерв=ТаблицаРезерв.Добавить();
				СтрокаРезерв.БанковскийСчетКасса=Строка.МестоРазмещения;
				СтрокаРезерв.Организация=Организация;
				СтрокаРезерв.ДокументРезервирования=Ссылка;
				СтрокаРезерв.ВидДенежныхСредств=ФормаОплаты;
				СтрокаРезерв.Сумма=Строка.СуммаПлатежа;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборРазмещение.мПериод=КонецДня(ДатаРасхода);
		НаборРазмещение.мТаблицаДвижений=ТаблицаРазмещение;
		Движения.РазмещениеЗаявокНаРасходованиеСредств.ВыполнитьПриход();
		
		НаборРезерв.мПериод=ДатаРасхода;
		НаборРезерв.мТаблицаДвижений=ТаблицаРезерв;
		Движения.ДенежныеСредстваВРезерве.ВыполнитьПриход();
		
	КонецЕсли;
	
	// По регистру "ЗаявкиНаРасходованиеСредств"
	
	НаборДвиженийЗаявки = Движения.ЗаявкиНаРасходованиеСредств;
	ТаблицаДвиженийЗаявки = НаборДвиженийЗаявки.ВыгрузитьКолонки();
	
	НаборДвиженийЗаявки_лео = Движения.ЛЕО_ЗаявкиНаРасходованиеСредств;
	ТаблицаДвиженийЗаявки_лео = НаборДвиженийЗаявки_лео.ВыгрузитьКолонки();
	
	НаборДвиженийЗаявкиРасшифровка_лео = Движения.Лео_ОборотыБюджетов;
	ТаблицаДвиженийЗаявкиРасшифровка_лео = НаборДвиженийЗаявкиРасшифровка_лео.ВыгрузитьКолонки();
	
	
	
	// По регистру "РасчетыСКонтрагентами"
	НаборДвиженийКонтрагенты = Движения.РасчетыСКонтрагентами;
	ТаблицаДвиженийКонтрагенты = НаборДвиженийКонтрагенты.ВыгрузитьКолонки();
	
	ВалютаУпрУчета = глЗначениеПеременной("ВалютаУправленческогоУчета");
	
	Для Каждого Платеж Из РасшифровкаПлатежа Цикл
		
		Если ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику Тогда
			ВалютаВзаиморасчетов = ВалютаВзаиморасчетовПодотчетника;
		ИначеЕсли ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
			ВалютаВзаиморасчетов = Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Иначе
			ВалютаВзаиморасчетов = ВалютаДокумента;
		КонецЕсли;
			
		СтруктураКурсВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(
			ВалютаВзаиморасчетов, ?(ДатаРасхода = '00010101', Дата, КонецДня(ДатаРасхода)));
		
		СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
			Платеж.СуммаВзаиморасчетов,
			ВалютаВзаиморасчетов, ,
			СтруктураКурсВзаиморасчетов.Курс, СтруктураКурсыВалют.ВалютаУпрУчетаКурс, 
			СтруктураКурсВзаиморасчетов.Кратность, СтруктураКурсыВалют.ВалютаУпрУчетаКратность);

		СтрокаДвиженийЗаявки = ТаблицаДвиженийЗаявки.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДвиженийЗаявки, Платеж);
		///лео никитин
		СтрокаДвиженийЗаявки_лео = ТаблицаДвиженийЗаявки_лео.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДвиженийЗаявки_лео, Платеж);
		
		СтрокаДвиженийЗаявкиРасшифровка_лео = ТаблицаДвиженийЗаявкиРасшифровка_лео.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДвиженийЗаявкиРасшифровка_лео, Платеж);

		
		
		////
		
		
		СтрокаДвиженийЗаявки.СуммаУпр				= СуммаУпр;
		СтрокаДвиженийЗаявки.Сумма					= Платеж.СуммаПлатежа;
		//СтрокаДвиженийЗаявки.абс_СуммаНДС			= Платеж.СуммаНДС;
		СтрокаДвиженийЗаявки.ЗаявкаНаРасходование	= Ссылка;
		СтрокаДвиженийЗаявки.Организация			= Организация;
		
		//лео никитин
		СтрокаДвиженийЗаявки_лео.СуммаУпр				= СуммаУпр;
		СтрокаДвиженийЗаявки_лео.Сумма					= Платеж.СуммаПлатежа;
		СтрокаДвиженийЗаявки_лео.абс_СуммаНДС			= Платеж.СуммаНДС;
		СтрокаДвиженийЗаявки_лео.ЗаявкаНаРасходование	= Ссылка;
		СтрокаДвиженийЗаявки_лео.Организация			= Организация;
		
		СтрокаДвиженийЗаявкиРасшифровка_лео.СуммаУпр				= СуммаУпр*(-1);
		СтрокаДвиженийЗаявкиРасшифровка_лео.СуммаУпрБезНДС				= (СуммаУпр-Платеж.СуммаНДС)*(-1);
		СтрокаДвиженийЗаявкиРасшифровка_лео.Организация			= Организация;
		СтрокаДвиженийЗаявкиРасшифровка_лео.Период				= НачалоМесяца(?(ДатаРасхода='00010101',Дата,ДатаРасхода));
        СтрокаДвиженийЗаявкиРасшифровка_лео.Расшифровка   = Платеж.Лео_Расшифровка;
		СтрокаДвиженийЗаявкиРасшифровка_лео.СтатьяОборотов =  Платеж.Лео_СтатьяОборотов;
		СтрокаДвиженийЗаявкиРасшифровка_лео.ЦФО =  ЦФО;
		СтрокаДвиженийЗаявкиРасшифровка_лео.Активность = Истина;
		СтрокаДвиженийЗаявкиРасшифровка_лео.сценарий = Справочники.СценарииПланирования.БухгалтерскийФакт;
		/////
		
		
		
		Если ВидОперации <> Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику Тогда
			СтрокаДвиженийЗаявки.Контрагент			= Контрагент;
			///Лео никитин

			СтрокаДвиженийЗаявки_лео.Контрагент			= Контрагент;

		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДвиженийЗаявки.ДокументРасчетовСКонтрагентом) Тогда
			СтрокаДвиженийЗаявки.ДокументРасчетовСКонтрагентом = Ссылка;
			///Лео никитин

			СтрокаДвиженийЗаявки_лео.ДокументРасчетовСКонтрагентом = Ссылка;

		КонецЕсли;
		
				
		
		
		
		
		
		
		Если (ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам) И ВключатьВПлатежныйКалендарь Тогда
			
			СтрокаДвиженийКонтрагенты = ТаблицаДвиженийКонтрагенты.Добавить();
			СтрокаДвиженийКонтрагенты.ДоговорКонтрагента	= Платеж.ДоговорКонтрагента;
			СтрокаДвиженийКонтрагенты.Контрагент  		    = Контрагент;
			СтрокаДвиженийКонтрагенты.Организация  	   		= Организация;

			СтрокаДвиженийКонтрагенты.РасчетыВозврат		= РасчетыВозврат;
			СтрокаДвиженийКонтрагенты.Сделка				= Платеж.Сделка;
			СтрокаДвиженийКонтрагенты.СуммаВзаиморасчетов	= Платеж.СуммаВзаиморасчетов*КоэффициентСторно;
			СтрокаДвиженийКонтрагенты.СуммаУпр				= СуммаУпр*КоэффициентСторно;
			СтрокаДвиженийКонтрагенты.Период				= ?(ДатаРасхода='00010101',Дата,ДатаРасхода);
			СтрокаДвиженийКонтрагенты.ВидДвижения			= ?(КоэффициентСторно = 1,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			СтрокаДвиженийКонтрагенты.Активность			= Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборДвиженийЗаявки.мПериод				= ?(ДатаРасхода='00010101',Дата,ДатаРасхода);
	НаборДвиженийЗаявки.мТаблицаДвижений	= ТаблицаДвиженийЗаявки;
	Движения.ЗаявкиНаРасходованиеСредств.ВыполнитьПриход();
	//лео никитин
	НаборДвиженийЗаявки_лео.мПериод				= ?(ДатаРасхода='00010101',Дата,ДатаРасхода);
	НаборДвиженийЗаявки_лео.мТаблицаДвижений	= ТаблицаДвиженийЗаявки_лео;
	Движения.Лео_ЗаявкиНаРасходованиеСредств.ВыполнитьПриход();
	
	
	//НаборДвиженийЗаявкиРасшифровка_лео.Период			= ?(ДатаРасхода='00010101',Дата,ДатаРасхода);
	НаборДвиженийЗаявкиРасшифровка_лео.мТаблицаДвижений	= ТаблицаДвиженийЗаявкиРасшифровка_лео;
	Движения.Лео_ОборотыБюджетов.ВыполнитьДвижения();

	
	
	
	
	//
	
	
	
	
	Если (ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам) И ВключатьВПлатежныйКалендарь Тогда
		
		НаборДвиженийКонтрагенты.мТаблицаДвижений	= ТаблицаДвиженийКонтрагенты;
		НаборДвиженийКонтрагенты.ВыполнитьДвижения();
				
	КонецЕсли;
	
	//Если используется механизм согласования заявок, и заявка еще не прошла по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	//+Лео Сафонов ЕА
	//НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаявок.СоздатьНаборЗаписей();
	//НаборЗаписейСостояниеСогласования.Отбор.Заявка.Установить(Ссылка);
	//НаборЗаписейСостояниеСогласования.Прочитать();
	//Если УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(Организация, Дата) Тогда
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,Дата) Тогда

		//абс вставка 38760
		Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
					
					//+Лео Сафонов
					//МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,абс_СверхЛимита);
					МаршрутСогласования = абс_СогласованиеДокументов.Лео_ОпределитьМаршрутСогласованияЗаявокНаРасходованиеДС(ЭтотОбъект);
					//-Лео Сафонов
					
					////никитин определение спец маршрута
					Если   Лео_Срочная      тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	Лео_Настройки.ДопРеквизит_2
					|ИЗ
					|	Справочник.Лео_Настройки КАК Лео_Настройки
					|ГДЕ
					|	 Лео_Настройки._Ссылка = &_Ссылка
					|	И Лео_Настройки.ДопРеквизит_1 = &ДопРеквизит_1
					|	И Лео_Настройки.Использовать = &Использовать";
					
					Запрос.УстановитьПараметр("_Ссылка", Организация);
					Запрос.УстановитьПараметр("ДопРеквизит_1", ЦФО);
					//Запрос.УстановитьПараметр("ДопРеквизит_2", ДопРеквизит_2);
					Запрос.УстановитьПараметр("Использовать", Истина);
					//	Запрос.УстановитьПараметр("Родитель", Родитель);
					
					Результат = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
                    					 
						МаршрутСогласования=ВыборкаДетальныеЗаписи.ДопРеквизит_2;			
						сообщить("строка.ДопРеквизит_2");
					КонецЦикла;						
					конецЕсли;
					
					
					
					
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период 					= ТекущаяДата();
					НоваяЗапись.Активность 				= Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь 			= Ответственный;
					НоваяЗапись.Этап 					= МаршрутСогласования;
					НоваяЗапись.ТекущийЭтап             = "Начальный";
					НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
					
					НаборЗаписейСостояниеСогласования.Записать();
					ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
					ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования,НоваяЗапись.Состояние);

					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//абс вставка 38760 конец

		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования
			Возврат;
		КонецЕсли;
		///+абс вставка 38760 конец
		//МаршрутСогласования = УправлениеДенежнымиСредствами.ОпределитьМаршрутСогласования(ЦФО);
		//+Лео Сафонов
		//МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,абс_СверхЛимита);
		МаршрутСогласования = абс_СогласованиеДокументов.Лео_ОпределитьМаршрутСогласованияЗаявокНаРасходованиеДС(ЭтотОбъект);
		//-Лео Сафонов
		//-абс вставка 38760 конец
		 ////никитин определение спец маршрута
				////никитин определение спец маршрута
				Если   Лео_Срочная      тогда

				Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	Лео_Настройки.ДопРеквизит_2
					|ИЗ
					|	Справочник.Лео_Настройки КАК Лео_Настройки
					|ГДЕ
					|	Лео_Настройки._Ссылка = &_Ссылка
					|	И Лео_Настройки.ДопРеквизит_1 = &ДопРеквизит_1
					|	И Лео_Настройки.Использовать = &Использовать";
					
					Запрос.УстановитьПараметр("_Ссылка", Организация);
					Запрос.УстановитьПараметр("ДопРеквизит_1", ЦФО);
					//Запрос.УстановитьПараметр("ДопРеквизит_2", ДопРеквизит_2);
					Запрос.УстановитьПараметр("Использовать", Истина);
					//	Запрос.УстановитьПараметр("Родитель", Родитель);
					
					Результат = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
                    					 
						МаршрутСогласования=ВыборкаДетальныеЗаписи.ДопРеквизит_2;			
						сообщить("строка.ДопРеквизит_2");
					КонецЦикла;				
		           КонецЕсли;
		
		
		
		
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования заявки", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		НаборЗаписейСостояниеСогласования.Очистить();
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		//НоваяЗапись.Заявка = Ссылка;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь = Ответственный;
		НоваяЗапись.Этап = МаршрутСогласования;
		НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		
		НаборЗаписейСостояниеСогласования.Записать();
		
		ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
		ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования, НоваяЗапись.Состояние);
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры // ДвиженияПоРегистрам() 

// Процедура выполняет заполнение реквизита Получатель значением по умолчанию.
//
Процедура ЗаполнитьПолучателя(глТекущийПользователь)
    СписокЗначений = Новый СписокЗначений;

	ВремПолучатель = Неопределено;
	Если ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику Тогда
		ВремКонтрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(глТекущийПользователь, "ОсновнойПоставщик", СписокЗначений).Значение;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю Тогда
		ВремКонтрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(глТекущийПользователь, "ОсновнойПокупатель", СписокЗначений).Значение;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствКассеККМ И ВидВыдачиДенежныхСредств = Перечисления.ВидВыдачиДенежныхСредств.КассеККМ Тогда
		ВремКонтрагент = УправлениеПользователями.ПолучитьЗначениеПоУмолчаниюПользователя(глТекущийПользователь, "ОсновнаяКассаККМ", СписокЗначений).Значение;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		Получатель = ВремПолучатель;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = ВремКонтрагент;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПолучателя()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если (Основание <> Неопределено) И (Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание))) Тогда
			//////  Никитин проверка на уже введенные заявки
		 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаявкаНаРасходованиеСредств.Ссылка
	//	|ИЗ
	//	|	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
	//	|ГДЕ
	//	|	ЗаявкаНаРасходованиеСредств.ДокументОснование = &ДокументОснование";

	//Запрос.УстановитьПараметр("ДокументОснование", Основание);
	////Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//	Предупреждение("У документа Основания уже есть ЗАЯВКА НА РАСХОДОВАНИЕ "+ВыборкаДетальныеЗаписи.Ссылка);
	//	Возврат;

	//КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	/////
	// Заполним реквизиты из стандартного набора по документу основанию.
		ДокументОснование = Основание;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	КонецЕсли;

	СпособЗаполнения = "Не заполнять";
	ВалютаДокумента  = мВалютаРегламентированногоУчета;
	//никитин
	ЦФО=ПараметрыСеанса.ТекущийПользователь.абс_Подразделение;
    Если сокрЛП(ЦФО.Наименование)="Логистика ГП (транспорт и клиентская служба)"  Тогда
	Описание="Транспортные услуги";
	Иначе
	Описание="";	
	КонецЕсли; 
	////
	глТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		
		ДатаРасхода       = Основание.ДатаОплаты;
		//ЦФО               = Основание.Подразделение;
		ДокументОснование = Основание;
		//лео никитин
		Лео_НормативнаяДатаОплаты = Основание.ДатаОплаты;
        Лео_ДатаПоступленияТовараАкта = Основание.ДатаПоступления;

		СтрокаПлатеж.ДоговорКонтрагента            = Основание.ДоговорКонтрагента;
        СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
		СтруктураКурсаВзаиморасчетов               = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ДатаРасхода);
		СтрокаПлатеж.КурсВзаиморасчетов            = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов       = СтруктураКурсаВзаиморасчетов.Кратность;
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику"))
			И (СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам) Тогда
			
			СтрокаПлатеж.Сделка=Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			Если СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			
				СтрокаПлатеж.Сделка=Основание;
			ИначеЕсли ТипЗнч(Основание.ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику") 
				И (СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
				ИЛИ СтрокаПлатеж.ДоговорКонтрагента.ВедениеВзаиморасчетов=Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом) Тогда
				СтрокаПлатеж.Сделка=Основание.ДокументОснование;

			КонецЕсли;
			
		КонецЕсли;
		
		ВидОперации	= Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		
		Если ЗначениеЗаполнено(Основание.СтруктурнаяЕдиница) Тогда
			
			Если ТипЗнч(Основание.СтруктурнаяЕдиница)=Тип("СправочникСсылка.Кассы") Тогда
				ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные;
			Иначе
				ФормаОплаты=Перечисления.ВидыДенежныхСредств.Безналичные;
			КонецЕсли;
			
			БанковскийСчетКасса = Основание.СтруктурнаяЕдиница;
		Иначе
			ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные;
			БанковскийСчетКасса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяКасса");
		КонецЕсли;

		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") И Основание.Проведен  Тогда
			СпособЗаполнения = "По заказу";
		Иначе
			СпособЗаполнения = "По сумме документа";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
			ВалютаДокумента=БанковскийСчетКасса.ВалютаДенежныхСредств;
		Иначе
			ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента           = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,КонецДня(ДатаРасхода));
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
		или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ")) 
		или (ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеДопРасходов")) 
		или (ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")) 
		или (ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")) Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
			ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю
		Иначе
			ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		КонецЕсли;

		Контрагент  = Основание.Контрагент;
		СтрокаПлатеж.ДоговорКонтрагента        = Основание.ДоговорКонтрагента;
		СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		СтрокаПлатеж.КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;
        СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = СтрокаПлатеж.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
		
		СтрокаПлатеж.Сделка = Основание.Сделка;
		Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
			СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Основание;
		КонецЕсли;
		
		//лео   никитин
		ДатаРасхода       = Основание.Дата+СтрокаПлатеж.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности*86400;
		//ЦФО               = Основание.Подразделение;
		ДокументОснование = Основание;
		//лео никитин
		Лео_НормативнаяДатаОплаты = Основание.Дата+СтрокаПлатеж.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности*86400;
        Лео_ДатаПоступленияТовараАкта = Основание.Дата;
        		
		//Если Основание.Проведен Тогда   //  лео никитин
		//	СпособЗаполнения = "По взаиморасчетам";
		//Иначе
			СпособЗаполнения = "По сумме документа";
		//КонецЕсли;
		
		ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные;
		БанковскийСчетКасса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяКасса");
		
		Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
			ВалютаДокумента=БанковскийСчетКасса.ВалютаДенежныхСредств;
		Иначе
			ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;

		СтруктураКурсаДокумента           = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
		УправлениеПроектами.ЗаполнитьПроект(СтрокаПлатеж, Основание);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда

		ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику;
		ФормаОплаты=Перечисления.ВидыДенежныхСредств.Наличные;
		
		Получатель                       = Основание.ФизЛицо;
		РасчетныйДокумент                = Основание;
		ВалютаВзаиморасчетовПодотчетника = Основание.ВалютаДокумента;
		СтруктураКурсаВзаиморасчетов     = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаВзаиморасчетовПодотчетника, ТекущаяДата());
		СтрокаПлатеж.КурсВзаиморасчетов               = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов          = СтруктураКурсаВзаиморасчетов.Кратность;
		
		СпособЗаполнения = "По взаиморасчетам с подотчетным лицом";
		
		БанковскийСчетКасса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяКасса");
		
		Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
			ВалютаДокумента=БанковскийСчетКасса.ВалютаДенежныхСредств;
		Иначе
			ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента           = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.БюджетнаяОперация") Тогда
		
		ВидОперации=Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		Контрагент = Основание.Контрагент;
		ВалютаДокумента=Основание.ВалютаДокумента;
		
		УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(ЭтотОбъект, глТекущийПользователь, мВалютаРегламентированногоУчета,РасшифровкаПлатежа);
		СтрокаПлатеж=РасшифровкаПлатежа[0];
		
		Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов=ВалютаДокумента;
		Иначе
			ВалютаВзаиморасчетов=СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли;
		
		// Получаем курсы валют
		СтруктураГруппаВалют = Новый Структура;
		СтруктураГруппаВалют.Вставить("ВалютаВзаиморасчетов",ВалютаВзаиморасчетов.Код);
		СтруктураГруппаВалют.Вставить("ВалютаДокумента",ВалютаДокумента.Код);
		СтруктураГруппаВалют.Вставить("ВалютаОперации",Основание.ВалютаДокумента.Код);
		
		СтруктураКурсыВалют=УправлениеДенежнымиСредствами.ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,Дата);
		
		КурсДокумента=СтруктураКурсыВалют.ВалютаДокументаКурс;
		КратностьДокумента=СтруктураКурсыВалют.ВалютаДокументаКратность;
		
		СтрокаПлатеж.КурсВзаиморасчетов=СтруктураКурсыВалют.ВалютаВзаиморасчетовКурс;
		СтрокаПлатеж.КратностьВзаиморасчетов=СтруктураКурсыВалют.ВалютаВзаиморасчетовКратность;
		СтрокаПлатеж.Проект=Основание.Проект;
		ЦФО=Основание.ЦФО;
		Номенклатура=Основание.Номенклатура;
		
		КурсОперации=СтруктураКурсыВалют.ВалютаОперацииКурс;
		КратностьОперации=СтруктураКурсыВалют.ВалютаОперацииКратность;
		
		СуммаДокумента=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Основание.Сумма,
		Основание.ВалютаДокумента, 
		ВалютаДокумента,
		КурсОперации, КурсДокумента,
		КратностьОперации, КратностьДокумента);
		
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;
		
		СтрокаПлатеж.СуммаВзаиморасчетов=МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаДокумента,
		ВалютаДокумента, 
		ВалютаВзаиморасчетов,
		КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);

	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		Если Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда

			ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю;
			ФормаОплаты =Перечисления.ВидыДенежныхСредств.Наличные;
			Контрагент	= Основание.Контрагент;
			
			СтрокаПлатеж.ДоговорКонтрагента=Основание.ДоговорКонтрагента;
			
			СпособЗаполнения = "По сумме документа";

			СтрокаПлатеж.Сделка = Основание.Сделка;
			Если СтрокаПлатеж.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
				СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Основание;
			КонецЕсли;
			
			СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов,Дата);
			СтрокаПлатеж.КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
			СтрокаПлатеж.КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;
			
			БанковскийСчетКасса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяКасса");
			
			Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
				ВалютаДокумента=БанковскийСчетКасса.ВалютаДенежныхСредств;
			Иначе
				ВалютаДокумента=мВалютаРегламентированногоУчета;
			КонецЕсли;
			
			СтруктураКурсаДокумента           = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
			КурсДокумента      = СтруктураКурсаДокумента.Курс;
			КратностьДокумента = СтруктураКурсаДокумента.Кратность;
			
		ИначеЕсли Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком Тогда
			
			// Отказ
			// Документ не вводится на основании ПКО с видом операции "Возврат денежных средств от поставщика".
			Возврат;
			
		ИначеЕсли Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником Тогда
			
			// Отказ
			// Документ не вводится на основании ПКО с видом операции "Возврат денежных средств от подотчетника".
			Возврат;
			
		ИначеЕсли Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда
			
			// Отказ
			// Документ не вводится на основании ПКО с видом операции "Прием розничной выручки".
			Возврат;
			
		ИначеЕсли Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее Тогда
			
			// Отказ
			// Документ не вводится на основании ПКО с видом операции "Прочий приход денежных средств".
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ДоговорЗаймаСРаботником") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСРаботниками;
		ФормаОплаты = Перечисления.ВидыДенежныхСредств.Наличные;
		Получатель  = Основание.ФизЛицо;
		РасчетныйДокумент = Основание;
		ВалютаВзаиморасчетовПодотчетника = Основание.ВалютаДокумента;
		
		СтруктураКурсаВзаиморасчетов     = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Дата);
		СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
		СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
		
		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования      = СтруктураКурсаОснования.Курс;
		КратностьОснования = СтруктураКурсаОснования.Кратность;

		БанковскийСчетКасса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяКасса");
		
		Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
			ВалютаДокумента=БанковскийСчетКасса.ВалютаДенежныхСредств;
		Иначе
			ВалютаДокумента=мВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента,Дата);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
		СтрокаПлатеж.СуммаВзаиморасчетов = Основание.СуммаЗайма;

		СуммаДокумента = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, 
		                            ВалютаВзаиморасчетовПодотчетника, ВалютаДокумента,
		                            СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
		                            СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
		
		СтрокаПлатеж.СуммаПлатежа = СуммаДокумента;

	КонецЕсли;

	Если СпособЗаполнения = "По заказу" Тогда

		ЗаполнитьПоЗаказу(Основание,СтрокаПлатеж);

	ИначеЕсли СпособЗаполнения = "По взаиморасчетам" Тогда
		УправлениеДенежнымиСредствами.ЗаполнитьПоВзаиморасчетамУпр(ВалютаДокумента,КурсДокумента,КратностьДокумента,СтрокаПлатеж,-1);
		СуммаДокумента=СтрокаПлатеж.СуммаПлатежа;
	ИначеЕсли СпособЗаполнения = "По взаиморасчетам с подотчетным лицом" Тогда
		ЗаполнитьПоВзаиморасчетамСПодотчетнымЛицом(СтрокаПлатеж);
	ИначеЕсли СпособЗаполнения = "По сумме документа" Тогда
		
		// Если основание - отчет комитенту, то надо вычесть вознаграждение
		ОснованиеСуммаДокумента = Основание.СуммаДокумента;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			ОснованиеСуммаДокумента = Основание.СуммаДокумента - Основание.СуммаВознаграждения;
		КонецЕсли;

		СтруктураКурсаОснования = МодульВалютногоУчета.ПолучитьКурсВалюты(Основание.ВалютаДокумента, Основание.Дата);
		КурсОснования=СтруктураКурсаОснования.Курс;
		КратностьОснования=СтруктураКурсаОснования.Кратность;

		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ОснованиеСуммаДокумента, Основание.ВалютаДокумента, Основание.ДоговорКонтрагента.ВалютаВзаиморасчетов,
		                                 КурсОснования, Основание.КурсВзаиморасчетов, КратностьОснования, Основание.КратностьВзаиморасчетов);
		СуммаДокумента      = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов, СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов, ВалютаДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
		                                 КурсДокумента, СтрокаПлатеж.КратностьВзаиморасчетов, КратностьДокумента);
		
		СтрокаПлатеж.СуммаПлатежа=СуммаДокумента;

	КонецЕсли;

	Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнойОтветственный");
	
	// Заполнить реквизиты значениями по умолчанию.
	УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(ЭтотОбъект, глТекущийПользователь, мВалютаРегламентированногоУчета, РасшифровкаПлатежа);
	УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(СтрокаПлатеж, ВидОперации);
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновноеПодразделение");
	КонецЕсли;
	
	ЗаполнитьПолучателя(глТекущийПользователь);
	
	Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
	 СтрокаОснованияСТР="";
	/////Заполнение основания платежа никитин
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	Для каждого Спрокаоснование Из Основание.товары Цикл
	   СтрокаОснованияСТР=СтрокаОснованияСТР+СокрЛП(Спрокаоснование.номенклатура.Наименование)+" "+СокрЛП(Спрокаоснование.количество)+" "+СокрЛП(Спрокаоснование.ЕдиницаИзмерения.наименование) +";"; 
	КонецЦикла; 	
	Описание= СтрокаОснованияСТР;
	КонецЕсли;
    абс_СверхЛимита = Истина; 
	/////
	
	
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ЕстьРасчетыСКонтрагентами=УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам=УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	
	Если РазмещениеЗаявки.Итог("СуммаПлатежа")>СуммаДокумента Тогда
		Сообщить(Заголовок+" 
		|сумма размещения превышает сумму документа.");
		
		
		
	КонецЕсли;

	СтруктураДанныхШапки=Новый Структура;

	СтруктураДанныхШапки.Вставить("СценарийПериодичность",Сценарий.Периодичность);
	СтруктураДанныхШапки.Вставить("СценарийВалюта",Сценарий.Валюта);

	СтруктураГруппаВалют = Новый Структура;
	СтруктураГруппаВалют.Вставить("ВалютаУпрУчета",мВалютаУправленческогоУчета.Код);
	СтруктураГруппаВалют.Вставить("ВалютаДокумента",ВалютаДокумента.Код);
	
	СтруктураКурсыВалют=УправлениеДенежнымиСредствами.ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,?(ДатаРасхода='00010101',Дата,КонецДня(ДатаРасхода)));

	
		
	
	
	
	
	Если Не Отказ Тогда

		ДвиженияПоРегистрам(СтруктураДанныхШапки, Отказ, Заголовок, СтруктураКурсыВалют);

	КонецЕсли;

	Если   абс_СверхЛимита = Ложь тогда
	//// никитин проверка на Лимит
	Движения.Записать();	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Лео_Расшифровка
		|ПОМЕСТИТЬ СоставЗаявки
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа
		|ГДЕ
		|	ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Лео_Расшифровка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лео_ОборотыБюджетовОбороты.Расшифровка,
		|	СУММА(Лео_ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Приход,
		|	0 КАК Расход
		|ПОМЕСТИТЬ РезультатПроведения
		|ИЗ
		|	РегистрНакопления.Лео_ОборотыБюджетов.Обороты(
		|			&дата,
		|			&дата,
		|			Регистратор,
		|			Расшифровка В
		|				(ВЫБРАТЬ
		|					СоставЗаявки.Лео_Расшифровка
		|				ИЗ
		|					СоставЗаявки КАК СоставЗаявки)) КАК Лео_ОборотыБюджетовОбороты
		|ГДЕ
		|	Лео_ОборотыБюджетовОбороты.Сценарий В(&Сценарий)
		|
		|СГРУППИРОВАТЬ ПО
		|	Лео_ОборотыБюджетовОбороты.Расшифровка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатПроведения.Расшифровка как Расшифровка,
		|	РезультатПроведения.Приход      как приход
		|ИЗ
		|	РезультатПроведения КАК РезультатПроведения
		|ГДЕ
		|	РезультатПроведения.Приход < 0";

		
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	списокБюджетов = Новый СписокЗначений;
	списокБюджетов.Добавить(Справочники.СценарииПланирования.План);
	списокБюджетов.Добавить(Справочники.СценарииПланирования.БухгалтерскийФакт);
	Запрос.УстановитьПараметр("Сценарий",списокБюджетов);
    Запрос.УстановитьПараметр("дата",НачалоМесяца(?(Ссылка.ДатаРасхода='00010101',Ссылка.Дата,Ссылка.ДатаРасхода)));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Превышен лимит бюджета по статье " + ВыборкаДетальныеЗаписи.расшифровка+ " не хватает " + ВыборкаДетальныеЗаписи.Приход*(-1)+ " руб.";
	Сообщение.Сообщить(); 	
	
	Отказ = Истина;	
	КонецЦикла;
    //ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено превышение  бюджета по статьям!!!");
   // ОбщегоНазначения.СообщитьОбОшибке("Не удалось провести документ: "+"Обнаружено превышение  бюджета по статьям!!!");
	//Предупреждение("Обнаружено превышение  бюджета по статьям!!!");
    	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	КонецЕсли; 

	//Проверка на номер заявки
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Если  (Ссылка.НомерСчета <>"") и (Ссылка.НомерСчета <>"б/н")  и  (Ссылка.НомерСчета <>"сз") тогда
		
	 	
		
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеСредств.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
		|ГДЕ
		|	ЗаявкаНаРасходованиеСредств.Проведен = &Проведен
		|	И ЗаявкаНаРасходованиеСредств.Контрагент = &Контрагент
		|	И ЗаявкаНаРасходованиеСредств.НомерСчета = &НомерСчета
		|	И ЗаявкаНаРасходованиеСредств.Ссылка <> &Ссылка
		|	И ЗаявкаНаРасходованиеСредств.Дата > &Дата";

	Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
	Запрос.УстановитьПараметр("НомерСчета", Ссылка.НомерСчета);
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("Дата", НачалоГода(Ссылка.Дата));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Заявка с таким НОМЕРОМ СЧЕТА уже существует  "  +ВыборкаДетальныеЗаписи.Ссылка);
		Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Заявка с таким номерос счета уже существует  "  +ВыборкаДетальныеЗаписи.Ссылка;
	Сообщение.Сообщить(); 	
	
	Отказ = Истина;	

		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
     конецесли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	/// никитин
	 //СуммаНДС = РасшифровкаПлатежа.итог("СуммаНДС");
	 //СтавкаНДС= РасшифровкаПлатежа.получить(0).СтавкаНДС;
	 
	 ////

	//Степан Если проведена тогда сообщить по электронной почте
	ОповеститьПоМаршруту();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Удаление движений по регистру СостоянияСогласованияЗаявок, если заявка была подготовлена
	//+Лео Сафонов ЕА
	//НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаявок.СоздатьНаборЗаписей();
	//НаборЗаписейСостояниеСогласования.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	//-Лео Сафонов ЕА
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если НаборЗаписейСостояниеСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	//+Лео Сафонов ЕА
	//Если УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(Организация, Дата) Тогда
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,Дата) Тогда
	//-Лео Сафонов ЕА
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования, не следует ничего менять
			Возврат;
		КонецЕсли;
		//Если в наборе записей только одна запись - значит заявка только подготовлена.
		//Очистим набор записей
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Ссылка.Состояние = Перечисления.СостоянияОбъектов.Утвержден И НЕ СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование)="Леонтьева Ольга Владимировна" 
		И НЕ СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование)="Шикова Ольга Николаевна" И НЕ СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование)="Зароднюк Владимир Васильевич" Тогда
		//Если ЭтотОбъект.Модифицированность() Тогда
		Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//По запросу Леонтьевой
	Если НЕ РольДоступна("ПолныеПрава") И ЭтоНовый() Тогда
		Дата	=	ТекущаяДата();
	ИначеЕсли НЕ РольДоступна("ПолныеПрава") И НЕ ЭтоНовый() Тогда
		Если Дата< Ссылка.Дата Тогда
			Дата=Ссылка.Дата;
		КонецЕсли;
	КонецЕсли;
	
	Если ДатаРасхода<НачалоДня(Дата) Тогда
		сообщить("Дата расхода не может быть меньше даты документа");
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если НЕ УправлениеДенежнымиСредствами.РазрешеноИзменениеЗаявки(Ссылка, ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ,,, Ссылка);
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	 /// никитин
	 #Если Клиент Тогда

	Для каждого  СтрокаПлатеж Из РасшифровкаПлатежа Цикл
		Если СтрокаПлатеж.СуммаПлатежа>СтрокаПлатеж.лео_ОстатокМесяц Тогда 
			Если НЕ РольДоступна("ПолныеПрава") Тогда				 
				  
	 			Предупреждение("ПРЕДУПРЕЖДЕНИЕ! В документе  имеется превышение бюджета");			  	
				  
			   _спр = Справочники.Лео_Настройки.НайтиПоНаименованию("ФинКонтоль_"+ЦФО.Наименование);
			   Если _спр <> неопределено тогда
				   Если  _спр.ДопРеквизит_1 = истина  тогда
				     Отказ = Истина;
				   КонецЕсли;
			   КонецЕсли;
	 		КонецЕсли; 
	 	КонецЕсли; 
	 КонеЦЦикла;
	 #КонецЕсли

	
	
	
	
	
	
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

		
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;

	// Заполнить реквизиты значениями по умолчанию.
	УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРасчетногоДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, РасшифровкаПлатежа,, ОбъектКопирования);
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
		УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(СтрокаПлатеж, ВидОперации);
	КонецЕсли;
	 БанковскийСчетКасса=ОбъектКопирования.БанковскийСчетКасса;
	Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЕстьРасчетыСКонтрагентами = УправлениеДенежнымиСредствами.ЕстьРасчетыСКонтрагентами(ВидОперации);
	ЕстьРасчетыПоКредитам     = УправлениеДенежнымиСредствами.ЕстьРасчетыПоКредитам(ВидОперации);
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		ПроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.ДоговорКонтрагента");
		ПроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику Тогда
		
		ПроверяемыеРеквизиты.Добавить("Получатель");
		ПроверяемыеРеквизиты.Добавить("ВалютаВзаиморасчетовПодотчетника");
		ПроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
				
	Иначе
		
		ПроверяемыеРеквизиты.Добавить("ВалютаДокумента");
		
	КонецЕсли;
	
	Если ВключатьВПлатежныйКалендарь Тогда
		
		ПроверяемыеРеквизиты.Добавить("ФормаОплаты");
		ПроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СуммаПлатежа");
		
		Если ПроверяемыеРеквизиты.Найти("ВалютаДокумента") = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ВалютаДокумента");			
		КонецЕсли; 
	КонецЕсли;
	
	ПроверитьЗаполнениеТЧ(Отказ);
	
КонецПроцедуры

//Степан Отправка сообщений по электропочте
//////////////////////////////////////////////////////////////////////////
Функция ЭлектронныйАдресПользователя(Пользователь)
	
	ЭлектронныйАдрес = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Пользователь
	|	И КонтактнаяИнформация.Тип  = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) 
    |"; 
	Запрос.УстановитьПараметр("Пользователь",Пользователь); 
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда 
		ЭлектронныйАдрес = Рез[0].Представление;	
	КонецЕсли;
	Возврат ЭлектронныйАдрес;
	
КонецФункции

Процедура ОповеститьПоМаршруту() 
	
	Если НЕ СтрокаСоединенияИнформационнойБазы() = "Srvr=""192.168.100.106"";Ref=""upp83"";"  Тогда
		Возврат;
	КонецЕсли;  
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда				 
		Если НЕ РольДоступна("ПравоИспользованияЭлектроннойПочты") Тогда				 
			Возврат;
	 	КонецЕсли; 
 	КонецЕсли; 
	
	//Если СтрокаСоединенияИнформационнойБазы() = "Srvr=""192.168.100.106"";Ref=""test_SD1"";"  Тогда
	//	сообщить("Это отправка из копии базы -> "+СтрокаСоединенияИнформационнойБазы());                 
	//КонецЕсли;

	МассивАдресов = Новый Массив;
	//СписокРассылки = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние,
	|	абс_СостоянияСогласованияДокументовСрезПоследних.Этап
	|ИЗ
	|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	
	ТЗСостоянияСогласования = Запрос.Выполнить().Выгрузить();  
	
	Если ТЗСостоянияСогласования.Количество() > 0 Тогда 
		Если НЕ ТЗСостоянияСогласования[0].Состояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
			Для каждого Сотр из ТЗСостоянияСогласования[0].Этап.СогласующиеЛица Цикл
				Если Сотр.ДатаДействия = Дата(1, 1, 1) ИЛИ Сотр.ДатаДействия > ЭтотОбъект.Дата Тогда 
					Если НЕ Сотр.Пользователь = глЗначениеПеременной("глТекущийПользователь") Тогда 
						ЭлектронныйАдрес = ЭлектронныйАдресПользователя(Сотр.Пользователь); 
						Если EmailValid(ЭлектронныйАдрес) И ИспользоватьНапоминания(Сотр.Пользователь) Тогда
							МассивАдресов.Добавить(ЭлектронныйАдрес);
						Иначе
							//сообщить("у пользователя " + Сотр.Пользователь + " нет электронного адреса!");                 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			//МассивАдресов.Добавить("ikatanovich@leovit.ru");
			//МассивАдресов.Добавить("sdekin@leovit.ru");
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если МассивАдресов.Количество() = 0 Тогда 
		Возврат; 
	КонецЕсли;
	
	ТемаПисьма = "ЗРС "+Номер;
	Если УжеОтправленоСегодня(ТемаПисьма) Тогда  
		Возврат; 
	КонецЕсли;
		
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "ЗРС "+Номер);
	
	ТекстПисьма = "";
	//ТекстПисьма = "Здравствуйте, коллеги! <BR> <BR>";
    ТекстПисьма = ТекстПисьма +  "Поступила заявка:" + Номер + " от " + Формат(Дата,"ДФ=dd.MM.yyyy") + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Инициатор:       " + Ответственный + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Контрагент:      " + Контрагент + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Сумма:           " + СуммаДокумента + " " + ВалютаДокумента.Наименование + "<BR>"; 
	//Если абс_СверхЛимита Тогда  
	//    ТекстПисьма = ТекстПисьма +  "Сверх лимита <BR>";
	//КонецЕсли;
    ТекстПисьма = ТекстПисьма +  "Описание:        " + Описание + "<BR>";
    ТекстПисьма = ТекстПисьма +  "из документа" + "<BR>";

	//Для каждого Адр Из СписокРассылки Цикл
	//    ТекстПисьма = ТекстПисьма + Адр + "<BR>";
	//КонецЦикла;
	
    СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	//	Если МассивФайлов.Количество()>0 Тогда
	//	
	//	СписокФайловВложений = Новый СписокЗначений;
	//	
	//	Для каждого Файл из МассивФайлов Цикл
	//		ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(Файл);
	//		
	//		ФайлВложения = СписокФайловВложений.Добавить();
	//		
	//		СтруктураВложения  = Новый Структура();
	//		
	//		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл);
	//		СтруктураВложения.Вставить("Хранилище", ДвоичныеДанныеФайла);
	//		
	//		СтруктураВложения.Вставить("ИмяФайла", ИмяФайла);
	//		
	//		ФайлВложения.Значение = СтруктураВложения;
	//	КонецЦикла;
	//	
	//	СтруктураПараметров.Вставить("СписокФайловВложений", СписокФайловВложений);
	//КонецЕсли;
	
	Попытка
		УстановитьПривилегированныйРежим(Истина); 
		
		СтруктураПисьма = НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
		ЭлектронныеПисьма = Новый Соответствие;
		
		ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		
		ИзмененныйСоставПисем = Новый Соответствие;	
		ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
		Для каждого Письмо Из ЭлектронныеПисьма Цикл
			Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
				ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
				
				ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
					
					ОбъектПисьмо.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			
				Попытка
					ОбъектПисьмо.Записать();
				Исключение
					Продолжить;;
				КонецПопытки;
			Иначе
				Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
					Письмо.Значение.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			КонецЕсли; 
		    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
		КонецЦикла;       
		
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;	
		
	ТекстОшибок = "";	
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисемБезЛогирования(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ,,
		ИзмененныйСоставПисем, Истина , , Ложь,ТекстОшибок );
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
	КонецПопытки;	

КонецПроцедуры

Функция EmailValid(Адрес)
	
    //Адрес = "test@me@gmail.narod.am";

    ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";

    Цифры = "0123456789";

    //ищем крайний справа символ @ для правильного выделения локальной и доменной части

    ИндексСобаки = Найти(Адрес,"@");

    //1. строка адреса вообще не содержит разделителя

    Если ИндексСобаки = 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    УрезаемаяСтрока = Сред(Адрес, ИндексСобаки+1);

    Пока Найти(УрезаемаяСтрока,"@") > 0 Цикл

        ИндексСобаки = ИндексСобаки + Найти(УрезаемаяСтрока,"@");

        УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);

    КонецЦикла;

    ДоменнаяЧасть = Сред(Адрес, ИндексСобаки+1);

    ЛокальнаяЧасть = Лев(Адрес, ИндексСобаки-1);

    //2. Проверяем длину локальной части

    Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //3. Проверяем длину доменной части

    Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //4. Проверяем что локальная части не начинается и не заканчивается на "."

    Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //5. Локальная части не содержит 2 или более "." подряд

    Если Найти(ЛокальнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //Проверка доменной части

    //6. Доменная часть не начинается с точки

    Если Лев(ДоменнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //7. Доменная часть не содержит 2 или более "." подряд

    Если Найти(ДоменнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //8. Проверка частей доменной части

    //каждая часть начинается с буквы и заканчивается буквой или цифрой

    //каждая часть длиной не более 63 символов

    ИдентификаторыДоменнойЧасти = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДоменнаяЧасть, ".");

    Для Каждого ИдентификаторДомена ИЗ ИдентификаторыДоменнойЧасти Цикл

        Если СтрДлина(ИдентификаторДомена) > 63 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0

            //для доменов, нарушающих RFC 1035 п.2.3.1, например @1c.ru :)

            И Найти(Цифры, Лев(ИдентификаторДомена,1)) = 0

            Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

    КонецЦикла;

    Возврат ИСТИНА;

КонецФункции

Функция ИспользоватьНапоминания(Пользователь)
	
	ИспользоватьНапомининия = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	       Наименование,
		|	       ЗначениеНастроек.Значение
		|	   ИЗ
		|	       ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
		|	   ЛЕВОЕ СОЕДИНЕНИЕ
		|	       РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
		|	   ПО
		|	       ЗначениеНастроек.Настройка=Настройки.Ссылка
		|	       И  ЗначениеНастроек.Пользователь=&Пользователь
		|	   ГДЕ
		|	       НЕ ПометкаУдаления
		|	       И Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьНапоминания)
		|";
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		ИспользоватьНапомининия = ТЗ[0].Значение;
	КонецЕсли;
	Возврат ИспользоватьНапомининия;
	
КонецФункции

Функция УжеОтправленоСегодня(Тема)
	
	УжеОтправлено = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмо.ДатаОтправления,
	               |	ЭлектронноеПисьмо.СтатусПисьма,
	               |	ЭлектронноеПисьмо.Тема
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	               |ГДЕ
	               |	ЭлектронноеПисьмо.Тема = &Тема
	               |	И ЭлектронноеПисьмо.ДатаОтправления МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |	И ЭлектронноеПисьмо.СтатусПисьма = &СтатусПисьма";
	Запрос.УстановитьПараметр("Тема",Тема);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусПисьма",Перечисления.СтатусыПисем.Отправленное);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		УжеОтправлено = Истина;
	КонецЕсли;
	Возврат УжеОтправлено;
	
КонецФункции

// Функция обрабатывает пользовательское событие - создание нового электронного письма.
// 
// Параметры:
//  ТекущийПользователь          - СправочникСсылка.Пользователи, текущий пользователь
//  СтруктураНовогоПисьма        - Структура с данными нового письма
//    Ключи структуры:
//     Тело                 - строка, текст письма (прочтой текст, или текст в формате ХТМЛ)
//     Тема                 - Строка
//     ВидТекста            - ПеречислениеСсылка.ВидыТекстовЭлектронныхПисем, вид текста нового письма
//     СписокФайловВложений - СписокЗначений, где значения - структура параметров и знаяений для создания
//                            нового элемента справочника ВложенияЭлектронныхПисем, ключи структуры
//                            соответствуют именам реквизитов справочника ВложенияЭлектронныхПисем
//     УчетнаяЗапись        - СправочникСсылка.УчетнаяЗапись, учетная запись нового письма
//     Кому                 - Список значений, значение - адрес эл.почты, представление - представление получателя
//     Копии                - Список значений, значение - адрес эл.почты, представление - представление получателя
//     СкрытыеКопии         - Список значений, значение - адрес эл.почты, представление - представление получателя
//     Основание            - ДокументСсылка.ЭлектронноеПисьмо, ДокументСсылка.Событие
//     ГруппаУчетнойЗаписи  - элемент справочника ГруппыПисемЭлектроннойПочты, группа писем для нового письма
//     Ответственный        - элемент справочника Пользователи, ответственный для запоолнения в письме
//     КодировкаПисьма      - строка, задает кодировку письма, кроме ответов, переадресаций и скопированных писем,
//                            т.е. писем с определенным объектом-основанием
//
//  ПеренестиВложенияИзОснования - Булево, переносить ли аттачи письма из основания (действует для копирования и пересылки)
//  Копирование                  - булево, признак копирования электронного письма
//  ТекущийЭлементХТМЛ           - Булево, устанавливать в качестве активного элемента в открытой форме письма поле ХТМЛ(Текстового) документа
//  Дополнительно                - Строка, "Ответ", "Переадресация", вид действия при создании нового письма
//  ФормаВладелец                - Форма, владелец для открываемой формы нового письма
//  ПодписьПодТекстом            - Булево, устанавливать подпись в письме "после" или "перед" текстом.
//  ОткрыватьПисьмо              - Булево, открывать форму письма или записывать письмо и не открывать форму
//
//  ВозвращаемреЗначение
//   СтруктураПараметров - Структура
//     Ключи структуры:
//     Письмо       - ДокументОбъект.ЭлектронноеПисьмо, новое электронное письмо
//     Форма        - Форма, форма нового электронного письма
//     ПисьмоСсылка - ДокументСсылка.ЭлектронноеПисьмо, новое электронное письмо
//
Функция НаписатьПисьмо(ТекущийПользователь, СтруктураНовогоПисьма = Неопределено, ПеренестиВложенияИзОснования = Ложь, Копирование = Ложь,
					   ТекущийЭлементХТМЛ = Ложь, Дополнительно = Неопределено, ФормаВладелец = Неопределено, ПодписьПодТекстом = Ложь,
					   ОткрыватьПисьмо = Истина)

	Перем УчетнаяЗапись;
	Перем Тема;
	Перем Тело;
	Перем ВидТекста;
	Перем СписокФайловВложений;
	Перем ГруппаУчетнойЗаписи;
	Перем Кому;
	Перем Копии;
	Перем СкрытыеКопии;
	Перем Основание;
	Перем Ответственный;
	Перем ПредметКонтакта;
	Перем КодировкаПисьма;
	Перем ЗаявкаКандидата;
	
	Если СтруктураНовогоПисьма = Неопределено Тогда
		СтруктураНовогоПисьма = Новый Структура;
	КонецЕсли; 
	
	// Определим учетную запись для создания письма
	
	СписокДоступныхЗаписей = Новый СписокЗначений;
	СписокДоступныхЗаписей.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	//СписокДоступныхЗаписей = ПроверитьУчетныеЗаписиДляОтправкиПисем(ТекущийПользователь);
	Если СписокДоступныхЗаписей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("УчетнаяЗапись", УчетнаяЗапись);
	Если ЗначениеЗаполнено(УчетнаяЗапись) И СписокДоступныхЗаписей.НайтиПоЗначению(УчетнаяЗапись) = Неопределено Тогда
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяУчетнаяЗапись");
		Если СписокДоступныхЗаписей.НайтиПоЗначению(УчетнаяЗапись) = Неопределено Тогда
			УчетнаяЗапись = Неопределено;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = СписокДоступныхЗаписей[0].Значение;
	КонецЕсли;
	
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.Дата                             = ТекущаяДата();
	Письмо.УчетнаяЗапись                    = УчетнаяЗапись;
	Письмо.ОтправительИмя                   = УчетнаяЗапись.Наименование;
	Письмо.ОтправительАдресЭлектроннойПочты = УчетнаяЗапись.АдресЭлектроннойПочты;
	Письмо.ОтправительПредставление         = УчетнаяЗапись.Наименование + " <" + УчетнаяЗапись.АдресЭлектроннойПочты + ">";
	
	СтруктураНовогоПисьма.Свойство("СписокФайловВложений", СписокФайловВложений);
	
	ОписаниеТиповПредмета = Новый ОписаниеТипов("Строка");
	СтруктураНовогоПисьма.Свойство("Основание", Основание);
	ЕстьДокументОснование = Ложь;
	Если Основание <> Неопределено Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) Тогда
			ЕстьДокументОснование = Не Основание.Пустая();
		Иначе
			ЕстьДокументОснование = Не Основание.Ссылка.Пустая();
		КонецЕсли;
	КонецЕсли;
	Если ЕстьДокументОснование Тогда
		Письмо.ОснованиеПисьма = ?(Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)), Основание, Основание.Ссылка);
		Если ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			Письмо.мОбъектОснование = Основание;
		КонецЕсли; 
		Если Письмо.УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам Тогда
			СтруктураНовогоПисьма.Свойство("ПредметКонтакта", ПредметКонтакта);
			Если ЗначениеЗаполнено(ПредметКонтакта) И ОписаниеТиповПредмета.СодержитТип(ТипЗнч(ПредметКонтакта)) Тогда
				Письмо.ПредметКонтакта = ПредметКонтакта;
			Иначе
				Если Письмо.УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
					Письмо.ПредметКонтакта = Основание.ПредметКонтакта;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЕстьДокументОснование
	   И УчетнаяЗапись.ФорматПисьмаДляОтветовИПереадресацийБратьИзИсходного
	   И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
		ВидТекста = Основание.ВидТекстаПисьма;
	Иначе
		СтруктураНовогоПисьма.Свойство("ВидТекста", ВидТекста);
	КонецЕсли;
	
	Если ЕстьДокументОснование
	   И УчетнаяЗапись.КодировкуПисьмаДляОтветовБратьИзИсходного
	   И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
		КодировкаПисьма = Основание.КодировкаПисьма;
	Иначе
		СтруктураНовогоПисьма.Свойство("КодировкаПисьма", КодировкаПисьма);
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("ЗаявкаКандидата", ЗаявкаКандидата);
	Если ЗначениеЗаполнено(ЗаявкаКандидата) Тогда
		Письмо.ЗаявкаКандидата = ЗаявкаКандидата;
	ИначеЕсли ЕстьДокументОснование Тогда
		Письмо.ЗаявкаКандидата = Основание.ЗаявкаКандидата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидТекста) Тогда
		Письмо.ВидТекстаПисьма = УчетнаяЗапись.ФорматТекстаПисьмаПоУмолчанию;
		Если НЕ ЗначениеЗаполнено(Письмо.ВидТекстаПисьма) Тогда
			Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
		КонецЕсли;
	Иначе
		Письмо.ВидТекстаПисьма = ВидТекста;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодировкаПисьма) Тогда
		Письмо.КодировкаПисьма = КодировкаПисьма;
	Иначе
		Письмо.КодировкаПисьма = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "КодировкаПисьмаЭлектроннойПочтыПоУмолчанию");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Письмо.КодировкаПисьма) Тогда
		Письмо.КодировкаПисьма = "utf-8";
	КонецЕсли;
	
	Если Дополнительно = "Ответ" Тогда
		Письмо.Ответ         = Истина;
	ИначеЕсли Дополнительно = "Переадресация" Тогда
		Письмо.Переадресация = Истина;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Тело", Тело);
	Если ЗначениеЗаполнено(Тело) Тогда
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			Письмо.ТекстПисьма = "<HTML><HEAD>
								 |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + ?(ЗначениеЗаполнено(Письмо.КодировкаПисьма), Письмо.КодировкаПисьма, "utf-8") + """" + ">
								 |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
								 |<BODY><DIV>" + Тело + "</DIV></BODY></HTML>";
			
		Иначе
			Письмо.ТекстПисьма = Тело;
			
		КонецЕсли;
	Иначе
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			Письмо.ТекстПисьма = "<HTML><HEAD>
								 |<META http-equiv=Content-Type content=""text/html; charset=" + ?(ЗначениеЗаполнено(Письмо.КодировкаПисьма), Письмо.КодировкаПисьма, "utf-8") + """" + ">
								 |<META content=""MSHTML 6.00.2900.2912"" name=GENERATOR></HEAD>
								 |<BODY><DIV></DIV></BODY></HTML>";
			
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("Тема", Тема);
	Если ЗначениеЗаполнено(Тема) Тогда
		Письмо.Тема = Тема;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
			
			Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				Тело = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY>" + Основание.СодержаниеСобытия + "</BODY></HTML>";
			Иначе
				Тело = Основание.СодержаниеСобытия;
			КонецЕсли
			
		Иначе
			
			Тело = Основание.ТекстПисьма;
			
			Если ((Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками)
			   И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.HTML И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками)
			   ИЛИ ((Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Прочее)
			   И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.Текст И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.Прочее) Тогда

				Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
					
					Тело = "<HTML><HEAD>
								  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
								  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
								  |<BODY>" + Тело + "</BODY></HTML>";
					
				Иначе
					
					//Тело = ПреобразоватьТекстИзХТМЛФорматаВПростой(Тело);
					
				КонецЕсли; 
			
			КонецЕсли; 
			
		КонецЕсли; 
		
		Письмо.ТекстПисьма = Тело;
		
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("ГруппаУчетнойЗаписи", ГруппаУчетнойЗаписи);
	Если ЗначениеЗаполнено(ГруппаУчетнойЗаписи) И ГруппаУчетнойЗаписи.Владелец = УчетнаяЗапись Тогда
		Письмо.ГруппаУчетнойЗаписи = ГруппаУчетнойЗаписи;
	Иначе
		Письмо.УказатьГруппуПоУмолчанию();
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Ответственный", Ответственный);
	Если ЗначениеЗаполнено(Ответственный) Тогда
		Письмо.Ответственный = Ответственный;
	Иначе
		Письмо.Ответственный = ТекущийПользователь;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Кому", Кому);
	Если ТипЗнч(Кому) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из Кому Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.КомуТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.Кому) Тогда
				Письмо.Кому = Письмо.Кому + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.Кому = Письмо.Кому + ЭлементСписка.Значение;
			Иначе
				Письмо.Кому = Письмо.Кому + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	Письмо.КомуПредставление = ПолучитьПредставлениеПолучателей(Письмо.КомуТЧ);

	СтруктураНовогоПисьма.Свойство("Копии", Копии);
	Если ТипЗнч(Копии) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из Копии Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.КопииТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.Копии) Тогда
				Письмо.Копии = Письмо.Копии + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.Копии = Письмо.Копии + ЭлементСписка.Значение;
			Иначе
				Письмо.Копии = Письмо.Копии + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	Письмо.КопииПредставление = ПолучитьПредставлениеПолучателей(Письмо.КопииТЧ);

	СтруктураНовогоПисьма.Свойство("СкрытыеКопии", СкрытыеКопии);
	Если ТипЗнч(СкрытыеКопии) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из СкрытыеКопии Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.СкрытыеКопииТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.СкрытыеКопии) Тогда
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ЭлементСписка.Значение;
			Иначе
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ФормаВладелец <> Неопределено Тогда
		ФормаПисьма = Письмо.ПолучитьФорму(, ФормаВладелец);
	Иначе
		ФормаПисьма = Письмо.ПолучитьФорму();
	КонецЕсли; 
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТекСсылка"   , ?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо"), Основание, Основание.Ссылка));
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенияЭлектронныхПисем.ИмяФайла КАК ИмяФайла,
		|	ВложенияЭлектронныхПисем.Хранилище КАК Хранилище,
		|	ВложенияЭлектронныхПисем.Наименование КАК Наименование,
		|	ВложенияЭлектронныхПисем.ИДФайлаПочтовогоПисьма КАК ИДФайлаПочтовогоПисьма
		|ИЗ
		|	Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
		|ГДЕ
		|	ВложенияЭлектронныхПисем.Объект = &ТекСсылка
		|	И (НЕ ВложенияЭлектронныхПисем.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ПустаяСтрока(Выборка.ИДФайлаПочтовогоПисьма) Тогда
					Если ПеренестиВложенияИзОснования Тогда
						СтрокаТЗ = ФормаПисьма.ВложенияПисьмаТЗ.Добавить();
						СтрокаТЗ.ИмяФайла     = Выборка.ИмяФайла;
						СтрокаТЗ.Наименование = Выборка.Наименование;
						СтрокаТЗ.Данные       = Выборка.Хранилище;
					КонецЕсли; 
				Иначе
					СтрокаТЗ = ФормаПисьма.ВложенияПисьмаТЗСкрытые.Добавить();
					СтрокаТЗ.ИмяФайла               = Выборка.ИмяФайла;
					СтрокаТЗ.Наименование           = Выборка.Наименование;
					СтрокаТЗ.Данные                 = Выборка.Хранилище;
					СтрокаТЗ.ИДФайлаПочтовогоПисьма = Выборка.ИДФайлаПочтовогоПисьма;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли;
	#КонецЕсли
	
	// Сформируем текст письма для ответа или переадресации
	Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо"))
	   И НЕ Копирование Тогда
		
		ТекстПисьма = Письмо.ТекстПисьма;
		
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			НачалоТела = Найти(ТекстПисьма, "<BODY");
			
			ДатаИсходногоПисьма = Основание.Дата;
			Если (Основание.СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ Основание.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное) И ЗначениеЗаполнено(Основание.Дата) Тогда
				ДатаИсходногоПисьма = Основание.Дата;
			КонецЕсли;
			
			СтрокаОтправителя = "Отправитель: ";
			Если НЕ ПустаяСтрока(Основание.ОтправительИмя) Тогда
				СтрокаОтправителя = СтрокаОтправителя + СокрЛП(Основание.ОтправительИмя) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(Основание.ОтправительИмя, """", "")) + "<" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + "</A>&gt";
			Иначе
				СтрокаОтправителя = СтрокаОтправителя + "&lt<A href=" + """" + "mailto:" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + """" + ">" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + "</A>&gt";
			КонецЕсли;
			
			СтрокаКому = "";
			Для каждого СтрокаТЧ Из Основание.КомуТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					СтрокаКому = СтрокаКому + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКому = СтрокаКому + СокрЛП(СтрокаТЧ.Представление) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(СтрокаТЧ.Представление, """", "")) + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				Иначе
					СтрокаКому = СтрокаКому + "&lt<A href=" + """" + "mailto:" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКому) Тогда
				СтрокаКому = "Получатели: " + СтрокаКому;
			КонецЕсли; 
			
			СтрокаКопии = "";
			Для каждого СтрокаТЧ Из Основание.КопииТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					СтрокаКопии = СтрокаКопии + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКопии = СтрокаКопии + СокрЛП(СтрокаТЧ.Представление) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(СтрокаТЧ.Представление, """", "")) + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				Иначе
					СтрокаКопии = СтрокаКопии + "&lt<A href=" + """" + "mailto:" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
				СтрокаКопии = "Копии: " + СтрокаКопии;
			КонецЕсли; 
			
			Если НачалоТела > 0 Тогда
				
				// Ищем конец начала тела
				а = НачалоТела;
				КонецНачалаТела = 0;
				Пока Истина Цикл
					Если Сред(ТекстПисьма, а, 1) = ">" Тогда
						КонецНачалаТела = а;
						Прервать;
					Иначе
						а = а + 1;
						Продолжить;
					КонецЕсли; 
				КонецЦикла; 
				
				НовыйТекстПисьма = Лев(ТекстПисьма, КонецНачалаТела) + "<DIV><BR></DIV>" + 
								  "<BLOCKQUOTE dir=ltr style=" + """" + "PADDING-LEFT: 15px; MARGIN-LEFT: 5px; BORDER-LEFT: #000000 2px solid; MARGIN-RIGHT: 0px" + """" + ">" + 
								  "<P><A href="+ """" + Строка(?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо"), Основание.УникальныйИдентификатор(), Основание.Ссылка.УникальныйИдентификатор())) + """" + ">--- Исходное сообщение --- </A>" + 
								  "<BR>Дата: " + Формат(ДатаИсходногоПисьма, "ДЛФ=DT") +
								  "<BR>" + СтрокаОтправителя;
								  
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + СтрокаКому;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + СтрокаКопии;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Основание.Тема) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + "Тема: " + Основание.Тема;
				КонецЕсли;
				
				НовыйТекстПисьма = НовыйТекстПисьма + "</P><P><BR></P>";
				
				КонецТела = Найти(ТекстПисьма, "</BODY");
				Если КонецТела > 0 Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + Сред(ТекстПисьма, (КонецНачалаТела + 1), (КонецТела - КонецНачалаТела - 1)) + "</BLOCKQUOTE>" + Сред(ТекстПисьма, КонецТела);
					Письмо.ТекстПисьма = НовыйТекстПисьма;
				КонецЕсли;
			КонецЕсли; 
			
		Иначе
			
			НовыйТекстПисьма = Новый ТекстовыйДокумент;
			
			НовыйТекстПисьма.УстановитьТекст(ТекстПисьма);
			
			НовыйТекстПисьма.ВставитьСтроку(1, "--- Исходное сообщение ---");
			ПоследняяСтрока = 1;
			
			ДатаИсходногоПисьма = Основание.Дата;
			Если (Основание.СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ Основание.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное) И ЗначениеЗаполнено(Основание.Дата) Тогда
				ДатаИсходногоПисьма = Основание.Дата;
			КонецЕсли;
			НовыйТекстПисьма.ВставитьСтроку(2, "Дата: " + Формат(ДатаИсходногоПисьма, "ДЛФ=DT"));
			ПоследняяСтрока = 2;
			
			СтрокаОтправителя = "Отправитель: ";
			Если НЕ ПустаяСтрока(Основание.ОтправительИмя) Тогда
				СтрокаОтправителя = СтрокаОтправителя + СокрЛП(Основание.ОтправительИмя) + " <" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">";
			Иначе
				СтрокаОтправителя = СтрокаОтправителя + "<" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">";
			КонецЕсли;
			НовыйТекстПисьма.ВставитьСтроку(3, СтрокаОтправителя);
			ПоследняяСтрока = 3;
			
			СтрокаКому = "";
			Для каждого СтрокаТЧ Из Основание.КомуТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					СтрокаКому = СтрокаКому + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКому = СтрокаКому + СокрЛП(СтрокаТЧ.Представление) + " <" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				Иначе
					СтрокаКому = СтрокаКому + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКому) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Получатели: " + СтрокаКому);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли; 
			
			СтрокаКопии = "";
			Для каждого СтрокаТЧ Из Основание.КопииТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					СтрокаКопии = СтрокаКопии + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКопии = СтрокаКопии + СокрЛП(СтрокаТЧ.Представление) + " <" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				Иначе
					СтрокаКопии = СтрокаКопии + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Копии: " + СтрокаКопии);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли; 
			
			Если НЕ ПустаяСтрока(Основание.Тема) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Тема: " + Основание.Тема);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли;
				
			НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "");
			
			Для а = 1 по НовыйТекстПисьма.КоличествоСтрок() Цикл
				НовыйТекстПисьма.ЗаменитьСтроку(а, ("> " + НовыйТекстПисьма.ПолучитьСтроку(а)));
			КонецЦикла;
			
			НовыйТекстПисьма.ВставитьСтроку(1, "");
			НовыйТекстПисьма.ВставитьСтроку(1, "");
			
			Письмо.ТекстПисьма = НовыйТекстПисьма.ПолучитьТекст();
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// Проставим при необходимости подпись
	Если НЕ Копирование И ((УчетнаяЗапись.ДобавлятьПодписьКИсходящимПисьмам И Дополнительно = Неопределено)
	 ИЛИ ((Дополнительно = "Ответ" ИЛИ Дополнительно = "Переадресация") И УчетнаяЗапись.ДобавлятьПодписьКОтветамИПересылкам = Истина)) Тогда
	 
		Отказ = Ложь;
	
		НовыйКом = Новый COMОбъект("HtmlFile");
		НовыйКом.open("text/html");
		НовыйКом.write(УчетнаяЗапись.ТекстПодписи);
		НовыйКом.close();
		
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			ТекстПисьма = Письмо.ТекстПисьма;
			
			Если ПустаяСтрока(ТекстПисьма) Тогда
				ТекстПисьма = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY><DIV></DIV></BODY></HTML>";
			Иначе
				Если Найти(ТекстПисьма, "<BODY") = 0 тогда
				ТекстПисьма = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY>" + ТекстПисьма + "</BODY></HTML>";
				КонецЕсли; 
			КонецЕсли; 
			
			НачалоТела = Найти(ТекстПисьма, "<BODY");
			КонецНачалаТела = 0;
			а = НачалоТела;
			Пока Истина Цикл
				Если Сред(ТекстПисьма, а, 1) = ">" Тогда
					КонецНачалаТела = а;
					Прервать;
				Иначе
					а = а + 1;
				КонецЕсли; 
			КонецЦикла;
			
			Если НачалоТела = 0 ИЛИ КонецНачалаТела = 0 Тогда
				Отказ = Истина;
			КонецЕсли;
			
			ТегBODY = НовыйКом.all.Tags("BODY");
			Если ТегBODY.length > 0 Тогда
				ХТМЛПодписи = ТегBODY.item(0).innerHTML;
				Если ПустаяСтрока(ХТМЛПодписи) Тогда
					Отказ = Истина;
				Иначе
					ХТМЛПодписи = СтрЗаменить(ХТМЛПодписи, "<PRE>", "");
					ХТМЛПодписи = СтрЗаменить(ХТМЛПодписи, "</PRE>", "<BR>");
				КонецЕсли;
			Иначе
				Отказ = Истина;
			КонецЕсли; 
			
			Если НЕ Отказ Тогда
				Если ПодписьПодТекстом Тогда
					НачалоКонцаТела = Найти(ТекстПисьма, "</BODY");
					Если НачалоКонцаТела > 0 Тогда
						НовыйТекстПисьма = Лев(ТекстПисьма, НачалоКонцаТела - 1);
						НовыйТекстПисьма  = НовыйТекстПисьма + "<BR>" + ХТМЛПодписи + Сред(ТекстПисьма, НачалоКонцаТела);
						Письмо.ТекстПисьма = НовыйТекстПисьма;
					КонецЕсли; 
				Иначе
					НовыйТекстПисьма = Лев(ТекстПисьма, КонецНачалаТела);
					НовыйТекстПисьма  = НовыйТекстПисьма + "<DIV>&nbsp;</DIV>" + ХТМЛПодписи + Сред(ТекстПисьма, (КонецНачалаТела + 1));
					Письмо.ТекстПисьма = НовыйТекстПисьма;
				КонецЕсли; 
			КонецЕсли; 
			
		Иначе
			
			ТекстПодписи = Новый ТекстовыйДокумент;
			ТекстПодписи.УстановитьТекст(СтрЗаменить(НовыйКом.all.item(0).innerText, Символ(13), ""));
			
			Если ТекстПодписи.КоличествоСтрок() > 0 Тогда
				
				НовыйТекстПисьма = Новый ТекстовыйДокумент;
				НовыйТекстПисьма.УстановитьТекст(Письмо.ТекстПисьма);
				
				Если НовыйТекстПисьма.КоличествоСтрок() > 0 Тогда
					ПерваяСтрока = НовыйТекстПисьма.ПолучитьСтроку(1);
					Если ПустаяСтрока(ПерваяСтрока) Тогда
						НовыйТекстПисьма.УдалитьСтроку(1);
					КонецЕсли; 
				КонецЕсли; 
				
				Для а = 1 По ТекстПодписи.КоличествоСтрок() Цикл
					Если ПодписьПодТекстом Тогда
						НовыйТекстПисьма.ДобавитьСтроку(ТекстПодписи.ПолучитьСтроку(а));
					Иначе
						НовыйТекстПисьма.ВставитьСтроку(а, ТекстПодписи.ПолучитьСтроку(а));
					КонецЕсли;
				КонецЦикла;
				
				НовыйТекстПисьма.ВставитьСтроку(1, "");
				Письмо.ТекстПисьма = НовыйТекстПисьма.ПолучитьТекст();
				
			КонецЕсли; 
			
		КонецЕсли;
	
	КонецЕсли; 
	
	#Если Клиент Тогда
	Если ОткрыватьПисьмо Тогда
		
		Если ТипЗнч(СписокФайловВложений) = Тип("СписокЗначений") И СписокФайловВложений.Количество() > 0 Тогда
			
			ЗначениеСтруктурыВозврата = Неопределено;
			
			Для каждого ЭлементСписка Из СписокФайловВложений Цикл
				
				НовоеВложение = ФормаПисьма.ВложенияПисьмаТЗ.Добавить();
				
				ЭлементСписка.Значение.Свойство("Хранилище", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					Продолжить;
				Иначе
					Если ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ДвоичныеДанные") Тогда
						НовоеВложение.Данные = Новый ХранилищеЗначения(ЗначениеСтруктурыВозврата, Новый СжатиеДанных);
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ХранилищеЗначения") Тогда
						НовоеВложение.Данные = ЗначениеСтруктурыВозврата;
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("Строка") Тогда
						НовоеВложение.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеСтруктурыВозврата), Новый СжатиеДанных);
					Иначе
						Продолжить;
					КонецЕсли; 
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("ИмяФайла", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.ИмяФайла = "";
				Иначе
					НовоеВложение.ИмяФайла = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("Наименование", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.Наименование = "";
				Иначе
					НовоеВложение.Наименование = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
		ФормаПисьма.Открыть();
		
		// Установим удобный элемент управления в форме письма - текущим
		Если ТекущийЭлементХТМЛ Тогда
			Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.ПолеHTMLДокумента;
			Иначе
				ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.ПолеТекстовогоДокумента;
			КонецЕсли; 
		Иначе
			ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.Кому;
		КонецЕсли;
		
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Письмо, ФормаПисьма, Письмо.Ссылка);
		
	КонецЕсли;
	#КонецЕсли

	Если Не ОткрыватьПисьмо Тогда
		
		Попытка
			Письмо.Записать();
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
			
		Если ТипЗнч(СписокФайловВложений) = Тип("СписокЗначений") И СписокФайловВложений.Количество() > 0 Тогда
			
			ЗначениеСтруктурыВозврата = Неопределено;
			
			Для каждого ЭлементСписка Из СписокФайловВложений Цикл
			
				НовоеВложение = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент();
				НовоеВложение.Объект = Письмо.Ссылка;
				
				ЭлементСписка.Значение.Свойство("Хранилище", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					Продолжить;
				Иначе
					Если ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ДвоичныеДанные") Тогда
						НовоеВложение.Хранилище = Новый ХранилищеЗначения(ЗначениеСтруктурыВозврата, Новый СжатиеДанных);
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ХранилищеЗначения") Тогда
						НовоеВложение.Хранилище = ЗначениеСтруктурыВозврата;
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("Строка") Тогда
						НовоеВложение.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеСтруктурыВозврата), Новый СжатиеДанных);
					Иначе
						Продолжить;
					КонецЕсли; 
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("ИмяФайла", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.ИмяФайла = "";
				Иначе
					НовоеВложение.ИмяФайла = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("Наименование", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.Наименование = "";
				Иначе
					НовоеВложение.Наименование = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				Попытка
					НовоеВложение.Записать();
				Исключение
					Возврат ОписаниеОшибки();
				КонецПопытки;
			
			КонецЦикла; 
			
		КонецЕсли; 
		
		#Если Клиент Тогда
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Письмо, ФормаПисьма, Письмо.Ссылка);
		#Иначе
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Неопределено, Неопределено, Письмо.Ссылка);
		#КонецЕсли
	
	КонецЕсли; 
	
	Возврат СтруктураВозврата;

КонецФункции

// Получить строку с представлением списка получателей
//
// Параметры
//  КомуТЧ  – Таблица значений – список получателей
//
// Возвращаемое значение:
//   Строка   – Строка с представлением списка получателей
//
// Получить строку с представлением списка получателей
//
// Параметры
//  КомуТЧ  – Таблица значений – список получателей
//
// Возвращаемое значение:
//   Строка   – Строка с представлением списка получателей
//
Функция ПолучитьПредставлениеПолучателей(КомуТЧ)

	Представление = "";
	Для каждого СтрокаКому Из КомуТЧ Цикл
		Представление = Представление + ", " + ?(ПустаяСтрока(СтрокаКому.Представление), СтрокаКому.АдресЭлектроннойПочты, СтрокаКому.Представление);
	КонецЦикла;
	Если НЕ ПустаяСтрока(Представление) Тогда
		Представление = Сред(Представление, 3);
	КонецЕсли;
	
	Возврат Представление;

КонецФункции // ПолучитьПредставлениеПолучателей()  

////////////////////////////////////////////////////////////////////////// 

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУправленческогоУчета=глЗначениеПеременной("ВалютаУправленческогоУчета");

