
&НаКлиенте
Перем мЗначениеСоставБюджетаПередИзменением;


&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
	
	
	ЗаполнитьЗаголовкиПоДатаПланирования();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЦФО(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЦФО.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	ЗаполнитьПоЦФОСервер();
	ЭтаФорма.Модифицированность = Истина;
	
	ОбработатьИтоговыеСтроки();
	СоставБюджета4ВыделитьТО();
	СоставБюджета5ВыделитьТО();
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИтоговыеСтроки()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЗеленыйФон = Новый Цвет(255, 255, 190); // Светол-желтый
	
	_ЗеленыйФон = Новый Цвет(220, 255, 220); // Светол-зеленый
	
	СерыйФон = Новый Цвет(179, 172, 134); // Цвет рамки
	
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	
	
	//СоставБюджета
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	
	
	//СоставБюджетаКлиенты
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета1");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета1.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета1");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета1.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	
	
	
	
	
	
	
	
	//СоставБюджетаКлиентыБезНДС
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета2");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета2.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета2");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета2.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	
	
	
	
	//СоставБюджетаНепрямым
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета3");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета3.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета3");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета3.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	
	
	
	//Расшифровка по клиентам БезНДС
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета5");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета5.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	
	//Расшифровка Непрямым
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета6");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета6.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	//СоставБюджета Расшифровка
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета7");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета7.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//СоставБюджета БДДС
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета11");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета11.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета8");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета8.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//СоставБюджета БезНДС
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета9");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета9.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//СоставБюджета БезНДС
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета10");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета10.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	//Эксплуатация
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета12");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета6.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	
	//Расшифровка Непрямым Без НДС
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета13");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета13.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета13");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета13.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	
	
	
	
	
	//Расшифровка Непрямым Без НДС (Расшифровка)
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета14");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета14.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	///////////////////////////////////////////////////
	// ТМ
	
	
	//ОСН ТМ 
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета15");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета15.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//ОСН ТМ  (Расшифровка)
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета16");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета16.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//Расшифровка ТМ Без НДС
	Если СокрЛП(Объект.ЦФО.Код) = "001" тогда // БДР old
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета17");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета17.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветГраницы",СерыйФон);

	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета17");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета17.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
		
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветГраницы",СерыйФон);
	
	
	//////////////////////////
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета17");
	//
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета17.Итоговая");
	//ЭлементОтбора.ПравоеЗначение = Ложь;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветГраницы",СерыйФон);
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[0].Использование = Истина;
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[0].Значение = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);	
	//
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[1].Использование = Истина;
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[1].Значение = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);	
	//
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[2].Использование = Истина;
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[2].Значение = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);	
	//
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[3].Использование = Истина;
	//ЭлементОформления.Оформление.Элементы[4].ЗначенияВложенныхПараметров[3].Значение = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);	
	//
	////ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",СерыйФон);
	
	
	
	иначе
		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета17");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета17.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	КонецЕсли;
	
	
	
	
	
	
	
	
	//Расшифровка ТМ Без НДС (Расшифровка)
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета18");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета18.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
КонецПроцедуры	




&НаСервере
Процедура ЗаполнитьПоЦФОСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиБюджетаПоЦФО();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыручку(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьВыручкуСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыручкуСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиВыручки();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСебестоимость(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	ЗаполнитьСебестоимостьСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСебестоимостьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиСебестоимости();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРетро(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	ЗаполнитьРетроСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРетроСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиРетро();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриАктивизацииЯчейки(Элемент)
	СтрокаТЧ=Элементы.СоставБюджета.ТекущиеДанные;
	//Если Не СтрокаТЧ=Неопределено Тогда
	//	//Элементы.СоставБюджета.ТолькоПросмотр=СтрокаТЧ.Автозаполнение;
	//	Элементы.СоставБюджета.ТекущийЭлемент.ТолькоПросмотр=СтрокаТЧ.Автозаполнение;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспорт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	ЗаполнитьТранспортСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТранспортСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиТранспорта();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	абс_СогласованиеДокументов.УстановитьДоступностьРедактирования(Объект,ЭтаФорма);
	
	//ОбновитьНадписиИтоговПоСтатье(Элементы.СоставБюджета.ТекущиеДанные);
	
	
	
	//Элементы.БДДС.Пометка = Истина;
	Элементы.БДДС.Пометка = Ложь;
	
	УстановитьВидимостьБДДС(Элементы.БДДС.Пометка);
	
	//Элементы.ПоказатьСправочно.Пометка = Истина;
	Элементы.ПоказатьСправочно.Пометка = Ложь;
	
	УстановитьВидимостьСправочно(Элементы.ПоказатьСправочно.Пометка);
	
	
	Элементы.ПоказатьБезНДС.Пометка = Истина;
	
	Элементы.СтраницаБезНДС.Видимость  = Истина;
	
	Если СокрЛП(Объект.ЦФО.Код) = "001"
	или  Объект.ЦФО.Лео_ЦЗ = "ФОТ"
		тогда 
	Элементы.СтраницаБезНДС.Видимость  = Ложь;
	КонецЕсли;
	
	Если  Объект.ЦФО.Лео_ЦЗ = "ФОТ" тогда
	Элементы.СтраницаФОТ.Видимость = Истина;
	КонецЕсли;
	
	//Если Объект.ЦФО.Лео_ЦЗ = "PR" тогда // Маркетинг
	//Элементы.СоставБюджетаГруппаКонтрагент11.Видимость = Ложь;
	//Элементы.СоставБюджета12абс_КодБюджетнойСтатьи.Видимость = Ложь;
	//КонецЕсли;
	
	УстановитьДоступностьПоляБюджет();

	
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьПоляБюджет()
	
	Таб = Объект["СоставБюджета"]; 
	
	мТаб = Новый Массив;
	мТаб.Добавить("СоставБюджета") ; мТаб.Добавить("СоставБюджета7"); // Основная
	мТаб.Добавить("СоставБюджета9"); мТаб.Добавить("СоставБюджета10"); // Без НДС

	
	Если РольДоступна("абс_Финансист") или РольДоступна("ПолныеПрава") Тогда
		возврат;
	Конецесли;	
	
	Для каждого мТ из мТаб цикл 
		Для сч = 1 по 12 цикл
			Элементы[мТ + "СуммаБюджет" + сч].Доступность = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	
	////////////////////////////////////
	//СНДС
	Элементы.СоставСправочноФакт.Доступность = Ложь;
	Элементы.СоставБюджетаБюджетГод.Доступность = Ложь;
	Элементы.СоставБюджетаБюджетМесяцГ.Доступность = Ложь;
	
	Элементы.СоставСправочноФакт7.Доступность = Ложь;
	Элементы.СоставБюджета7БюджетГод.Доступность = Ложь;
	Элементы.СоставБюджета7БюджетМесяцГ.Доступность = Ложь;
	
	//БезНДС
	Элементы.СоставСправочноФакт9.Доступность = Ложь;
	Элементы.СоставБюджета9БюджетГод.Доступность = Ложь;
	Элементы.СоставБюджета9БюджетМесяцГ.Доступность = Ложь;
	
	Элементы.СоставСправочноФакт10.Доступность = Ложь;
	Элементы.СоставБюджета10БюджетГод.Доступность = Ложь;
	Элементы.СоставБюджета10БюджетМесяцГ.Доступность = Ложь;
	
	
	
КонецПроцедуры	




&НаКлиенте
Процедура ЗагрузитьИзМакета(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли; 
	СтруктураПараметров = Новый Структура("Ключ", Объект.Ссылка);
	ФормаЗагрузки = ПолучитьФорму("Документ.абс_ВводБюджета.Форма.ФормаЗагрузки", СтруктураПараметров, Объект.Ссылка);
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "абс_ВводБюджета_ЗагрузкаИзEXCEL" Тогда
		Если Объект.СоставБюджета.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = "Заменить данные в документе?";
			Ответ = Вопрос(Текст, Режим, 0);    
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.СоставБюджета.Очистить();			
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли; 
		ЗаполнитьТЧДокументаПоТаблицеСервер(Параметр); 
	КонецЕсли;
	
	
	//Если ИмяСобытия = "ПереброситьСумму" Тогда
	//	
	//	Параметр.ОбновитьОтображениеДанных();
	//	
	//КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьТЧДокументаПоТаблице(ТабДок);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл Excel|*.xls*";
	Диалог.МножественныйВыбор = Ложь;
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Диалог.ВыбранныеФайлы[0];
	
	Если Объект.СоставБюджета.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Заменить данные в документе?";
		Ответ = Вопрос(Текст, Режим, 0);    
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СоставБюджета.Очистить();			
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВнешнийФайл 	= Новый ДвоичныеДанные(ПутьКФайлу);
	
	АдресФайлаВХранилище = "";
	
	Если ПоместитьВоВременноеХранилище(ВнешнийФайл, АдресФайлаВХранилище) Тогда
		
		ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище);
		
	Иначе
		
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при загрузке файла на сервер!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(АдресФайлаВХранилище)
	
	ТабДок = абс_РаботаСФайлами.ПолучитьТабличныйДокументПоФайлуExcel(АдресФайлаВХранилище);
	
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧДокументаПоТаблицеСервер(ТабДок);
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Согласован);
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отложен);
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ИзменитьСостояниеДокумента(Перечисления.СостоянияОбъектов.Отклонен);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеДокумента(НовоеСостояние)
	
	Если ЭтаФорма.Модифицированность Тогда
		Если Вопрос("Перед изменением состояния документ необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет) 
			= КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = абс_СогласованиеДокументов.ПолучитьПараметрыДляСогласованияДокумента(Объект.Ссылка, НовоеСостояние, ПараметрыСеанса.ТекущийПользователь);
	Если ПараметрыФормы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не требует согласования пользователем " + ПараметрыСеанса.ТекущийПользователь);
	Иначе
		ОткрытьФорму("Обработка.абс_СогласованиеДокументов.Форма.ИзменениеСостоянияДокументов", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
		//ТекДанные.РодительИтогСтатьи = 
		мД = Объект[ТабЧ].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов));
		Если мД.Количество() > 0 И НЕ ТекДанные.СтатьяОборотовПоБюджетам.НетИтоговой тогда
			//ТекДанные.РодительИтогСтатьи = мД[0].НомерСтроки;
			ТекДанные.РодительИтогСтатьи = мД[0].РодительИтогСтатьи;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	//Если ТабЧ = "СоставБюджета7" тогда // Расшифровка
	Если ТабЧ = "СоставБюджета7" или ТабЧ = "СоставБюджета6"  // Расшифровка или Эксплуатация
	       или ТабЧ = "СоставБюджета10" тогда                 // БезНДС 
	
		рПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные,Ложь);
		
	иначе //остальные	
		
		// 1.
		РодительИндекс = Ложь;
		Если ТабЧ = "СоставБюджета7" или ТабЧ = "СоставБюджета10" тогда
		РодительИндекс = Истина;
		КонецЕсли;
		
		
		мПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные,Ложь);
		
		////////////////////////////////////////
		//// 2.Родители  (Логистика ГП (транспорт и клиентская служба))
		
		мРод = Новый Массив;
		Если РодительИндекс тогда
			мРод = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		иначе
			//мРод = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
			
			
			Если ТекДанные.РодительИтогСтатьи > 0 тогда
				мРод = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1];
			КонецЕсли;
			
		КонецЕсли;
	
	
		////Есть родитель у род строки пример ФОТ
		

		//Если мРод.Количество() > 0 тогда
		//	СуммированиеИтоговых(ТабЧ,ТекКолонка,мРод);
		//КонецЕсли;
		
		
		////////////////////////////////////////
		
		Если ТипЗнч(мРод) = Тип("ДанныеФормыЭлементКоллекции") и  мРод.РодительИтогСтатьи > 0 тогда
		СуммированиеИтоговых(ТабЧ,ТекКолонка,мРод);	
		КонецЕсли;	
		
		
		
		
		
	КонецЕсли;
	
	
	
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	//// Если у ТекДанные.РодительИтогСтатьи есть своя  РодительИтогСтатьи, то обновляем данные для нее
	
	//   Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда  //ОП Дистрибьюция ОБЩИЕ
	//	
	//   мСтр = Объект[ТабЧ].НайтиСтроки(Новый Структура("НомерСтроки",ТекДанные.РодительИтогСтатьи));	
	//   Если  мСтр.Количество() > 0 тогда
	//	   Если ЗначениеЗаполнено(мСтр[0].РодительИтогСтатьи) тогда 
	//		   мПроссумируемЕксель(ТабЧ,ТекКолонка,мСтр[0],Ложь);
	//	   КонецЕсли;
	//   КонецЕсли;	
	//	
	//   КонецЕсли;	
	
КонецПроцедуры	


&НаКлиенте

Процедура _мПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.ИндексСтатьи,Ложь));
	
	Если мИндексов.Количество() = 0 тогда
		
	возврат;
	
    Конецесли;	
	
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	
	////иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//Если РодительИндекс тогда
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));	
	// иначе
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));		
	//КонецЕсли;
	//
	//РодительИндекс = иРодительИтогСтатьи[0].НомерСтроки;
	
	
	
	//// 1. Соберем итоги по вертикали
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1  тогда
	//	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
	//	
	//	//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
	//	
	//	//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
	//	// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
	//	//НачИндекс = мИндексов[0].НомерСтроки;
	//	//Для каждого мИ из мИндексов цикл
	//	//	КонИндекс = мИ.НомерСтроки;
	//	//КонецЦикла;
	//	
	//	//мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//	//Если мРодИндексов.Количество() > 0 тогда
	//	//  иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
	//	//КонецЕсли;
	//	
	//	
	//	Если ЭтоКопирование тогда
	//		Для Н = 1 По 12 Цикл  
	//			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
	//			
	//			об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
	//			//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка + Н] = 0;
	//			
	//			
	//			Для каждого сч из мИндексов цикл
	//				об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + об[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
	//				//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка + Н] = Объект[ТабЧ][РодительИндекс - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
	//			КонецЦикла;
	//		КонецЦикла;
	//	иначе
	//		об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
	//		//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] = 0;
	//		
	//		Для каждого сч из мИндексов цикл
	//			об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + об[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
	//			//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] = Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			//Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			
		КонецЦикла;		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
	//	//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = 0;
	//	Для Н = 1 По ТекМесяц Цикл
	//		Для каждого сч из мИндексов цикл
	//			//Для сч = НачИндекс по КонИндекс цикл
	//			Если об[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
	//				об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + об[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
	//				//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
	//			Иначе
	//				об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + об[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
	//				//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
	//			КонецЕсли;
	//		КонецЦикла;	
	//	КонецЦикла;		
	//	
	//	
	//	
	//	Для Н = ТекМесяц + 1 По 12 Цикл
	//		Для каждого сч из мИндексов цикл
	//			об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + об[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
	//			//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
	//		КонецЦикла;	
	//		
	//	КонецЦикла;		
	//	
	//	
	//КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
			//Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] - Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
	//	//Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = 0;
	//	Для Н = 1 По ТекМесяц Цикл
	//		об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
	//		//Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
	//	//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
	//	
	//	Для Н = 1 По ТекМесяц Цикл
	//		//Для сч = НачИндекс по КонИндекс цикл
	//		Для каждого сч из мИндексов цикл
	//			
	//			Если об[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
	//				об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + об[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
	//				//Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
	//			Иначе
	//				об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + об[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
	//				//Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
	//			КонецЕсли;
	//		КонецЦикла;		
	//	КонецЦикла;		
	//КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
	//	//Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = 0;
	//	Для Н = 1 По ТекМесяц Цикл
	//		об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - об[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
	//		//Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] - Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	



 &НаКлиенте
 Процедура СуммированиеИтоговых(ТабЧ,ТекКолонка,Данные)
	 
	  ////Старый код
	  //  	Если  Данные[0].РодительИтогСтатьи > 0 тогда
	  //  		мПроссумируемЕксельРод(ТабЧ,ТекКолонка,Данные[0],Ложь);
	  //  	КонецЕсли;
	  //  Данные = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",Данные[0].РодительИтогСтатьи,Истина));
	  //  Если Данные.Количество() > 0 тогда
	  //  СуммированиеИтоговых(ТабЧ,ТекКолонка,Данные);	
	  //  КонецЕсли;	
	                       	  
 
	 
	 ///////////////////////////////////////////////////////////////////////////////////////////////////////
	 // Новый код
		Если ТипЗнч(Данные) = Тип("ДанныеФормыЭлементКоллекции") тогда
		
			Если  Данные.РодительИтогСтатьи > 0 тогда
				мПроссумируемЕксельРод(ТабЧ,ТекКолонка,Данные,Ложь);
			КонецЕсли;
			
		//Данные = Объект[ТабЧ][Данные.РодительИтогСтатьи];
		
		
		Если ТипЗнч(Объект[ТабЧ][Объект[ТабЧ][Данные.РодительИтогСтатьи].РодительИтогСтатьи]) = Тип("ДанныеФормыЭлементКоллекции") и Объект[ТабЧ][Объект[ТабЧ][Данные.РодительИтогСтатьи].РодительИтогСтатьи].РодительИтогСтатьи > 0 тогда
		СуммированиеИтоговых(ТабЧ,ТекКолонка,Объект[ТабЧ][Объект[ТабЧ][Данные.РодительИтогСтатьи].РодительИтогСтатьи - 1]);	
		КонецЕсли;	
		
		
	    иначе
		
	    	Если  Данные[0].РодительИтогСтатьи > 0 тогда
	    		мПроссумируемЕксельРод(ТабЧ,ТекКолонка,Данные[0],Ложь);
	    	КонецЕсли;
	    Данные = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",Данные[0].РодительИтогСтатьи,Истина));
	    Если Данные.Количество() > 0 тогда
	    СуммированиеИтоговых(ТабЧ,ТекКолонка,Данные);	
	    КонецЕсли;	
		
		
		
		Конецесли;
		
КонецПроцедуры	



&НаКлиенте
Процедура мПроссумируемЕксельТОВ_ИСГ(ТабЧ,ТекКолонка,ТекДанные,Итоговая)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	
	Если 1 = 1 
		
		//(Найти(ТекКолонка,"СуммаБюджет") > 0  // Бюджет
		//			или Найти(ТекКолонка,"Сумма") > 0)  // План
		//		  и  (Найти(ТекКолонка,"СуммаФакт") > 0 или
		//			 Найти(ТекКолонка,"СуммаПрФакт") > 0)
		
		тогда
		
	Иначе
		
		
		мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Ложь));
		НачИндекс = мИндексов[0].НомерСтроки;
		
		
	   //иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	   иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	
	   РодительИндекс = иРодительИтогСтатьи[0].НомерСтроки;
		
		
		
		// 1. Соберем итоги по вертикали
		Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1 тогда
			
			//Если ЭтоКопирование тогда
			//	Для Н = 1 По 12 Цикл  
			//		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
			//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
			//		Для каждого сч из мИндексов цикл
			//			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
			//		КонецЦикла;
			//	КонецЦикла;
			//иначе
			
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
			Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] = 0;
			
			Для каждого сч из мИндексов цикл
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
				Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] = Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Итоговая));
	
	Если мИндексов.Количество() = 0 тогда
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	КонецЕсли;	
		
	НачИндекс = мИндексов[0].НомерСтроки;
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		  Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;	
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					
				Иначе
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
				Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = 0;
		
		Для Н = 1 По 12 Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
			Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] - Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
			Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] - Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
КонецПроцедуры	


&НаКлиенте
Процедура ПроссумируемЕксельБезРодителя(ТабЧ,ТекКолонка,ТекДанные,ЭтоКопирование)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Ложь));
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	
	иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	
	РодительИндекс = иРодительИтогСтатьи[0].НомерСтроки;
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	//Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	ТекДанныеНомерСтроки_1ГодовойБюджет = 0;
	Для Н = 1 По 12 Цикл
	//005,83% //Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
		ТекДанныеНомерСтроки_1ГодовойБюджет = ТекДанныеНомерСтроки_1ГодовойБюджет + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = ТекДанныеНомерСтроки_1ГодовойБюджет;
	
	
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			НомерСтроки_1ГодовойПрогноз = 0;
			//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					НомерСтроки_1ГодовойПрогноз = НомерСтроки_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н]; 
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					НомерСтроки_1ГодовойПрогноз = НомерСтроки_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н]; 
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
					НомерСтроки_1ГодовойПрогноз = НомерСтроки_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н]; 
				//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = НомерСтроки_1ГодовойПрогноз;
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		
		РодительИндекс_1ГодовойПрогноз = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					
					РодительИндекс_1ГодовойПрогноз = РодительИндекс_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					
					РодительИндекс_1ГодовойПрогноз = РодительИндекс_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		
		Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = РодительИндекс_1ГодовойПрогноз;
		
		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
				Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;	
			
		КонецЦикла;		
		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
			Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] - Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	ТекДанныеНомерСтроки_1БюджетМесяц = 0;
	//Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		ТекДанныеНомерСтроки_1БюджетМесяц = ТекДанныеНомерСтроки_1БюджетМесяц + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
		//Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = ТекДанныеНомерСтроки_1БюджетМесяц;
	
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			НомерСтроки_1ПрогнозМесяц = 0;
			//Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					НомерСтроки_1ПрогнозМесяц = НомерСтроки_1ПрогнозМесяц + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					НомерСтроки_1ПрогнозМесяц = НомерСтроки_1ПрогнозМесяц + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = НомерСтроки_1ПрогнозМесяц;
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					
				Иначе
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
			Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] - Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	




&НаКлиенте
Процедура мПроссумируемЕксельИтоговаяФОТ(ТабЧ,ТекКолонка,ТекДанные,ЭтоКопирование)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	
	//Если _РодительИндекс тогда
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//иначе		
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//КонецЕсли;
	//
	//РодительИндекс = иРодительИтогСтатьи[0].НомерСтроки;
	
	
	
	
	
	
	// 1. Соберем итоги по вертикали
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1  тогда
		//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
		
		//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
		
		//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
		// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
		//НачИндекс = мИндексов[0].НомерСтроки;
		//Для каждого мИ из мИндексов цикл
		//	КонИндекс = мИ.НомерСтроки;
		//КонецЦикла;
		
		//мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//Если мРодИндексов.Количество() > 0 тогда
		//  иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
		//КонецЕсли;
		
		
		Если ЭтоКопирование тогда
		//	Для Н = 1 По 12 Цикл  
		//		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
		//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
		//		Для каждого сч из мИндексов цикл
		//			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
		//		КонецЦикла;
		//	КонецЦикла;
		//иначе
		//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
		//	
		//	Для каждого сч из мИндексов цикл
		//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
		//	КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		
		
		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;	
			
		КонецЦикла;		
		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	



&НаКлиенте
Процедура мПроссумируемЕксельИтоговая(ТабЧ,ТекКолонка,ТекДанные,ЭтоКопирование)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	
	//Если _РодительИндекс тогда
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//иначе		
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//КонецЕсли;
	//
	//РодительИндекс = иРодительИтогСтатьи[0].НомерСтроки;
	
	
	
	
	
	
	// 1. Соберем итоги по вертикали
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1  тогда
		//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
		
		//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
		
		//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
		// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
		//НачИндекс = мИндексов[0].НомерСтроки;
		//Для каждого мИ из мИндексов цикл
		//	КонИндекс = мИ.НомерСтроки;
		//КонецЦикла;
		
		//мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//Если мРодИндексов.Количество() > 0 тогда
		//  иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
		//КонецЕсли;
		
		
		Если ЭтоКопирование тогда
		//	Для Н = 1 По 12 Цикл  
		//		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
		//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
		//		Для каждого сч из мИндексов цикл
		//			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
		//		КонецЦикла;
		//	КонецЦикла;
		//иначе
		//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
		//	
		//	Для каждого сч из мИндексов цикл
		//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
		//	КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		
		
		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;	
			
		КонецЦикла;		
		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	



&НаКлиенте
Процедура мПроссумируемЕксельРод(ТабЧ,ТекКолонка,ТекДанные,ЭтоКопирование)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	// 1. Соберем итоги по вертикали
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1  тогда
		//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
		
		//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
		
		//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
		// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
		//НачИндекс = мИндексов[0].НомерСтроки;
		//Для каждого мИ из мИндексов цикл
		//	КонИндекс = мИ.НомерСтроки;
		//КонецЦикла;
		
		//мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//Если мРодИндексов.Количество() > 0 тогда
		//  иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
		//КонецЕсли;
		
		
		Если ЭтоКопирование тогда
			Для Н = 1 По 12 Цикл  
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				Для каждого сч из мИндексов цикл
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
				КонецЦикла;
			КонецЦикла;
		иначе
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
			
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		
		
		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;	
			
		КонецЦикла;		
		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	


&НаКлиенте
Процедура мПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные,ЭтоКопирование)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Ложь));
	
	Если мИндексов.Количество() = 0 тогда
		
	возврат;
	
    Конецесли;	
	
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	
	////иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
	//Если РодительИндекс тогда
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));	
	// иначе
	//иРодительИтогСтатьи = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));		
	//КонецЕсли;
	//
	//РодительИндекс = иРодительИтогСтатьи[0].НомерСтроки;
	
	
	
	// 1. Соберем итоги по вертикали
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1  тогда
		//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
		
		//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
		
		//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
		// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
		//НачИндекс = мИндексов[0].НомерСтроки;
		//Для каждого мИ из мИндексов цикл
		//	КонИндекс = мИ.НомерСтроки;
		//КонецЦикла;
		
		//мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//Если мРодИндексов.Количество() > 0 тогда
		//  иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
		//КонецЕсли;
		
		
		Если ЭтоКопирование тогда
			Для Н = 1 По 12 Цикл  
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка + Н] = 0;
				
				
				Для каждого сч из мИндексов цикл
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
					//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка + Н] = Объект[ТабЧ][РодительИндекс - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
				КонецЦикла;
			КонецЦикла;
		иначе
			
			
			ТекДанныеРодительИтогСтатьи_1ТекКолонка = 0;
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
			//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] = 0;
			
			Для каждого сч из мИндексов цикл
				ТекДанныеРодительИтогСтатьи_1ТекКолонка = ТекДанныеРодительИтогСтатьи_1ТекКолонка + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
				//Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] = Объект[ТабЧ][РодительИндекс - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
			КонецЦикла;
			
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = ТекДанныеРодительИтогСтатьи_1ТекКолонка;
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		
		ТекДанныеРодительИтогСтатьи_1ГодовойБюджет = 0;
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			ТекДанныеРодительИтогСтатьи_1ГодовойБюджет = ТекДанныеРодительИтогСтатьи_1ГодовойБюджет + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н]; 
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			//Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = ТекДанныеРодительИтогСтатьи_1ГодовойБюджет;
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		
		ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз = 0;
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз = ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз = ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз;
		
		
		
		
		ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз = 0;
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз = ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
				//Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;	
			
		КонецЦикла;	
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = ТекДанныеРодительИтогСтатьи_1ГодовойПрогноз;
		
		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
			//Объект[ТабЧ][РодительИндекс - 1]["ГодовойОтклонение"] = Объект[ТабЧ][РодительИндекс - 1]["ГодовойБюджет"] - Объект[ТабЧ][РодительИндекс - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		
		РодительИтогСтатьи_1БюджетМесяц = 0;
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			РодительИтогСтатьи_1БюджетМесяц = РодительИтогСтатьи_1БюджетМесяц + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
			//Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] + Объект[ТабЧ][РодительИндекс - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = РодительИтогСтатьи_1БюджетМесяц;
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		
		
		ТекДанныеРодительИтогСтатьи_1ПрогнозМесяц = 0;
		//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					ТекДанныеРодительИтогСтатьи_1ПрогнозМесяц = ТекДанныеРодительИтогСтатьи_1ПрогнозМесяц + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н]; 
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					//Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					ТекДанныеРодительИтогСтатьи_1ПрогнозМесяц = ТекДанныеРодительИтогСтатьи_1ПрогнозМесяц + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н]; 
					//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					//Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
		
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = ТекДанныеРодительИтогСтатьи_1ПрогнозМесяц;
		
		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		//Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
			//Объект[ТабЧ][РодительИндекс - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][РодительИндекс - 1]["БюджетМесяц"] - Объект[ТабЧ][РодительИндекс - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	


&НаКлиенте
Процедура ПроссумируемЕксельНепрямым(ТабЧ,ТекКолонка,ТекДанные)
	
	ЭтоКопирование = Ложь;
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	
	Если мИндексов.Количество() = 0 тогда
		
	возврат;
	
    Конецесли;	
	
	
	НачИндекс = мИндексов[0].НомерСтроки;
	
	// 1. Соберем итоги по вертикали
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() >= 1  тогда
		//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
		
		//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
		
		//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
		// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
		//НачИндекс = мИндексов[0].НомерСтроки;
		//Для каждого мИ из мИндексов цикл
		//	КонИндекс = мИ.НомерСтроки;
		//КонецЦикла;
		
		//мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//Если мРодИндексов.Количество() > 0 тогда
		//  иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
		//КонецЕсли;
		
		
		Если ЭтоКопирование тогда
			Для Н = 1 По 12 Цикл  
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				Для каждого сч из мИндексов цикл
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
				КонецЦикла;
			КонецЦикла;
		иначе
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = 0;
			
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	ТекМесяц = Месяц(Объект.Дата);
	
	
	// Если есть Факт берем его вместо Плана
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
			Для Н = ТекМесяц + 1 По 12 Цикл
				Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		
		
		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;	
			
		КонецЦикла;		
		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	
	
	
	// Берем факт, в последнем месяце отч.периода если нет факта берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	



&НаКлиенте
Процедура рПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные,ЭтоКопирование)
	
	
	//ТабЧ = Элемент.Имя;
	//
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТекДанные = Неопределено тогда
		возврат;
	КонецЕсли;
	
	
	
	// Делаем Excel
	
	мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Ложь));
	
	// 1. Соберем итоги по вертикали
	Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и мИндексов.Количество() > 0 тогда
		//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) и ТекДанные.РодительИтогСтатьи <> ТекДанные.ИндексСтатьи тогда
		
		//Если Найти(мИндексов[0].абс_КодБюджетнойСтатьи,"_ТОВ_") > 1 или
		//	 Найти(мИндексов[0].абс_КодБюджетнойСтатьи,"_ИСГ_") > 1
		// тогда
		//	// Заполним итоговую строку ТОВ, ИСГ
		//	// 
		//	
		//	иначе
		
		НачИндекс = мИндексов[0].НомерСтроки;
		
		
		//мИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи",ТекДанные.РодительИтогСтатьи));
		
		//НеИтоговая = ?(Объект[ТабЧ][сч.НомерСтроки - 1].РодительИтогСтатьи = Объект[ТабЧ][сч.НомерСтроки - 1].ИндексСтатьи, Ложь, Истина);
		// Не ставлю проверку на массив количество пусть вылетает ошибка по индексам
		//НачИндекс = мИндексов[0].НомерСтроки;
		//Для каждого мИ из мИндексов цикл
		//	КонИндекс = мИ.НомерСтроки;
		//КонецЦикла;
		
		мРодИндексов = Объект[ТабЧ].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		Если мРодИндексов.Количество() > 0 тогда
			иРодительИтогСтатьи = мРодИндексов[0].НомерСтроки;
		КонецЕсли;
		
		
		Если ЭтоКопирование тогда
			Для Н = 1 По 12 Цикл  
				//Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				Объект[ТабЧ][иРодительИтогСтатьи - 1][ТекКолонка + Н] = 0;
				Для каждого сч из мИндексов цикл
					Объект[ТабЧ][иРодительИтогСтатьи - 1][ТекКолонка + Н] = Объект[ТабЧ][иРодительИтогСтатьи - 1][ТекКолонка + Н] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка + Н];
				КонецЦикла;
			КонецЦикла;
		иначе
			Объект[ТабЧ][иРодительИтогСтатьи - 1][ТекКолонка] = 0;
			
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
			
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
			
			
			
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][иРодительИтогСтатьи - 1][ТекКолонка] = Объект[ТабЧ][иРодительИтогСтатьи - 1][ТекКолонка] + Объект[ТабЧ][сч.НомерСтроки - 1][ТекКолонка];
			КонецЦикла;
			
		КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	
	///////////////////////////////////////////////////////////
	//// 2. Соберем итоги по горизонтали
	//
	
	
	
	//// 2.1 ГодовойБюджет
	//// 
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(иРодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойБюджет"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойБюджет"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойБюджет"] + Объект[ТабЧ][иРодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	
	
	Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда возврат конецЕсли; 
	//// 2.2 ГодовойПрогноз(План + Факт)
	//// Прогноз: Факт отчетного периода + Планы оставшихся периодов
	
	
	
	
	// Если есть Факт берем его вместо Плана - это неверно см выше
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;
		Для Н = ТекМесяц + 1 По 12 Цикл
			Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч - 1]["Сумма" + Н];
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			НомерСтроки_1ГодовойПрогноз = 0;
			//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					НомерСтроки_1ГодовойПрогноз = НомерСтроки_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					НомерСтроки_1ГодовойПрогноз = НомерСтроки_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;
			Для Н = ТекМесяц + 1 По 12 Цикл
					НомерСтроки_1ГодовойПрогноз = НомерСтроки_1ГодовойПрогноз + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
				//Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ГодовойПрогноз"] = НомерСтроки_1ГодовойПрогноз;
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(иРодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Для каждого сч из мИндексов цикл
				//Для сч = НачИндекс по КонИндекс цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
		Для Н = ТекМесяц + 1 По 12 Цикл
			Для каждого сч из мИндексов цикл
				Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"] + Объект[ТабЧ][сч.НомерСтроки - 1]["Сумма" + Н];
			КонецЦикла;		
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	//// 2.3 ГодовойОтклонение
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = 0;
	Для Н = 1 По 12 Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойОтклонение"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойБюджет"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойПрогноз"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(иРодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойОтклонение"] = 0;
		Для Н = 1 По 12 Цикл
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойОтклонение"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойБюджет"] - Объект[ТабЧ][иРодительИтогСтатьи - 1]["ГодовойПрогноз"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////
	//// 3. Соберем итоги по горизонтали для Отчетного периода (ЯНВАРЬ - ИЮНЬ)
	//
	//// 3.1 БюджетМесяц
	
	
	
	//Если Лев(ТекКолонка,11) = "СуммаБюджет" тогда
	
	ТекМесяц = Месяц(Объект.Дата);
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаБюджет" + Н];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(иРодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][иРодительИтогСтатьи - 1]["БюджетМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["БюджетМесяц"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["БюджетМесяц"] + Объект[ТабЧ][иРодительИтогСтатьи - 1]["СуммаБюджет" + Н];
		КонецЦикла;		
		
	КонецЕсли;	
	
	//КонецЕсли;
	
	//// 3.2 ПрогнозМесяц(План + Факт)
	//// Прогноз: Факт отчетного периода + Планы оставшихся периодов
	
	
	// берем факт в последний месяц берем п/факт
	
	Если НачИндекс = Неопределено тогда //Для таб частей расшифровок	
		сч = ТекДанные.НомерСтроки;
		Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Если Объект[ТабЧ][сч - 1]["СуммаФакт" + Н] = 0 тогда	
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаПрФакт" + Н];
			иначе
				Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч - 1]["СуммаФакт" + Н];
			КонецЕсли;
		КонецЦикла;		
		
	иначе	
		//Для сч = НачИндекс по КонИндекс цикл // для Основных таблиц
		Для каждого сч из мИндексов цикл
			
			НомерСтроки_1ПрогнозМесяц = 0;
			//Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = 0;
			Для Н = 1 По ТекМесяц Цикл
				Если Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					НомерСтроки_1ПрогнозМесяц = НомерСтроки_1ПрогнозМесяц + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н]; 
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				иначе
					НомерСтроки_1ПрогнозМесяц = НомерСтроки_1ПрогнозМесяц + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н]; 
					//Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
			
			Объект[ТабЧ][сч.НомерСтроки - 1]["ПрогнозМесяц"] = НомерСтроки_1ПрогнозМесяц;
			
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(иРодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			//Для сч = НачИндекс по КонИндекс цикл
			Для каждого сч из мИндексов цикл
				
				Если  Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н] = 0 тогда	
					Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаПрФакт" + Н];
				Иначе
					Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"] + Объект[ТабЧ][сч.НомерСтроки - 1]["СуммаФакт" + Н];
				КонецЕсли;
			КонецЦикла;		
		КонецЦикла;		
	КонецЕсли;	
	
	
	
	
	//// 3.3 ОтклоненияМесяц
	
	
	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = 0;
	Для Н = 1 По ТекМесяц Цикл
		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["БюджетМесяц"] - Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ПрогнозМесяц"];
	КонецЦикла;		
	
	Если ЗначениеЗаполнено(иРодительИтогСтатьи) тогда
		// по итоговым
		Объект[ТабЧ][иРодительИтогСтатьи - 1]["ОтклоненияМесяц"] = 0;
		Для Н = 1 По ТекМесяц Цикл
			Объект[ТабЧ][иРодительИтогСтатьи - 1]["ОтклоненияМесяц"] = Объект[ТабЧ][иРодительИтогСтатьи - 1]["БюджетМесяц"] - Объект[ТабЧ][иРодительИтогСтатьи - 1]["ПрогнозМесяц"];
		КонецЦикла;		
		
	КонецЕсли;	
	
	
	
	
	
	
	
	
	
	////// 2.4 ГодовойФакт
	//
	//	
	//	Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.НомерСтроки - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//Если ЗначениеЗаполнено(ТекДанные.РодительИтогСтатьи) тогда
	//	// по итоговым
	//	Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = 0;
	//	Для Н = 1 По 12 Цикл
	//		Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] = Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["ГодовойФакт"] + Объект[ТабЧ][ТекДанные.РодительИтогСтатьи - 1]["СуммаФакт" + Н];
	//	КонецЦикла;		
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	
КонецПроцедуры	



&НаКлиенте
Процедура ПроссумируемЕксельКопированием(ТабЧ,ТекКолонка,ТекДанные)
	
	мПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные,Истина);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	//// Если у ТекДанные.РодительИтогСтатьи есть своя  РодительИтогСтатьи, то обновляем данные для нее
	//
	//
	//мСтр = Объект[ТабЧ].НайтиСтроки(Новый Структура("НомерСтроки",ТекДанные.РодительИтогСтатьи));	
	//Если  мСтр.Количество() > 0 тогда
	//	Если ЗначениеЗаполнено(мСтр[0].РодительИтогСтатьи) тогда 
	//		мПроссумируемЕксель(ТабЧ,ТекКолонка,мСтр[0],Истина);
	//	КонецЕсли;
	//КонецЕсли;	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроссумируемЕксельКопированиемИтоговая(ТабЧ,ТекКолонка,ТекДанные)
	
	мПроссумируемЕксельИтоговая(ТабЧ,ТекКолонка,ТекДанные,Истина);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	//// Если у ТекДанные.РодительИтогСтатьи есть своя  РодительИтогСтатьи, то обновляем данные для нее
	//
	//
	//мСтр = Объект[ТабЧ].НайтиСтроки(Новый Структура("НомерСтроки",ТекДанные.РодительИтогСтатьи));	
	//Если  мСтр.Количество() > 0 тогда
	//	Если ЗначениеЗаполнено(мСтр[0].РодительИтогСтатьи) тогда 
	//		мПроссумируемЕксель(ТабЧ,ТекКолонка,мСтр[0],Истина);
	//	КонецЕсли;
	//КонецЕсли;	
	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнимИтоговуюТаблицу(ТабЧитог, ТабЧ, Исключениие)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	ТабЧ = Объект[ТабЧ];
	
	
	//Для каждого сс из ТабЧитог цикл
	//		
	//		// Обнулим итоги сначала	
	//		Для Н = 1 По 12 Цикл
	//			сс["СуммаБюджет" + Н] = 0;
	//			сс["Сумма" + Н]       = 0;
	//			сс["СуммаПрФакт" + Н] = 0;
	//			сс["СуммаФакт" + Н]   = 0;
	//	   КонецЦикла;
	//
	//			сс["ГодовойБюджет"]     = 0;
	//			сс["ГодовойПрогноз"]    = 0;
	//			сс["ГодовойОтклонение"] = 0;
	//
	//			сс["БюджетМесяц"]       = 0;
	//			сс["ПрогнозМесяц"]      = 0;
	//			сс["ОтклоненияМесяц"]   = 0;
	//			
	//КонецЦикла;
				
				
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;
	
		ТЗ.Колонки.Добавить("Факт1");
		ТЗ.Колонки.Добавить("Факт2");
		ТЗ.Колонки.Добавить("Факт3");
	
	
	
	Для каждого сс из ТабЧ цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
				
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;	
	
	
		ТЗ.Колонки.Добавить("Факт1");
		ТЗ.Колонки.Добавить("Факт2");
		ТЗ.Колонки.Добавить("Факт3");
	
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки",сс.РодительИтогСтатьи));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнимИтоговуюТаблицуКлиент(ТабЧитог, ТабЧ, Исключениие)
	
	// Расшифровка
	_ЗаполнимТаблицуПоРодителюКлиент(ТабЧ,"РасшСтатья");
	
	// Основная
	_ЗаполнимТаблицуПоРодителюКлиент(ТабЧитог,"РодительИтогСтатьи");
	
	
КонецПроцедуры



&НаКлиенте
Процедура _ЗаполнимТаблицуПоРодителюКлиент(_ТабЧ,Родитель)
	
	
	
	
	ТабЧ = Объект[_ТабЧ];
	
	
	мРодительИтогСтатьи = Новый Массив;
	Для каждого гг из ТабЧ цикл
		Если гг.РодительИтогСтатьи > 0 тогда
		мРодительИтогСтатьи.Добавить(гг[Родитель]);	
		КонецЕсли;
	КонецЦикла;
	мРодительИтогСтатьиУ = Новый Массив;
	Для каждого гг из мРодительИтогСтатьи цикл
		
		Если мРодительИтогСтатьиУ.Найти(гг) = неопределено тогда
		мРодительИтогСтатьиУ.Добавить(гг);	
		КонецЕсли;
	КонецЦикла;
	
	
		Если Родитель = "РасшСтатья" тогда
		стрИ =  "СтатьяОборотовПоБюджетам,Итоговая";
		стрС =  Родитель + ",Итоговая";
		иначе
		стрИ =  Родитель + ",Итоговая";
		стрС =  Родитель + ",Итоговая";
		Конецесли;
	
	
	
	
	Для каждого оо из мРодительИтогСтатьиУ цикл
	
		
		
		мСтрокИ   = ТабЧ.НайтиСтроки(Новый Структура(стрИ,оо,Истина));
		мСтрокСтр = ТабЧ.НайтиСтроки(Новый Структура(стрС,оо,Ложь));
		
		
		Если мСтрокИ.Количество() > 0 И мСтрокСтр.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрокИ[0]["СуммаБюджет" + Н] = 0;
				мСтрокИ[0]["Сумма" + Н]       = 0;
				мСтрокИ[0]["СуммаПрФакт" + Н] = 0;
				мСтрокИ[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрокИ[0]["Факт1"]   = 0;
				мСтрокИ[0]["Факт2"]   = 0;
				мСтрокИ[0]["Факт3"]   = 0;

			
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				
				
				_СуммаБюджет = мСтрокИ[0]["СуммаБюджет" + Н];
				_Сумма       = мСтрокИ[0]["Сумма" + Н];
				_СуммаПрФакт = мСтрокИ[0]["СуммаПрФакт" + Н];
				_СуммаФакт   = мСтрокИ[0]["СуммаФакт" + Н];
				
			    Для каждого оо из мСтрокСтр Цикл
				
				_СуммаБюджет = _СуммаБюджет + оо["СуммаБюджет" + Н];
				_Сумма       = _Сумма       + оо["Сумма" + Н];
				_СуммаПрФакт = _СуммаПрФакт + оо["СуммаПрФакт" + Н];
				_СуммаФакт   = _СуммаФакт   + оо["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			    КонецЦикла;
				
				мСтрокИ[0]["СуммаБюджет" + Н] = _СуммаБюджет;
				мСтрокИ[0]["Сумма" + Н]       = _Сумма;
				мСтрокИ[0]["СуммаПрФакт" + Н] = _СуммаПрФакт;
				мСтрокИ[0]["СуммаФакт" + Н]   = _СуммаФакт;
				
			
			
			КонецЦикла;		
			
				мСтрокИ[0]["Факт1"]   = мСтрокИ[0]["Факт1"]   + оо["Факт1"];
				мСтрокИ[0]["Факт2"]   = мСтрокИ[0]["Факт2"]   + оо["Факт2"];
				мСтрокИ[0]["Факт3"]   = мСтрокИ[0]["Факт3"]   + оо["Факт3"];
		КонецЕсли;
	КонецЦикла;	
		
	
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнимИтоговуюТаблицуКлиентИТ(ТабЧитог, ТабЧ, Исключениие)
	
	// Расшифровка
	_ЗаполнимТаблицуПоРодителюКлиент(ТабЧ,"РасшСтатья");
	
	// Основная
	_ЗаполнимТаблицуПоИндексуКлиент(ТабЧитог);
	
	
КонецПроцедуры


&НаКлиенте
Процедура _ЗаполнимТаблицуПоИндексуКлиент(_ТабЧ)
	
	
	
	
	ТабЧ = Объект[_ТабЧ];
	
	
	мРодительИтогСтатьи = Новый Массив;
	Для каждого гг из ТабЧ цикл
		Если гг.РодительИтогСтатьи > 0 тогда
		мРодительИтогСтатьи.Добавить(гг["РодительИтогСтатьи"]);	
		КонецЕсли;
	КонецЦикла;
	мРодительИтогСтатьиУ = Новый Массив;
	Для каждого гг из мРодительИтогСтатьи цикл
		
		Если мРодительИтогСтатьиУ.Найти(гг) = неопределено тогда
		мРодительИтогСтатьиУ.Добавить(гг);	
		КонецЕсли;
	КонецЦикла;
	
	
		//Если Родитель = "РасшСтатья" тогда
		//стрИ =  "СтатьяОборотовПоБюджетам,Итоговая";
		//стрС =  Родитель + ",Итоговая";
		//иначе
		//стрИ =  Родитель + ",Итоговая";
		//стрС =  Родитель + ",Итоговая";
		//Конецесли;
	
		стрИ =  "ИндексСтатьи,Итоговая";
		стрС =  "РодительИтогСтатьи,Итоговая";
	
	
	Для каждого оо из мРодительИтогСтатьиУ цикл
	
		
		
		мСтрокИ   = ТабЧ.НайтиСтроки(Новый Структура(стрИ,оо,Истина));
		мСтрокСтр = ТабЧ.НайтиСтроки(Новый Структура(стрС,оо,Ложь));
		
		
		Если мСтрокИ.Количество() > 0 И мСтрокСтр.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрокИ[0]["СуммаБюджет" + Н] = 0;
				мСтрокИ[0]["Сумма" + Н]       = 0;
				мСтрокИ[0]["СуммаПрФакт" + Н] = 0;
				мСтрокИ[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрокИ[0]["Факт1"]   = 0;
				мСтрокИ[0]["Факт2"]   = 0;
				мСтрокИ[0]["Факт3"]   = 0;

			
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				
				
				_СуммаБюджет = мСтрокИ[0]["СуммаБюджет" + Н];
				_Сумма       = мСтрокИ[0]["Сумма" + Н];
				_СуммаПрФакт = мСтрокИ[0]["СуммаПрФакт" + Н];
				_СуммаФакт   = мСтрокИ[0]["СуммаФакт" + Н];
				
			    Для каждого оо из мСтрокСтр Цикл
				
				_СуммаБюджет = _СуммаБюджет + оо["СуммаБюджет" + Н];
				_Сумма       = _Сумма       + оо["Сумма" + Н];
				_СуммаПрФакт = _СуммаПрФакт + оо["СуммаПрФакт" + Н];
				_СуммаФакт   = _СуммаФакт   + оо["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			    КонецЦикла;
				
				мСтрокИ[0]["СуммаБюджет" + Н] = _СуммаБюджет;
				мСтрокИ[0]["Сумма" + Н]       = _Сумма;
				мСтрокИ[0]["СуммаПрФакт" + Н] = _СуммаПрФакт;
				мСтрокИ[0]["СуммаФакт" + Н]   = _СуммаФакт;
				
			
			
			КонецЦикла;		
			
				мСтрокИ[0]["Факт1"]   = мСтрокИ[0]["Факт1"]   + оо["Факт1"];
				мСтрокИ[0]["Факт2"]   = мСтрокИ[0]["Факт2"]   + оо["Факт2"];
				мСтрокИ[0]["Факт3"]   = мСтрокИ[0]["Факт3"]   + оо["Факт3"];
		КонецЕсли;
	КонецЦикла;	
		
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнимИтоговуюТаблицуБезИтоговых(ТабЧитог, ТабЧ, Исключениие)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	ТабЧ = Объект[ТабЧ];
	
	
	//Для каждого сс из ТабЧитог цикл
	//		
	//		// Обнулим итоги сначала	
	//		Для Н = 1 По 12 Цикл
	//			сс["СуммаБюджет" + Н] = 0;
	//			сс["Сумма" + Н]       = 0;
	//			сс["СуммаПрФакт" + Н] = 0;
	//			сс["СуммаФакт" + Н]   = 0;
	//	   КонецЦикла;
	//
	//			сс["ГодовойБюджет"]     = 0;
	//			сс["ГодовойПрогноз"]    = 0;
	//			сс["ГодовойОтклонение"] = 0;
	//
	//			сс["БюджетМесяц"]       = 0;
	//			сс["ПрогнозМесяц"]      = 0;
	//			сс["ОтклоненияМесяц"]   = 0;
	//			
	//КонецЦикла;
				
				
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;
	
		ТЗ.Колонки.Добавить("Факт1");
		ТЗ.Колонки.Добавить("Факт2");
		ТЗ.Колонки.Добавить("Факт3");
	
	
	
	Для каждого сс из ТабЧ цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если сс.Итоговая тогда продолжить КонецЕсли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
				
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;	
	
	
		ТЗ.Колонки.Добавить("Факт1");
		ТЗ.Колонки.Добавить("Факт2");
		ТЗ.Колонки.Добавить("Факт3");
	
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки",сс.РодительИтогСтатьи));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПериодыКопированиемСервер(Прием,Источник)
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				Прием["СуммаБюджет" + Н] = Источник["СуммаБюджет" + Н] ;
				Прием["Сумма" + Н]       = Источник["Сумма" + Н]       ;
				Прием["СуммаПрФакт" + Н] = Источник["СуммаПрФакт" + Н] ;
				Прием["СуммаФакт" + Н]   = Источник["СуммаФакт" + Н]   ;

			КонецЦикла;	
			
				Прием["БюджетМесяц"]     = Источник["БюджетМесяц"] ;
				Прием["ПрогнозМесяц"]    = Источник["ПрогнозМесяц"] ;
				Прием["ОтклоненияМесяц"] = Источник["ОтклоненияМесяц"] ;
			
				Прием["ГодовойБюджет"]     = Источник["ГодовойБюджет"] ;
				Прием["ГодовойПрогноз"]    = Источник["ГодовойПрогноз"] ;
				Прием["ГодовойОтклонение"] = Источник["ГодовойОтклонение"] ;

КонецПроцедуры


&НаСервере
Процедура ЗаполнимРасшифровкуФАРМ_БОНУС_ТОВ_ИСГ(ТабОсн,ТабРасш)
	
		ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС");
			
		БезНДС_ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_безНДС");
				
		ФАРМ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС");
		
		ФАРМ_ТОВ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ");
		
		ФАРМ_ИСГ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ");
		
		ФАРМ_ПРЕМ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ");
		
		ФАРМ_ТРМ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ");
		
	
	
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		// ФАРМ заполнить БОНУС в расшифровках ФАРМ_БОНУС_1
		// Основные вкладки
		// С НДС
		мСтрок = Объект[ТабОсн].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ФАРМ_БОНУС_СтатьяОборотов));
		мСтрок1 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1"));
		мСтрок2 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС"));
		
		
		Если мСтрок1.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок1[0],мСтрок[0]);	
	    Конецесли;
	
		Если мСтрок2.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок2[0],мСтрок[0]);	
	    Конецесли;
	
		
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		// ФАРМ заполнить ТОВ в расшифровках ФАРМ_ТОВ_СтатьяОборотов
		// Основные вкладки
		// С НДС
		мСтрок = Объект[ТабОсн].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ФАРМ_ТОВ_СтатьяОборотов));
		мСтрок1 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1"));
		мСтрок2 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ"));
		
		
		Если мСтрок1.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок1[0],мСтрок[0]);	
		Конецесли;
		
		Если мСтрок2.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок2[0],мСтрок[0]);	
	    Конецесли;
		

		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		// ФАРМ заполнить ИСГ в расшифровках ФАРМ_ИСГ_СтатьяОборотов
		// Основные вкладки
		// С НДС
		мСтрок = Объект[ТабОсн].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ФАРМ_ИСГ_СтатьяОборотов));
		мСтрок1 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1"));
		мСтрок2 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ"));
		
	
		Если мСтрок1.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок1[0],мСтрок[0]);	
		Конецесли;
		
		Если мСтрок2.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок2[0],мСтрок[0]);	
	    Конецесли;
		
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		// ФАРМ заполнить ФАРМ_ПРЕМ в расшифровках ФАРМ_ПРЕМ_СтатьяОборотов
		// Основные вкладки
		// С НДС
		мСтрок = Объект[ТабОсн].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ФАРМ_ПРЕМ_СтатьяОборотов));
		мСтрок1 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
		мСтрок2 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ"));
		
	
		Если мСтрок1.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок1[0],мСтрок[0]);	
		Конецесли;
		
		Если мСтрок2.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок2[0],мСтрок[0]);	
	    Конецесли;
		
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		///////////////////////////////////////////////////////////////////////////////////////////////////////
		// ФАРМ заполнить ФАРМ_ТРМ в расшифровках ФАРМ_ТРМ_СтатьяОборотов
		// Основные вкладки
		// С НДС
		мСтрок = Объект[ТабОсн].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ФАРМ_ТРМ_СтатьяОборотов));
		мСтрок1 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1"));
		мСтрок2 = Объект[ТабРасш].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ"));
		
	
		Если мСтрок1.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок1[0],мСтрок[0]);	
		Конецесли;
		
		Если мСтрок2.Количество() > 0 тогда	
		ЗаполнитьПериодыКопированиемСервер(мСтрок2[0],мСтрок[0]);	
	    Конецесли;
		
		
		
КонецПроцедуры



&НаСервере
Процедура ЗаполнимИтоговуюТаблицуБезФакта(_ТабЧитог, _ТабЧ, Исключениие)
	
	
	
	
	ТабЧитог = Объект[_ТабЧитог];
	ТабЧ     = Объект[_ТабЧ];
	
	
	//Для каждого сс из ТабЧитог цикл
	//		
	//		// Обнулим итоги сначала	
	//		Для Н = 1 По 12 Цикл
	//			сс["СуммаБюджет" + Н] = 0;
	//			сс["Сумма" + Н]       = 0;
	//			сс["СуммаПрФакт" + Н] = 0;
	//			сс["СуммаФакт" + Н]   = 0;
	//	   КонецЦикла;
	//
	//			сс["ГодовойБюджет"]     = 0;
	//			сс["ГодовойПрогноз"]    = 0;
	//			сс["ГодовойОтклонение"] = 0;
	//
	//			сс["БюджетМесяц"]       = 0;
	//			сс["ПрогнозМесяц"]      = 0;
	//			сс["ОтклоненияМесяц"]   = 0;
	//			
	//КонецЦикла;
				
				
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;
	
		//ТЗ.Колонки.Добавить("Факт1");
		//ТЗ.Колонки.Добавить("Факт2");
		//ТЗ.Колонки.Добавить("Факт3");
	
	
	
	Для каждого сс из ТабЧ цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		// Индустриальный
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи  = "ИНД_БОНУС" 
			И _ТабЧитог = "СоставБюджета7"
			тогда
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ИНД_БОНУС_1"));
		КонецЕсли;	
		
		// ФАРМ
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи  = "ФАРМ_БОНУС" 
			И _ТабЧитог = "СоставБюджета7"
			тогда
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1"));
		КонецЕсли;	
		
		// МТ
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи  = "МТ_БОНУС" 
			И _ТабЧитог = "СоставБюджета7"
			тогда
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_БОНУС_1"));
	   КонецЕсли;	
	
	
	
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				//мСтрок[0]["Факт1"] = 0;
				//мСтрок[0]["Факт2"] = 0;
				//мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;	
			
				//мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				//мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				//мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
				
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
    ТЗ.Колонки.Добавить("Итоговая");

	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;	
	
	
		//ТЗ.Колонки.Добавить("Факт1");
		//ТЗ.Колонки.Добавить("Факт2");
		//ТЗ.Колонки.Добавить("Факт3");
	
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи,Итоговая",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки,Итоговая",сс.РодительИтогСтатьи,Истина));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				//мСтрок[0]["Факт1"] = 0;
				//мСтрок[0]["Факт2"] = 0;
				//мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;	
			
				//мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				//мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				//мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры




&НаСервере
Процедура ЗаполнимИтоговуюТаблицуРасшифровкаДок(док,ТабЧитог, ТабЧ, Исключениие)
	
	
	
	
	ТабЧитог = док[ТабЧитог];
	ТабЧ = док[ТабЧ];
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;		
	
	Для каждого сс из ТабЧ цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если сс.Итоговая тогда 
			
			// Обнулим итоговую	
			Для Н = 1 По 12 Цикл
				сс["СуммаБюджет" + Н] = 0;
				сс["Сумма" + Н]       = 0;
				сс["СуммаПрФакт" + Н] = 0;
				сс["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
		конецесли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		Если ТипЗнч(стр.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
			стр.СтатьяОборотовПоБюджетам = стр.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;	
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки",сс.РодительИтогСтатьи));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимИтоговуюТаблицуРасшифровка(ТабЧитог, ТабЧ, Исключениие)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	ТабЧ = Объект[ТабЧ];
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;		
	
	Для каждого сс из ТабЧ цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если сс.Итоговая тогда 
			
			// Обнулим итоговую	
			Для Н = 1 По 12 Цикл
				сс["СуммаБюджет" + Н] = 0;
				сс["Сумма" + Н]       = 0;
				сс["СуммаПрФакт" + Н] = 0;
				сс["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
		конецесли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		Если ТипЗнч(стр.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
			стр.СтатьяОборотовПоБюджетам = стр.СтатьяОборотовПоБюджетам.СтатьяОборотов;
			
		ИначеЕсли ТипЗнч(стр.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			стр.СтатьяОборотовПоБюджетам = стр.СтатьяОборотовПоБюджетам;
			
		КонецЕсли;	
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки",сс.РодительИтогСтатьи));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимИтоговуюТаблицуРасшифровкаЭксплуатация(ТабЧитог, ТабЧ, Исключениие)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	ТабЧ = Объект[ТабЧ];
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;		
	
	Для каждого сс из ТабЧ цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ сс.Итоговая тогда 
			
			продолжить;
			
			//// Обнулим итоговую	
			//Для Н = 1 По 12 Цикл
			//	сс["СуммаБюджет" + Н] = 0;
			//	сс["Сумма" + Н]       = 0;
			//	сс["СуммаПрФакт" + Н] = 0;
			//	сс["СуммаФакт" + Н]   = 0;
			//	
			//	//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
			//	
			//КонецЦикла;		
			
			
		конецесли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		Если ТипЗнч(стр.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
			стр.СтатьяОборотовПоБюджетам = стр.СтатьяОборотовПоБюджетам.СтатьяОборотов;
			
		ИначеЕсли ТипЗнч(стр.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			стр.СтатьяОборотовПоБюджетам = стр.СтатьяОборотовПоБюджетам;
			
		КонецЕсли;	
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки",сс.РодительИтогСтатьи));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаСервере
Функция НетПодчиненных(сс,ТабЧитог)
	Флаг = Ложь;
	                                                           
	мДанные = Объект[ТабЧитог].НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",сс.ИндексСтатьи,Ложь));
	//Если мДанные.Количество() = 0 и ?(сс.ИндексСтатьи = 1,сс.РодительИтогСтатьи = 0,сс.РодительИтогСтатьи > 0) И сс.Итоговая тогда
	Если мДанные.Количество() = 0 и сс.РодительИтогСтатьи > 0 И сс.Итоговая тогда
	Флаг = Истина;
	КонецЕсли;
	
	возврат Флаг
	
КонецФункции	


 &НаСервере
 Процедура ЗаполнимТаблицуСерверСуммированиемВсех(ТабЧитог, ТабЧ, ПервыйПроход,ТЗ_РодНетПодчиненных)
	 
	 
	 ТЗ = Новый ТаблицаЗначений;
	 ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	 
	 Для Н = 1 По 12 Цикл
		 ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		 ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		 ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		 ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		 
		 //ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		 
	 КонецЦикла;	
	 
	 Для Н = 1 По 3 Цикл
		 ТЗ.Колонки.Добавить("Факт" + Строка(Н));
	 КонецЦикла;	
	 
	 Если ПервыйПроход тогда
		 ТабЧ = Объект[ТабЧитог];
	 КонецЕсли;
	 
		 Если ПервыйПроход тогда
			 ТЗ_РодНетПодчиненных = ТабЧ.Выгрузить();
			 ТЗ_РодНетПодчиненных.Очистить();
	     КонецЕсли;
	 
	 
	 Для каждого сс из ТабЧ цикл
		 стр = ТЗ.Добавить();
		 Если ПервыйПроход тогда
			 Если НетПодчиненных(сс,ТабЧитог) тогда
				 лл = ТЗ_РодНетПодчиненных.Добавить();
		         ЗаполнитьЗначенияСвойств(лл,сс);
			 КонецЕсли;	 
			 Если сс.Итоговая тогда продолжить конецЕсли; 
		 конецЕсли; 	 
		 ЗаполнитьЗначенияСвойств(стр,сс);
		 
		 
		 //Нет подчиненных
		 Если НЕ ПервыйПроход тогда
	    	 нДанные = ТЗ_РодНетПодчиненных.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
	    	 Если нДанные.Количество() > 0 тогда
	    		 
	    		 стр1 = ТЗ.Добавить();
	    		 ЗаполнитьЗначенияСвойств(стр1,нДанные[0]);
	    		 нДанные[0].Итоговая = Ложь; // берем один раз
	    	 КонецЕсли;	
			 
			 
		 конецЕсли; 	 
	 КонецЦикла;
	 
	 
	 Если  ТЗ.Количество() > 0 тогда
		 ЗаполнимТаблицуСерверСуммированиемВсех_(ТабЧитог,ТабЧ,ТЗ);
	 КонецЕсли;
	 
	 
	 
	 //Если  Данные[0].РодительИтогСтатьи > 0 тогда
	 //	ЗаполнимТаблицуСерверСуммированиемВсех_(ТабЧитог,ТЗ);
	 //КонецЕсли;
	 
	 //промТЗ = ТЗ.СкопироватьКолонки();
	 //Для каждого гг из ТЗ цикл
	 //   	 гДанные = Объект[ТабЧитог].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",гг.РодительИтогСтатьи,Истина));
	 //   	 Если гДанные.Количество() > 0 тогда
	 //   		 
	 //   		 стр1 = ТЗ1.Добавить();
	 //   		 ЗаполнитьЗначенияСвойств(стр1,мДанные[0]);
	 //   		 
	 //   	 КонецЕсли;	
	 //	
	 //	
	 //	дд = промТЗ.Добавить();
	 //
	 //КонецЦикла;
	 
	 
	 мРод = ТЗ.ВыгрузитьКолонку("РодительИтогСтатьи");
	 Если мРод.Количество() > 0 тогда
		 
		 ТЗ1 = Новый ТаблицаЗначений;
		 ТЗ1.Колонки.Добавить("РодительИтогСтатьи");
		 Для Н = 1 По 12 Цикл
			 ТЗ1.Колонки.Добавить("СуммаБюджет" + Строка(Н));
			 ТЗ1.Колонки.Добавить("Сумма" + Строка(Н));
			 ТЗ1.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
			 ТЗ1.Колонки.Добавить("СуммаФакт" + Строка(Н));
			 
			 //ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
			 
		 КонецЦикла;	
		 
		 Для Н = 1 По 3 Цикл
			 ТЗ1.Колонки.Добавить("Факт" + Строка(Н));
		 КонецЦикла;	
		 
		 Для каждого оо из мРод цикл
			 Если оо = неопределено тогда продолжить конецесли;
			 мДанные = Объект[ТабЧитог].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",оо,Истина));
			 Если мДанные.Количество() > 0 тогда
				 
				 стр1 = ТЗ1.Добавить();
				 ЗаполнитьЗначенияСвойств(стр1,мДанные[0]);
				 
			 КонецЕсли;	
		 КонецЦикла;
		 
		 //Данные = ТабЧитог.НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",мДанных,Истина));
		 Если ТЗ1.Количество() > 0 тогда
			 ЗаполнимТаблицуСерверСуммированиемВсех(ТабЧитог,ТЗ1,Ложь,ТЗ_РодНетПодчиненных);	
		 КонецЕсли;	
		 
		 
		 /////////////////////////////////////////////////////////////////////
		 // Начало Заключительный этап строка 1
		 // Итоговая 1 без Родителя
		 
		 
		 
		 ТЗ1 = Новый ТаблицаЗначений;
		 ТЗ1.Колонки.Добавить("РодительИтогСтатьи");
		 Для Н = 1 По 12 Цикл
			 ТЗ1.Колонки.Добавить("СуммаБюджет" + Строка(Н));
			 ТЗ1.Колонки.Добавить("Сумма" + Строка(Н));
			 ТЗ1.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
			 ТЗ1.Колонки.Добавить("СуммаФакт" + Строка(Н));
			 
			 //ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
			 
		 КонецЦикла;	
		 
		 Для Н = 1 По 3 Цикл
			 ТЗ1.Колонки.Добавить("Факт" + Строка(Н));
		 КонецЦикла;	
		 
			 мДанные = Объект[ТабЧитог].НайтиСтроки(Новый Структура("РодительИтогСтатьи",1));
			 //Если мДанные.Количество() > 0 тогда
			 Для каждого лл из мДанные цикл	 
				 стр1 = ТЗ1.Добавить();
				 ЗаполнитьЗначенияСвойств(стр1,лл);
				 
			 //КонецЕсли;	
			 КонецЦикла;	
			 
	ТЗ1.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	|Факт1,Факт2,Факт3
	|");
			 
			 
		 
		     иДанные = Объект[ТабЧитог].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",1,Истина));
			 
			 Если ТЗ1.Количество() > 0 и иДанные.Количество() > 0 тогда 
			// Заполнение	
			Для Н = 1 По 12 Цикл
				иДанные[0]["СуммаБюджет" + Н] =  ТЗ1[0]["СуммаБюджет" + Н];
				иДанные[0]["Сумма" + Н]       =  ТЗ1[0]["Сумма" + Н];
				иДанные[0]["СуммаПрФакт" + Н] =  ТЗ1[0]["СуммаПрФакт" + Н];
				иДанные[0]["СуммаФакт" + Н]   =  ТЗ1[0]["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
			Для Н = 1 По 3 Цикл
				иДанные[0]["Факт" + Н]        =  ТЗ1[0]["Факт" + Н];
			КонецЦикла;	
				  
				  
				  
			 КонецЕсли;
		 //Если ТЗ1.Количество() > 0 тогда
		 //	ЗаполнимТаблицуСерверСуммированиемВсех(ТабЧитог,ТЗ1,Ложь,ТЗ_РодНетПодчиненных);	
		 //КонецЕсли;	
		 
		 
		 // конец Заключительный этап строка 1
		 /////////////////////////////////////////////////////////////////////
		 
		 
	 Конецесли;
	 
	 //Данные = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",Данные[0].РодительИтогСтатьи,Истина));
	 //Если Данные.Количество() > 0 тогда
	 //ЗаполнимТаблицуСерверСуммированиемВсех(ТабЧ);	
	 //КонецЕсли;	
	
КонецПроцедуры	


&НаСервере
Процедура ЗаполнимТаблицуСерверСуммированиемВсех_(ТабЧитог,ТабЧ,ТЗ)
	
	_ТабЧитог = Объект[ТабЧитог];
	
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|,Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = _ТабЧитог.НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
		
		//мРод = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//////Есть родитель у род строки пример ФОТ
		////мД = Объект[ТабЧ].НайтиСтроки(Новый Структура("НомерСтроки",ТекДанные.РодительИтогСтатьи));
		//Если мРод.Количество() > 0 тогда
		//	//Если  мРод[0].РодительИтогСтатьи > 0 тогда
		//	//	мПроссумируемЕксельРод(ТабЧ,ТекКолонка,мРод[0],Ложь);
		//	//КонецЕсли;
		//	СуммированиеИтоговых(ТабЧ,ТекКолонка,мРод);
		//КонецЕсли;
		//////////////////////////////////////////
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			Для Н = 1 По 3 Цикл
				мСтрок[0]["Факт" + Н]   = 0;
			КонецЦикла;	
			
			
			
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
			Для Н = 1 По 3 Цикл
				мСтрок[0]["Факт" + Н]   = мСтрок[0]["Факт" + Н] + сс["Факт" + Н];
			КонецЦикла;	
			
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры




&НаСервере
Процедура ЗаполнимТаблицуСерверРасшифровкаГруппировкиИндекс(ТабЧитог)
	
	ТабЧитог = Объект[ТабЧитог];
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;	
	
	Для Н = 1 По 3 Цикл
		ТЗ.Колонки.Добавить("Факт" + Строка(Н));
	КонецЦикла;	
	
	
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		Если сс.Итоговая тогда продолжить конецЕсли; 
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|,Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
		
		//мРод = Объект[ТабЧ].НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",ТекДанные.РодительИтогСтатьи,Истина));
		//////Есть родитель у род строки пример ФОТ
		////мД = Объект[ТабЧ].НайтиСтроки(Новый Структура("НомерСтроки",ТекДанные.РодительИтогСтатьи));
		//Если мРод.Количество() > 0 тогда
		//	//Если  мРод[0].РодительИтогСтатьи > 0 тогда
		//	//	мПроссумируемЕксельРод(ТабЧ,ТекКолонка,мРод[0],Ложь);
		//	//КонецЕсли;
		//	СуммированиеИтоговых(ТабЧ,ТекКолонка,мРод);
		//КонецЕсли;
		//////////////////////////////////////////
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			Для Н = 1 По 3 Цикл
				мСтрок[0]["Факт" + Н]   = 0;
			КонецЦикла;	
			
			
			
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
			Для Н = 1 По 3 Цикл
				мСтрок[0]["Факт" + Н]   = мСтрок[0]["Факт" + Н] + сс["Факт" + Н];
			КонецЦикла;	
			
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимТаблицуСерверРасшифровкаГруппировки(ТабЧитог)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	//ТабЧ = док[ТабЧитог];
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	//Для Н = 1 По 12 Цикл
	//	ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
	//	ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
	//	ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
	//	ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
	//	
	//	//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	//КонецЦикла;		
	
	//Для каждого сс из ТабЧ цикл
	//	
	//	
	//	Если сс.Итоговая тогда 
	//		
	//		// Обнулим итоговую	
	//		Для Н = 1 По 12 Цикл
	//			сс["СуммаБюджет" + Н] = 0;
	//			сс["Сумма" + Н]       = 0;
	//			сс["СуммаПрФакт" + Н] = 0;
	//			сс["СуммаФакт" + Н]   = 0;
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
	//			
	//		КонецЦикла;		
	//		
	//		
	//	конецесли;
	//	
	//	стр = ТЗ.Добавить();
	//	ЗаполнитьЗначенияСвойств(стр,сс);
	//	
	//	Если ТипЗнч(стр.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
	//		 стр.СтатьяОборотовПоБюджетам = стр.СтатьяОборотовПоБюджетам.СтатьяОборотов;
	//	КонецЕсли;	
	//	
	//	//// 	("ФАРМ_ТО_без НДС");
	//	////  	("МТ_ТО_без НДС");
	//	//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
	//	//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
	//	//	Для Н = 1 По 12 Цикл
	//	//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
	//	//	КонецЦикла;		
	//	//КонецЕсли;	  
	//	
	//КонецЦикла;
	
	//ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	//"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	//|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	//|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	//|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	////|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|");
	//
	//Для каждого сс из ТЗ цикл
	//	
	//	мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
	//	
	//	
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		
	//		// Обнулим итоги сначала	
	//		Для Н = 1 По 12 Цикл
	//			мСтрок[0]["СуммаБюджет" + Н] = 0;
	//			мСтрок[0]["Сумма" + Н]       = 0;
	//			мСтрок[0]["СуммаПрФакт" + Н] = 0;
	//			мСтрок[0]["СуммаФакт" + Н]   = 0;
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
	//			
	//		КонецЦикла;		
	//		
	//		
	//		// Заполнение	
	//		Для Н = 1 По 12 Цикл
	//			мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
	//			мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
	//			мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
	//			мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
	//			
	//		КонецЦикла;		
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	//
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		Если сс.Итоговая тогда продолжить конецЕсли; 
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнимТаблицуСерверРасшифровкаГруппировкиКлиент(ТабЧитог)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	
	
	мРодительИтогСтатьи = Новый Массив;
	Для каждого гг из ТабЧитог цикл
		Если гг.РодительИтогСтатьи > 0 тогда
		мРодительИтогСтатьи.Добавить(гг.РодительИтогСтатьи);	
		КонецЕсли;
	КонецЦикла;
	мРодительИтогСтатьиУ = Новый Массив;
	Для каждого гг из мРодительИтогСтатьи цикл
		Если мРодительИтогСтатьиУ.Найти(гг) = неопределено тогда
		мРодительИтогСтатьиУ.Добавить(гг);	
		КонецЕсли;
	КонецЦикла;
	
	
	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	
	
	//Для каждого сс из ТабЧитог цикл
	//	стр = ТЗ.Добавить();
	//	Если сс.Итоговая тогда продолжить конецЕсли; 
	//	ЗаполнитьЗначенияСвойств(стр,сс);
	//КонецЦикла;
	//
	//ТЗ.Свернуть("РодительИтогСтатьи",
	//"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	//|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	//|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	//|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	////|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|");
	
	
	
	Для каждого оо из мРодительИтогСтатьиУ цикл
	
	
		мСтрокИ   = ТабЧитог.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",оо,Истина));
		мСтрокСтр = ТабЧитог.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",оо,Ложь));
		
		
		Если мСтрокИ.Количество() > 0 И мСтрокСтр.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрокИ[0]["СуммаБюджет" + Н] = 0;
				мСтрокИ[0]["Сумма" + Н]       = 0;
				мСтрокИ[0]["СуммаПрФакт" + Н] = 0;
				мСтрокИ[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
			    Для каждого оо из мСтрокСтр Цикл
				
				
				мСтрокИ[0]["СуммаБюджет" + Н] = мСтрокИ[0]["СуммаБюджет" + Н] + оо["СуммаБюджет" + Н];
				мСтрокИ[0]["Сумма" + Н]       = мСтрокИ[0]["Сумма" + Н]       + оо["Сумма" + Н];
				мСтрокИ[0]["СуммаПрФакт" + Н] = мСтрокИ[0]["СуммаПрФакт" + Н] + оо["СуммаПрФакт" + Н];
				мСтрокИ[0]["СуммаФакт" + Н]   = мСтрокИ[0]["СуммаФакт" + Н]   + оо["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			    КонецЦикла;			
			КонецЦикла;		
			
		КонецЕсли;
		
		
		
		
		
		
	
	КонецЦикла;	
		
		
	
	
	//Для каждого сс из ТЗ цикл
	//	
	//	мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		
	//		// Обнулим итоги сначала	
	//		Для Н = 1 По 12 Цикл
	//			мСтрок[0]["СуммаБюджет" + Н] = 0;
	//			мСтрок[0]["Сумма" + Н]       = 0;
	//			мСтрок[0]["СуммаПрФакт" + Н] = 0;
	//			мСтрок[0]["СуммаФакт" + Н]   = 0;
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
	//			
	//		КонецЦикла;		
	//		
	//		
	//		// Заполнение	
	//		Для Н = 1 По 12 Цикл
	//			мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
	//			мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
	//			мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
	//			мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
	//		КонецЦикла;		
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнимТаблицуСерверРасшифровкаГруппировкиКлиентИндекс(ТабЧитог)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	
	
	мРодительИтогСтатьи = Новый Массив;
	Для каждого гг из ТабЧитог цикл
		Если гг.РодительИтогСтатьи > 0 тогда
		мРодительИтогСтатьи.Добавить(гг.РодительИтогСтатьи);	
		КонецЕсли;
	КонецЦикла;
	мРодительИтогСтатьиУ = Новый Массив;
	Для каждого гг из мРодительИтогСтатьи цикл
		Если мРодительИтогСтатьиУ.Найти(гг) = неопределено тогда
		мРодительИтогСтатьиУ.Добавить(гг);	
		КонецЕсли;
	КонецЦикла;
	
	
	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	     ТЗ.Колонки.Добавить("БюджетМесяц");
		 ТЗ.Колонки.Добавить("ПрогнозМесяц");
		 ТЗ.Колонки.Добавить("ОтклоненияМесяц");
		 
	     ТЗ.Колонки.Добавить("ГодовойБюджет");
		 ТЗ.Колонки.Добавить("ГодовойПрогноз");
		 ТЗ.Колонки.Добавить("ГодовойОтклонение");
	
	//Для каждого сс из ТабЧитог цикл
	//	стр = ТЗ.Добавить();
	//	Если сс.Итоговая тогда продолжить конецЕсли; 
	//	ЗаполнитьЗначенияСвойств(стр,сс);
	//КонецЦикла;
	//
	//ТЗ.Свернуть("РодительИтогСтатьи",
	//"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	//|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	//|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	//|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	////|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|");
	
	
	
	Для каждого оо из мРодительИтогСтатьиУ цикл
	
	
		мСтрокИ   = ТабЧитог.НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",оо,Истина));
		мСтрокСтр = ТабЧитог.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",оо,Ложь));
		
		
		Если мСтрокИ.Количество() > 0 И мСтрокСтр.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрокИ[0]["СуммаБюджет" + Н] = 0;
				мСтрокИ[0]["Сумма" + Н]       = 0;
				мСтрокИ[0]["СуммаПрФакт" + Н] = 0;
				мСтрокИ[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрокИ[0]["БюджетМесяц"] = 0;
				мСтрокИ[0]["ПрогнозМесяц"] = 0;
				мСтрокИ[0]["ОтклоненияМесяц"] = 0;
				
				мСтрокИ[0]["ГодовойБюджет"] = 0;
				мСтрокИ[0]["ГодовойПрогноз"] = 0;
				мСтрокИ[0]["ГодовойОтклонение"] = 0;
			
			
			
			
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
			    Для каждого оо из мСтрокСтр Цикл
				
				
				мСтрокИ[0]["СуммаБюджет" + Н] = мСтрокИ[0]["СуммаБюджет" + Н] + оо["СуммаБюджет" + Н];
				мСтрокИ[0]["Сумма" + Н]       = мСтрокИ[0]["Сумма" + Н]       + оо["Сумма" + Н];
				мСтрокИ[0]["СуммаПрФакт" + Н] = мСтрокИ[0]["СуммаПрФакт" + Н] + оо["СуммаПрФакт" + Н];
				мСтрокИ[0]["СуммаФакт" + Н]   = мСтрокИ[0]["СуммаФакт" + Н]   + оо["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			    КонецЦикла;			
			КонецЦикла;		
			
			Для каждого оо из мСтрокСтр Цикл
				мСтрокИ[0]["БюджетМесяц"] = мСтрокИ[0]["БюджетМесяц"] + оо["БюджетМесяц"];
				мСтрокИ[0]["ПрогнозМесяц"] = мСтрокИ[0]["ПрогнозМесяц"] + оо["ПрогнозМесяц"];
				мСтрокИ[0]["ОтклоненияМесяц"] = мСтрокИ[0]["ОтклоненияМесяц"] + оо["ОтклоненияМесяц"];
				
				
				мСтрокИ[0]["ГодовойБюджет"] = мСтрокИ[0]["ГодовойБюджет"] + оо["ГодовойБюджет"];
				мСтрокИ[0]["ГодовойПрогноз"] = мСтрокИ[0]["ГодовойПрогноз"] + оо["ГодовойПрогноз"];
				мСтрокИ[0]["ГодовойОтклонение"] = мСтрокИ[0]["ГодовойОтклонение"] + оо["ГодовойОтклонение"];
			КонецЦикла;			
				
		КонецЕсли;
		
		
		
		
		
		
	
	КонецЦикла;	
		
		
	
	
	//Для каждого сс из ТЗ цикл
	//	
	//	мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		
	//		// Обнулим итоги сначала	
	//		Для Н = 1 По 12 Цикл
	//			мСтрок[0]["СуммаБюджет" + Н] = 0;
	//			мСтрок[0]["Сумма" + Н]       = 0;
	//			мСтрок[0]["СуммаПрФакт" + Н] = 0;
	//			мСтрок[0]["СуммаФакт" + Н]   = 0;
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
	//			
	//		КонецЦикла;		
	//		
	//		
	//		// Заполнение	
	//		Для Н = 1 По 12 Цикл
	//			мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
	//			мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
	//			мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
	//			мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
	//			
	//			//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
	//		КонецЦикла;		
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнимТаблицуБезНДС(Таб,Исключениие)
	
	
	Таб = Объект[Таб];
	
	
	Для каждого сс из Объект.СоставБюджета цикл
		
		Если НЕ Исключениие  тогда
			Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровкуБезНДС(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		мСтрок = Таб.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", сс.СтатьяОборотовПоБюджетам));
		Если мСтрок.Количество() > 0 тогда
			 РодительИтогСтатьи = мСтрок[0].РодительИтогСтатьи;
			 ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
			 мСтрок[0].РодительИтогСтатьи = РодительИтогСтатьи;
		КонецЕсли;
		
		
		
		//Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		//Для Н = 1 По 12 Цикл
		//	Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
		//	План     = План          + сс["Сумма" + Н];
		//	ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
		//	Факт     = Факт          + сс["СуммаФакт" + Н];
		//	
		//	ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		//КонецЦикла;		
		//
		//сс.ГодовойБюджет  = Бюджет;
		//сс.ГодовойПрогноз = ГодовойПрогноз;
		//сс.ГодовойОтклонение = Бюджет - ГодовойПрогноз;
		//
		//
		////Отчетный период
		//Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		//пМесяц = Месяц(Объект.Дата);
		//Для Н = 1 По пМесяц Цикл
		//	Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
		//	План     = План          + сс["Сумма" + Н];
		//	ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
		//	Факт     = Факт          + сс["СуммаФакт" + Н];
		//	
		//	ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		//КонецЦикла;	
		//
		//сс.БюджетМесяц  = Бюджет;
		//сс.ПрогнозМесяц = ГодовойПрогноз;
		//сс.ОтклоненияМесяц = Бюджет - ГодовойПрогноз;
		
		
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнимИтоговуюТаблицуБезКода(ТабЧ, Исключениие)
	
	
	
	
	//ТабЧитог = Об1Док[ТабЧитог];
	ТабЧ = Объект[ТабЧ];
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	
	ТЗ.Колонки.Добавить("Факт1");
	ТЗ.Колонки.Добавить("Факт2");
	ТЗ.Колонки.Добавить("Факт3");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	Для каждого сс из ТабЧ цикл
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		//мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("НомерСтроки",сс.РодительИтогСтатьи));
		// проверить !
		мСтрок = ТабЧ.НайтиСтроки(Новый Структура("ИндексСтатьи",сс.РодительИтогСтатьи));

		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала
			мСтрок[0]["Факт1"] = 0;
			мСтрок[0]["Факт2"] = 0;
			мСтрок[0]["Факт3"] = 0;
			
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение
			мСтрок[0]["Факт1"] = сс["Факт1"];
			мСтрок[0]["Факт2"] = сс["Факт2"];
			мСтрок[0]["Факт3"] = сс["Факт3"];
			
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнимТаблицуСервер(Таб,Исключениие)
	
	
	Таб = Объект[Таб];
	
    пМесяц = Месяц(Объект.Дата);

	Для каждого сс из Таб цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		Для Н = 1 По 12 Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			//ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		
		сс.ГодовойБюджет      = Бюджет;
		сс.ГодовойПрогноз     = 0;
		сс.ГодовойОтклонение  = 0;
		сс.БюджетМесяц        = 0;
		сс.ПрогнозМесяц       = 0;
		сс.ОтклоненияМесяц    = 0;
		
	    Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда продолжить конецЕсли; 
		
		
		
		Для Н = 1 По пМесяц Цикл
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["СуммаПрФакт" + Н]);
		КонецЦикла;	
		
		Для Н = пМесяц + 1 По 12 Цикл
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаПрФакт" + Н] > 0,сс["СуммаПрФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		
		
		
		сс.ГодовойПрогноз = ГодовойПрогноз;
		сс.ГодовойОтклонение = Бюджет - ГодовойПрогноз;
		
		//Отчетный период
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		//пМесяц = Месяц(Объект.Дата);
		Для Н = 1 По пМесяц Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["СуммаПрФакт" + Н]);
		КонецЦикла;	
		
		сс.БюджетМесяц  = Бюджет;
		сс.ПрогнозМесяц = ГодовойПрогноз;
		сс.ОтклоненияМесяц = Бюджет - ГодовойПрогноз;
		
		
		
	КонецЦикла;
	
КонецПроцедуры	




&НаКлиенте
Процедура ЗаполнимТаблицуКлиент(Таб,Исключениие)
	
	
	Таб = Объект[Таб];
	
    пМесяц = Месяц(Объект.Дата);

	Для каждого сс из Таб цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		Для Н = 1 По 12 Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			//ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		
		сс.ГодовойБюджет      = Бюджет;
		сс.ГодовойПрогноз     = 0;
		сс.ГодовойОтклонение  = 0;
		сс.БюджетМесяц        = 0;
		сс.ПрогнозМесяц       = 0;
		сс.ОтклоненияМесяц    = 0;
		
	    Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда продолжить конецЕсли; 
		
		
		
		Для Н = 1 По пМесяц Цикл
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["СуммаПрФакт" + Н]);
		КонецЦикла;	
		
		Для Н = пМесяц + 1 По 12 Цикл
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаПрФакт" + Н] > 0,сс["СуммаПрФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		
		
		
		сс.ГодовойПрогноз = ГодовойПрогноз;
		сс.ГодовойОтклонение = Бюджет - ГодовойПрогноз;
		
		//Отчетный период
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		//пМесяц = Месяц(Объект.Дата);
		Для Н = 1 По пМесяц Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["СуммаПрФакт" + Н]);
		КонецЦикла;	
		
		сс.БюджетМесяц  = Бюджет;
		сс.ПрогнозМесяц = ГодовойПрогноз;
		сс.ОтклоненияМесяц = Бюджет - ГодовойПрогноз;
		
		
		
	КонецЦикла;
	
КонецПроцедуры	




&НаСервере
Процедура ЗаполнимТаблицуСерверДок(док,Таб,Исключениие)
	
	
	Таб = док[Таб];
	
	
	Для каждого сс из Таб цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		
		
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		
		сс.ГодовойБюджет      = Бюджет;
		сс.ГодовойПрогноз     = 0;
		сс.ГодовойОтклонение  = 0;
		сс.БюджетМесяц        = 0;
		сс.ПрогнозМесяц       = 0;
		сс.ОтклоненияМесяц    = 0;
		
		
	    Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда продолжить конецЕсли; 
		
		
		Для Н = 1 По 12 Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;		
		
		сс.ГодовойПрогноз = ГодовойПрогноз;
		сс.ГодовойОтклонение = Бюджет - ГодовойПрогноз;
		
		//Отчетный период
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		пМесяц = Месяц(Объект.Дата);
		Для Н = 1 По пМесяц Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		сс.БюджетМесяц  = Бюджет;
		сс.ПрогнозМесяц = ГодовойПрогноз;
		сс.ОтклоненияМесяц = Бюджет - ГодовойПрогноз;
		
		
		
	КонецЦикла;
	
КонецПроцедуры	




&НаСервере
Процедура ЗаполнимТаблицуСерверРасшифровка(док,Таб,Исключениие)
	
	
	Таб = док[Таб];
	
	
	Для каждого сс из Таб цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		
		сс.ГодовойБюджет      = Бюджет;
		сс.ГодовойПрогноз     = 0;
		сс.ГодовойОтклонение  = 0;
		сс.БюджетМесяц        = 0;
		сс.ПрогнозМесяц       = 0;
		сс.ОтклоненияМесяц    = 0;
		
		Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда продолжить конецЕсли; 
		
		
		Для Н = 1 По 12 Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;		
		
		сс.ГодовойПрогноз = ГодовойПрогноз;
		сс.ГодовойОтклонение = Бюджет - ГодовойПрогноз;
		
		//Отчетный период
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		пМесяц = Месяц(Объект.Дата);
		Для Н = 1 По пМесяц Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		сс.БюджетМесяц  = Бюджет;
		сс.ПрогнозМесяц = ГодовойПрогноз;
		сс.ОтклоненияМесяц = Бюджет - ГодовойПрогноз;
		
		
		
	КонецЦикла;
	
КонецПроцедуры	



&НаКлиенте
Процедура ЗаполнимРодительскуюТаблицуПоИндексу(Таб,ТекКолонка,ИндексСтатьи,ТекЗначение)
	
	
	ТабЧ = Объект[Таб];
	
	
	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("ИндексСтатьи",ИндексСтатьи));
	
	//Если мСтрок.Количество() = 0 тогда
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	//КонецЕсли;
	
	
	
	
	Если мСтрок.Количество() > 0 тогда
		 Дельта = ?(мСтрок[0][ТекКолонка] > 0,absКлиент(ТекЗначение - мСтрок[0][ТекКолонка]),ТекЗначение); // 032,80%
		//Дельта = ТекЗначение;
		//Если мСтрок[0][ТекКолонка] > 0 тогда
		//Дельта = abs(ТекЗначение - мСтрок[0][ТекКолонка]);
		//КонецЕсли;	
		
		Если мСтрок[0][ТекКолонка] > ТекЗначение тогда
			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
		иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначение тогда
			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
		Конецесли;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнимРодительскуюТаблицу(Таб,ТекКолонка,СтатьяОборотов,ТекЗначение)
	
	
	ТабЧ = Объект[Таб];
	
	
	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	
	Если мСтрок.Количество() = 0 тогда
	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	КонецЕсли;
	
	
	
	
	Если мСтрок.Количество() > 0 тогда
		 Дельта = ?(мСтрок[0][ТекКолонка] > 0,absКлиент(ТекЗначение - мСтрок[0][ТекКолонка]),ТекЗначение); // 032,80%
		//Дельта = ТекЗначение;
		//Если мСтрок[0][ТекКолонка] > 0 тогда
		//Дельта = abs(ТекЗначение - мСтрок[0][ТекКолонка]);
		//КонецЕсли;	
		
		Если мСтрок[0][ТекКолонка] > ТекЗначение тогда
			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
		иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначение тогда
			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
		Конецесли;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнимРодительскуюТаблицуКодСтатьи(Таб,ТекКолонка,абс_КодБюджетнойСтатьи,ТекЗначение)
	
	
	ТабЧ = Объект[Таб];
	
		
	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",абс_КодБюджетнойСтатьи));
	
		
	Если мСтрок.Количество() > 0 тогда
		Дельта = ?(мСтрок[0][ТекКолонка] > 0,absКлиент(ТекЗначение - мСтрок[0][ТекКолонка]),ТекЗначение);
		Если мСтрок[0][ТекКолонка] > ТекЗначение тогда
			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
		иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначение тогда
			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
		Конецесли;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте	
Процедура ЗаполнимПодчиненныеТаблицы(Таб,ТекКолонка,ТекЗначПоСтатье,Исключениие)
	
	
	Для каждого сс из Объект[Таб] цикл
		
		Если НЕ Исключениие  тогда
			Если ЗаполнятьОсновнуюВкладкуИРасшифровку(сс.СтатьяОборотовПоБюджетам) тогда
				продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// По клиентам
		ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,сс.СтатьяОборотовПоБюджетам,ТекЗначПоСтатье);			
		мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры	



&НаКлиенте	
Процедура ЗаполнимТаблицуБезНДС_Осн(Таб,ТабБезНДС)
	
	
	Для каждого сс из Объект[Таб] цикл
		
		//Если сс.Итоговая тогда продолжить КонецЕсли;
		
		//// По клиентам
		//ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,сс.СтатьяОборотовПоБюджетам,ТекЗначПоСтатье);			
		мПоиска = Объект[ТабБезНДС].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		Если мПоиска.количество() > 0 тогда
			//ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			//ЗаполнитьЗначенияСвойств(мПоиска[0],сс);
			ЗаполнитьПоказателиДаннымиОтчетПериодКлиент(мПоиска[0],сс);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	


&НаКлиенте	
Процедура ЗаполнимТаблицуБезНДС_ФАРМ_МТ(Таб,ТабБезНДС)
	
	
	Для каждого сс из Объект[Таб] цикл
		
		//Если сс.Итоговая тогда продолжить КонецЕсли;
		
		//// По клиентам
		//ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,сс.СтатьяОборотовПоБюджетам,ТекЗначПоСтатье);			
		мПоиска = Объект[ТабБезНДС].НайтиСтроки(Новый Структура("НомерСтроки",сс.НомерСтроки));
		Если мПоиска.количество() > 0 тогда
			//ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			ЗаполнитьЗначенияСвойств(мПоиска[0],сс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуКопированием(ТабИсточник,ТабПриемник,ТекКолонка,СтатьяОборотов)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	|Факт1,Факт2,Факт3
	|");
	
	
	ТабЧ = Объект[ТабПриемник];
	
	
	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
		Для каждого сс из мПромТЗ цикл
			ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
			
		КонецЦикла;
		
		
		//Дельта = ?(мСтрок[0][ТекКолонка] > 0,abs(ТекЗначение - мСтрок[0][ТекКолонка]),ТекЗначение);
		//Если мСтрок[0][ТекКолонка] > ТекЗначение тогда
		//	мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
		//иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначение тогда
		//	мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
		//Конецесли;
	КонецЕсли;
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуКопированиемПоРегионам(ТабИсточник,ТабПриемник,ТекКолонка,СтатьяОборотов,Регион)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам,Регион",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	|");
	
	
	ТабЧ = Объект[ТабПриемник];
	
	
	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
		Для каждого сс из мПромТЗ цикл
			ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
			
		КонецЦикла;
		
		
		//Дельта = ?(мСтрок[0][ТекКолонка] > 0,abs(ТекЗначение - мСтрок[0][ТекКолонка]),ТекЗначение);
		//Если мСтрок[0][ТекКолонка] > ТекЗначение тогда
		//	мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
		//иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначение тогда
		//	мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
		//Конецесли;
	КонецЕсли;
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоРегионам(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам,Регион,СтавкаНДС",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12,
	|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямКП_Осн(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	
    Для каждого сс из ПромТЗ цикл
		ПересчитатьБезНДССтрокуНаСервере(сс);
	КонецЦикла;
	
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
			Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_БОНУС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "ИН_БОНУС"
				тогда 
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1");
			продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТОВ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ТОВ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ИСГ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ИСГ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ПРЕМ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,7) = "КП_ПРЕМ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТРМ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ТРМ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_УС" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,5) = "КП_УС"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
		//	продолжить;
			
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямЭО_Осн(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	
    Для каждого сс из ПромТЗ цикл
		ПересчитатьБезНДССтрокуНаСервере(сс);
	КонецЦикла;
	
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
			Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ЭО_БОНУС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "ЭО_БОНУС"
				тогда 
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1");
			продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТОВ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ТОВ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ИСГ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ИСГ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ПРЕМ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,7) = "КП_ПРЕМ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТРМ" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ТРМ"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
		//	продолжить;
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_УС" 
		//		или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,5) = "КП_УС"
		//	тогда
		//	//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
		//	продолжить;
			
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры




&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямИН_Осн(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	
    Для каждого сс из ПромТЗ цикл
		ПересчитатьБезНДССтрокуНаСервере(сс);
	КонецЦикла;
	
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
			Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_БОНУС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "КП_БОНУС"
				тогда 
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТОВ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ТОВ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ИСГ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ИСГ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ПРЕМ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,7) = "КП_ПРЕМ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТРМ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "КП_ТРМ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_УС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,5) = "КП_УС"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
			продолжить;
			
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ_Осн(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	
    Для каждого сс из ПромТЗ цикл
		ПересчитатьБезНДССтрокуНаСервере(сс);
	КонецЦикла;
	
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
			Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_БОНУС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,10) = "ФАРМ_БОНУС"
				тогда 
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТОВ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "ФАРМ_ТОВ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ИСГ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "ФАРМ_ИСГ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,9) = "ФАРМ_ПРЕМ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "ФАРМ_ТРМ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
			продолжить;
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямМТ_Осн(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	
    Для каждого сс из ПромТЗ цикл
		ПересчитатьБезНДССтрокуНаСервере(сс);
	КонецЦикла;
	
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
			Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_БОНУС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,8) = "МТ_БОНУС"
				тогда 
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТОВ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "МТ_ТОВ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ИСГ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "МТ_ИСГ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,7) = "МТ_ПРЕМ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТРМ" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,6) = "МТ_ТРМ"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
			продолжить;
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_УС" 
				или Лев(сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи,5) = "МТ_УС"
			тогда
			//СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
			продолжить;
			
			
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры

 
&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямМТ(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
		// ФАРМ	
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_БОНУС" тогда 
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_БОНУС_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТОВ" тогда
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТОВ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ИСГ_1");
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда	
		//	СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ПРЕМ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТРМ_1");
		КонецЕсли;
		
		
		
		
		
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	       //БезНДС
		   Для сч = 1 по 12 цикл
	  
			   мСтрок[0]["СуммаБюджетБезНДС"+сч] = сс["СуммаБюджет"+сч];
			   мСтрок[0]["СуммаБезНДС"+сч]       = сс["Сумма"+сч];
			   мСтрок[0]["СуммаПрФактБезНДС"+сч] = сс["СуммаПрФакт"+сч];
			   мСтрок[0]["СуммаФактБезНДС"+сч]   = сс["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
		// ФАРМ	
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_БОНУС" тогда 
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТОВ" тогда
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ИСГ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1");
		КонецЕсли;
		
		
		
		
		
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	       //БезНДС
		   Для сч = 1 по 12 цикл
	  
			   мСтрок[0]["СуммаБюджетБезНДС"+сч] = сс["СуммаБюджет"+сч];
			   мСтрок[0]["СуммаБезНДС"+сч]       = сс["Сумма"+сч];
			   мСтрок[0]["СуммаПрФактБезНДС"+сч] = сс["СуммаПрФакт"+сч];
			   мСтрок[0]["СуммаФактБезНДС"+сч]   = сс["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямКП(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_БОНУС" тогда 
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_БОНУС_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ТОВ" тогда
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТОВ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ИСГ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ИСГ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ПРЕМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ПРЕМ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ТРМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТРМ_1");
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	       //БезНДС
		   Для сч = 1 по 12 цикл
	  
			   мСтрок[0]["СуммаБюджетБезНДС"+сч] = сс["СуммаБюджет"+сч];
			   мСтрок[0]["СуммаБезНДС"+сч]       = сс["Сумма"+сч];
			   мСтрок[0]["СуммаПрФактБезНДС"+сч] = сс["СуммаПрФакт"+сч];
			   мСтрок[0]["СуммаФактБезНДС"+сч]   = сс["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямЭО(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ЭО_БОНУС" тогда 
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭО_БОНУС_1");
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ТОВ" тогда
		//	СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТОВ_1");
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ИСГ" тогда	
		//	СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ИСГ_1");
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ПРЕМ" тогда	
		//	СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ПРЕМ_1");
		//ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ИН_ТРМ" тогда	
		//	СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТРМ_1");
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	       //БезНДС
		   Для сч = 1 по 12 цикл
	  
			   мСтрок[0]["СуммаБюджетБезНДС"+сч] = сс["СуммаБюджет"+сч];
			   мСтрок[0]["СуммаБезНДС"+сч]       = сс["Сумма"+сч];
			   мСтрок[0]["СуммаПрФактБезНДС"+сч] = сс["СуммаПрФакт"+сч];
			   мСтрок[0]["СуммаФактБезНДС"+сч]   = сс["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры




&НаСервере
Процедура ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямИН(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	
	ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
			
		Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_БОНУС" тогда 
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_БОНУС_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТОВ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ИСГ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ИСГ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ПРЕМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ПРЕМ_1");
		ИначеЕсли сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "КП_ТРМ" тогда	
			СтатьяПоиска = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТРМ_1");
		КонецЕсли;
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
	  прСтатья = мСтрок[0].СтатьяОборотовПоБюджетам;	  
      ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  мСтрок[0].СтатьяОборотовПоБюджетам = прСтатья;
	  
	       //БезНДС
		   Для сч = 1 по 12 цикл
	  
			   мСтрок[0]["СуммаБюджетБезНДС"+сч] = сс["СуммаБюджет"+сч];
			   мСтрок[0]["СуммаБезНДС"+сч]       = сс["Сумма"+сч];
			   мСтрок[0]["СуммаПрФактБезНДС"+сч] = сс["СуммаПрФакт"+сч];
			   мСтрок[0]["СуммаФактБезНДС"+сч]   = сс["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры


&НаСервере
Функция abs(а)
	
	Возврат ?(а < 0 , -а, а);
	
КонецФункции

&НаКлиенте
Функция absКлиент(а)
	
	Возврат ?(а < 0 , -а, а);
	
КонецФункции


&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент(ТабЧ,ТекКолонка,СтатьяОборотов,ЭтоРасшифровка)
	Зн = 0;
	ТЗзн =  Объект[ТабЧ];
	
	Если ЭтоРасшифровка тогда
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		//ТЗзн.Свернуть("РасшСтатья",ТекКолонка);
		
		//ОбщийИтог = ТЗзн.Итог(ТекКолонка);
		
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья",СтатьяОборотов));
		
	Иначе
		
		//ТЗзн.Свернуть("СтатьяОборотовПоБюджетам",ТекКолонка);
		//ОбщийИтог = ТЗзн.Итог(ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		
	КонецЕсли;
	
		
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	
	Для каждого ии из мСт цикл
	
	 Зн = Зн +  ии[ТекКолонка];	
	
	КонецЦикла;
	
	возврат Зн
	
КонецФункции


&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиентБезНДС(ТабЧ,ТекКолонка,РодительИтогСтатьи,ЭтоРасшифровка)
	Зн = 0;
	ТЗзн =  Объект[ТабЧ];
	
	//Если ЭтоРасшифровка тогда
	//	//ТЗзн.Колонки.Добавить("РасшСтатья");
	//	
	//	Для каждого тт из ТЗзн цикл
	//		Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
	//			сРасш = тт.СтатьяОборотовПоБюджетам;	
	//		иначе
	//			сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
	//		КонецЕсли;
	//		тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
	//	КонецЦикла;	
	//	
	//	//ТЗзн.Свернуть("РасшСтатья",ТекКолонка);
	//	
	//	//ОбщийИтог = ТЗзн.Итог(ТекКолонка);
	//	
	//	мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья",СтатьяОборотов));
	//	
	//Иначе
		
		//ТЗзн.Свернуть("СтатьяОборотовПоБюджетам",ТекКолонка);
		//ОбщийИтог = ТЗзн.Итог(ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",РодительИтогСтатьи,Ложь));
		
	//КонецЕсли;
	
		
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	
	Для каждого ии из мСт цикл
		
	//	ии["СуммаБюджетБезНДС" + Н] = ии["СуммаБюджет" + Н] - РассчитатьСуммуНДСКлиент(ии["СуммаБюджет" + Н], Истина, Истина, ПолучитьСтавкуНДСКлиент(ии.СтавкаНДС));
		
		
	// Зн = Зн +  ии[ТекКолонка];
	  Зн = Зн +  (ии[ТекКолонка] - РассчитатьСуммуНДСКлиент(ии[ТекКолонка] , Истина, Истина, ПолучитьСтавкуНДСКлиент(ии.СтавкаНДС)));
	 
	 
	
	КонецЦикла;
	
	возврат Зн
	
КонецФункции


&НаСервере
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,СтатьяОборотов,ЭтоРасшифровка)
	Зн = 0;
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	
	Если ЭтоРасшифровка тогда
		ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		ТЗзн.Свернуть("РасшСтатья",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья",СтатьяОборотов));
		
	Иначе
		
		ТЗзн.Свернуть("СтатьяОборотовПоБюджетам",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		
	КонецЕсли;
	
	
	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	возврат Зн
	
КонецФункции

&НаСервере
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовФАРМ(ТабЧ,ТекКолонка,СтатьяОборотов,Контрагент,ЭтоРасшифровка)
	Зн = 0;
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	
	Если ЭтоРасшифровка тогда
		ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		ТЗзн.Свернуть("РасшСтатья,Контрагент",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Контрагент",СтатьяОборотов,Контрагент));
		
	Иначе
		
		ТЗзн.Свернуть("СтатьяОборотовПоБюджетам,Контрагент",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,Контрагент));
		
	КонецЕсли;
	
	
	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	возврат Зн
	
КонецФункции



&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент(ТабЧ,ТекКолонка,СтатьяОборотов)
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			иначе 
				ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
		   КонецЕсли;
		КонецЦикла;
		
		//ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая",СтатьяОборотов,Ложь));

	
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	
	Для каждого ии из мСт цикл
	
	 Зн = Зн +  ии[ТекКолонка];	
	
	КонецЦикла;
	
	
	возврат Зн
	
КонецФункции

&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовФОТКлиент(ТабЧ,ТекКолонка,СтатьяОборотов)
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			//Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			//	ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			//иначе 
			//	ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
			//КонецЕсли;
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
				ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки.Лео_РодительскаяСтатья;
			КонецЕсли;
			
	   КонецЦикла;
	   
	   
	   
		
		//ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая",СтатьяОборотов,Ложь));

	
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	
	Для каждого ии из мСт цикл
	
	 Зн = Зн +  ии[ТекКолонка];	
	
	КонецЦикла;
	
	
	возврат Зн
	
КонецФункции



&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовФОТ_ОрганизацияКлиент(ТабЧ,ТекКолонка,СтатьяОборотов,Орг)
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
	
	
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			//Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			//	ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			//иначе 
			//	ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
			//КонецЕсли;
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
				_РасшСтатья = ии.СтатьяОборотовПоБюджетам.СтатьяОборотов;
				
				ии.РасшСтатья = _РасшСтатья.Лео_РодительскаяСтатья;
				
			КонецЕсли;
			
	   КонецЦикла;
	   
	   
	   
		
		//ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		
		мСт =  ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",СтатьяОборотов,Ложь,Орг));
		
		
		
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	Для каждого ии из мСт цикл
	 Зн = Зн +  ии[ТекКолонка];	
    КонецЦикла;
	
	возврат Зн
	
КонецФункции



&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоРодСтатьеОборотовФОТ_ОрганизацияКлиент(ТабЧ,ТекКолонка,СтатьяОборотов,Орг)
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
	ЭтоФОТ = Ложь; ЭтоВзносы = Ложь;
	Если Лев(СтатьяОборотов,3) = "ФОТ" тогда
		ЭтоФОТ = Истина;
    иначеЕсли Лев(СтатьяОборотов,6) = "Взносы" тогда
		ЭтоВзносы = Истина;
	КонецЕсли;	
	
	
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			//Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			//	ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			//иначе 
			//	ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
			//КонецЕсли;
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
				_РасшСтатья = ии.СтатьяОборотовПоБюджетам.СтатьяОборотов;
				
				ии.РасшСтатья = _РасшСтатья.Лео_РодительскаяСтатья;
				
			КонецЕсли;
			
	   КонецЦикла;
	   
	   
	   
		
		//ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		
		// ФОТ 
		Если ЭтоФОТ тогда
		мСт =  ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ производства"),Ложь,Орг));
		мСт1 = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ КС"),Ложь,Орг));
		мСт2 = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ АУП"),Ложь,Орг));
		КонецЕсли;
		
		
		// Взносы 
		Если ЭтоВзносы тогда
		мСт =  ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ производства"),Ложь,Орг));
		мСт1 = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ КС"),Ложь,Орг));
		мСт2 = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая,Контрагент",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ АУП"),Ложь,Орг));
		КонецЕсли;
		
		
		
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
		Если ЭтоФОТ или ЭтоВзносы тогда
	Для каждого ии из мСт цикл
	 Зн = Зн +  ии[ТекКолонка];	
    КонецЦикла;
	Для каждого ии из мСт1 цикл
	 Зн = Зн +  ии[ТекКолонка];	
    КонецЦикла;
	Для каждого ии из мСт2 цикл
	 Зн = Зн +  ии[ТекКолонка];	
    КонецЦикла;
		КонецЕсли;
	
	возврат Зн
	
КонецФункции




&НаСервере
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,СтатьяОборотов)
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	
		ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			иначе 
				ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
		   КонецЕсли;
		КонецЦикла;
		
		ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая",СтатьяОборотов,Ложь));

	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	возврат Зн
	
КонецФункции



&НаСервере
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовСтруктура(ТабЧ,ТекКолонка,СтатьяОборотов,РодСтатьяОборотов,Контрагент,ЭтоРасшифровка)
	
	СтЗначений = Новый Структура;
	/////////////////////////////////////////////////////////
	// РодСтатьяОборотов
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	
		ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			иначе 
				ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
		   КонецЕсли;
		КонецЦикла;
		
		ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая",РодСтатьяОборотов,Ложь));

	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	
	СтЗначений.Вставить("ТекЗначПоСтатьеРод",Зн);
	
	/////////////////////////////////////////////////////////
	//ТекЗначПоСтатье
	
	Зн = 0;
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	
	Если ЭтоРасшифровка тогда
		ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		ТЗзн.Свернуть("РасшСтатья,Контрагент",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Контрагент",СтатьяОборотов,Контрагент));
		
	Иначе
		
		ТЗзн.Свернуть("СтатьяОборотовПоБюджетам,Контрагент",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,Контрагент));
		
	КонецЕсли;
	
	
	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	СтЗначений.Вставить("ТекЗначПоСтатье",Зн);
	
	/////////////////////////////////////////////////////////
	//ТекЗначПоСтатьеПоВсемКонт
	Зн = 0;
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	
	Если ЭтоРасшифровка тогда
		ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		ТЗзн.Свернуть("РасшСтатья",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья",СтатьяОборотов));
		
	Иначе
		
		ТЗзн.Свернуть("СтатьяОборотовПоБюджетам",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		
	КонецЕсли;
	
	
	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	СтЗначений.Вставить("ТекЗначПоСтатьеПоВсемКонт",Зн);
	
	
	
	
	
	возврат СтЗначений
	
КонецФункции

&НаКлиенте
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовСтруктураКлиент(ТабЧ,ТекКолонка,СтатьяОборотов,РодСтатьяОборотов,Контрагент,ЭтоРасшифровка)
	
	СтЗначений = Новый Структура;
	/////////////////////////////////////////////////////////
	// РодСтатьяОборотов
	Зн = 0;
	
	//Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		Для каждого ии из ТЗзн цикл
			
			Если ТипЗнч(ии.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				ии.РасшСтатья = ии.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
			иначе 
				ии.РасшСтатья = ии.СтатьяОборотовИзРасшифровки;
		   КонецЕсли;
		КонецЦикла;
		
		//ТЗзн.Свернуть("РасшСтатья,Итоговая",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Итоговая",РодСтатьяОборотов,Ложь));

	
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;
	
	Для каждого ии из мСт цикл
	
	 Зн = Зн +  ии[ТекКолонка];	
	
	КонецЦикла;
	
	
	
	СтЗначений.Вставить("ТекЗначПоСтатьеРод",Зн);
	
	/////////////////////////////////////////////////////////
	//ТекЗначПоСтатье
	
	Зн = 0;
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
	Если ЭтоРасшифровка тогда
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		//ТЗзн.Свернуть("РасшСтатья,Контрагент",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья,Контрагент",СтатьяОборотов,Контрагент));
		
	Иначе
		
		//ТЗзн.Свернуть("СтатьяОборотовПоБюджетам,Контрагент",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,Контрагент));
		
	КонецЕсли;
	
	
	
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	
	
	Для каждого ии из мСт цикл
	
	 Зн = Зн +  ии[ТекКолонка];	
	
	КонецЦикла;
	
	
	СтЗначений.Вставить("ТекЗначПоСтатье",Зн);
	
	/////////////////////////////////////////////////////////
	//ТекЗначПоСтатьеПоВсемКонт
	Зн = 0;
	//ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн =  Объект[ТабЧ];
	
	Если ЭтоРасшифровка тогда
		//ТЗзн.Колонки.Добавить("РасшСтатья");
		
		Для каждого тт из ТЗзн цикл
			Если ТипЗнч(тт.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
				сРасш = тт.СтатьяОборотовПоБюджетам;	
			иначе
				сРасш = тт.СтатьяОборотовПоБюджетам.СтатьяОборотов;	
			КонецЕсли;
			тт.РасшСтатья = ?(тт.Итоговая,Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка(),сРасш);
		КонецЦикла;	
		
		//ТЗзн.Свернуть("РасшСтатья",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("РасшСтатья",СтатьяОборотов));
		
	Иначе
		
		//ТЗзн.Свернуть("СтатьяОборотовПоБюджетам",ТекКолонка);
		мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		
	КонецЕсли;
	
	
	
	//Если мСт.Количество() > 0 тогда 
	//	Зн = мСт[0][ТекКолонка];
	//КонецЕсли;	
	
	Для каждого ии из мСт цикл
	
	 Зн = Зн +  ии[ТекКолонка];	
	
	КонецЦикла;
	
	
	
	СтЗначений.Вставить("ТекЗначПоСтатьеПоВсемКонт",Зн);
	
	
	
	
	
	возврат СтЗначений
	
КонецФункции


&НаСервере
Функция ПолучитьСвернутоеЗначениеПоСтатьеОборотовРегион(ТабЧ,ТекКолонка,СтатьяОборотов,Регион)
	Зн = 0;
	ТЗзн =  Объект[ТабЧ].Выгрузить();
	ТЗзн.Свернуть("СтатьяОборотовПоБюджетам,Регион",ТекКолонка);
	мСт = ТЗзн.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	Если мСт.Количество() > 0 тогда 
		Зн = мСт[0][ТекКолонка];
	КонецЕсли;	
	
	возврат Зн
	
КонецФункции


&НаСервере
Функция ПолучитьРодителькуюСтатьюОборотов(СтатьяОборотовПоБюджетам)
	
	_Статья = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
	|	абс_СтатьиБюджетаПоЦФО.АналитикаБюджета,
	|	абс_СтатьиБюджетаПоЦФО.Раздел,
	|	абс_СтатьиБюджетаПоЦФО.Индекс,
	|	абс_СтатьиБюджетаПоЦФО.РодительИтог,
	|	абс_СтатьиБюджетаПоЦФО.Итоговая
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам = &СтатьяОборотовПоБюджетам
	|	И абс_СтатьиБюджетаПоЦФО.Раздел = ""СоставБюджетаРасшифровка""";
	
	Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам", СтатьяОборотовПоБюджетам);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.Итоговая тогда
			
			возврат СтатьяОборотовПоБюджетам;
			
		Конецесли;	
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	абс_СтатьиБюджетаПоЦФО.ЦФО,
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	абс_СтатьиБюджетаПоЦФО.АналитикаБюджета,
		|	абс_СтатьиБюджетаПоЦФО.Раздел,
		|	абс_СтатьиБюджетаПоЦФО.Индекс,
		|	абс_СтатьиБюджетаПоЦФО.РодительИтог,
		|	абс_СтатьиБюджетаПоЦФО.Итоговая
		|ИЗ
		|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		|ГДЕ
		|	абс_СтатьиБюджетаПоЦФО.Индекс = &РодительИтог";
		
		Запрос1.УстановитьПараметр("РодительИтог", ВыборкаДетальныеЗаписи.РодительИтог);
		
		Результат1 = Запрос1.Выполнить();
		Если НЕ Результат1.Пустой() тогда
			ВыборкаДетальныеЗаписи1 = Результат1.Выбрать();
			ВыборкаДетальныеЗаписи1.Следующий();
			_Статья = ВыборкаДетальныеЗаписи1.СтатьяОборотовПоБюджетам;
		КонецЕсли;
	КонецЕсли;
	
	
	Если _Статья = неопределено тогда _Статья = СтатьяОборотовПоБюджетам конецесли;
	
	возврат _Статья;
	
КонецФункции


&НаКлиенте
Процедура ДистрибуцияПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,ЭтоРасшифровка,ТекЗначПоСтатье);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Бюджет без НДС (Расшифровка расходов)
	
	Если ТабЧ = "СоставБюджета7" тогда // Расшифровка расходов
		
		
		
		// !!! 0.Если Статья: ТОВ и ИСГ и Бюджет, План - не суммируем
		//  МТ_ТОВ, МТ_ИСГ
		//  ФАРМ_ТОВ, ФАРМ_ИСГ
		//Если ТипЗнч(СтатьяОборотов) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
		//	_СтОборПроверка = СтатьяОборотов.СтатьяОборотов;
		//иначе
		//	_СтОборПроверка = СтатьяОборотов;
		//КонецЕсли;
		Если ЗаполнятьОсновнуюВкладкуИРасшифровкуТОВ_ИСГ(РодСтатьяОборотов)  // ТОВ, ИСГ
			И (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
			
			тогда
			
			ТекЗначПоСтатьеИт = 0;
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			Если мПоиска.количество() > 0 тогда
				ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			КонецЕсли;	
			
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
				мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеИт);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеИт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			возврат;
		КонецЕсли;
		
		Если ЗаполнятьОсновнуюВкладкуИРасшифровкуТОВ_ИСГ(РодСтатьяОборотов)  //  Пр/Факт, Факт
			И (Найти(ИмяТекКолонки,"СуммаБюджет") > 0 // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)

			тогда
		иначе
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
		КонецЕсли;
		
		
		//Если _СтатьяОборотов <> неопределено тогда
		//	//_ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов("СоставБюджета7",ТекКолонка,_СтатьяОборотов);
		//	ЗаполнимРодительскуюТаблицу(ТабПр,ТекКолонка,_СтОборПроверка,ТекЗначПоСтатье);
		//	мПоиска = Объект[ТабПр].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	Если мПоиска.количество() > 0 тогда
		//		ПроссумируемЕксель(ТабПр,ТекКолонка,мПоиска[0]);
		//	КонецЕсли;
		//КонецЕсли;
		
		
		
		
		
		// 1.	
		// Заполняем Расшифровку по клиентам только для статей:
		//  ФАРМ_ТО, МТ_ТО, ФАРМ_ТО_без НДС, МТ_ТО_без НДС
		//  ДИС_ФАРМ_ДС, ДИС_МТ_ДС, ДИС_ФАРМ_УС, ДИС_МТ_УС
		//  ДИС_ФАРМ_БОНУС, ДИС_МТ_БОНУС
		Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(РодСтатьяОборотов) тогда
			
			
			/////////////////////////////////////////////////////////////////////////////////////////
			//Заполним подчиненные осн. таблицы По клиентам, ТРМ, Непрямым 
			//ЗаполнимПодчиненныеТаблицы("СоставБюджета",ТекКолонка,ТекЗначПоСтатье,Ложь);
			
			// По клиентам
			//_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(СтатьяОборотов);			
			Если РодСтатьяОборотов <> неопределено тогда
				//_ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов("СоставБюджета7",ТекКолонка,_СтатьяОборотов);
				ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
				КонецЕсли;
			КонецЕсли;
			
			
			// ТРМ
			//_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(СтатьяОборотов);			
			Если РодСтатьяОборотов <> неопределено тогда
				//_ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов("СоставБюджета7",ТекКолонка,_СтатьяОборотов);
				ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
				КонецЕсли;
			КонецЕсли;
			
			
			// Непрямым
			//_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(СтатьяОборотов);			
			Если РодСтатьяОборотов <> неопределено тогда
				//_ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов("СоставБюджета7",ТекКолонка,_СтатьяОборотов);
				ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета3",ТекКолонка,мПоиска[0]);
				КонецЕсли;
			КонецЕсли;
			
			
			
		КонецЕсли;	
		
		
		
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// 1.1 Заполняем Расшифровку по клиентам только для статей:
		//  ФАРМ_ТО, МТ_ТО, ФАРМ_ТО_без НДС, МТ_ТО_без НДС
		//  ДИС_ФАРМ_ДС, ДИС_МТ_ДС, ДИС_ФАРМ_УС, ДИС_МТ_УС
		//  ДИС_ФАРМ_БОНУС, ДИС_МТ_БОНУС
		
		Если ЗаполнятьОсновнуюВкладкуИРасшифровку(РодСтатьяОборотов) тогда
			
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			
			
			// По клиентам
			Если ТабЧ = "СоставБюджета4" тогда
				//ИмяТекКолонки =  "СоставБюджета1" + Прав(ИмяТекКолонки,СтрДлина(ТекКолонка) - СтрДлина("СоставБюджета4"));
				мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
				КонецЕсли;
			КонецЕсли;
			
			
			// ТРМ
			//ИмяТекКолонки =  "СоставБюджета2" + Прав(ИмяТекКолонки,СтрДлина(ИмяТекКолонки) - СтрДлина("СоставБюджета4"));
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			// Непрямым
			//ИмяТекКолонки =  "СоставБюджета3" + Прав(ИмяТекКолонки,СтрДлина(ИмяТекКолонки) - СтрДлина("СоставБюджета4"));
			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета3",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			
			
			
			
			
			// Проссумируем Расшифровку ДИС
			// 1.1 Свернутые итоги по статье
			мСтрок = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мСтрок.Количество() > 0 тогда
				//ТекКолонка = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
				Дельта = ?(мСтрок[0][ТекКолонка] > 0,abs(ТекЗначПоСтатье - мСтрок[0][ТекКолонка]),ТекЗначПоСтатье);
				Если мСтрок[0][ТекКолонка] > ТекЗначПоСтатье тогда
					мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
				иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначПоСтатье тогда
					мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
				Конецесли;
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мСтрок[0]);
			КонецЕсли;
			
			
			////Соберем Основную ДИС из Расшифровки
			//ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
			
		КонецЕсли;
		
		
		//Соберем Основную ДИС из Расшифровки
		ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		Если ЭтоРасшифровка тогда  // Для ЭтоРасшифровка
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
	//
	//ПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные);
	
	
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 2. Расходы по клиентам (Расшифровка по клиентам)
	
	Если ТабЧ = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		
		
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// 2.1 Заполняем Расшифровку по клиентам только для статей:
		//  МТ_ТОВ, МТ_ИСГ
		//  ФАРМ_ТОВ, ФАРМ_ИСГ
		
		Если ЗаполнятьОсновнуюВкладкуИРасшифровкуТОВ_ИСГ(РодСтатьяОборотов) тогда
			
			// Проссумируем Расшифровку ДИС
			// По регионам
			// 2.1 Свернутые итоги по статье и региону
			мСтрок = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки, Регион",РодСтатьяОборотов,ТекДанные.Регион));
			//мСтрок = ПолучитьМассивСтатьяОборотовРегион(СтатьяОборотов,ТекДанные.Регион);
			Если мСтрок.Количество() > 0 тогда
				//ТекКолонка = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
				Дельта = ?(мСтрок[0][ТекКолонка] > 0,abs(ТекЗначПоСтатье - мСтрок[0][ТекКолонка]),ТекЗначПоСтатье);
				Если мСтрок[0][ТекКолонка] > ТекЗначПоСтатье тогда
					мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
				иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначПоСтатье тогда
					мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
				Конецесли;
				
				
				Если (Найти(ИмяТекКолонки,"СуммаБюджет") > 0   // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
					
					
					
					
				тогда
				
				ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,мСтрок[0],Ложь);
				иначе
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мСтрок[0]);
				
			КонецЕсли;
				
			КонецЕсли;
			
			КопироватьДанныеФормы(Объект["СоставБюджета7"],Объект["СоставБюджета7"]); 
			
			
			////Соберем Основную ДИС из Расшифровки
			//ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
			
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,НомерСтроки",РодСтатьяОборотов,ТекДанные.НомерСтроки));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета4",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			Если (Найти(ИмяТекКолонки,"СуммаБюджет") > 0 // Бюджет
			   или Найти(ИмяТекКолонки,"Сумма") > 0)     // План
				  и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				   
				тогда
			иначе
				
				
				ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
				КонецЕсли;
				
				
				ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
				КонецЕсли;
				
				ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
				КонецЕсли;
				
				
				Если Найти(РодСтатьяОборотов.абс_КодБюджетнойСтатьи,"_ТО") > 1 тогда  // МТ_ТО, ФАРМ_ТО
					
				ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
				КонецЕсли;
					
				ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				Если мПоиска.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета3",ТекКолонка,мПоиска[0]);
				КонецЕсли;
				
				
				КонецЕсли;
				
			КонецЕсли;
			
			
			
			
			
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// 2.2 Заполняем Расшифровку по клиентам только для статей:
		//  ДИС_МТ_УС
		//  ДИС_ФАРМ_УС
		//  ДИС_ФАРМ_БОНУС
		Если Найти(РодСтатьяОборотов.абс_КодБюджетнойСтатьи,"_УС") > 1
			или	 Найти(РодСтатьяОборотов.абс_КодБюджетнойСтатьи,"_БОНУС") > 1
			
			тогда
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,НомерСтроки",РодСтатьяОборотов,ТекДанные.НомерСтроки));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета4",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
		КонецЕсли;	
		
	Конецесли;
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 3. ТМ (Расшифровка расходов)
	
	Если ТабЧ = "СоставБюджета5" тогда // Расшифровка расходов ТМ
		
		мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,НомерСтроки",РодСтатьяОборотов,ТекДанные.НомерСтроки));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета5",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		
		ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 4. Непрямым (Расшифровка расходов)
	
	Если ТабЧ = "СоставБюджета6" тогда // Расшифровка расходов 
		
		
		мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,НомерСтроки",РодСтатьяОборотов,ТекДанные.НомерСтроки));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета6",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета3",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		
		ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		
	КонецЕсли;	
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ФАРМПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам
	
	Если ТабЧ = "СоставБюджета4" тогда // Расходы по клиентам
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета4",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			Если ТекЗначПоСтатьеРод > 0 тогда
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			КонецЕсли;
			
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_НЕТТО_сНДС" 
			или	 СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_НЕТТО_безНДС" 
				тогда
			         возврат
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ИСГ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_1" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_2" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_3" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТОВ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ИСГ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_БОНУС" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_1" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_УС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_2" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_УС_2"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_3" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_УС_3"));
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам Без НДС
	
	Если ТабЧ = "СоставБюджета5" тогда // Расходы по клиентам Без НДС
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета5",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ИСГ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_1" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_2" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_3" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТОВ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ИСГ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_БОНУС" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_1" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_УС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_2" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_УС_2"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_УС_3" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_УС_3"));
			
			
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Непрямым С НДС
	
	Если ТабЧ = "СоставБюджета6" тогда // Непрямым С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
				  
			тогда
			
			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета6",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксельНепрямым("СоставБюджета3",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ФАРМ_ПРЕМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ФАРМ_ПРЕМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн С НДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Непрямым Без НДС
	
	Если ТабЧ = "СоставБюджета14" тогда // Непрямым Без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета14",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета13",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета13"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксельНепрямым("СоставБюджета13",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ФАРМ_ПРЕМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ФАРМ_ПРЕМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн БезНДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. ТМ С НДС
	
	Если ТабЧ = "СоставБюджета16" тогда // Непрямым С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
				  
			тогда
			
			мПоиска = Объект["СоставБюджета16"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета16",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета15",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета15"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксельНепрямым("СоставБюджета15",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ФАРМ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ФАРМ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1"));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн С НДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. ТМ Без НДС
	
	Если ТабЧ = "СоставБюджета18" тогда // Непрямым Без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета18"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета18",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета17",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета17"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксельНепрямым("СоставБюджета17",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ФАРМ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ФАРМ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ_1"));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн БезНДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Основная расшифровка С НДС
	
	Если ТабЧ = "СоставБюджета7" тогда // Основная расшифровка С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ГУПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам
	
	Если ТабЧ = "СоставБюджета4" тогда // Расходы по клиентам
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета4",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			Если ТекЗначПоСтатьеРод > 0 тогда
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			КонецЕсли;
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ГУ_ТО" 
			или	 СтатьяОборотов.абс_КодБюджетнойСтатьи = "ГУ_ТО_без НДС" 
				тогда
			         возврат
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ"тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"КП_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ГУ_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ГУ_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ГУ_БОНУС" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ГУ_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн
			//ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам Без НДС
	
	Если ТабЧ = "СоставБюджета5" тогда // Расходы по клиентам Без НДС
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета5",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ"тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"КП_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ГУ_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ГУ_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ГУ_БОНУС" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ГУ_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
			
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	// 1. Непрямым С НДС
//	
//	Если ТабЧ = "СоставБюджета6" тогда // Непрямым С НДС
//		
//		
//		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
//					или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
//				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
//				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//					 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
//				  
//			тогда
//			
//			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
//			Если мПоиска.количество() > 0 тогда
//			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета6",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
//			КонецЕсли;
//			
//			
//			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксельНепрямым("СоставБюджета3",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//			
//			
//		//	/////////////////////////////////////////////////////////////
//		//	//Расш Осн
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
//		//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
//		//	КонецЕсли;
//		//	
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
//		//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
//		//	КонецЕсли;
//		//	
//		//	Если мПоиска.Количество() = 0 тогда
//		// 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
//		//	КонецЕсли;
//		//
//		//	Если мПоиска.количество() > 0 тогда
//		//		ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
//		//	КонецЕсли;
//			
//			
//			/////////////////////////////////////////////////////////////////////
//			//Осн С НДС
//			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	//// 1. Непрямым Без НДС
	//
	//Если ТабЧ = "СоставБюджета14" тогда // Непрямым Без НДС
	//	
	//	
	//	Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
	//				или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
	//			  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//			  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
	//			  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//				 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
	//		
	//		тогда
	//		
	//		мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
	//		Если мПоиска.количество() > 0 тогда
	//		мПроссумируемЕксельТОВ_ИСГ("СоставБюджета14",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
	//		КонецЕсли;
	//		
	//		
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета13",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета13"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельНепрямым("СоставБюджета13",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		
	//		
	//	//	/////////////////////////////////////////////////////////////
	//	//	//Расш Осн
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
	//	//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
	//	//	КонецЕсли;
	//	//	
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
	//	//	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
	//	//	КонецЕсли;
	//	//	
	//	//	Если мПоиска.Количество() = 0 тогда
	//	// 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	//	//	КонецЕсли;
	//	//
	//	//	Если мПоиска.количество() > 0 тогда
	//	//		ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
	//	//	КонецЕсли;
	//		
	//		
	//		/////////////////////////////////////////////////////////////////////
	//		//Осн БезНДС
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Основная расшифровка С НДС
	
	Если ТабЧ = "СоставБюджета7" тогда // Основная расшифровка С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 2. Основная расшифровка Без НДС
	
	Если ТабЧ = "СоставБюджета10" тогда // Основная расшифровка без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета10",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ИНПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам
	
	Если ТабЧ = "СоставБюджета4" тогда // Расходы по клиентам
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета4",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			Если ТекЗначПоСтатьеРод > 0 тогда
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			КонецЕсли;
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИН_ТО" 
			или	 СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИН_ТО_без НДС" 
				тогда
			         возврат
			КонецЕсли;
			
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ"тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"КП_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИН_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ИН_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИН_БОНУС" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ИН_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИНТЕР_БОНУС" тогда  // ИНТЕРНЕТ
				 ТекЗначПоСтатьеРод  = ТекЗначПоСтатьеПоВсемКонт;
			КонецЕсли;	
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам Без НДС
	
	Если ТабЧ = "СоставБюджета5" тогда // Расходы по клиентам Без НДС
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета5",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ"тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"КП_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИН_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ИН_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			//Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ИН_БОНУС" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ИН_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
			
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	// 1. Непрямым С НДС
//	
//	Если ТабЧ = "СоставБюджета6" тогда // Непрямым С НДС
//		
//		
//		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
//					или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
//				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
//				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//					 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
//				  
//			тогда
//			
//			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
//			Если мПоиска.количество() > 0 тогда
//			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета6",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
//			КонецЕсли;
//			
//			
//			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксельНепрямым("СоставБюджета3",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//			
//			
//		//	/////////////////////////////////////////////////////////////
//		//	//Расш Осн
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
//		//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
//		//	КонецЕсли;
//		//	
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
//		//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
//		//	КонецЕсли;
//		//	
//		//	Если мПоиска.Количество() = 0 тогда
//		// 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
//		//	КонецЕсли;
//		//
//		//	Если мПоиска.количество() > 0 тогда
//		//		ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
//		//	КонецЕсли;
//			
//			
//			/////////////////////////////////////////////////////////////////////
//			//Осн С НДС
//			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	//// 1. Непрямым Без НДС
	//
	//Если ТабЧ = "СоставБюджета14" тогда // Непрямым Без НДС
	//	
	//	
	//	Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
	//				или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
	//			  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//			  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
	//			  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//				 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
	//		
	//		тогда
	//		
	//		мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
	//		Если мПоиска.количество() > 0 тогда
	//		мПроссумируемЕксельТОВ_ИСГ("СоставБюджета14",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
	//		КонецЕсли;
	//		
	//		
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета13",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета13"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельНепрямым("СоставБюджета13",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		
	//		
	//	//	/////////////////////////////////////////////////////////////
	//	//	//Расш Осн
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
	//	//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
	//	//	КонецЕсли;
	//	//	
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
	//	//	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
	//	//	КонецЕсли;
	//	//	
	//	//	Если мПоиска.Количество() = 0 тогда
	//	// 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	//	//	КонецЕсли;
	//	//
	//	//	Если мПоиска.количество() > 0 тогда
	//	//		ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
	//	//	КонецЕсли;
	//		
	//		
	//		/////////////////////////////////////////////////////////////////////
	//		//Осн БезНДС
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Основная расшифровка С НДС
	
	Если ТабЧ = "СоставБюджета7" тогда // Основная расшифровка С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 2. Основная расшифровка Без НДС
	
	Если ТабЧ = "СоставБюджета10" тогда // Основная расшифровка без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета10",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ЭОПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам
	
	Если ТабЧ = "СоставБюджета4" тогда // Расходы по клиентам
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета4",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета1",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			//ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			//мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_ТО" 
			или	 СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_ТО_без НДС" 
				тогда
			         возврат
			КонецЕсли;
			
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ЭКС_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ЭКС_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_ТОВ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЭКС_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_БОНУС" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЭКС_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам Без НДС
	
	Если ТабЧ = "СоставБюджета5" тогда // Расходы по клиентам Без НДС
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета5",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета2",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			//ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			//мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ЭКС_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ЭКС_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_ТОВ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЭКС_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ЭКС_БОНУС" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЭКС_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
			
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	// 1. Непрямым С НДС
//	
//	Если ТабЧ = "СоставБюджета6" тогда // Непрямым С НДС
//		
//		
//		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
//					или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
//				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
//				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//					 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
//				  
//			тогда
//			
//			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
//			Если мПоиска.количество() > 0 тогда
//			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета6",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
//			КонецЕсли;
//			
//			
//			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксельНепрямым("СоставБюджета3",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//			
//			
//		//	/////////////////////////////////////////////////////////////
//		//	//Расш Осн
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
//		//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
//		//	КонецЕсли;
//		//	
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
//		//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
//		//	КонецЕсли;
//		//	
//		//	Если мПоиска.Количество() = 0 тогда
//		// 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
//		//	КонецЕсли;
//		//
//		//	Если мПоиска.количество() > 0 тогда
//		//		ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
//		//	КонецЕсли;
//			
//			
//			/////////////////////////////////////////////////////////////////////
//			//Осн С НДС
//			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	//// 1. Непрямым Без НДС
	//
	//Если ТабЧ = "СоставБюджета14" тогда // Непрямым Без НДС
	//	
	//	
	//	Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
	//				или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
	//			  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//			  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
	//			  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//				 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
	//		
	//		тогда
	//		
	//		мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
	//		Если мПоиска.количество() > 0 тогда
	//		мПроссумируемЕксельТОВ_ИСГ("СоставБюджета14",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
	//		КонецЕсли;
	//		
	//		
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета13",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета13"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельНепрямым("СоставБюджета13",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		
	//		
	//	//	/////////////////////////////////////////////////////////////
	//	//	//Расш Осн
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
	//	//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
	//	//	КонецЕсли;
	//	//	
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
	//	//	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
	//	//	КонецЕсли;
	//	//	
	//	//	Если мПоиска.Количество() = 0 тогда
	//	// 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	//	//	КонецЕсли;
	//	//
	//	//	Если мПоиска.количество() > 0 тогда
	//	//		ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
	//	//	КонецЕсли;
	//		
	//		
	//		/////////////////////////////////////////////////////////////////////
	//		//Осн БезНДС
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Основная расшифровка С НДС
	
	Если ТабЧ = "СоставБюджета7" тогда // Основная расшифровка С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 2. Основная расшифровка Без НДС
	
	Если ТабЧ = "СоставБюджета10" тогда // Основная расшифровка без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета10",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура КППриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам
	
	Если ТабЧ = "СоставБюджета4" тогда // Расходы по клиентам
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета4",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			Если ТекЗначПоСтатьеРод > 0 тогда
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		    КонецЕсли;
		
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТО" 
			или	 СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТО_без НДС" 
				тогда
			         возврат
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"КП_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"КП_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_БОНУС" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам Без НДС
	
	Если ТабЧ = "СоставБюджета5" тогда // Расходы по клиентам Без НДС
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета5",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"КП_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"КП_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_ТОВ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_ТОВ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			////ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			////мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "КП_БОНУС" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","КП_БОНУС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
			
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	// 1. Непрямым С НДС
//	
//	Если ТабЧ = "СоставБюджета6" тогда // Непрямым С НДС
//		
//		
//		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
//					или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
//				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
//				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//					 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
//				  
//			тогда
//			
//			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
//			Если мПоиска.количество() > 0 тогда
//			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета6",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
//			КонецЕсли;
//			
//			
//			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксельНепрямым("СоставБюджета3",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//			
//			
//		//	/////////////////////////////////////////////////////////////
//		//	//Расш Осн
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
//		//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
//		//	КонецЕсли;
//		//	
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
//		//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
//		//	КонецЕсли;
//		//	
//		//	Если мПоиска.Количество() = 0 тогда
//		// 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
//		//	КонецЕсли;
//		//
//		//	Если мПоиска.количество() > 0 тогда
//		//		ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
//		//	КонецЕсли;
//			
//			
//			/////////////////////////////////////////////////////////////////////
//			//Осн С НДС
//			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	//// 1. Непрямым Без НДС
	//
	//Если ТабЧ = "СоставБюджета14" тогда // Непрямым Без НДС
	//	
	//	
	//	Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
	//				или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
	//			  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//			  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
	//			  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//				 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
	//		
	//		тогда
	//		
	//		мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
	//		Если мПоиска.количество() > 0 тогда
	//		мПроссумируемЕксельТОВ_ИСГ("СоставБюджета14",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
	//		КонецЕсли;
	//		
	//		
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета13",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета13"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельНепрямым("СоставБюджета13",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		
	//		
	//	//	/////////////////////////////////////////////////////////////
	//	//	//Расш Осн
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
	//	//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
	//	//	КонецЕсли;
	//	//	
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
	//	//	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
	//	//	КонецЕсли;
	//	//	
	//	//	Если мПоиска.Количество() = 0 тогда
	//	// 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	//	//	КонецЕсли;
	//	//
	//	//	Если мПоиска.количество() > 0 тогда
	//	//		ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
	//	//	КонецЕсли;
	//		
	//		
	//		/////////////////////////////////////////////////////////////////////
	//		//Осн БезНДС
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Основная расшифровка С НДС
	
	Если ТабЧ = "СоставБюджета7" тогда // Основная расшифровка С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 2. Основная расшифровка Без НДС
	
	Если ТабЧ = "СоставБюджета10" тогда // Основная расшифровка без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета10",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура МТПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам
	
	Если ТабЧ = "СоставБюджета4" тогда // Расходы по клиентам
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета4",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			Если ТекЗначПоСтатьеРод > 0 тогда
			ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			КонецЕсли;
			
			
			
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТО_НЕТТО_сНДС" 
			или	 СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТО_НЕТТО_безНДС" 
				тогда
			         возврат
			КонецЕсли;
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТОВ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТОВ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ПРЕМ" тогда
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ПРЕМ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_БОНУС" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_БОНУС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Расходы по клиентам Без НДС
	
	Если ТабЧ = "СоставБюджета5" тогда // Расходы по клиентам Без НДС
		
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			//ТекЗначПоСтатьеИт = 0;
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов,Истина));
			//Если мПоиска.количество() > 0 тогда
			//	ТекЗначПоСтатьеИт = мПоиска[0][ТекКолонка];
			//КонецЕсли;	
			
			
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельТОВ_ИСГ("СоставБюджета7",ТекКолонка,мПоиска[0],Истина); // По горизонтали	
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета5"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета5",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета2",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета2",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТОВ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТОВ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ИСГ_1",ТекЗначПоСтатьеПоВсемКонт);
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			//ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_БОНУС" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_БОНУС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_1",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_2",ТекЗначПоСтатьеПоВсемКонт);
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_УС_3",ТекЗначПоСтатьеПоВсемКонт);
			
			
		    иначе // остальные
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// ТОВ, ИСГ
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТОВ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТОВ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ИСГ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ИСГ_1"));
			//ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
			//мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
			ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_БОНУС" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_БОНУС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_1" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_1"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_2" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_2"));
		    ИначеЕсли СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_УС_3" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_УС_3"));
			
			
			
		    иначе //остальные
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// заглушка
			//возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
///////////////////////////////////////////////////////////////////////////////////////////////////////////	
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	/////////////////////////////////////////////////////////////////////////////////////////////////////
//	// 1. Непрямым С НДС
//	
//	Если ТабЧ = "СоставБюджета6" тогда // Непрямым С НДС
//		
//		
//		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
//					или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
//				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
//				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
//					 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
//				  
//			тогда
//			
//			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
//			Если мПоиска.количество() > 0 тогда
//			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета6",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
//			КонецЕсли;
//			
//			
//			ЗаполнимРодительскуюТаблицу("СоставБюджета3",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксельНепрямым("СоставБюджета3",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//			
//			
//		//	/////////////////////////////////////////////////////////////
//		//	//Расш Осн
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
//		//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
//		//	КонецЕсли;
//		//	
//		//	// ФАРМ_ПРЕМ_1
//		//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
//		//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
//		//	КонецЕсли;
//		//	
//		//	Если мПоиска.Количество() = 0 тогда
//		// 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
//		//	КонецЕсли;
//		//
//		//	Если мПоиска.количество() > 0 тогда
//		//		ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
//		//	КонецЕсли;
//			
//			
//			/////////////////////////////////////////////////////////////////////
//			//Осн С НДС
//			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
//			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
//			Если мПоиска.количество() > 0 тогда
//				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЕсли;	
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	//// 1. Непрямым Без НДС
	//
	//Если ТабЧ = "СоставБюджета14" тогда // Непрямым Без НДС
	//	
	//	
	//	Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
	//				или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
	//			  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//			  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
	//			  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//				 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
	//		
	//		тогда
	//		
	//		мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
	//		Если мПоиска.количество() > 0 тогда
	//		мПроссумируемЕксельТОВ_ИСГ("СоставБюджета14",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
	//		КонецЕсли;
	//		
	//		
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета13",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета13"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельНепрямым("СоставБюджета13",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		
	//		
	//	//	/////////////////////////////////////////////////////////////
	//	//	//Расш Осн
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ"тогда
	//	//	ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"ФАРМ_ПРЕМ_1",ТекЗначПоСтатьеПоВсемКонт);
	//	//	КонецЕсли;
	//	//	
	//	//	// ФАРМ_ПРЕМ_1
	//	//	Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ" тогда
	//	//	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ_1"));
	//	//	КонецЕсли;
	//	//	
	//	//	Если мПоиска.Количество() = 0 тогда
	//	// 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
	//	//	КонецЕсли;
	//	//
	//	//	Если мПоиска.количество() > 0 тогда
	//	//		ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
	//	//	КонецЕсли;
	//		
	//		
	//		/////////////////////////////////////////////////////////////////////
	//		//Осн БезНДС
	//		ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
	//		мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. ТМ С НДС
	
	Если ТабЧ = "СоставБюджета16" тогда // Непрямым С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
				  
			тогда
			
			мПоиска = Объект["СоставБюджета16"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета16",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета15",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета15"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксельНепрямым("СоставБюджета15",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// МТ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета7",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// МТ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн С НДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. ТМ Без НДС
	
	Если ТабЧ = "СоставБюджета18" тогда // Непрямым Без НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета18"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",СтатьяОборотов,ТекДанные.Контрагент));
			Если мПоиска.количество() > 0 тогда
			мПроссумируемЕксельТОВ_ИСГ("СоставБюджета18",ТекКолонка,мПоиска[0],Ложь); // По горизонтали
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета17",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета17"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксельНепрямым("СоставБюджета17",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////
			//Расш Осн
			// МТ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ"тогда
			ЗаполнимРодительскуюТаблицуКодСтатьи("СоставБюджета10",ТекКолонка,"МТ_ТРМ_1",ТекЗначПоСтатьеПоВсемКонт);
			КонецЕсли;
			
			// МТ_ТРМ_1
			Если СтатьяОборотов.абс_КодБюджетнойСтатьи = "МТ_ТРМ" тогда
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","МТ_ТРМ_1"));
			КонецЕсли;
			
			Если мПоиска.Количество() = 0 тогда
		 	мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи));
		    КонецЕсли;
		
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			/////////////////////////////////////////////////////////////////////
			//Осн БезНДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеПоВсемКонт);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
/////////////////////////////////////////////////////////////////////////////////////////////////////////	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Основная расшифровка С НДС
	
	Если ТабЧ = "СоставБюджета7" тогда // Основная расшифровка С НДС
		
		
		Если  (Найти(ИмяТекКолонки,"СуммаБюджет") > 0  // Бюджет
				    или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
				  //и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				  //   Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
				  или Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
				     Найти(ИмяТекКолонки,"СуммаПрФакт") > 0
			
			тогда
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
   		  ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
КонецПроцедуры



Функция ПолучитьТекКолонкаУчитываяСдвиг12(ТекКолонка)
	
	
	тКолонка = неопределено;
	Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ТекКолонка,2)) тогда
		
		ПочтФикс = Число(Прав(ТекКолонка,2)) - 12;
		
		тКолонка = лев(ТекКолонка,СтрДлина(ТекКолонка)-2) + СокрЛП(ПочтФикс);
	КонецЕсли;
	
	
	Если Лев(ТекКолонка,4) = "Факт" тогда
		
		ПочтФикс = Число(Прав(ТекКолонка,1)) - 3;
		
		тКолонка = лев(ТекКолонка,СтрДлина(ТекКолонка)-1) + СокрЛП(ПочтФикс);
	КонецЕсли;
	
	
	возврат тКолонка;

КонецФункции	

&НаКлиенте
Процедура СоставБюджета4ПриИзменении(Элемент)
	
	ТабЧ = Элемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам;
	
	
	Если Найти(ИмяТекКолонки,"ВидОплаты") > 0
		или Найти(ИмяТекКолонки,"МесяцОплаты") > 0
		или Найти(ИмяТекКолонки,"ТипАкции") > 0
		или Найти(ИмяТекКолонки,"КомментарийАкции") > 0
		или Найти(ИмяТекКолонки,"НомерАкции") > 0
		или Найти(ИмяТекКолонки,"СтавкаНДС") > 0
		или Найти(ИмяТекКолонки,"Условия") > 0
		или Найти(ИмяТекКолонки,"Плательщик") > 0
		или Найти(ИмяТекКолонки,"Регион") > 0
		или Найти(ИмяТекКолонки,"Контрагент") > 0
		или Найти(ИмяТекКолонки,"СтатьяОборотовПоБюджетам") > 0
		или Найти(ИмяТекКолонки,"РодительИтогСтатьи") > 0
		или Найти(ИмяТекКолонки,"Итоговая") > 0
		
		тогда
		возврат;
	КонецЕсли;	 
	
	
	//ИмяТекКолонки
	// Поиск ТекКолонка
	Если ТабЧ = "СоставБюджета12" тогда // Эксплуатация
		ТекКолонка = Сред(ИмяТекКолонки,15,20);  //СоставБюджета6Сумма13
	ИначеЕсли ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ТабЧ,2)) тогда
		ТекКолонка = Сред(ИмяТекКолонки,16,20);  //СоставБюджета10Сумма1
	ИначеЕсли ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ТабЧ,1)) тогда
		ТекКолонка = Сред(ИмяТекКолонки,15,20);  //СоставБюджета1Сумма1
	иначе
		ТекКолонка = Сред(ИмяТекКолонки,14,20); //СоставБюджета
	КонецЕсли;
	
	
	// Эксплуатация
	Если ТабЧ = "СоставБюджета12" тогда
		ТекКолонка = ПолучитьТекКолонкаУчитываяСдвиг12(ТекКолонка);
	Конецесли;
	
	Если ТекКолонка = неопределено тогда
		возврат;
	Конецесли;	
	
	
	//ЗаполнимИтоговуюТаблицу("СоставБюджета1","СоставБюджета4");
	
	
	ЭтоРасшифровка = Ложь;
	Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
		//РодСтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		РодСтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.Лео_РодительскаяСтатья;
		Если РодСтатьяОборотов.пустая() тогда РодСтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам конецесли;
	иначе // Лео_СтатьиОборотовРасшифровка
		РодСтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		ЭтоРасшифровка = Истина;
	КонецЕсли;
	
	
		
	
	
	//Получим значение по статьям
	
	Если ТабЧ = "СоставБюджета12" тогда	ТабЧ = "СоставБюджета6"	конецесли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
		
	//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,РодСтатьяОборотов);
	ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент(ТабЧ,ТекКолонка,РодСтатьяОборотов);
	
    ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" // ФАРМ
	 или Объект.ЦФО.Лео_ЦЗ = "ОРД МТ"         // МТ	
 	 или Объект.ЦФО.Лео_ЦЗ = "ОКП"            // КП
	 или  Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)"     // ИН
 	 или Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)"       // ГУ
	 или Объект.ЦФО.Лео_ЦЗ = "ЭО"             // ЭКС
	 или Объект.ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ"       // ИНТЕРНЕТ
	 
	 
	тогда 
	//ТекЗначПоСтатьеРод = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,РодСтатьяОборотов);
	//
	//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовФАРМ(ТабЧ,ТекКолонка,СтатьяОборотов,ТекДанные.Контрагент,ЭтоРасшифровка);
	//
	//ТекЗначПоСтатьеПоВсемКонт = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,СтатьяОборотов,ЭтоРасшифровка);
	
	//СтЗн = ПолучитьСвернутоеЗначениеПоСтатьеОборотовСтруктура(ТабЧ,ТекКолонка,СтатьяОборотов,РодСтатьяОборотов,ТекДанные.Контрагент,ЭтоРасшифровка);
	СтЗн = ПолучитьСвернутоеЗначениеПоСтатьеОборотовСтруктураКлиент(ТабЧ,ТекКолонка,СтатьяОборотов,РодСтатьяОборотов,ТекДанные.Контрагент,ЭтоРасшифровка);
	
	ТекЗначПоСтатьеРод        = СтЗн.ТекЗначПоСтатьеРод;
	ТекЗначПоСтатье           = СтЗн.ТекЗначПоСтатье;
	ТекЗначПоСтатьеПоВсемКонт = СтЗн.ТекЗначПоСтатьеПоВсемКонт;
	
	СтатьяОборотовРасшифровка = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",СтатьяОборотов.абс_КодБюджетнойСтатьи);
	
          иначе // Остальные
			  
	//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
	ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент(ТабЧ,ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
	
	
	КонецЕсли;
	
	
	
	
	
		_ОстальныеЦФО = Истина;
		
	
	// 1. ДИСТРИБУЦИЯ ОРД
	Если  Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда

		_ОстальныеЦФО = Ложь;
		
		ДистрибуцияПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,ЭтоРасшифровка,ТекЗначПоСтатье);
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда  // Ключевые покупатели
		
		_ОстальныеЦФО = Ложь;
		
		КППриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда  // ЭКС
		
		_ОстальныеЦФО = Ложь;
		
		ЭОПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда  // ИН
		
		_ОстальныеЦФО = Ложь;
		
		ИНПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда  // ГУ
		
		_ОстальныеЦФО = Ложь;
		
		ГУПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда  // ФАРМ
		
		_ОстальныеЦФО = Ложь;
		
		ФАРМПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда  // МТ
		
		_ОстальныеЦФО = Ложь;
		
		МТПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
		
	ИначеЕсли  Объект.ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ" тогда  // ИНТЕРНЕТ
		
		_ОстальныеЦФО = Ложь;
		
		ИНПриИзменении(ТабЧ,ИмяТекКолонки,ТекКолонка,ТекДанные,РодСтатьяОборотов,СтатьяОборотов,СтатьяОборотовРасшифровка,ЭтоРасшифровка,ТекЗначПоСтатьеРод,ТекЗначПоСтатье,ТекЗначПоСтатьеПоВсемКонт);
		
		
		
	иначе	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить настройки для ЦФО: "+СокрЛП(Объект.ЦФО));
		
	КонецЕсли;
	
	
	// 2. КЛЮЧЕВЫЕ КЛИЕНТЫ
	
	
	
	// 3. ИНУСТРИАЛЬНЫЙ
	
	
	// 4. ЭКСПОРТ
	
	
	// 5. ГУ
	
	
		
		
	Если Объект.ЦФО.Лео_ЦЗ = "ЛОГИСТИКА_ГП" тогда // Логистика
		
		_ОстальныеЦФО = Ложь;
		
		    //ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
			
			
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",ТекКолонка,РодСтатьяОборотов);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			//// Проссумируем итоговую, если у нее есть Лео_РодительскаяСтатья
			//Если НЕ РодСтатьяОборотов.Лео_РодительскаяСтатья.Пустая() тогда
			//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов.Лео_РодительскаяСтатья));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
			//	//ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			//	мПроссумируемЕксельРод("СоставБюджета",ТекКолонка,мПоиска[0],Ложь);
			//КонецЕсли;
			//КонецЕсли;
			
			
	
	КонецЕсли;
	
		
	Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ"  или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
		
		_ОстальныеЦФО = Ложь;
		
		   Если ТабЧ = "СоставБюджета6" тогда
		
			мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета6",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета6",ТекКолонка,ТекДанные,Ложь);
			
			// СНДС
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			_РодСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка();
		    Если НЕ РодСтатьяОборотов.Лео_РодительскаяСтатья.пустая() тогда _РодСтатьяОборотов = РодСтатьяОборотов.Лео_РодительскаяСтатья конецесли;  // ИТС
	        ТекЗначПоСтатьеРод = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент("СоставБюджета7",ТекКолонка,_РодСтатьяОборотов,Ложь);
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,_РодСтатьяОборотов,ТекЗначПоСтатьеРод);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			//ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			ЗаполнимИтоговуюТаблицуКлиентИТ("СоставБюджета","СоставБюджета7",Истина);
			
			ЗаполнимТаблицуКлиент("СоставБюджета7",Истина);
			ЗаполнимТаблицуКлиент("СоставБюджета",Истина);
			
			
			// БезНДС
			
			
			ТекЗначПоСтатьеБезНДС = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиентБезНДС("СоставБюджета6",ТекКолонка,ТекДанные.РодительИтогСтатьи,Ложь);
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатьеБезНДС);
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			_РодСтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка();
		    Если НЕ РодСтатьяОборотов.Лео_РодительскаяСтатья.пустая() тогда _РодСтатьяОборотов = РодСтатьяОборотов.Лео_РодительскаяСтатья конецесли;  // ИТС
	        ТекЗначПоСтатьеРодБезНДС = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент("СоставБюджета10",ТекКолонка,_РодСтатьяОборотов,Ложь);
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,_РодСтатьяОборотов,ТекЗначПоСтатьеРодБезНДС);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			//ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			
			ЗаполнимИтоговуюТаблицуКлиентИТ("СоставБюджета9","СоставБюджета10",Истина);
			
			ЗаполнимТаблицуКлиент("СоставБюджета10",Истина);
			ЗаполнимТаблицуКлиент("СоставБюджета9",Истина);
		  
		   иначе
			   
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь)
			
		   Конецесли;
	
	КонецЕсли;
		
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "Амортизация" тогда // АМОРТИЗАЦИЯ
		
		_ОстальныеЦФО = Ложь;
	
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			// АМ_ТР (Родительские статьи)
			РодСтатьяОборотов = РодСтатьяОборотов.Лео_РодительскаяСтатья;
			Если НЕ РодСтатьяОборотов.Пустая() тогда
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			КонецЕсли;
			
			
   		  //ЗаполнимТаблицуСервер("СоставБюджета",Истина);
   		  ЗаполнимТаблицуКлиент("СоставБюджета",Истина);
	
	КонецЕсли;
	
	
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ФОТ" тогда // ФОТ для БЮДЖЕТА 
		
		_ОстальныеЦФО = Ложь;
		
		   Если ТабЧ = "СоставБюджета7" тогда
		
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
			//
			//ПроссумируемЕксельБезРодителя("СоставБюджета6",ТекКолонка,ТекДанные,Ложь);
			
			
			
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
            ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
		
		
		
		    ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			
			
			
			
			////ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			//ЗаполнимТаблицуКлиент("СоставБюджета",Истина);
		  
		  //////////////////////////////////////////////////////////////////////////
		  // Заполним ФОТ производства
          РодТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовФОТКлиент(ТабЧ,ТекКолонка,РодСтатьяОборотов.Лео_РодительскаяСтатья);
		  Если РодТекЗначПоСтатье > 0 тогда
			  	мСт = Объект[ТабЧ].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",РодСтатьяОборотов.Лео_РодительскаяСтатья,Истина));
                Если мСт.Количество() > 0 тогда
					 мСт[0][ТекКолонка] = РодТекЗначПоСтатье;
				КонецЕсли;	
			мПроссумируемЕксельИтоговая(ТабЧ,ТекКолонка, мСт[0],Ложь);
	
		  КонецЕсли;
		
		
		  //////////////////////////////////////////////////////////////////////////
		  // ФОТ по Организациям
		  //фСтруктура = Новый Структура("Статья, Организация, НоваяСтатья");
		  //
		  //фСтруктура.Вставить("Статья","ФОТ производства");
		  //фСтруктура.Вставить("Организация","ЛЕОВИТ нутрио");
		  //фСтруктура.Вставить("НоваяСтатья","ФОТ ЛЕОВИТ");
		  //
		  //фСтруктура.Вставить("Статья","ФОТ производства");
		  //фСтруктура.Вставить("Организация","Леотон Трейдинг (пок.)");
		  //фСтруктура.Вставить("НоваяСтатья","ФОТ ЛЕОТОН ТРЕЙДИНГ");
		  
		  
		  
		  статья = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		  _Лео_РодительскаяСтатья = статья.Лео_РодительскаяСтатья;
		  
		  //Если  фСтруктура.Статья = СокрЛП(_Лео_РодительскаяСтатья) и  фСтруктура.Организация = СокрЛП(ТекДанные.Контрагент) тогда
		  Если  ЗначениеЗаполнено(_Лео_РодительскаяСтатья) и  ЗначениеЗаполнено(ТекДанные.Контрагент) тогда
			  
			  //нСтатья = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(фСтруктура.НоваяСтатья);
			  мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Контрагент",_Лео_РодительскаяСтатья,ТекДанные.Контрагент));
			  
			  
			  
			  
			  Если мПоиска.количество() > 0 тогда
				  //ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
				  //ТекЗначение = ТекДанные[ТекКолонка];
				  
                     _ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовФОТ_ОрганизацияКлиент(ТабЧ,ТекКолонка,_Лео_РодительскаяСтатья,ТекДанные.Контрагент);
                     _ТекЗначПоСтатьеРод = ПолучитьСвернутоеЗначениеПоРодСтатьеОборотовФОТ_ОрганизацияКлиент(ТабЧ,ТекКолонка,_Лео_РодительскаяСтатья,ТекДанные.Контрагент);
					 
					 
					  Дельта = ?(мПоиска[0][ТекКолонка] > 0,absКлиент(_ТекЗначПоСтатье - мПоиска[0][ТекКолонка]),_ТекЗначПоСтатье); // 032,80%
					  
					  Если мПоиска[0][ТекКолонка] > _ТекЗначПоСтатье тогда
						  мПоиска[0][ТекКолонка] = мПоиска[0][ТекКолонка] - Дельта;
					  иначеЕсли  мПоиска[0][ТекКолонка] <= _ТекЗначПоСтатье тогда
						  мПоиска[0][ТекКолонка] = мПоиска[0][ТекКолонка] + Дельта;
					  Конецесли;
				  
				  
				  
				  мПроссумируемЕксельИтоговаяФОТ("СоставБюджета",ТекКолонка, мПоиска[0],Ложь);
				  
				  // родитель
		          ЗаполнимРодительскуюТаблицуПоИндексу("СоставБюджета",ТекКолонка,мПоиска[0].РодительИтогСтатьи,_ТекЗначПоСтатьеРод);
			      мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("ИндексСтатьи",мПоиска[0].РодительИтогСтатьи));
			      Если мПоиска.количество() > 0 тогда
				       ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			      КонецЕсли;
				  
				  
			  КонецЕсли;
		
		  КонецЕсли;
		  
   		  //ЗаполнимТаблицуСервер("СоставБюджета",Истина);
   		  ЗаполнимТаблицуКлиент("СоставБюджета",Истина);
		  
		  
	  КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	
	
	
	// ОСТАЛЬНЫЕ !!!!!!!!
	
	
	//Если Объект.ЦФО = Справочники.Подразделения.НайтиПоКоду("107")  // ИТ
	//	
	//	или   Объект.ЦФО.Лео_ЦЗ = "ОТ и ТБ" // ОТ и ТБ
	//	
	//	
	
	Если _ОстальныеЦФО 
		тогда 
		
		
		
		Если ТабЧ = "СоставБюджета7" тогда // СНДС
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ПроссумируемЕксельБезРодителя("СоставБюджета7",ТекКолонка,ТекДанные,Ложь);
			
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			//ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			ЗаполнимТаблицуКлиент("СоставБюджета",Истина);
			
			
		ИначеЕсли ТабЧ = "СоставБюджета10" тогда  // БезНДС
			
			
			мПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			ПроссумируемЕксельБезРодителя("СоставБюджета10",ТекКолонка,ТекДанные,Ложь);
			
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета9",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска = Объект["СоставБюджета9"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета9",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			//ЗаполнимТаблицуСервер("СоставБюджета",Истина);
			ЗаполнимТаблицуКлиент("СоставБюджета9",Истина);
			
			
			
			
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//// 2. Заполняем Расшифровку по клиентам только для статей:
	////  МТ_ТОВ, МТ_ИСГ
	////  ФАРМ_ТОВ, ФАРМ_ИСГ
	//
	//Если ЗаполнятьОсновнуюВкладкуИРасшифровкуТОВ_ИСГ(СтатьяОборотов) тогда
	//	
	//	ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатье);
	//	
	//	// По клиентам
	//	Если ТабЧ = "СоставБюджета4" тогда
	//		//ИмяТекКолонки =  "СоставБюджета1" + Прав(ИмяТекКолонки,СтрДлина(ТекКолонка) - СтрДлина("СоставБюджета4"));
	//		мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксель("СоставБюджета1",ТекКолонка,мПоиска[0]);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	
	//	// Проссумируем Расшифровку ДИС
	//	// По регионам
	//	// 2.1 Свернутые итоги по статье и региону
	//	мСтрок = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки, Регион",СтатьяОборотов,ТекДанные.Регион));
	//	//мСтрок = ПолучитьМассивСтатьяОборотовРегион(СтатьяОборотов,ТекДанные.Регион);
	//	Если мСтрок.Количество() > 0 тогда
	//		//ТекКолонка = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
	//		Дельта = ?(мСтрок[0][ТекКолонка] > 0,abs(ТекЗначПоСтатье - мСтрок[0][ТекКолонка]),ТекЗначПоСтатье);
	//		Если мСтрок[0][ТекКолонка] > ТекЗначПоСтатье тогда
	//			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] - Дельта;
	//		иначеЕсли  мСтрок[0][ТекКолонка] <= ТекЗначПоСтатье тогда
	//			мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + Дельта;
	//		Конецесли;
	//		ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мСтрок[0]);
	//	КонецЕсли;
	//	
	//	
	//	//Соберем Основную ДИС из Расшифровки
	//	ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,СтатьяОборотов,ТекЗначПоСтатье);
	//	мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
	//	Если мПоиска.количество() > 0 тогда
	//		ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
	//	КонецЕсли;
	//	
	//	
	//
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнятьОсновнуюВкладкуИРасшифровкуБезНДС(СтатьяОборотов)
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Заполняем Расшифровку по клиентам только для статей:
	//  ФАРМ_ТО, МТ_ТО, ФАРМ_ТО_без НДС, МТ_ТО_без НДС
	//  ДИС_ФАРМ_ДС, ДИС_МТ_ДС, ДИС_ФАРМ_УС, ДИС_МТ_УС
	//  ДИС_ФАРМ_БОНУС, ДИС_МТ_БОНУС
	ЗаполнятьРасш = Ложь;
	
	мПроверки  = Новый Массив;
	//мПроверки.Добавить("ФАРМ_ТО");
	//мПроверки.Добавить("МТ_ТО");
	мПроверки.Добавить("ДИС_ТО_без НДС");
	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_безНДС");
	мПроверки.Добавить("МТ_ТО_НЕТТО_безНДС");
	//мПроверки.Добавить("ДИС_ФАРМ_ДС");
	//мПроверки.Добавить("ДИС_МТ_ДС");
	//мПроверки.Добавить("ДИС_ФАРМ_УС");
	//мПроверки.Добавить("ДИС_МТ_УС");
	//мПроверки.Добавить("ДИС_ФАРМ_БОНУС");
	//мПроверки.Добавить("ДИС_МТ_БОНУС");
	
	
	
	Если СтатьяОборотов <> неопределено тогда
		Если мПроверки.Найти(СтатьяОборотов.абс_КодБюджетнойСтатьи) <> неопределено тогда
			ЗаполнятьРасш = Истина;
		КонецЕсли;	   
	КонецЕсли;	   
	
	
	возврат ЗаполнятьРасш;
	
КонецФункции


&НаКлиенте
Функция ЗаполнятьОсновнуюВкладкуИРасшифровку(СтатьяОборотов)
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Заполняем Расшифровку по клиентам только для статей:
	//  ФАРМ_ТО, МТ_ТО, ФАРМ_ТО_без НДС, МТ_ТО_без НДС
	//  ДИС_ФАРМ_ДС, ДИС_МТ_ДС, ДИС_ФАРМ_УС, ДИС_МТ_УС
	//  ДИС_ФАРМ_БОНУС, ДИС_МТ_БОНУС
	ЗаполнятьРасш = Ложь;
	
	мПроверки  = Новый Массив;
	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_сНДС");
	мПроверки.Добавить("МТ_ТО_НЕТТО_сНДС");
	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_безНДС");
	мПроверки.Добавить("МТ_ТО_НЕТТО_безНДС");
	мПроверки.Добавить("ДИС_ФАРМ_ДС");
	мПроверки.Добавить("ДИС_МТ_ДС");
	мПроверки.Добавить("ДИС_ФАРМ_УС");
	мПроверки.Добавить("ДИС_МТ_УС");
	мПроверки.Добавить("ДИС_ФАРМ_БОНУС");
	мПроверки.Добавить("ДИС_МТ_БОНУС");
	
	
	
	Если СтатьяОборотов <> неопределено тогда
		Если мПроверки.Найти(СтатьяОборотов.абс_КодБюджетнойСтатьи) <> неопределено тогда
			ЗаполнятьРасш = Истина;
		КонецЕсли;	   
	КонецЕсли;	   
	
	
	возврат ЗаполнятьРасш;
	
КонецФункции



&НаСервере
Функция ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(СтатьяОборотов)
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Заполняем Расшифровку по клиентам только для статей:
	//  ФАРМ_ТО, МТ_ТО, ФАРМ_ТО_без НДС, МТ_ТО_без НДС
	//  ДИС_ФАРМ_ДС, ДИС_МТ_ДС, ДИС_ФАРМ_УС, ДИС_МТ_УС
	//  ДИС_ФАРМ_БОНУС, ДИС_МТ_БОНУС
	ЗаполнятьРасш = Ложь;
	
	мПроверки  = Новый Массив;
	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_сНДС");
	мПроверки.Добавить("МТ_ТО_НЕТТО_сНДС");
	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_безНДС");
	мПроверки.Добавить("МТ_ТО_НЕТТО_безНДС");
	мПроверки.Добавить("ДИС_ФАРМ_ДС");
	мПроверки.Добавить("ДИС_МТ_ДС");
	мПроверки.Добавить("ДИС_ФАРМ_УС");
	мПроверки.Добавить("ДИС_МТ_УС");
	мПроверки.Добавить("ДИС_ФАРМ_БОНУС");
	мПроверки.Добавить("ДИС_МТ_БОНУС");
	
	
	
	Если СтатьяОборотов <> неопределено тогда
		Если мПроверки.Найти(СтатьяОборотов.абс_КодБюджетнойСтатьи) <> неопределено тогда
			ЗаполнятьРасш = Истина;
		КонецЕсли;	   
	КонецЕсли;	   
	
	
	возврат ЗаполнятьРасш;
	
КонецФункции




&НаКлиенте
Функция ЗаполнятьОсновнуюВкладкуИРасшифровкуТОВ_ИСГ(СтатьяОборотов)
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Заполняем Расшифровку по клиентам только для статей:
	//  МТ_ТОВ, МТ_ИСГ
	//  ФАРМ_ТОВ, ФАРМ_ИСГ
	
	ЗаполнятьРасш = Ложь;
	
	мПроверки  = Новый Массив;
	
	мПроверки.Добавить("ДИС_ФАРМ_ТОВ");
	мПроверки.Добавить("ДИС_МТ_ТОВ");
	
	мПроверки.Добавить("ДИС_ФАРМ_ИСГ");
	мПроверки.Добавить("ДИС_МТ_ИСГ");
	
	мПроверки.Добавить("МТ_ТО_НЕТТО_сНДС");
	мПроверки.Добавить("МТ_ТО_НЕТТО_безНДС");

	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_сНДС");
	мПроверки.Добавить("ФАРМ_ТО_НЕТТО_безНДС");
	
	
	
	мПроверки.Добавить("КП_ТОВ");
	
	
	
	Если СтатьяОборотов <> неопределено тогда
		Если мПроверки.Найти(СтатьяОборотов.абс_КодБюджетнойСтатьи) <> неопределено тогда
			ЗаполнятьРасш = Истина;
		КонецЕсли;	   
	КонецЕсли;	   
	
	
	возврат ЗаполнятьРасш;
	
КонецФункции




&НаКлиенте
Процедура СоставБюджетаПриИзменении(Элемент)
	
	ТабЧ = Элемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если  Найти(ИмяТекКолонки,"СтатьяОборотов") > 0 
		Или Найти(ИмяТекКолонки,"СтатьяБюджета") > 0 
		
		или Найти(ИмяТекКолонки,"МесяцОплаты") > 0
		или Найти(ИмяТекКолонки,"ТипАкции") > 0
		или Найти(ИмяТекКолонки,"КомментарийАкции") > 0
		или Найти(ИмяТекКолонки,"НомерАкции") > 0
		или Найти(ИмяТекКолонки,"СтавкаНДС") > 0
		или Найти(ИмяТекКолонки,"Условия") > 0
		или Найти(ИмяТекКолонки,"Плательщик") > 0
		или Найти(ИмяТекКолонки,"Регион") > 0
		или Найти(ИмяТекКолонки,"Контрагент") > 0
		или Найти(ИмяТекКолонки,"СтатьяОборотовПоБюджетам") > 0
		или Найти(ИмяТекКолонки,"РодительИтогСтатьи") > 0
		или Найти(ИмяТекКолонки,"Итоговая") > 0
		
		тогда
		Возврат;
	КонецЕсли;	 
	
	
	
	
	//ИмяТекКолонки
	// Поиск ТекКолонка
	Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ТабЧ,2)) тогда
		ТекКолонка = Сред(ИмяТекКолонки,16,20);  //СоставБюджета13Сумма1
	ИначеЕсли ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ТабЧ,1)) тогда
		ТекКолонка = Сред(ИмяТекКолонки,15,20);  //СоставБюджета1Сумма1
	иначе
		ТекКолонка = Сред(ИмяТекКолонки,14,20); //СоставБюджета
	КонецЕсли;
	
	
	
	
	ПроссумируемЕксель(ТабЧ,ТекКолонка,ТекДанные);
	
	// Проссумируем Основную ДИС
	Если  ТабЧ = "СоставБюджета1" 
		//или ТабЧ = "СоставБюджета2" или ТабЧ = "СоставБюджета3" 
		тогда
		СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам;
		
		
		Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(СтатьяОборотов) тогда
			возврат;
		КонецЕсли;
		
		//По клиентам 
		//ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		
		мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		
		//Соберем Основную ДИС из Расшифровки
		ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
		//ЗаполнимИтоговуюТаблицуСервер("СоставБюджета1");
		
		//СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам;
		//
		//мСтрок = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		//Если мСтрок.Количество() > 0 тогда
		//	
		//	
		//ТекКолонка = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
		//	
		//мСтрок[0][ТекКолонка] = мСтрок[0][ТекКолонка] + ТекДанные[ТекКолонка];
		//	
		//ПроссумируемЕксель("СоставБюджета","СоставБюджета" + ТекКолонка,мСтрок[0]);
		//
		//КонецЕсли;
		
	КонецЕсли;	
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////// /
	// Заполним БДР Материальными расходами(Затраты на сырье и ...)
	
	Если  ТабЧ = "СоставБюджета2" и сокрЛП(Объект.ЦФО.Код)  = "001"  // БДР
		//или ТабЧ = "СоставБюджета2" или ТабЧ = "СоставБюджета3" 
		тогда
		СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам;
		
		
		//Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(СтатьяОборотов) тогда
		//	возврат;
		//КонецЕсли;
		
		//По клиентам 
		//ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
		КонецЕсли;
		
	КонецЕсли;	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////// /
	// Заполнение Вручную: Налог на прибыль
	
	Если  ТабЧ = "СоставБюджета" и сокрЛП(Объект.ЦФО.Код)  = "001"  // БДР
		//или ТабЧ = "СоставБюджета2" или ТабЧ = "СоставБюджета3" 
		и 
		(СокрЛП(ТекДанные.НомерПредставление) = "4."       // Налог на прибыль
		 или СокрЛП(ТекДанные.НомерПредставление) = "6.")  // Расходы из чистой прибыли
		тогда
		СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам;
		
		
		
		
		//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("НомерПредставление","5.")); // Чистая прибыль
		//Если мПоиска.количество() > 0 тогда
		//	 мПоиска[0][ТекКолонка] = мПоиска[0][ТекКолонка] - ТекДанные[ТекКолонка];
		//КонецЕсли;
		
		
		ЗаполнитьЗакладкуФинРез();
		
		
		//Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(СтатьяОборотов) тогда
		//	возврат;
		//КонецЕсли;
		
		//По клиентам 
		//ЗаполнимРодительскуюТаблицу("СоставБюджета1",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		//ЗаполнимРодительскуюТаблицу("СоставБюджета",ТекКолонка,СтатьяОборотов,ТекДанные[ТекКолонка]);
		//
		//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотов));
		//Если мПоиска.количество() > 0 тогда
		//	ПроссумируемЕксель("СоставБюджета",ТекКолонка,мПоиска[0]);
		//КонецЕсли;
		
	КонецЕсли;	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные)
	
	//Если ТекДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ИтогКоличество 	= 0;
	//ИтогСуммаБезНДС = 0;
	//ИтогСумма 		= 0;
	//
	//Для Н = 1 По 12 Цикл
	//	
	//	ИтогКоличество 	= ИтогКоличество 	+ ТекДанные["Количество" 	+ Н];
	//	ИтогСуммаБезНДС = ИтогСуммаБезНДС 	+ ТекДанные["СуммаБезНДС" 	+ Н];
	//	ИтогСумма 		= ИтогСумма 		+ ТекДанные["Сумма" 		+ Н];
	//	
	//КонецЦикла;
	//
	//ТекДанные.КоличествоИтог 	= ИтогКоличество;
	//ТекДанные.СуммаБезНДСИтог 	= ИтогСуммаБезНДС;
	//ТекДанные.СуммаИтог 		= ИтогСумма;
	
КонецПроцедуры





&НаКлиенте
Процедура ОбновитьНадписиИтоговПоСтатье(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "";
		
		Возврат;
	КонецЕсли;
	
	РассчитыватьИтогПоМесяц = Ложь;
	
	Если НЕ Элементы.СоставБюджета.ТекущийЭлемент = Неопределено Тогда
		
		ИндексТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;	
		
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СоставБюджета"	, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СуммаБезНДС"		, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "Сумма"			, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "СНДС"			, "");
		ИндексТекКолонки = СтрЗаменить(ИндексТекКолонки		, "Количество"		, "");
		
		Попытка
			ИндексТекКолонки 		= Число(ИндексТекКолонки);
			РассчитыватьИтогПоМесяц = Истина;
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
	СтрокиПоСтатье = Объект.СоставБюджета.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", ТекДанные.СтатьяОборотовПоБюджетам));
	
	КоличествоИтогМесяц 	= 0; СуммаБезНДСИтогМесяц 	= 0; СуммаИтогМесяц = 0;
	КоличествоИтогГод 		= 0; СуммаБезНДСИтогГод		= 0; СуммаИтогГод	= 0;
	
	Для Каждого СтрокаПоСтатье Из СтрокиПоСтатье Цикл
		
		КоличествоИтогГод 	= КоличествоИтогГод 	+ СтрокаПоСтатье.КоличествоИтог;
		СуммаБезНДСИтогГод 	= СуммаБезНДСИтогГод 	+ СтрокаПоСтатье.СуммаБезНДСИтог;
		СуммаИтогГод 		= СуммаИтогГод	 		+ СтрокаПоСтатье.СуммаИтог;
		
		Если РассчитыватьИтогПоМесяц Тогда
			КоличествоИтогМесяц 	= КоличествоИтогМесяц 	+ СтрокаПоСтатье["Количество" 	+ ИндексТекКолонки];
			СуммаБезНДСИтогМесяц 	= СуммаБезНДСИтогМесяц 	+ СтрокаПоСтатье["СуммаБезНДС" 	+ ИндексТекКолонки];
			СуммаИтогМесяц 			= СуммаИтогМесяц 		+ СтрокаПоСтатье["Сумма" 		+ ИндексТекКолонки];
		КонецЕсли;		
		
	КонецЦикла;
	
	Если РассчитыватьИтогПоМесяц Тогда
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "Итого по статье за месяц: " + "Количество: " + Формат(КоличествоИтогМесяц, "ЧЦ=18; ЧН=0") + ", Сумма без НДС: " + Формат(СуммаБезНДСИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб." + ", Сумма с НДС: " + Формат(СуммаИтогМесяц, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб. ";
		
	Иначе
		
		Элементы.НадписьИтогПоСтатье.Заголовок = "";
		
	КонецЕсли;
	
	Элементы.НадписьИтогПоСтатье.Заголовок = Элементы.НадписьИтогПоСтатье.Заголовок + "Итого по статье за год: " + "Количество: " + Формат(КоличествоИтогГод, "ЧЦ=18; ЧН=0") + ", Сумма без НДС: " + Формат(СуммаБезНДСИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб." + ", Сумма с НДС: " + Формат(СуммаИтогГод, "ЧЦ=18; ЧДЦ=2; ЧН=0") + " руб.";
	
КонецПроцедуры





&НаКлиенте
Процедура АктивироватьСтрокуБДДС(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиБДДСПоСтатье = Объект.СоставБюджетаДДС.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам, Контрагент, ДоговорКонтрагента", ТекДанные.СтатьяОборотовПоБюджетам, ТекДанные.Контрагент, ТекДанные.ДоговорКонтрагента));
	
	Если СтрокиБДДСПоСтатье.Количество() > 0 Тогда
		
		Элементы.СоставБюджетаДДС.ТекущаяСтрока = СтрокиБДДСПоСтатье[0].ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриАктивизацииСтроки(Элемент)
	
	//ОбновитьНадписиИтоговПоСтатье(Элементы.СоставБюджета.ТекущиеДанные);
	
	
	
	//АктивироватьСтрокуБДДС(Элементы.СоставБюджета.ТекущиеДанные);
	
	//ЗаполнитьКомментарий();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьСкрытьБДДС(Команда)
	
	Элементы.БДДС.Пометка = НЕ Элементы.БДДС.Пометка;
	
	УстановитьВидимостьБДДС(Элементы.БДДС.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьБДДС(ВидимостьБДДС)
	
	//Элементы.СоставБюджетаДДС.Видимость = ВидимостьБДДС;
	Элементы.СтраницаБДДС.Видимость = ВидимостьБДДС;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнтьБДДС(Команда)
	
	Если Объект.СоставБюджетаДДС.Количество()>0 Тогда
		Если НЕ Вопрос("Перезаполнить БДДС?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Объект.СоставБюджетаДДС.Очистить();
	ЗаполнитьБДДССервер();
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБДДССервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьБДДС();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.Имя = "СоставБюджета" тогда
		Элементы.СоставБюджета.ТекущиеДанные.ЦФО = Объект.ЦФО;
	КонецЕсли;
	
	// Для Клиентов
	Если Элемент.Имя = "СоставБюджета1" тогда
		// Добавим новую строку на закладки ДИС и Расшифровка
		Если НоваяСтрока тогда
			// Расшифровка 
			ЗаполнитьСтатьиКлиентаСоставБюджета4(Элемент.ТекущиеДанные.СтатьяОборотовПоБюджетам);
			
			//стр = Объект["СоставБюджета4"].Добавить();
			//стр.СтатьяОборотовПоБюджетам = Элемент.ТекущиеДанные.СтатьяОборотовПоБюджетам;
			//// ДИС 
			//стр = Объект["СоставБюджета"].Добавить();
			//стр.СтатьяОборотовПоБюджетам = Элемент.ТекущиеДанные.СтатьяОборотовПоБюджетам;
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаДДСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Элементы.СоставБюджетаДДС.ТекущиеДанные.ЦФО = Объект.ЦФО;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПередНачаломИзменения(Элемент, Отказ)
	
	//ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	//
	//ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	
	Если Вопрос("Удалить строку?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаДДСПередУдалением(Элемент, Отказ)
	
	Если Вопрос("Удалить строку?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьРольФинансист = РольДоступна("абс_Финансист");
	
	Элементы.ЗакрытыйПериод.ТолькоПросмотр 	= НЕ ЕстьРольФинансист;
	
	//	Элементы.ОтразитьЛимитыДДС.Видимость 	= ЕстьРольФинансист;
	Элементы.ОтразитьЛимитыДДС.Видимость 	= Ложь;
	
	Если НЕ ЕстьРольФинансист Тогда
		УстановитьДоступностьЭлементовФормыПользователюВводБюджета();
	КонецЕсли;
	
	Элементы.КомандаУстановитьСостояниеПодготовка.Видимость = Объект.Состояние = Перечисления.СостоянияОбъектов.Отклонен;		
	
	// ZAA           Объект.ДатаПланирования
	
	ЗаполнитьЗаголовкиПоДатаПланирования();
	
	ОбработатьИтоговыеСтроки();
	СоставБюджета4ВыделитьТО();
	СоставБюджета5ВыделитьТО();
	
	Если Объект.ЦФО.Лео_ЦЗ = "ФОТ" тогда
	Элементы.ФОТсвернуть.Видимость = Истина;
	Элементы.СоставБюджетаКонтрагент.Видимость = Истина;
	Элементы.СтраницаФОТ.Видимость = Истина;
	//Объект.ФОТсвернуть = Истина;
    СоставБюджетаФОТ(Объект.ФОТсвернуть);
	КонецЕсли;
	
КонецПроцедуры


// ZAA
&НаСервере
Процедура ЗаполнитьЗаголовкиПоДатаПланирования()
	
	ШиринаЗ   = 10;
	ШиринаЗ_1 = 9;
	ШиринаВ   = 2;
	ШиринаМ   = 2;
	
	
	ФонФормы  = Новый Цвет(245, 242, 221); // Фон формы

	
	// Таб часть: СоставБюджета
	Элементы.СоставБюджетаФакт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджетаФакт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджетаФакт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджетаФакт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаФакт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаФакт3.Ширина = ШиринаЗ;
	
	
	Элементы.СоставБюджетаФакт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджетаГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджетаГодовойПрогноз.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт + план) ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджетаГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджетаБюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	
	Если Объект.Дата = Дата(1,1,1) тогда
		_ОбДата = ТекущаяДата();
	иначе
		_ОбДата = Объект.Дата;
	КонецЕсли;
	Элементы.СоставБюджетаБюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджетаБюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджетаПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджетаПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджетаОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджетаГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаГодовойОтклонение.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаБюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджетаОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	//ШрифтЗ = Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина);
	//
	//
	//Элементы.СоставБюджетаГодовойБюджет.Шрифт     = ШрифтЗ;	
	//Элементы.СоставБюджетаГодовойПрогноз.Шрифт    = ШрифтЗ;
	//Элементы.СоставБюджетаГодовойОтклонение.Шрифт = ШрифтЗ;
	//Элементы.СоставБюджетаБюджетМесяц.Шрифт     = ШрифтЗ;
	//Элементы.СоставБюджетаПрогнозМесяц.Шрифт    = ШрифтЗ;
	//Элементы.СоставБюджетаОтклоненияМесяц.Шрифт = ШиринаЗ;
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджетаСуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджетаСумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджетаСуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджетаСуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджетаСуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджетаСуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	// Таб часть: СоставБюджетаКлиенты
	Элементы.СоставБюджета1Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета1Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета1Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета1Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1Факт3.Ширина = ШиринаЗ;
	
	
	Элементы.СоставБюджета1Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета1ГодовойБюджет.Заголовок  = "БЮДЖЕТ";
	Элементы.СоставБюджета1ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";
	//Элементы.СоставБюджета1ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета1БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета1БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета1БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета1ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета1ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета1ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	
	Элементы.СоставБюджета1ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета1ГодовойФакт.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета1ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета1СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета1Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета1СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета1СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета1СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета1СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	// Таб часть: СоставБюджетаКлиентыБезНДС
	Элементы.СоставБюджета2Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета2Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета2Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета2Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета2Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета2ГодовойБюджет.Заголовок  = "БЮДЖЕТ";
	Элементы.СоставБюджета2ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";
	//Элементы.СоставБюджета2ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета2БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета2БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета2БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета2ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета2ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета2ОтклоненияМесяц.Заголовок = "Отклонения";
	
	Элементы.СоставБюджета2ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета2ГодовойФакт.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета2ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета2СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета2Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета2СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета2СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета2СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета2СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	// Таб часть: СоставБюджетаНепрямым
	Элементы.СоставБюджета3Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета3Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета3Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета3Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета3Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета3ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета3ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета3ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета3БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета3БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета3БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета3ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета3ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета3ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета3ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета3ГодовойФакт.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета3ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета3СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета3Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета3СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета3СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета3СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета3СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	// Таб часть: СоставБюджета4(Расшифровка) для СоставБюджета1 (По клиентам)
	
	Элементы.СоставБюджета4Контрагент.Ширина = 10;
	Элементы.СоставБюджета4Плательщик.Ширина = 10;
	Элементы.СоставБюджета4Регион.Ширина = 5;
	Элементы.СоставБюджета4Условия.Ширина = 2;
	Элементы.СоставБюджета4СтавкаНДС.Ширина = 2;
	
	
	Элементы.СоставБюджета4Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета4Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета4Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета4Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета4Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета4Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета4Факт2.ЦветФона = ФонФормы;
	
	
	
	Элементы.СоставБюджета4ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета4ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета4БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета4БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета4БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета4ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета4ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета4ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета4ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета4ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета4ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета4БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета4ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета4ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета4СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета4Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета4СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета4СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета4СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета4СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	
	// Таб часть: СоставБюджета5(Расшифровка) РасходыПоКлиентамБезНДС
	
	Элементы.СоставБюджета5Контрагент.Ширина = 10;
	Элементы.СоставБюджета5Плательщик.Ширина = 10;
	Элементы.СоставБюджета5Регион.Ширина = 5;
	Элементы.СоставБюджета5Условия.Ширина = 2;
	Элементы.СоставБюджета5СтавкаНДС.Ширина = 2;
	
	
	Элементы.СоставБюджета5Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета5Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета5Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета5Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета5Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета5Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета5Факт2.ЦветФона = ФонФормы;
	
	
	
	Элементы.СоставБюджета5ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета5ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета5БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета5БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета5БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета5ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета5ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета5ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета5ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета5ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета5ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета5БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета5ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета5ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета5СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета5Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета5СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета5СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета5СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета5СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	// Таб часть: СоставБюджета6(Расшифровка) для Непрямым
	
	Элементы.СоставБюджета6Контрагент.Ширина = 10;
	Элементы.СоставБюджета6Плательщик.Ширина = 10;
	Элементы.СоставБюджета6Регион.Ширина = 5;
	Элементы.СоставБюджета6Условия.Ширина = 2;
	Элементы.СоставБюджета6СтавкаНДС.Ширина = 2;
	
	
	Элементы.СоставБюджета6Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета6Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета6Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета6Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6Факт3.Ширина = ШиринаЗ;
	
	
	Элементы.СоставБюджета6Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета6ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета6ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета6БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета6БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета6БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета6ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета6ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета6БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета6СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета6Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета6СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета6СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета6СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета6СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	// Таб часть: СоставБюджета7(Расшифровка) Основная
	
	Элементы.СоставБюджета7СтатьяОборотовПоБюджетамабс_КодБюджетнойСтатьи.Ширина = 6;
	
	Элементы.СоставБюджета7Контрагент.Ширина = 10;
	Элементы.СоставБюджета7Бренд1.Ширина     = 10;
	//Элементы.СоставБюджета7Плательщик.Ширина = 10;
	Элементы.СоставБюджета7СтавкаНДС.Ширина        = 2;
	Элементы.СоставБюджета7КомментарийАкции.Ширина = 2;
	
	Элементы.СоставБюджета7Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета7Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета7Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета7Факт1.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета7Факт2.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета7Факт3.Ширина = ШиринаЗ_1;
	
	
	Элементы.СоставБюджета7Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета7ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета7ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета7ГодовойПрогноз.Заголовок = "ПРОГНОЗ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета7БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета7БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета7БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета7ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета7ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета7ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета7ГодовойБюджет.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета7ГодовойПрогноз.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета7ГодовойОтклонение.Ширина = ШиринаЗ_1;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета7БюджетМесяц.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета7ПрогнозМесяц.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета7ОтклоненияМесяц.Ширина = ШиринаЗ_1;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета7СуммаБюджет" + н].Ширина = ШиринаЗ_1;
		Элементы["СоставБюджета7Сумма" + н].Ширина       = ШиринаЗ_1;
		Элементы["СоставБюджета7СуммаПрФакт" + н].Ширина = ШиринаЗ_1;
		Элементы["СоставБюджета7СуммаФакт" + н].Ширина   = ШиринаЗ_1;
		
		Элементы["СоставБюджета7ВидОплаты" + н].Ширина   = ШиринаВ;
		Элементы["СоставБюджета7МесяцОплаты" + н].Ширина = ШиринаМ;
		
		Элементы["СоставБюджета7СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета7СуммаПрФакт" + н].ЦветФона = ФонФормы;
		        
	КонецЦикла;
	
	
	// Таб часть: СоставБюджета8 БДДС
	
	Элементы.СоставБюджета8Контрагент.Ширина = 10;
	//Элементы.СоставБюджета7Плательщик.Ширина = 10;
	Элементы.СоставБюджета8СтавкаНДС.Ширина = 2;
	Элементы.СоставБюджета8КомментарийАкции.Ширина = 2;
	
	Элементы.СоставБюджета8Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета8Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета8Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета8Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета8Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета8Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета8Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета8ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета8ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета8БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета8БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета8БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета8ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета8ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета8ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета8ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета8ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета8ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета8БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета8ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета8ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета8СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета8Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета8СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета8СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета8СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета8СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	
	
	// Таб часть: СоставБюджета9 // Без НДС
	
	Элементы.СоставБюджета9Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета9Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета9Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета9Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета9Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета9ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета9ГодовойПрогноз.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт + план) ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджетаГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета9БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	
	Если Объект.Дата = Дата(1,1,1) тогда
		_ОбДата = ТекущаяДата();
	иначе
		_ОбДата = Объект.Дата;
	КонецЕсли;
	Элементы.СоставБюджета9БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета9БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета9ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета9ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета9ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета9ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9ГодовойОтклонение.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета9ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета9СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета9Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета9СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета9СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета9СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета9СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	// Таб часть: СоставБюджета10(Расшифровка) Без НДС
	
	Элементы.СоставБюджета10абс_КодБюджетнойСтатьи.Ширина = 6;
	
	Элементы.СоставБюджета10Контрагент.Ширина = 10;
	Элементы.СоставБюджета10Бренд.Ширина     = 10;
	//Элементы.СоставБюджета7Плательщик.Ширина = 10;
	Элементы.СоставБюджета10СтавкаНДС.Ширина = 2;
	Элементы.СоставБюджета10КомментарийАкции.Ширина = 2;
	
	Элементы.СоставБюджета10Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета10Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета10Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета10Факт1.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета10Факт2.Ширина = ШиринаЗ_1;
	Элементы.СоставБюджета10Факт3.Ширина = ШиринаЗ_1;
	
	Элементы.СоставБюджета10Факт2.ЦветФона = ФонФормы;
	
	
	
	Элементы.СоставБюджета10ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета10ГодовойПрогноз.Заголовок = "ПРОГНОЗ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета10БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета10БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета10БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета10ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета10ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета10ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета10ГодовойБюджет.Ширина     = ШиринаЗ_1;
	Элементы.СоставБюджета10.Ширина                  = ШиринаЗ_1;
	Элементы.СоставБюджета10ГодовойОтклонение.Ширина = ШиринаЗ_1;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета10БюджетМесяц.Ширина       = ШиринаЗ_1;
	Элементы.СоставБюджета10ПрогнозМесяц.Ширина      = ШиринаЗ_1;
	Элементы.СоставБюджета10ОтклоненияМесяц.Ширина   = ШиринаЗ_1;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета10СуммаБюджет" + н].Ширина = ШиринаЗ_1;
		Элементы["СоставБюджета10Сумма" + н].Ширина       = ШиринаЗ_1;
		Элементы["СоставБюджета10СуммаПрФакт" + н].Ширина = ШиринаЗ_1;
		Элементы["СоставБюджета10СуммаФакт" + н].Ширина   = ШиринаЗ_1;
		
		Элементы["СоставБюджета10СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета10СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
		
	КонецЦикла;
	
	
	
	
	
	// Таб часть: СоставБюджета11 БДДС
	
	Элементы.СоставБюджета11Контрагент.Ширина = 10;
	//Элементы.СоставБюджета7Плательщик.Ширина = 10;
	//Элементы.СоставБюджета11СтавкаНДС.Ширина = 2;
	//Элементы.СоставБюджета11КомментарийАкции.Ширина = 2;
	
	Элементы.СоставБюджета11Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета11Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета11Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета11Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета11Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета11Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета11Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета11ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета11ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета11БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета11БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета11БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета8ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета11ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета11ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета11ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета11ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета11ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета11БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета11ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета11ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета11СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета11Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета11СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета11СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета11СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета11СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	
	
	// Эксплуатация Таб часть: СоставБюджета6
	
	Элементы.СоставБюджета6Контрагент1.Ширина = 10;
	Элементы.СоставБюджета6Плательщик1.Ширина = 10;
	Элементы.СоставБюджета6Регион1.Ширина = 5;
	Элементы.СоставБюджета6Условия1.Ширина = 2;
	Элементы.СоставБюджета6СтавкаНДС1.Ширина = 2;
	
	
	Элементы.СоставБюджета6Факт4.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета6Факт5.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета6Факт6.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета6Факт4.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6Факт5.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6Факт6.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета6Факт5.ЦветФона = ФонФормы;

	
	Элементы.СоставБюджета6ГодовойБюджет1.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета6ГодовойПрогноз1.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета6БюджетГод1.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета6БюджетМесяцГ1.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета6БюджетМесяц1.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета6ПрогнозМесяц1.Заголовок = "ФАКТ";
	Элементы.СоставБюджета6ОтклоненияМесяц1.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета6ГодовойБюджет1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ГодовойПрогноз1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ГодовойОтклонение1.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета6БюджетМесяц1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ПрогнозМесяц1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета6ОтклоненияМесяц1.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 13 по 24 цикл
		
		Элементы["СоставБюджета6СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета6Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета6СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета6СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета6СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета6СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	
	
	// Таб часть: СоставБюджетаНепрямым БезНДС
	Элементы.СоставБюджета13Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета13Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета13Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета13Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета13Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета13ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета13ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета3ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета13БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета13БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета13БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета3ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета13ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета13ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета13ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета3ГодовойФакт.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета13ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета13СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета13Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета13СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета13СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета13СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета13СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	
	//
	// Непрямым Без НДС Таб часть: СоставБюджета14
	
	Элементы.СоставБюджета14Контрагент.Ширина = 10;
	Элементы.СоставБюджета14Сеть.Ширина = 10;
	//Элементы.СоставБюджета14Регион.Ширина = 5;
	//Элементы.СоставБюджета14Условия.Ширина = 2;
	Элементы.СоставБюджета14СтавкаНДС.Ширина = 2;
	
	
	Элементы.СоставБюджета14Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета14Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета14Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета14Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета14Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета14Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета14Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета14ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета14ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета14БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета14БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета14БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета14ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета14ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета14ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета14ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета14ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета14БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета14ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета14ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета14СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета14Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета14СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета14СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета14СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета14СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	

	/////////////////////////////////////////////////////////////////
	// ТМ
	
	// ТМ Таб часть: СоставБюджета15
	
	
	Элементы.СоставБюджета15Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета15Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета15Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета15Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета15Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета15Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета15Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета15ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета15ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета15БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета15БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета15БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета15ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета15ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета15ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета15ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета15ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета15БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета15ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета15ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета15СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета15Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета15СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета15СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета15СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета15СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	// ТМ Таб часть: СоставБюджета16 (Расшифровка)
	
	Элементы.СоставБюджета16Контрагент.Ширина = 10;
	Элементы.СоставБюджета16Сеть.Ширина = 10;
	//Элементы.СоставБюджета14Регион.Ширина = 5;
	//Элементы.СоставБюджета14Условия.Ширина = 2;
	Элементы.СоставБюджета16СтавкаНДС.Ширина = 2;
	
	
	Элементы.СоставБюджета16Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета16Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета16Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета16Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета16Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета16Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета16Факт2.ЦветФона = ФонФормы;
	
	
	
	Элементы.СоставБюджета16ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета16ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета16БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета16БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета16БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета16ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета16ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета16ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета16ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета16ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета16БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета16ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета16ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета16СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета16Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета16СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета16СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета16СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета16СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	
	
	// ТМ Без НДС Таб часть: СоставБюджета17 
	
	
	Элементы.СоставБюджета17Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета17Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета17Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета17Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета17Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета17Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета17Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета17ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета17ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета17БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета17БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета17БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета17ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета17ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета17ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета17ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета17ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета17БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета17ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета17ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета17СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета17Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета17СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета17СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета17СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета17СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	// ТМ  Без НДС Таб часть: СоставБюджета18  (Расшифровка)
	
	Элементы.СоставБюджета18Контрагент.Ширина = 10;
	Элементы.СоставБюджета18Сеть.Ширина = 10;
	//Элементы.СоставБюджета14Регион.Ширина = 5;
	//Элементы.СоставБюджета14Условия.Ширина = 2;
	Элементы.СоставБюджета18СтавкаНДС.Ширина = 2;
	
	
	Элементы.СоставБюджета18Факт1.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-36)),"ЧГ=0");
	Элементы.СоставБюджета18Факт2.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-24)),"ЧГ=0");
	Элементы.СоставБюджета18Факт3.Заголовок = "ФАКТ " +Формат(Год(ДобавитьМесяц(Объект.ДатаПланирования,-12)),"ЧГ=0");
	
	Элементы.СоставБюджета18Факт1.Ширина = ШиринаЗ;
	Элементы.СоставБюджета18Факт2.Ширина = ШиринаЗ;
	Элементы.СоставБюджета18Факт3.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета18Факт2.ЦветФона = ФонФормы;
	
	
	Элементы.СоставБюджета18ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета18ГодовойПрогноз.Заголовок = "ПРОГНОЗ (факт + план)";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета4ГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета18БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	Элементы.СоставБюджета18БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы.СоставБюджета18БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджета6ПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы.СоставБюджета18ПрогнозМесяц.Заголовок = "ФАКТ";
	Элементы.СоставБюджета18ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
	Элементы.СоставБюджета18ГодовойБюджет.Ширина = ШиринаЗ;
	Элементы.СоставБюджета18ГодовойПрогноз.Ширина = ШиринаЗ;
	Элементы.СоставБюджета18ГодовойОтклонение.Ширина = ШиринаЗ;
	//Элементы.СоставБюджета4ГодовойФакт.Ширина = ШиринаЗ;
	
	Элементы.СоставБюджета18БюджетМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета18ПрогнозМесяц.Ширина = ШиринаЗ;
	Элементы.СоставБюджета18ОтклоненияМесяц.Ширина = ШиринаЗ;
	
	
	
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета18СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета18Сумма" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета18СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета18СуммаФакт" + н].Ширина = ШиринаЗ;
		
		Элементы["СоставБюджета18СуммаБюджет" + н].ЦветФона = ФонФормы;
		Элементы["СоставБюджета18СуммаПрФакт" + н].ЦветФона = ФонФормы;
		
	КонецЦикла;
	
	
	

	
	ИзменитьВидимостьСтраниц();
	
	
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьСтраниц()
	
	
	Элементы.ГруппаТМНепрямым.Видимость     = Ложь;

	Если СокрЛП(Объект.ЦФО.Код) = "001" 
	или  Объект.ЦФО.Лео_ЦЗ = "ФОТ"
		тогда 
	Элементы.СтраницаБезНДС.Видимость  = Ложь;
	КонецЕсли;
	
	Если  Объект.ЦФО.Лео_ЦЗ = "ФОТ"  тогда
	Элементы.СтраницаФОТ.Видимость = Истина;
	КонецЕсли;

	
	Элементы.СтраницаРасходыПоКлиентам.Видимость  = Ложь;
	Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Ложь;
	//Элементы.СтраницаНепрямым.Видимость           = Ложь;
	Элементы.Дополнительно.Видимость              = Ложь;
	Элементы.СтраницаЭксплуатация.Видимость       = Ложь;
	
	Элементы.СтраницаНепрямым.Видимость           = Ложь;
	Элементы.СтраницаНепрямымБезНДС.Видимость     = Ложь;
	
	Элементы.СтраницаТМ.Видимость                 = Ложь;
	Элементы.СтраницаТМБезНДС.Видимость           = Ложь;
	
	
	////Видимость Коммерсов
	//Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда  //ОП Дистрибьюция ОБЩИЕ
	//	Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
	//	Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Истина;
	//	Элементы.СтраницаНепрямым.Видимость           = Истина;
	//	Элементы.Дополнительно.Видимость              = Истина;
	//КонецЕсли;
	
	
	//Если Объект.ЦФО.Лео_ЦЗ = "ОКП" 
	//или	 Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" 
	//или	 Объект.ЦФО.Лео_ЦЗ = "ЭО" 
	//или	 Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)"  тогда
	//
	//	Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
	//	//Элементы.СтраницаТРМ.Видимость                = Истина;
	//	//Элементы.СтраницаНепрямым.Видимость           = Истина;
	//	Элементы.Дополнительно.Видимость              = Истина;
	//
	//КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ФОТ" тогда
	Элементы.ФОТсвернуть.Видимость = Истина;
	Элементы.СоставБюджетаКонтрагент.Видимость = Истина;
    СоставБюджетаФОТ(Объект.ФОТсвернуть);
	КонецЕсли;

	
	
	
	Если СокрЛП(Объект.ЦФО.Код) = "001" тогда // ЦФО (БДР док)
		
	Элементы.СоставБюджетаСтатьяОборотовПоБюджетамабс_КодБюджетнойСтатьи.Видимость = Ложь;
	Элементы.СоставБюджета17СтатьяОборотовПоБюджетамабс_КодБюджетнойСтатьи.Видимость = Ложь;
		
		
        Элементы.ФормаГруппаПланы.Видимость = Ложь; // кнопка Заполнить
		
		Элементы.СоставБюджета17ЗаполнитьБДР_Старый.Видимость = Истина;
		
		//НомерПредставление
		Элементы.СоставБюджетаНомерПредставление.Видимость   = Истина;
		Элементы.СоставБюджета1НомерПредставление.Видимость  = Истина;
		Элементы.СоставБюджета2НомерПредставление.Видимость  = Истина;
		Элементы.СоставБюджета3НомерПредставление.Видимость  = Истина;
		Элементы.СоставБюджета13НомерПредставление.Видимость = Истина;
		Элементы.СоставБюджета17НомерПредставление.Видимость = Истина;
		
		Элементы.Дополнительно.Видимость                = Истина;
		Элементы.Дополнительно.Заголовок                = "Заполнение";	
		Элементы.ДобавитьКонтрагентовИзПланаПродаж.Заголовок = "Заполнить по опер.планам";
		Элементы.ПроцентТО.Видимость = Ложь;
		
		Элементы.СтраницаОсновная.Заголовок  = "БДР";	
		Элементы.СтраницаРасшифровкаОсновная.Видимость  = Ложь;
		
                      	
		Элементы.СтраницаРасходыПоКлиентам.Видимость     = Истина;  //Доходы
		Элементы.СтраницаРасходыПоКлиентам.Заголовок     = "ДОХОДЫ";	
		Элементы.ГруппаРасшифровкаПоКлиентам.Видимость   = Ложь;
		
		Элементы.СтраницаПоКлиентамБезНДС.Видимость      = Истина;  //Производство
		Элементы.СтраницаПоКлиентамБезНДС.Заголовок      = "Производство";
		Элементы.ГруппаРасшифровкаРасходовТРМ.Видимость  = Ложь;
		
		Элементы.СтраницаНепрямым.Видимость                    = Истина;  //Коммерческие
		Элементы.СтраницаНепрямым.Заголовок                    = "Коммерческие";
		Элементы.ГруппаРасшифровкаРасходовНепряиыи.Видимость   = Ложь;
		
		Элементы.СтраницаНепрямымБезНДС.Видимость              = Истина;  //Операционные
		Элементы.СтраницаНепрямымБезНДС.Заголовок              = "Операционные";
		Элементы.ГруппаРасшифровкаРасходовНепряиыи1.Видимость  = Ложь;
		
		Элементы.СтраницаТМ.Видимость                          = Истина;  //СверхБюджета
		Элементы.СтраницаТМ.Заголовок                          = "СВЕРХБЮДЖЕТА";
		Элементы.ГруппаРасшифровкаРасходовТМ.Видимость         = Ложь;
		
		Элементы.СтраницаТМБезНДС.Видимость                          = Истина;  //БДР old
		Элементы.СтраницаТМБезНДС.Заголовок                          = "БДР old";
		Элементы.ГруппаРасшифровкаРасходовТМБезНДС.Видимость         = Ложь;
		
		
		
		//Элементы.Дополнительно.Видимость              = Истина;
		
		//Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		//Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		//Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
		
		//Кнопки
		Элементы.ПоказатьБезНДС.Видимость = Ложь;
		Элементы.БДДС.Видимость           = Ложь;
		
		
		
		
	
	КонецЕсли;

	
	Если Объект.ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ" тогда //ИНТЕРНЕТ
                      	
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаТРМ.Видимость                = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
	
	КонецЕсли;
	
	
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда //Индустриальный
                      	
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаТРМ.Видимость                = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
	
	КонецЕсли;
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
		
	    Элементы.ГруппаТМНепрямым.Видимость           = Истина;
		
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		//Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
		
		Элементы.СоставБюджета5Регион.Видимость       = Ложь;
		Элементы.СоставБюджета5Плательщик.Видимость   = Ложь;
		
		Элементы.СтраницаНепрямым.Видимость           = Объект.Непрямым;
		//Элементы.СтраницаНепрямымБезНДС.Видимость     = Объект.Непрямым;
		
		Элементы.СтраницаТМ.Видимость                 = Объект.ТМ;
		//Элементы.СтраницаТМБезНДС.Видимость           = Объект.ТМ;
		
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ
		
	    Элементы.ГруппаТМНепрямым.Видимость           = Истина;
		
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		//Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
		
		Элементы.СоставБюджета5Регион.Видимость       = Ложь;
		Элементы.СоставБюджета5Плательщик.Видимость   = Ложь;
		
		//Элементы.СтраницаНепрямым.Видимость           = Объект.Непрямым;
		//Элементы.СтраницаНепрямымБезНДС.Видимость     = Объект.Непрямым;
		
		Элементы.СтраницаТМ.Видимость                 = Объект.ТМ;
		Элементы.Непрямым.Видимость                   = Ложь;
		//Элементы.СтраницаТМБезНДС.Видимость           = Объект.ТМ;
		
	КонецЕсли;
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда // КП
		
	    //Элементы.ГруппаТМНепрямым.Видимость           = Истина;
		
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		//Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
		
		Элементы.СоставБюджета5Регион.Видимость       = Ложь;
		Элементы.СоставБюджета5Плательщик.Видимость   = Ложь;
		
		//Элементы.СтраницаНепрямым.Видимость           = Объект.Непрямым;
		//Элементы.СтраницаНепрямымБезНДС.Видимость     = Объект.Непрямым;
		
		//Элементы.СтраницаТМ.Видимость                 = Объект.ТМ;
		//Элементы.Непрямым.Видимость                   = Ложь;
		//Элементы.СтраницаТМБезНДС.Видимость           = Объект.ТМ;
		
	КонецЕсли;
	
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда // ГУ
		
	    //Элементы.ГруппаТМНепрямым.Видимость           = Истина;
		
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		//Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
		
		Элементы.СоставБюджета5Регион.Видимость       = Ложь;
		Элементы.СоставБюджета5Плательщик.Видимость   = Ложь;
		
	КонецЕсли;
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда // ЭКС
		
	    //Элементы.ГруппаТМНепрямым.Видимость           = Истина;
		
		Элементы.СтраницаРасходыПоКлиентам.Видимость  = Истина;
		//Элементы.СтраницаПоКлиентамБезНДС.Видимость   = Истина;
		//Элементы.СтраницаНепрямым.Видимость           = Истина;
		Элементы.Дополнительно.Видимость              = Истина;
		
		//Элементы.СоставБюджета4СтавкаНДС.Видимость    = Ложь;
		Элементы.СоставБюджета4Регион.Видимость       = Ложь;
		Элементы.СоставБюджета4Плательщик.Видимость   = Ложь;
		
		Элементы.СоставБюджета5Регион.Видимость       = Ложь;
		Элементы.СоставБюджета5Плательщик.Видимость   = Ложь;
		
	КонецЕсли;
	
	
	
	
	//Видимость Эксплуатация, ИТС
	Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда  //ЭКСПЛУАТАЦИЯ, ИТС
		Элементы.СтраницаЭксплуатация.Видимость  = Истина;
		Элементы.СтраницаЭксплуатация.Заголовок = "Расшифровка";
	КонецЕсли;
	
	
	//Видимость Маркетинг
	Если Объект.ЦФО.Лео_ЦЗ = "PR" тогда  //PR
		Элементы.СтраницаЭксплуатация.Видимость  = Истина;
		Элементы.СтраницаЭксплуатация.Заголовок = "Бренд";
		
	Элементы.СоставБюджетаГруппаКонтрагент11.Видимость = Ложь;
	Элементы.СоставБюджета12абс_КодБюджетнойСтатьи.Видимость = Ложь;
	
	Элементы.СоставБюджета7Контрагент.Видимость = Ложь;
	Элементы.СоставБюджета7Бренд1.Видимость = Истина;
	
	// справочно
	//Элементы.СоставСправочноФакт11.Видимость = Ложь;
	
	// БезНДС
	Элементы.СоставБюджета10Контрагент.Видимость = Ложь;
	Элементы.СоставБюджета10Бренд.Видимость = Истина;
	
    КонецЕсли;

	//Кнопка Заполнение Логистики
    Если Объект.ЦФО.Лео_ЦЗ = "ЛОГИСТИКА_ГП" и НЕ (типЗнч(ЭтаФорма.Команды.Найти("кЗаполнениеЛогистики")) = Тип("КомандаФормы")) тогда  //ОП ЛОГИСТИКА_ГП
		//Добавляем новую команду
		КомандаЛог = ЭтаФорма.Команды.Добавить("кЗаполнениеЛогистики");
		КомандаЛог.Действие = "ЗаполнениеЛогистики";
		КомандаЛог.Заголовок = "Заполнение логистики";
		//Добавляем новую кнопку
		КнопкаЛог = Элементы.Вставить("кЗаполнениеЛогистики", Тип("КнопкаФормы"), Элементы.СоставБюджета.КоманднаяПанель);
		
		КнопкаЛог.Заголовок     = "Заполнение логистики";
		КнопкаЛог.Вид			= ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаЛог.ИмяКоманды	= "ЗаполнениеЛогистики";
        КнопкаЛог.Картинка      = БиблиотекаКартинок.ПодсистемаЗакупки;
		КнопкаЛог.Отображение   = ОтображениеКнопки.КартинкаИТекст
	КонецЕсли;
	
	//Кнопка Заполнение Бренд
	Если Объект.ЦФО.Лео_ЦЗ = "PR" и НЕ (типЗнч(ЭтаФорма.Команды.Найти("кЗаполнениеБренд")) = Тип("КомандаФормы")) тогда// Маркетинг
		//Добавляем новую команду
		КомандаЛог = ЭтаФорма.Команды.Добавить("кЗаполнениеБренд");
		КомандаЛог.Действие = "ЗаполнитьБренды";
		КомандаЛог.Заголовок = "Заполненить Бренды";
		//Добавляем новую кнопку
		КнопкаЛог = Элементы.Вставить("кЗаполнениеБренд", Тип("КнопкаФормы"), Элементы.СоставБюджета.КоманднаяПанель);
		
		КнопкаЛог.Заголовок     = "Заполненить Бренды";
		КнопкаЛог.Вид			= ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаЛог.ИмяКоманды	= "ЗаполнитьБренды";
        КнопкаЛог.Картинка      = БиблиотекаКартинок.Набор;
		КнопкаЛог.Отображение   = ОтображениеКнопки.КартинкаИТекст
	КонецЕсли;
	
	
	
КонецПроцедуры	


&НаСервере
Функция ПолучитьПланПродажКУ()
	
	
	ТЗПродаж = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыПродажОбороты.Контрагент КАК Контрагент,
	|	СУММА(ПланыПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ПланыПродажОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|	СУММА(ПланыПродажОбороты.НДСОборот) КАК НДСОборот,
	|	ПланыПродажОбороты.Период КАК Период,
	|	ПланыПродажОбороты.Контрагент.Лео_КаналБюджет КАК Канал
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(, , Месяц, ДокументПланирования = &ДокументПланирования) КАК ПланыПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПродажОбороты.Контрагент,
	|	ПланыПродажОбороты.Период,
	|	ПланыПродажОбороты.Контрагент.Лео_КаналБюджет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Канал,
	|	Контрагент,
	|	Период";
	
	Запрос.УстановитьПараметр("ДокументПланирования", Объект.ПланПродажКУ);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		ТЗПродаж1 = Результат.Выгрузить();	
		ТЗПродаж = ТЗПродаж1.СкопироватьКолонки();
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных.Выберите документ План продаж !!!");
		
	КонецЕсли;
	
	// Ограничение по регионам:
	// ДИСТРИБЬЮЦИЯ
	// КЛЮЧЕВЫЕ ПОКУПАТЕЛИ
	// ИНДУСТРИАЛЬНЫЙ
	// ГОС. УЧРЕЖДЕНИЯ
	// ЭКСПОРТ
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда //ДИСТРИБЬЮЦИЯ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000004");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда //КЛЮЧЕВЫЕ ПОКУПАТЕЛИ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000007");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда //ИНДУСТРИАЛЬНЫЙ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000009");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда //ФАРМ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000004");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда //МТ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000004");
	КонецЕсли;

	
	Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда //ГОС. УЧРЕЖДЕНИЯ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000012");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда //ЭКСПОРТ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000100");
	КонецЕсли;
	
	
	Если СокрЛП(Объект.ЦФО.Код) = "001" тогда // ЦФО (БДР док)
        ТЗПродаж1.Свернуть("Канал,Период","СтоимостьОборот,НДСОборот");
		ТЗПродаж = ТЗПродаж1.Скопировать();
	КонецЕсли;
	
	
	возврат ТЗПродаж;
	
КонецФункции

&НаСервере
Функция ПолучитьПланПродаж()
	
	
	ТЗПродаж = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыПродажОбороты.Контрагент КАК Контрагент,
	|	СУММА(ПланыПродажОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ПланыПродажОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|	СУММА(ПланыПродажОбороты.НДСОборот) КАК НДСОборот,
	|	ПланыПродажОбороты.Период КАК Период,
	|	ПланыПродажОбороты.Контрагент.Лео_КаналБюджет КАК Канал
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(, , Месяц, ДокументПланирования = &ДокументПланирования) КАК ПланыПродажОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланыПродажОбороты.Контрагент,
	|	ПланыПродажОбороты.Период,
	|	ПланыПродажОбороты.Контрагент.Лео_КаналБюджет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Канал,
	|	Контрагент,
	|	Период";
	
	Запрос.УстановитьПараметр("ДокументПланирования", Объект.ПланПродаж);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		ТЗПродаж1 = Результат.Выгрузить();	
		ТЗПродаж = ТЗПродаж1.СкопироватьКолонки();
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных.Выберите документ План продаж !!!");
		
	КонецЕсли;
	
	// Ограничение по регионам:
	// ДИСТРИБЬЮЦИЯ
	// КЛЮЧЕВЫЕ ПОКУПАТЕЛИ
	// ИНДУСТРИАЛЬНЫЙ
	// ГОС. УЧРЕЖДЕНИЯ
	// ЭКСПОРТ
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда //ДИСТРИБЬЮЦИЯ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000004");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда //КЛЮЧЕВЫЕ ПОКУПАТЕЛИ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000007");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда //ИНДУСТРИАЛЬНЫЙ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000009");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда //ФАРМ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000004");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда //МТ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000004");
	КонецЕсли;

	
	Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда //ГОС. УЧРЕЖДЕНИЯ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000012");
	КонецЕсли;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда //ЭКСПОРТ 
		ТЗПродаж = ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, "Б00000100");
	КонецЕсли;
	
	
	
	Если СокрЛП(Объект.ЦФО.Код) = "001" тогда // ЦФО (БДР док)
        ТЗПродаж1.Свернуть("Канал,Период","СтоимостьОборот,НДСОборот");
		ТЗПродаж = ТЗПродаж1.Скопировать();
	КонецЕсли;
	
	возврат ТЗПродаж;
	
КонецФункции




&НаСервере
Функция ЗаполнитьПланПродажПоРегионам(ТЗПродаж, ТЗПродаж1, КодРегиона)
	
	Для каждого сс из ТЗПродаж1 цикл
		Контрагент  = сс.Контрагент;
		Отдел  = ПолучитьБизнесРегионПоУровню(Контрагент, 0);
		Если Отдел = Справочники.Регионы.НайтиПоКоду(КодРегиона) тогда //ДИСТРИБЬЮЦИЯ
			мм = ТЗПродаж.Добавить();
			ЗаполнитьЗначенияСвойств(мм,сс);
		Конецесли;
	КонецЦикла;
	
	возврат ТЗПродаж
	
КонецФункции



&НаСервере
Функция ПолучитьБизнесРегионПоУровню(Контрагент, Уровень) Экспорт
	
	Если Контрагент.Регион.Пустая() Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	ТекущийУровень = Контрагент.Регион.Уровень();
	Если ТекущийУровень < Уровень Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	БизнесРегион = Контрагент.Регион;
	Сч = ТекущийУровень - Уровень;
	Пока Сч>0 Цикл
		БизнесРегион = БизнесРегион.Родитель;
		Сч = Сч - 1;
	КонецЦикла;
	
	Возврат БизнесРегион;
	
КонецФункции


&НаСервере
Процедура УстановитьДоступностьЭлементовФормыПользователюВводБюджета()
	
	ВозможноРедактированиеШапки = Объект.ЗакрытыйПериод < Объект.ДатаПланирования;
	
	Элементы.Дата.ТолькоПросмотр 				= НЕ ВозможноРедактированиеШапки;
	Элементы.Номер.ТолькоПросмотр 				= НЕ ВозможноРедактированиеШапки;
	Элементы.ЦФО.ТолькоПросмотр 				= НЕ ВозможноРедактированиеШапки;
	Элементы.Организация.ТолькоПросмотр 		= НЕ ВозможноРедактированиеШапки;
	Элементы.ДатаПланирования.ТолькоПросмотр 	= НЕ ВозможноРедактированиеШапки;
	Элементы.ВидОперации.ТолькоПросмотр 		= НЕ ВозможноРедактированиеШапки;
	Элементы.СценарийПланирования.ТолькоПросмотр= НЕ ВозможноРедактированиеШапки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьРедактированияСтокиБюджета(СтрокаБюджета, ЗакрытыйПериод, ИмяКолонки, Отказ)
	
	Если РольДоступна("абс_Финансист") Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЗакрытыйПериод) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрытыйПериод < Объект.ДатаПланирования Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрытыйПериод >= НачалоМесяца(КонецГода(Объект.ДатаПланирования)) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Запрещено редактировать данные в закрытом периоде!", Отказ);
		Возврат;
	КонецЕсли;
	
	ТекПериод 			= ЗакрытыйПериод;
	ИндексТекПериода 	= Месяц(ТекПериод);
	
	ИндексКолонкиСтр = СтрЗаменить(ИмяКолонки, "СоставБюджета"				, "");
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "СоставБюджетаДДС"		, "");
	
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "Количество"			, "");
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "СуммаБезНДС"			, "");
	ИндексКолонкиСтр = СтрЗаменить(ИндексКолонкиСтр, "Сумма"				, "");
	
	ИндексКолонки = ОбщегоНазначения.ПривестиСтрокуКЧислу(ИндексКолонкиСтр, Истина);
	
	// Если в закрытом периоде есть данные по бюджетам, то запретим редактировать сроку целиком
	Если ИндексКолонки = Неопределено Тогда
		//В случае редактировании колонки - месяца
		//Если указан номер колонки, то проверим просто по индексу периода
		Если ИндексКолонки <= ИндексТекПериода Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Запрещено редактировать данные в закрытом периоде!", Отказ);
			Возврат;
		КонецЕсли;		
	Иначе
		//В случае редактирования прочих данных или удаления данных
		//Если номер колонки не указан, то запретим редактировать строку целиком если в ней заполнены данные в закрытом периоде
		Для Н = 1 по ИндексТекПериода Цикл
			Если ЗначениеЗаполнено(СтрокаБюджета["Количество" + Н]) ИЛИ
				ЗначениеЗаполнено(СтрокаБюджета["Сумма" + Н]) ИЛИ
				ЗначениеЗаполнено(СтрокаБюджета["СуммаБезНДС" + Н]) Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Запрещено редактировать данные в закрытом периоде!", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытыйПериодПриИзменении(Элемент)
	
	Объект.ЗакрытыйПериод = НачалоМесяца(Объект.ЗакрытыйПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджетаДДСПередНачаломИзменения(Элемент, Отказ)
	
	ИмяТекКолонки 	= Элементы.СоставБюджета.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы.СоставБюджета.ТекущиеДанные;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(ТекДанные, Объект.ЗакрытыйПериод, ИмяТекКолонки, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСостояниеПодготовка(Команда)
	
	Объект.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.КомандаУстановитьСостояниеПодготовка.Видимость = Объект.Состояние = Перечисления.СостоянияОбъектов.Отклонен;			
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБДДСПоПланамИЗадолженности(Команда)
	
	//Если Объект.СоставБюджетаДДС.Количество()>0 Тогда
	//	Если НЕ Вопрос("Перезаполнить БДДС?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Выбрать период перезаполнения
	ФормаНастройкиПериода = Новый НастройкаПериода;
	ФормаНастройкиПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	ФормаНастройкиПериода.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
	ФормаНастройкиПериода.ДатаОкончания	= КонецМесяца(ТекущаяДата());
	
	ФормаНастройкиПериода.РедактироватьКакИнтервал 	= Ложь;
	ФормаНастройкиПериода.РедактироватьКакПериод 	= Истина;
	
	Если НЕ ФормаНастройкиПериода.Редактировать() Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим выбранный период
	НекорректныйПериод = Ложь;
	Если ФормаНастройкиПериода.ДатаНачала 		> КонецГода(Объект.ДатаПланирования) ИЛИ
		ФормаНастройкиПериода.ДатаОкончания 	> КонецГода(Объект.ДатаПланирования) ИЛИ
		ФормаНастройкиПериода.ДатаНачала 		< НачалоГода(Объект.ДатаПланирования) ИЛИ
		ФормаНастройкиПериода.ДатаОкончания 	< НачалоГода(Объект.ДатаПланирования) Тогда
		
		НекорректныйПериод = Истина;
		
	КонецЕсли;
	
	Если НекорректныйПериод Тогда
		Сообщить("Выбран некорректный период!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьБДДСПоПланамИЗадолженностиСервер(ФормаНастройкиПериода.ДатаНачала, ФормаНастройкиПериода.ДатаОкончания);
	
	ЭтаФорма.Модифицированность = Истина;	
	
КонецПроцедуры

Процедура ЗаполнитьБДДСПоПланамИЗадолженностиСервер(Знач НачПериода, Знач КонПериода)
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьБДДСПоПланамИЗадолженности(НачПериода, КонПериода);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыручкуОперФакт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьВыручкуОперФактСервер();
	ЭтаФорма.Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСебестоимостьОперФакт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьСебестоимостьОперФактСервер();
	ЭтаФорма.Модифицированность=Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРетроОперФакт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьРетроОперФактСерверСервер();
	ЭтаФорма.Модифицированность=Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспортОперФакт(Команда)
	
	Отказ = Ложь;
	
	ПроверитьВозможностьРедактированияСтокиБюджета(Неопределено, Объект.ЗакрытыйПериод, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//Если Объект.СоставБюджета.Количество()>0 Тогда
	//	Если Вопрос("Перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
	//		//Объект.СоставБюджета.Очистить();
	//	КонецЕсли;
	//КонецЕсли;
	
	//Объект.СоставБюджета.Очистить();
	
	ЗаполнитьТранспортОперФактСервер();
	ЭтаФорма.Модифицированность=Истина;	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВыручкуОперФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиВыручкиОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСебестоимостьОперФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиСебестоимостиОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРетроОперФактСерверСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиРетроОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТранспортОперФактСервер()
	
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиТранспортаОперФакт();
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Комментарий(Команда)
	// Вставить содержимое обработчика.
	
	Если НЕ Объект.Ссылка.Пустая() тогда
		
		ИмяТекСтроки    = ТекущийЭлемент.ТекущиеДанные.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		УИН = Объект.Ссылка.УникальныйИдентификатор();
		
		
		ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
		ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
		
		Если СтрДлина(ТабЧ) = 13 тогда //СоставБюджета
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,14,СтрДлина(ИмяТекКолонки)));			
			
		иначе
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
			
		КонецЕсли;	
		
		
		
		
		
		
		ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
		НомерСтроки     = ТекДанные.НомерСтроки;
		ТекЗначение     = ТекДанные[ИмяТекКолонки];
		
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		
		
		
		
		СтрДлинаКолонки = СтрДлина(ИмяТекКолонки);
		иКолонка = "";
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			мМесяц = лео_ПолучитьМесяц(Прав(Элементы[ТекущийЭлемент.Имя].ТекущийЭлемент.Имя,2));
		иначе
			мМесяц = лео_ПолучитьМесяц(Прав(Элементы[ТекущийЭлемент.Имя].ТекущийЭлемент.Имя,1));
		КонецЕсли;		
		
		Если СтрДлинаКолонки  = 6 или СтрДлинаКолонки  = 7  тогда
			
			иКолонка = "Сумма";
			_ИмяТекКолонки = "(План) " + мМесяц;
			Лео_ВводБюджетаКомментарии(УИН,ИмяТекСтроки,_ИмяТекКолонки,ТекущийЭлемент.Имя,НомерСтроки,ТекЗначение);
			
		ИначеЕсли СтрДлинаКолонки  = 10 или СтрДлинаКолонки  = 11  тогда
			
			иКолонка = "СуммаФакт";
			_ИмяТекКолонки = "(Факт) " + мМесяц;
			Лео_ВводБюджетаКомментарии(УИН,ИмяТекСтроки,_ИмяТекКолонки,ТекущийЭлемент.Имя,НомерСтроки,ТекЗначение);
		ИначеЕсли СтрДлинаКолонки  = 12 или СтрДлинаКолонки  = 13  тогда
			
			Если Лев(ИмяТекКолонки,7) = "СуммаПр" тогда
				иКолонка = "СуммаПрФакт";
				_ИмяТекКолонки = "(Пр/Факт) " + мМесяц;
				Лео_ВводБюджетаКомментарии(УИН,ИмяТекСтроки,_ИмяТекКолонки,ТекущийЭлемент.Имя,НомерСтроки,ТекЗначение);
			КонецЕсли;
			
			Если Лев(ИмяТекКолонки,7) = "СуммаБю" тогда
				иКолонка = "СуммаБюджет";
				_ИмяТекКолонки = "(Бюджет) " + мМесяц;
				Лео_ВводБюджетаКомментарии(УИН,ИмяТекСтроки,_ИмяТекКолонки,ТекущийЭлемент.Имя,НомерСтроки,ТекЗначение);
			КонецЕсли;
		КонецЕсли;	   
		
		
		
		
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для оставления комментария запишите документ.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лео_ВводБюджетаКомментарии(УИН,ИмяТекСтроки,ИмяТекКолонки,ИмяТабЧасти,НомерСтроки,ТекЗначение)
	
	МенЗаписи =	РегистрыСведений.Лео_ВводБюджетаКомментарии.СоздатьМенеджерЗаписи();
	МенЗаписи.УИН = УИН;	
	МенЗаписи.абс_КодБюджетнойСтатьи = ИмяТекСтроки;	
	МенЗаписи.ТекКолонка = ИмяТекКолонки;
	МенЗаписи.Раздел     = ИмяТабЧасти;
	МенЗаписи.ТекСтрока  = НомерСтроки;
	
	МенЗаписи.Прочитать();
	Если НЕ МенЗаписи.Выбран() тогда
		МенЗаписи.УИН = УИН;	
		МенЗаписи.абс_КодБюджетнойСтатьи = ИмяТекСтроки;	
		МенЗаписи.ТекКолонка = ИмяТекКолонки;
		МенЗаписи.Раздел     = ИмяТабЧасти;
		МенЗаписи.ТекСтрока  = НомерСтроки;
		МенЗаписи.Значение   = ТекЗначение;
	КонецЕсли;	
	
	
	МенЗаписи.ПолучитьФорму("ФормаЗаписи").Открыть();
	
КонецПроцедуры

&НаКлиенте
Функция лео_ПолучитьМесяц(Номер)
	
	Если Номер = "1" тогда
		месяц = "Январь";
	ИначеЕсли Номер = "2" тогда
		месяц = "Февраль";
	ИначеЕсли Номер = "3" тогда
		месяц = "Март";
	ИначеЕсли Номер = "4" тогда
		месяц = "Апрель";
	ИначеЕсли Номер = "5" тогда
		месяц = "Май";
	ИначеЕсли Номер = "6" тогда
		месяц = "Июнь";
	ИначеЕсли Номер = "7" тогда
		месяц = "Июль";
	ИначеЕсли Номер = "8" тогда
		месяц = "Август";
	ИначеЕсли Номер = "9" тогда
		месяц = "Сентябрь";
	ИначеЕсли Номер = "10" тогда
		месяц = "Октябрь";
	ИначеЕсли Номер = "11" тогда
		месяц = "Ноябрь";
	ИначеЕсли Номер = "12" тогда
		месяц = "Декабрь";
	КонецЕсли;
	
	возврат месяц;
	
КонецФункции

&НаСервере
Функция лео_ПолучитьМесяцСервер(Номер)
	
	Если Номер = 1 тогда
		месяц = "Январь";
	ИначеЕсли Номер = 2 тогда
		месяц = "Февраль";
	ИначеЕсли Номер = 3 тогда
		месяц = "Март";
	ИначеЕсли Номер = 4 тогда
		месяц = "Апрель";
	ИначеЕсли Номер = 5 тогда
		месяц = "Май";
	ИначеЕсли Номер = 6 тогда
		месяц = "Июнь";
	ИначеЕсли Номер = 7 тогда
		месяц = "Июль";
	ИначеЕсли Номер = 8 тогда
		месяц = "Август";
	ИначеЕсли Номер = 9 тогда
		месяц = "Сентябрь";
	ИначеЕсли Номер = 10 тогда
		месяц = "Октябрь";
	ИначеЕсли Номер = 11 тогда
		месяц = "Ноябрь";
	ИначеЕсли Номер = 12 тогда
		месяц = "Декабрь";
	КонецЕсли;
	
	возврат месяц;
	
КонецФункции


&НаКлиенте
Процедура Последующий(Команда)
	// Вставить содержимое обработчика.
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	// Расшифровка расходов по Клиентам, ТРМ, Непрямым
	Если ТабЧ = "СоставБюджета4" или ТабЧ = "СоставБюджета5" или ТабЧ = "СоставБюджета6" или ТабЧ = "СоставБюджета7" тогда
		Постфикс = Сред(ИмяТекКолонки,15,13);
		Если Лев(Постфикс,11) = "МесяцОплаты" тогда
			Если СтрДлина(Постфикс) = 12 тогда
				Индекс = Число(Прав(Постфикс,1));
			иначе
				Индекс = Число(Прав(Постфикс,2));
			КонецЕсли;
			
			Для Н = Индекс По 12 Цикл
				
				Если  Н = 12 тогда
					мОпла = Число(Прав(Год(Объект.ДатаПланирования) + 1,2));
				иначе
					мОпла = Н + 1;
				Конецесли;	
				ТекДанные["МесяцОплаты"+ Н] = мОпла;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Предыдущий(Команда)
	// Вставить содержимое обработчика.
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	// Расшифровка расходов по Клиентам, ТРМ, Непрямым
	Если ТабЧ = "СоставБюджета4" или ТабЧ = "СоставБюджета5" или ТабЧ = "СоставБюджета6" или ТабЧ = "СоставБюджета7" тогда
		Постфикс = Сред(ИмяТекКолонки,15,13);
		Если Лев(Постфикс,11) = "МесяцОплаты" тогда
			Если СтрДлина(Постфикс) = 12 тогда
				Индекс = Число(Прав(Постфикс,1));
			иначе
				Индекс = Число(Прав(Постфикс,2));
			КонецЕсли;
			
			Для Н = 1 По Индекс Цикл
				
				Если  Н = 1 тогда
					мОпла = Число(Прав(Год(Объект.ДатаПланирования) - 1,2));
				иначе
					мОпла = Н - 1;
				Конецесли;	
				
				ТекДанные["МесяцОплаты"+ Н] = мОпла;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Текущий(Команда)
	// Вставить содержимое обработчика.
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	// Расшифровка расходов по Клиентам, ТРМ, Непрямым
	Если ТабЧ = "СоставБюджета4" или ТабЧ = "СоставБюджета5" или ТабЧ = "СоставБюджета6" или ТабЧ = "СоставБюджета7" тогда
		Постфикс = Сред(ИмяТекКолонки,15,13);
		Если Лев(Постфикс,11) = "МесяцОплаты" тогда
			Если СтрДлина(Постфикс) = 12 тогда
				Индекс = Число(Прав(Постфикс,1));
			иначе
				Индекс = Число(Прав(Постфикс,2));
			КонецЕсли;
			
			Для Н = Индекс По 12 Цикл
				ТекДанные["МесяцОплаты"+ Н] = Н;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	// Вставить содержимое обработчика.
	
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	
	////////////////////////////////////////////////////////////////////
	// ВидОплаты,МесяцОплаты
	
	// ВидОплаты
	Если Найти(ИмяТекКолонки,"ВидОплаты") > 0
		//     или Найти(ИмяТекКолонки,"МесяцОплаты") > 0
		тогда
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			иИндекс = Число(Прав(ИмяТекКолонки,2));
		иначе
			иИндекс = Число(Прав(ИмяТекКолонки,1));
		КонецЕсли;		
		_ВидОплаты = ТекДанные["ВидОплаты"+ иИндекс];
		Для Н = иИндекс По 12 Цикл
			ТекДанные["ВидОплаты"+ Н] = _ВидОплаты;
		КонецЦикла;
		
		возврат;
	КонецЕсли;	 
	
	
	// МесяцОплаты
	Если Найти(ИмяТекКолонки,"МесяцОплаты") > 0
		//     или Найти(ИмяТекКолонки,"МесяцОплаты") > 0
		тогда
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			иИндекс = Число(Прав(ИмяТекКолонки,2));
		иначе
			иИндекс = Число(Прав(ИмяТекКолонки,1));
		КонецЕсли;		
		_МесяцОплаты = ТекДанные["МесяцОплаты"+ иИндекс];
		Для Н = иИндекс По 12 Цикл
			ТекДанные["МесяцОплаты"+ Н] = _МесяцОплаты;
		КонецЦикла;
		
		возврат;
	КонецЕсли;	 
	/////////////////////////////////////////////////////////////////////////////////////////
	
	
	
	
	Если СтрДлина(ТабЧ) = 13 тогда //СоставБюджета
		
		ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,14,СтрДлина(ИмяТекКолонки)));			
		
	иначе
		
		ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
		
	КонецЕсли;	
	
	
	
	СтрДлинаКолонки = СтрДлина(ИмяТекКолонки);
	иКолонка = "";
	
	Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
		иИндекс = Число(Прав(ИмяТекКолонки,2));
	иначе
		иИндекс = Число(Прав(ИмяТекКолонки,1));
	КонецЕсли;		
	
	Если СтрДлинаКолонки  = 6 или СтрДлинаКолонки  = 7  тогда
		
		иКолонка = "Сумма"
		
	ИначеЕсли СтрДлинаКолонки  = 10 или СтрДлинаКолонки  = 11  тогда
		
		иКолонка = "СуммаФакт"
		
	ИначеЕсли СтрДлинаКолонки  = 12 или СтрДлинаКолонки  = 13  тогда
		
		Если Лев(ИмяТекКолонки,7) = "СуммаПр" тогда
			иКолонка = "СуммаПрФакт"
		КонецЕсли;
		
		Если Лев(ИмяТекКолонки,7) = "СуммаБю" тогда
			иКолонка = "СуммаБюджет"
		КонецЕсли;
	КонецЕсли;	   
	
	
	_ПоказатьПредупреждение = Ложь;	
	//_ПоказатьПредупреждение = Истина;
	
	
	//Если  ТабЧ <> "СоставБюджета7" тогда
	
	Если НЕ ПустаяСтрока(иКолонка) тогда
		Для Н = иИндекс По 12 Цикл
			ТекДанные[иКолонка + Н] = ТекДанные[иКолонка + иИндекс];
			
			//ПроссумируемЕксель(ТабЧ,ТабЧ + (иКолонка + Н),ТекДанные);
			
			ПроссумируемЕксель(ТабЧ,(иКолонка + Н),ТекДанные);
			
			
			_ПоказатьПредупреждение = Истина;
		КонецЦикла;
	КонецЕсли;	 
	
	//КонецЕсли;	 
	
	
	// Основная расшифровка	
	Если  ТабЧ = "СоставБюджета7" и _ПоказатьПредупреждение тогда
		
		
		Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		иначе // Лео_СтатьиОборотовРасшифровка
			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;
		
		
		//Основная
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
			Для Н = иИндекс По 12 Цикл
				_ТекЗнач = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент(ТабЧ,(иКолонка + Н),_СтатьяОборотов);
				мПоиска[0][иКолонка + Н] = _ТекЗнач;
				ПроссумируемЕксель("СоставБюджета",иКолонка + Н,мПоиска[0]);
				
			КонецЦикла;
		КонецЕсли;
		
		
		
		//Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
		//	
		//	// Основная
		//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",иКолонка,_СтатьяОборотов);
		//	мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	Если мПоиска.количество() > 0 тогда
		//		ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
		//	КонецЕсли;
		//	// По клиентам
		//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета1",иКолонка,_СтатьяОборотов);
		//	мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	Если мПоиска.количество() > 0 тогда
		//		ПроссумируемЕксельКопированием("СоставБюджета1",иКолонка,мПоиска[0]);
		//	КонецЕсли;
		//	// ТРМ
		//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета2",иКолонка,_СтатьяОборотов);
		//	мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	Если мПоиска.количество() > 0 тогда
		//		ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
		//	КонецЕсли;
		//	// Непрямым
		//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета3",иКолонка,_СтатьяОборотов);
		//	мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	Если мПоиска.количество() > 0 тогда
		//		//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
		//		ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
		//	КонецЕсли;
		//	
		//	
		//	
		//КонецЕсли;		
	КонецЕсли;	
	
	
	
	//// По клиентам	
	//Если  ТабЧ = "СоставБюджета4" и _ПоказатьПредупреждение тогда	
	//	
	//	Если ЗаполнятьОсновнуюВкладкуИРасшифровку(ТекДанные.СтатьяОборотовПоБюджетам) тогда
	//		// Род
	//		ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета4","СоставБюджета1",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//		мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельКопированием("СоставБюджета1",иКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		// Осн	
	//		ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета4","СоставБюджета",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		// ТРМ	
	//		ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета4","СоставБюджета2",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//		мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		// Непрямым	
	//		ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета4","СоставБюджета3",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//		мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//		Если мПоиска.количество() > 0 тогда
	//			ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
	//		КонецЕсли;
	//		
	//		
	//	иначе
	//		
	//		
	//		_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);	
	//		Если _СтатьяОборотов = неопределено тогда // Не задано соответствие в РС абс_СтатьиБюджетаПоЦФО
	//			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам;
	//		КонецЕсли;
	//		
	//		Если ТабЧ = "СоставБюджета4" тогда ТабПр = "СоставБюджета1" конецЕсли;
	//		
	//		//_ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,_СтатьяОборотов);
	//		Если _СтатьяОборотов <> неопределено тогда
	//			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета4","СоставБюджета1",иКолонка,_СтатьяОборотов);
	//			мПоиска = Объект[ТабПр].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
	//			Если мПоиска.количество() > 0 тогда
	//				ПроссумируемЕксельКопированием(ТабПр,иКолонка,мПоиска[0]);
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		  // Заполним по Регионам
	//		  ЗаполнимРодительскуюТаблицуКопированиемПоРегионам("СоставБюджета4","СоставБюджета7",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам,ТекДанные.Регион);
	//		  мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки, Регион",ТекДанные.СтатьяОборотовПоБюджетам,ТекДанные.Регион));
	//		  Если (Найти(ИмяТекКолонки,"СуммаБюджет") > 0 // Бюджет
	//				или Найти(ИмяТекКолонки,"Сумма") > 0)  // План
	//			  и НЕ (Найти(ИмяТекКолонки,"СуммаФакт") > 0 или
	//				 Найти(ИмяТекКолонки,"СуммаПрФакт") > 0)
	//			  
	//			  тогда
	//			  
	//			  ПроссумируемЕксельБезРодителя("СоставБюджета7",иКолонка,мПоиска[0],Ложь);
	//		  иначе
	//			  //ПроссумируемЕксель("СоставБюджета7",ИмяТекКолонки,мПоиска[0]);
	//			  ПроссумируемЕксельКопированием("СоставБюджета7",иКолонка,мПоиска[0]);
	//			  
	//			  // Осн	
	//			  ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета4","СоставБюджета",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//			  мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//			  Если мПоиска.количество() > 0 тогда
	//				  ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
	//			  КонецЕсли;
	//			  
	//			  
	//			  
	//		  КонецЕсли;
	//		  
	//		
	//	КонецЕсли;	
	//	//// родительская
	//	//мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	//Если мПоиска.количество() > 0 тогда
	//	//	ПроссумируемЕксель("СоставБюджета1",иКолонка,мПоиска[0]);
	//	//КонецЕсли;
	//	
	//	
	//КонецЕсли;	
	
	
	//// ТРМ	
	//Если  ТабЧ = "СоставБюджета5" и _ПоказатьПредупреждение тогда	
	//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета5","СоставБюджета2",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//	мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	Если мПоиска.количество() > 0 тогда
	//  	  ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
	//	КонецЕсли;
	//  
	//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета5","СоставБюджета7",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	Если мПоиска.количество() > 0 тогда
	//  	  ПроссумируемЕксельКопированиемИтоговая("СоставБюджета7",иКолонка,мПоиска[0]);
	//	КонецЕсли;
	//	
	//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета5","СоставБюджета",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//	мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	Если мПоиска.количество() > 0 тогда
	//  	  ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
	//	КонецЕсли;
	//	
	//  
	//КонецЕсли;	
	
	//// Непрямым	
	//Если  ТабЧ = "СоставБюджета6" и _ПоказатьПредупреждение тогда	
	//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета6","СоставБюджета3",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//	мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	Если мПоиска.количество() > 0 тогда
	//  	  ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
	//	КонецЕсли;
	//	
	//	
	//	
	//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета6","СоставБюджета7",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//	мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	Если мПоиска.количество() > 0 тогда
	//  	  ПроссумируемЕксельКопированиемИтоговая("СоставБюджета7",иКолонка,мПоиска[0]);
	//	КонецЕсли;
	//	
	//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета6","СоставБюджета",иКолонка,ТекДанные.СтатьяОборотовПоБюджетам);
	//	мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ТекДанные.СтатьяОборотовПоБюджетам));
	//	Если мПоиска.количество() > 0 тогда
	//  	  ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
	//	КонецЕсли;
	//	
	//	
	//	
	//	
	//КонецЕсли;	
	
	
	
	
	
	
	
	Если _ПоказатьПредупреждение тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте результаты копирования на вкладке ""Основная""");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКомментарии(Команда)
	
	ПоказатьКомментарииНаСервере(ЭтаФорма.ТекущийЭлемент.Имя);
	
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьКомментарииНаСервере(ИмяТабЧасти)
	
	
	Набор =	РегистрыСведений.Лео_ВводБюджетаКомментарии.СоздатьНаборЗаписей();
	Набор.Отбор.УИН.Установить(Объект.Ссылка.УникальныйИдентификатор());
	Набор.Отбор.Раздел.Установить(ИмяТабЧасти);
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 тогда
		Раздел = "";
		Если ИмяТабЧасти  = "СоставБюджета4" тогда
			Раздел = "Расшифровка по клиентам";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета5" тогда
			Раздел = "Расшифровка расходов ТРМ";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета6" тогда
			Раздел = "Расшифровка расходов Непрямым";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета7" тогда
			Раздел = "Расшифровка расходов";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета" тогда
			Раздел = "Основной";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета1" тогда
			Раздел = "Расходы по клиентам";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета2" тогда
			Раздел = "ТРМ";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета3" тогда
			Раздел = "Непрямым";
		ИначеЕсли ИмяТабЧасти  = "СоставБюджета8" тогда
			Раздел = "БДДС";
		КонецЕсли;	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("РАЗДЕЛ: " + Раздел);
	КонецЕсли;
	Для каждого сс из Набор цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("-----------------------------------------");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка: " + сс.ТекСтрока + ", Колонка: " + сс.ТекКолонка + ", Значение: " + сс.Значение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Комментарий: " + сс.Комментарий);
		
		
		
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	ИзменитьВидимостьСтраниц();
	ЗаполнитьПоЦФОСервер();	
	
	ЭтаФорма.Модифицированность = Истина;
	
	ОбработатьИтоговыеСтроки();
	//СоставБюджета4ВыделитьТО();
	//СоставБюджета5ВыделитьТО();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКонтрагента(Команда)
	// Вставить содержимое обработчика.
	
	_Ф = Справочники.Контрагенты.ПолучитьФормуВыбора("ФормаВыбораУправляемая",ЭтаФорма);
	Если Не _Ф.Открыта() Тогда
		//_Ф.МножественныйВыбор = Истина;
		_Ф.Открыть();
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Функция ПолучитьКаналКонтрагента(Контрагент)
	
	//Канал
	Канал = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Канал);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Канал = Выборка.Значение;
	КонецЕсли;
	
	возврат Канал;
	
КонецФункции

&НаСервере
Процедура ДобавитьКонтрагентаКлиентаВРасшифровку(Контрагент,ТабП)
	
	
	//Канал = ПолучитьКаналКонтрагента(Контрагент);
	Канал = Контрагент.Лео_КаналБюджет;
	
	//КаналНаименование = Канал.Наименование;
	КаналНаименование = Канал;
	
	Если Канал = неопределено или НЕ ЗначениеЗаполнено(Канал) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задано свойство Канал для выбранного контрагента: "+СокрЛП(Контрагент));  
	КонецЕсли;
	
	       _Канал = ""; ЕстьИНД = Ложь;  ЕстьФАРМ = Ложь;  ЕстьМТ = Ложь; ЕстьКП = Ложь; ЕстьГУ = Ложь; ЕстьЭКСП = Ложь; ЕстьИНТЕРНЕТ = Ложь;
		Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда  //Индустриальный
	        _Канал = "ИНД";  ЕстьИНД = Истина;
		ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда  //ФАРМ
	        _Канал = "ФАРМ"; ЕстьФАРМ = Истина;
		ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда  //МТ
	        _Канал = "МТ";   ЕстьМТ = Истина;
		ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда  //КП
	        _Канал = "КП";   ЕстьКП = Истина;
		ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда  //ГУ
	        _Канал = "ГУ";   ЕстьГУ = Истина;
		ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда  //ЭКСП
	        _Канал = "ЭКСП";  ЕстьЭКСП = Истина;
		ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ" тогда  //ИНТЕРНЕТ
	        _Канал = "ИНТЕРНЕТ";  ЕстьИНТЕРНЕТ = Истина;
			
		КонецЕсли;	
			
	
	Если Канал <> Неопределено или ЗначениеЗаполнено(Канал)  тогда
		Если КаналНаименование = _Канал и ЕстьМТ тогда // МТ
			
		Если ТабП = "СоставБюджета4" или ТабП = "СоставБюджета5" тогда // По клиентам
			//ЗаполнитьРасшифровкуКлиентыМТ(Контрагент,ТабП);
			ЗаполнитьРасшифровкуКлиентыМТ_МТ(Контрагент,ТабП);
		КонецЕсли;	
		
		Если ТабП = "СоставБюджета16" или ТабП = "СоставБюджета18" тогда // ТМ
			ЗаполнитьРасшифровкуКлиентыМТ_ТМ(Контрагент,ТабП);
		КонецЕсли;	
			
		ИначеЕсли КаналНаименование = _Канал и ЕстьФАРМ тогда // ФАРМ
			
		Если ТабП = "СоставБюджета4" или ТабП = "СоставБюджета5" тогда // По клиентам
			ЗаполнитьРасшифровкуКлиентыФАРМ(Контрагент,ТабП);
		КонецЕсли;	
		Если ТабП = "СоставБюджета6" или ТабП = "СоставБюджета14" тогда // Непрямым
			ЗаполнитьРасшифровкуКлиентыФАРМ_Непрямым(Контрагент,ТабП);
		КонецЕсли;	
		Если ТабП = "СоставБюджета16" или ТабП = "СоставБюджета18" тогда // ТМ
			ЗаполнитьРасшифровкуКлиентыФАРМ_ТМ(Контрагент,ТабП);
		КонецЕсли;	
		
		ИначеЕсли КаналНаименование = _Канал и ЕстьКП тогда // КП
			ЗаполнитьРасшифровкуКлиентыКП(Контрагент,ТабП);	
		
		
		ИначеЕсли КаналНаименование = _Канал и ЕстьИНД тогда // ИНД
			ЗаполнитьРасшифровкуКлиентыИНД(Контрагент,ТабП);	
			
		ИначеЕсли КаналНаименование = _Канал и ЕстьГУ тогда // ГУ
			ЗаполнитьРасшифровкуКлиентыГУ(Контрагент,ТабП);	
			
		ИначеЕсли КаналНаименование = _Канал и ЕстьЭКСП тогда // ЭКС
			ЗаполнитьРасшифровкуКлиентыЭКС(Контрагент,ТабП);	
			
		ИначеЕсли КаналНаименование = _Канал и ЕстьИНТЕРНЕТ тогда // ИНТЕРНЕТ
			ЗаполнитьРасшифровкуКлиентыИНТЕРНЕТ(Контрагент,ТабП);	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьУсловияБонуса(Контрагент,Статья)	
	
	Договор = ОбщегоНазначения.ПолучитьОсновнойДоговорКонтрагента(Контрагент);
	
	Условие = ""; 
	// Бонус по месяцам  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Первые 1
	|	НАЧАЛОПЕРИОДА(ДоговорыКонтрагентовабс_УслугиРетро.абс_ПериодДействия, МЕСЯЦ) КАК Месяц,
	|	ДоговорыКонтрагентовабс_УслугиРетро.абс_Процент как  абс_Процент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.абс_УслугиРетро КАК ДоговорыКонтрагентовабс_УслугиРетро
	|ГДЕ
	|	ДоговорыКонтрагентовабс_УслугиРетро.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|   абс_Процент УБЫВ,
	|	Месяц УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Условие = сокрлп(Выборка.абс_Процент);
		
	КонецЕсли;
	
	возврат Условие;
	
КонецФункции		



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыКП(Контрагент,ТабП)	
	
	
	//Если ТабП = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда  //КП
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО");
			
			
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_без НДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_БОНУС");
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_СК");
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_ЛИС");
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_МАГ");
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_ДОПв");
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_АКТ");
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_КАТ");
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_МЕРЧ");
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_ПРОЧ");
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТОВ");
		
		
	   КонецЕсли;
	
		
		СоставБюджета4ВыделитьТО();
		СоставБюджета5ВыделитьТО();
	//КонецЕсли;
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	стр = Объект.СоставБюджета5.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыЭКС(Контрагент,ТабП)	
	
	
	//Если ТабП = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		Если Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда  //ЭКС
		
		//стр = Объект[ТабП].Добавить();
		//стр.Контрагент = Контрагент;
		//стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО");
			
			
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_НЕТТО_безНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_БОНУС");
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
	   КонецЕсли;
	
		
		СоставБюджета4ВыделитьТО();
		СоставБюджета5ВыделитьТО();

	//КонецЕсли;
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	стр = Объект.СоставБюджета5.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыГУ(Контрагент,ТабП)	
	
	
	//Если ТабП = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда  //ГУ
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_сНДС");
			
			
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_безНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_БОНУС");
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
	   КонецЕсли;
	
		
		СоставБюджета4ВыделитьТО();
		СоставБюджета5ВыделитьТО();

	//КонецЕсли;
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	стр = Объект.СоставБюджета5.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыИНД(Контрагент,ТабП)	
	
	
	//Если ТабП = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда  //Индустриальный
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_сНДС");
			
			
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_безНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_БОНУС");
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
	   КонецЕсли;
	
		
		СоставБюджета4ВыделитьТО();
		СоставБюджета5ВыделитьТО();

	//КонецЕсли;
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	стр = Объект.СоставБюджета5.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыМТ(Контрагент,ТабП)	
	
	
	Если ТабП = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда  //ОП Дистрибьюция ОБЩИЕ
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_безНДС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_УС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_БОНУС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		стр.СтавкаНДС = Перечисления.Лео_СтавкиНДС.БезНДС;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТОВ");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
         		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ИСГ");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
	   КонецЕсли;
	   
	   
	   
		Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда  //ОП Ключевые покупатели
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_сНДС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_безНДС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_БОНУС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		стр.СтавкаНДС = Перечисления.Лео_СтавкиНДС.БезНДС;
		
		стр = Объект.СоставБюджета4.Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТОВ");
		стр.Регион = Контрагент.абс_БизнесРегион;
		
         		
		//стр = Объект.СоставБюджета4.Добавить();
		//стр.Контрагент = Контрагент;
		//стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ИСГ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
	   КонецЕсли;
	   
	
	
	
	
		
		СоставБюджета4ВыделитьТО();
	КонецЕсли;
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	стр = Объект.СоставБюджета5.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыИНТЕРНЕТ(Контрагент,ТабП)	
	
	
	//Если ТабП = "СоставБюджета4" тогда // Расшифровка по клиентам
		
		Если Объект.ЦФО.Лео_ЦЗ = "ИНТЕРНЕТ" тогда  //ИНТЕРНЕТ
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТО_КУ_сНДС");
			
			
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТО_КУ_безНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТО_НЕТТО_сНДС");
			
			
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТО_НЕТТО_безНДС");
		
		
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_БОНУС");
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_УС");
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТОВ");
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ИСГ");
		
	   КонецЕсли;
	
		
		СоставБюджета4ВыделитьТО();
		СоставБюджета5ВыделитьТО();

	//КонецЕсли;
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	стр = Объект.СоставБюджета5.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыМТ_МТ(Контрагент,ТабП)	
	
	
	Если ТабП = "СоставБюджета4" или ТабП = "СоставБюджета5" тогда // Расшифровка по клиентам
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_безНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_БОНУС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_УС_1");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_УС_2");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_УС_3");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТОВ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ИСГ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		//СоставБюджета4ВыделитьТО();
	КонецЕсли;
	
	
	Если ТабП = "СоставБюджета4" тогда
		СоставБюджета4ВыделитьТО();
	ИначеЕсли ТабП = "СоставБюджета5" тогда
		СоставБюджета5ВыделитьТО();
    КонецЕсли;
	
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	
	//	Канал = ПолучитьКаналКонтрагента(Контрагент);
	//	
	//	Если Канал <> Неопределено тогда
	//		
	//		Если Канал.Наименование = "ФАРМ" тогда
	//			стр = Объект.СоставБюджета5.Добавить();
	//			стр.Контрагент = Контрагент;
	//			стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ТРМ");
	//			стр.Регион = Контрагент.абс_БизнесРегион;
	//			
	//		ИначеЕсли Канал.Наименование = "МТ" тогда
	//			стр = Объект.СоставБюджета5.Добавить();
	//			стр.Контрагент = Контрагент;
	//			стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//			стр.Регион = Контрагент.абс_БизнесРегион;
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЕсли;		
	
	
	
	
	//Если ТабП = "СоставБюджета6" тогда // Расшифровка Непрямым	  
	//	
	//	стр = Объект.СоставБюджета6.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ПРЕМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
КонецПроцедуры  



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыФАРМ(Контрагент,ТабП)	
	
	
	Если ТабП = "СоставБюджета4" или ТабП = "СоставБюджета5" тогда // Расшифровка по клиентам
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_безНДС");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС");
		стр.Регион = Контрагент.абс_БизнесРегион;
		стр.Условия = ЗаполнитьУсловияБонуса(Контрагент,стр.СтатьяОборотовПоБюджетам);
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_УС_1");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_УС_2");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_УС_3");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		
		
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		
		//СоставБюджета4ВыделитьТО();
	КонецЕсли;
	
	
	Если ТабП = "СоставБюджета4" тогда
		СоставБюджета4ВыделитьТО();
	ИначеЕсли ТабП = "СоставБюджета5" тогда
		СоставБюджета5ВыделитьТО();
    КонецЕсли;
	
	
	//Если ТабП = "СоставБюджета5" тогда // Расшифровка ТРМ	  
	//	
	//	
	//	Канал = ПолучитьКаналКонтрагента(Контрагент);
	//	
	//	Если Канал <> Неопределено тогда
	//		
	//		Если Канал.Наименование = "ФАРМ" тогда
	//			стр = Объект.СоставБюджета5.Добавить();
	//			стр.Контрагент = Контрагент;
	//			стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ТРМ");
	//			стр.Регион = Контрагент.абс_БизнесРегион;
	//			
	//		ИначеЕсли Канал.Наименование = "МТ" тогда
	//			стр = Объект.СоставБюджета5.Добавить();
	//			стр.Контрагент = Контрагент;
	//			стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_ТРМ");
	//			стр.Регион = Контрагент.абс_БизнесРегион;
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЕсли;		
	
	
	
	
	//Если ТабП = "СоставБюджета6" тогда // Расшифровка Непрямым	  
	//	
	//	стр = Объект.СоставБюджета6.Добавить();
	//	стр.Контрагент = Контрагент;
	//	стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_ПРЕМ");
	//	стр.Регион = Контрагент.абс_БизнесРегион;
	//	
	//	
	//КонецЕсли;
	
	
КонецПроцедуры  

&НаСервере
Процедура ДобавитьКонтрагентаКлиентаОдногоКонтрагенты(Контрагент,ТабП,ФАРМ_ПРЕМ_СтатьяОборотов,абс_КодБюджетнойСтатьи)	
	
	
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Контрагент);
		стр.СтатьяОборотовПоБюджетам = ФАРМ_ПРЕМ_СтатьяОборотов;
		
		стр.абс_КодБюджетнойСтатьи = абс_КодБюджетнойСтатьи;

		//стр.Регион = Контрагент.абс_БизнесРегион;

		
КонецПроцедуры  



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыФАРМ_Непрямым(Контрагент,ТабП)	
	
	
	Если ТабП = "СоставБюджета6" или ТабП = "СоставБюджета14" тогда // Расшифровка по клиентам
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		стр.абс_КодБюджетнойСтатьи = "ФАРМ_ПРЕМ";
		
		//СоставБюджета4ВыделитьТО();
	КонецЕсли;
	
	//Если ТабП = "СоставБюджета6" тогда
	//	СоставБюджетаВыделитьТО("СоставБюджета6");
	//ИначеЕсли ТабП = "СоставБюджета14" тогда
	//	СоставБюджетаВыделитьТО("СоставБюджета14");
	//КонецЕсли;
	
	
КонецПроцедуры  



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыМТ_ТМ(Контрагент,ТабП)	
	
	
	Если ТабП = "СоставБюджета16" или ТабП = "СоставБюджета18" тогда // Расшифровка по клиентам
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТРМ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		стр.абс_КодБюджетнойСтатьи = "МТ_ТРМ";
		
		//СоставБюджета4ВыделитьТО();
	КонецЕсли;
	
	//Если ТабП = "СоставБюджета16" тогда
	//	СоставБюджетаВыделитьТО("СоставБюджета16");
	//ИначеЕсли ТабП = "СоставБюджета18" тогда
	//	СоставБюджетаВыделитьТО("СоставБюджета18");
	//КонецЕсли;
	
	
	
КонецПроцедуры  



&НаСервере
Процедура ЗаполнитьРасшифровкуКлиентыФАРМ_ТМ(Контрагент,ТабП)	
	
	
	Если ТабП = "СоставБюджета16" или ТабП = "СоставБюджета18" тогда // Расшифровка по клиентам
		стр = Объект[ТабП].Добавить();
		стр.Контрагент = Контрагент;
		стр.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ");
		//стр.Регион = Контрагент.абс_БизнесРегион;
		стр.абс_КодБюджетнойСтатьи = "ФАРМ_ТРМ";
		
		//СоставБюджета4ВыделитьТО();
	КонецЕсли;
	
	//Если ТабП = "СоставБюджета16" тогда
	//	СоставБюджетаВыделитьТО("СоставБюджета16");
	//ИначеЕсли ТабП = "СоставБюджета18" тогда
	//	СоставБюджетаВыделитьТО("СоставБюджета18");
	//КонецЕсли;
	
	
	
КонецПроцедуры  



Процедура СоставБюджетаФОТ(Флаг)
	
	УсловноеОформление.Элементы.Очистить();
	
	
	ЗеленыйФон  = Новый Цвет(255, 255, 190); // Светол-желтый
	
	_ЗеленыйФон = Новый Цвет(220, 255, 220); // Светол-зеленый
	
	СерыйФон    = Новый Цвет(179, 172, 134); // Цвет рамки
	
	Светлый     = Новый Цвет(255, 255, 255); // Светлый
	
	
	
	
	
	
	//Объект.СоставБюджета.от
	Если Флаг тогда
	Элементы.СоставБюджета.ОтборСтрок = Новый ФиксированнаяСтруктура("ОтборСтрок",Истина);
	
	мСтатей = Новый СписокЗначений;
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Итого ФОТ"));
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Итого Взносы с ФОТ"));
	
	
	мСтатей1 = Новый СписокЗначений;
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ ЛЕОВИТ"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ ЛЕОВИТ"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ ЛЕОТОН ТРЕЙДИНГ"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ ЛЕОТОН ТРЕЙДИНГ"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ ЛЕОТРЕЙД"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ ЛЕОТРЕЙД"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ ЛЕФЭКСПО"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ ЛЕФЭКСПО"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ УК ЭЙКОСЪ"));
	мСтатей1.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ УК ЭЙКОСЪ"));
	
	
	мСтатей2 = Новый СписокЗначений;
	мСтатей2.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ производства"));
	мСтатей2.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ КС"));
	мСтатей2.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ АУП"));
	мСтатей2.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ производства"));
	мСтатей2.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ КС"));
	мСтатей2.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ АУП"));
	
	
	//СоставБюджета
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.СтатьяОборотовПоБюджетам");
	ЭлементОтбора.ПравоеЗначение = мСтатей2;
	
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Контрагент");
	ЭлементОтбора.ПравоеЗначение = Справочники.Контрагенты.ПустаяСсылка();
	
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",Светлый);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Ложь));	
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	
	//СоставБюджета
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.СтатьяОборотовПоБюджетам");
	ЭлементОтбора.ПравоеЗначение = мСтатей2;
	
	
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Контрагент");
	//ЭлементОтбора.ПравоеЗначение = Справочники.Контрагенты.ПустаяСсылка();
	
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.СтатьяОборотовПоБюджетам");
	ЭлементОтбора.ПравоеЗначение = мСтатей;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	//
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.СтатьяОборотовПоБюджетам");
	//ЭлементОтбора.ПравоеЗначение = мСтатей;
	//
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	//
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.СтатьяОборотовПоБюджетам");
	//ЭлементОтбора.ПравоеЗначение = мСтатей1;
	//
	////ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	//
	//
	////СоставБюджета
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	//
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.ОтборСтрок");
	//ЭлементОтбора.ПравоеЗначение = Истина;
	//
	////ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	////ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	//
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.СтатьяОборотовПоБюджетам");
	//ЭлементОтбора.ПравоеЗначение = мСтатей;
	//
	//
	//
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	
	
иначе 
	
	Элементы.СоставБюджета.ОтборСтрок = неопределено;
	
	
	//СоставБюджета
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	//зеленый фон
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета.Зеленая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("СтильГраницы", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2));	
	
	
	
	
	конецесли;
	
	//СоставБюджета Расшифровка
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета7");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета7.Итоговая");
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
КонецПроцедуры  


Процедура СоставБюджетаВыделитьТО(Таб)
	//
	
	мСтатей = Новый СписокЗначений;
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС"));
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ"));
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ"));
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС"));
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТРМ"));
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_сНДС"));
	
	// Индустриальный
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_сНДС"));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Таб);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+Таб+".СтатьяОборотовПоБюджетам");
	ЭлементОтбора.ПравоеЗначение = мСтатей;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.БледноЗеленый);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
КонецПроцедуры   



Процедура СоставБюджета4ВыделитьТО()
	//
	
	мСтатей = Новый СписокЗначений;
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС"));
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС"));
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_сНДС"));
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_сНДС"));
	
	// Индустриальный
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_сНДС"));
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_НЕТТО_сНДС"));
	
	
	// ИНТЕРНЕТ
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТО_НЕТТО_сНДС"));
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета4");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета4.СтатьяОборотовПоБюджетам");
	ЭлементОтбора.ПравоеЗначение = мСтатей;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.БледноЗеленый);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
КонецПроцедуры   


Процедура СоставБюджета5ВыделитьТО()
	//
	
	мСтатей = Новый СписокЗначений;
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС"));
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС"));
	//
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_сНДС"));
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_сНДС"));
	//
	//// Индустриальный
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_сНДС"));
	
	
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_НЕТТО_сНДС"));
	
	
	// ИНТЕРНЕТ
	мСтатей.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИНТЕР_ТО_НЕТТО_сНДС"));
	
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета5");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета5.СтатьяОборотовПоБюджетам");
	ЭлементОтбора.ПравоеЗначение = мСтатей;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.БледноЗеленый);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
КонецПроцедуры 


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПланПродаж") тогда // План продаж
		Объект.ПланПродаж = ВыбранноеЗначение;
		Возврат;
	Конецесли;
	
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") тогда // Контрагенты
		
		Если ТабЧ = "СоставБюджета1" или  ТабЧ = "СоставБюджета4" тогда
			ТабП = "СоставБюджета4";
		ИначеЕсли ТабЧ = "СоставБюджета2"  или  ТабЧ = "СоставБюджета5" тогда
			ТабП = "СоставБюджета5";
		ИначеЕсли ТабЧ = "СоставБюджета3"  или  ТабЧ = "СоставБюджета6" тогда
			ТабП = "СоставБюджета6";
		КонецЕсли;	
		
		Для каждого сс из ВыбранноеЗначение цикл	
			
			мВыбКонтрагентов = Объект[ТабП].НайтиСтроки(Новый Структура("Контрагент",сс));
			Если мВыбКонтрагентов.Количество() = 0 тогда
				ДобавитьКонтрагентаКлиентаВРасшифровку(сс,ТабП);
			иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(сс) +" уже был выбран в строке: " + мВыбКонтрагентов[0].НомерСтроки);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка") тогда
		
		
		Если ТабЧ = "СоставБюджета7" тогда
			
			Идент = 1;
			ОбработатьРасшифровкуНаСервере(ТабЧ,ВыбранноеЗначение,Идент);
			Элементы.СоставБюджета7.ТекущаяСтрока = Идент;	
			
			
			НомерСдвиг = Объект.СоставБюджета7.НайтиПоИдентификатору(Идент).НомерСтроки;
			// при добавление строки перезаполняем РодительИтогСтатьи
			ПерезаполнитьРодительИтогСтатьи(НомерСдвиг);
			
		КонецЕсли;	
		
		Если ТабЧ = "СоставБюджета12" тогда // Эксплуатация
			
			Идент = 1;
			ОбработатьРасшифровкуНаСервере(ТабЧ,ВыбранноеЗначение,Идент);
			Элементы.СоставБюджета6.ТекущаяСтрока = Идент;	
			
			
			НомерСдвиг = Объект.СоставБюджета6.НайтиПоИдентификатору(Идент).НомерСтроки;
			// при добавление строки перезаполняем РодительИтогСтатьи
			ПерезаполнитьРодительИтогСтатьи(НомерСдвиг);
			
		КонецЕсли;	
		
		
	КонецЕсли;
	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") тогда // Клиенты, ФАРМ, МТ
		
		
		// Расходы по клиентам
		Если ТабЧ = "СоставБюджета4" или ТабЧ = "СоставБюджета1" тогда // Расходы по клиентам
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +", Канал (Бюджет): " + сокрлп(ВыбранноеЗначение.Лео_КаналБюджет));
		
		мПоиска = Объект["СоставБюджета4"].НайтиСтроки(Новый Структура("Контрагент",ВыбранноеЗначение));
			Если мПоиска.количество() = 0 тогда
			ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета4");
			
			ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета5"); // Без НДС
		    иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +" уже был выбран в строке: " + мПоиска[0].НомерСтроки);
			КонецЕсли;
		КонецЕсли;	
		
		
		// Непрямым
		Если ТабЧ = "СоставБюджета6" или ТабЧ = "СоставБюджета3" тогда // Непрямым
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +", Канал (Бюджет): " + сокрлп(ВыбранноеЗначение.Лео_КаналБюджет));
		
		мПоиска = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("Контрагент",ВыбранноеЗначение));
			Если мПоиска.количество() = 0 тогда
			ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета6");
			
			ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета14");  // Без НДС
			
			иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +" уже был выбран в строке: " + мПоиска[0].НомерСтроки);
			КонецЕсли;
		КонецЕсли;	
		
		//Если ТабЧ = "СоставБюджета14"  тогда // Непрямым БезНДС
		//	
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +", Канал (Бюджет): " + сокрлп(ВыбранноеЗначение.Лео_КаналБюджет));
		//
		//мПоиска = Объект["СоставБюджета14"].НайтиСтроки(Новый Структура("Контрагент",ВыбранноеЗначение));
		//	Если мПоиска.количество() = 0 тогда
		//	ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета14");
		//	иначе	
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +" уже был выбран в строке: " + мПоиска[0].НомерСтроки);
		//	КонецЕсли;
		//КонецЕсли;	
		
		
		// ТМ
		Если ТабЧ = "СоставБюджета16" или ТабЧ = "СоставБюджета15" тогда // ТМ
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +", Канал (Бюджет): " + сокрлп(ВыбранноеЗначение.Лео_КаналБюджет));
		
		мПоиска = Объект["СоставБюджета16"].НайтиСтроки(Новый Структура("Контрагент",ВыбранноеЗначение));
			Если мПоиска.количество() = 0 тогда
			ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета16");
			
			ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета18"); //БезНДС
			иначе	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +" уже был выбран в строке: " + мПоиска[0].НомерСтроки);
			КонецЕсли;
		КонецЕсли;	
		
		//Если ТабЧ = "СоставБюджета18" тогда // ТМ БезНДС
		//	
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +", Канал (Бюджет): " + сокрлп(ВыбранноеЗначение.Лео_КаналБюджет));
		//
		//мПоиска = Объект["СоставБюджета18"].НайтиСтроки(Новый Структура("Контрагент",ВыбранноеЗначение));
		//	Если мПоиска.количество() = 0 тогда
		//	ДобавитьКонтрагентаКлиентаВРасшифровку(ВыбранноеЗначение,"СоставБюджета18");
		//	иначе	
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный контрагент: "+сокрлп(ВыбранноеЗначение) +" уже был выбран в строке: " + мПоиска[0].НомерСтроки);
		//	КонецЕсли;
		//КонецЕсли;	
		
		
		
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ПерезаполнитьРодительИтогСтатьи(НомерСдвиг)
	
	//Для каждого сс из 
	
	
	
КонецПроцедуры	



&НаСервере
Процедура ОбработатьРасшифровкуНаСервере(ТабЧ,ВыбЗнч,Идент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
	|	абс_СтатьиБюджетаПоЦФО.АналитикаБюджета,
	|	абс_СтатьиБюджетаПоЦФО.Раздел,
	|	абс_СтатьиБюджетаПоЦФО.Индекс,
	|	абс_СтатьиБюджетаПоЦФО.РодительИтог,
	|	абс_СтатьиБюджетаПоЦФО.Итоговая
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам = &СтатьяОборотовПоБюджетам
	|	И абс_СтатьиБюджетаПоЦФО.Раздел = &Раздел";
	
	
	Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам", ВыбЗнч.СтатьяОборотов);
	
	Если ТабЧ = "СоставБюджета12" тогда // Эксплуатация
	Раздел = "СоставБюджетаЭксплуатация";
	ТабЧ = "СоставБюджета6";
	иначе // остальные
	Раздел = "СоставБюджетаРасшифровка";
	Конецесли;
	Запрос.УстановитьПараметр("Раздел", Раздел);

	
	
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.Итоговая тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			
			
			ТЗ =  Объект[ТабЧ].выгрузить();
			ТЗ.Сортировать("НомерСтроки");
			//мСтрок = ТЗ.НайтиСтроки(Новый Структура("РодительИтогСтатьи,ЦФО",ВыборкаДетальныеЗаписи.Индекс,ВыборкаДетальныеЗаписи.ЦФО));
			мСтрок = ТЗ.НайтиСтроки(Новый Структура("РодительИтогСтатьи",ВыборкаДетальныеЗаписи.Индекс));
			_НомерСтроки = мСтрок[мСтрок.Количество()-1].НомерСтроки;
			//сс = ТЗ.Вставить(_НомерСтроки - 1);
			сс = ТЗ.Вставить(_НомерСтроки);
			сс.СтатьяОборотовПоБюджетам = ВыбЗнч;
			сс.абс_КодБюджетнойСтатьи   = ВыбЗнч.абс_КодБюджетнойСтатьи;
			сс.РодительИтогСтатьи       = ?(ВыбЗнч.НетИтоговой,0,ВыборкаДетальныеЗаписи.Индекс);
			сс.Итоговая                 =  Ложь;
			сс.ИндексСтатьи	            =  мСтрок[0].ИндексСтатьи;
			
			
			
			
			// Заполняем ТабЧ
			Объект[ТабЧ].Очистить();
			Для каждого лл из ТЗ цикл
				стр = Объект[ТабЧ].Добавить();
				ЗаполнитьЗначенияСвойств(стр,лл);
			КонецЦикла;
			
		КонецЕсли;	  
		СтрокаКоллекции = Объект[ТабЧ][_НомерСтроки];
		Идент = СтрокаКоллекции.ПолучитьИдентификатор();
	КонецЕсли;	  
	//стр = Объект[ТабЧ].Добавить();
	
	
	
КонецПроцедуры




&НаКлиенте
Процедура СоставБюджета1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПланомПродаж(Команда)
	// Вставить содержимое обработчика.
	
	_Перезаполнить = Ложь;
	ЗаполнитьБюджетПланомПродаж(_Перезаполнить);
	
	//ТабЧ = Элемент.Имя;
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	Если _Перезаполнить тогда
		ЗаполнимИтоговуюТаблицу("СоставБюджета1","СоставБюджета4",Истина);	
		ЗаполнимИтоговуюТаблицу("СоставБюджета7","СоставБюджета1",Истина);
		ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета4",Истина);
		ЗаполнимИтоговуюТаблицу("СоставБюджета3","СоставБюджета4",Истина);
		ЗаполнимИтоговуюТаблицу("СоставБюджета","СоставБюджета1",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета1",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета4",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
		
		ЗаполнимТаблицуСервер("СоставБюджета",Истина);
		
		//ПроссумируемЕксель(ТабЧ,ИмяТекКолонки,ТекДанные);
		
	КонецЕсли;
	
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБюджетПланомПродаж(_Перезаполнить)
	
	ТЗ = ПолучитьПланПродаж();
	Если ТЗ <> неопределено тогда
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда  //ОП Дистрибьюция ОБЩИЕ
		
		ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС");
		МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС");
		
		БезНДС_ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_безНДС");
		БезНДС_МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_безНДС");
		
		
		ФАРМ_БОНУС_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_БОНУС");
		МТ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_БОНУС");
		
		КонецЕсли;	
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда // Ключевые покупатели
			
		МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_сНДС");
		
		БезНДС_МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_безНДС");
				
		МТ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_БОНУС");
		
			
		КонецЕсли;	

		
		
		Для каждого стр из Объект.СоставБюджета4 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ТО_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот + смтр.НДСОборот; // с НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			Если стр.СтатьяОборотовПоБюджетам = БезНДС_ФАРМ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = БезНДС_МТ_ТО_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;	
			
			
			
			// БОНУС
			Если ОбщегоНазначения.ТолькоЦифрыВСтроке(стр.Условия) и ЗначениеЗаполнено(стр.Условия) тогда
				Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_БОНУС_СтатьяОборотов)
					И Число(стр.Условия) > 0 тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // БезНДС
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот) * Число(стр.Условия))/100 ; // БезНДС
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		_Перезаполнить = Истина;	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Вставить содержимое обработчика.
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета2ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета1СтатьяОборотовПоБюджетамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	//ЗаполнитьСтатьиКлиентаСоставБюджета4(ВыбранноеЗначение);
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьиКлиентаСоставБюджета4(СтатьяОб)
	ТабЧ = Объект["СоставБюджета4"];
	ТабКонтр = ТабЧ.Выгрузить(,"Контрагент");
	ТабКонтр.Свернуть("Контрагент");
	мИндексовКонтр = Новый ТаблицаЗначений;
	мИндексовКонтр.Колонки.Добавить("Контрагент");
	мИндексовКонтр.Колонки.Добавить("Индекс");
	мИндексовКонтр.Колонки.Добавить("мСтрок");
	
	Для каждого контр из ТабКонтр цикл
		мКонтр = ТабЧ.НайтиСтроки(Новый Структура("Контрагент",контр.Контрагент));
		ин = мИндексовКонтр.Добавить();
		ин.Контрагент = контр.Контрагент;
		ин.Индекс     = 0;
		ин.мСтрок     = мКонтр;
		Для каждого тт из мКонтр цикл
			_Ин = 	тт.НомерСтроки;
			Если _Ин >= ин.Индекс тогда  
				ин.Индекс = _Ин;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Повторно заполним Расшифровку по клиентам
	мИндексовКонтр.Сортировать("Индекс");
	ТабЧ.Очистить();
	Для каждого сс из мИндексовКонтр цикл
		Для каждого тт из сс.мСтрок цикл
			нСтр = ТабЧ.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,тт);	
			
		КонецЦикла;
		// новая статья
		нСтр = ТабЧ.Добавить();
		нСтр.СтатьяОборотовПоБюджетам = СтатьяОб;
		нСтр.Контрагент = сс.Контрагент;
		нСтр.Регион = сс.Контрагент.абс_БизнесРегион;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьСтатьюВРасшифровку(Команда)
	
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	Если ТекДанные = Неопределено Тогда
		ТекДанные 		= Элементы["СоставБюджета"].ТекущиеДанные;	
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.Лео_СтатьиОборотовРасшифровка")
		или	 ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам")
		
		тогда
		
		
		_Ф = Справочники.Лео_СтатьиОборотовРасшифровка.ПолучитьФормуВыбора(,ЭтаФорма);
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.ВидСравнения  = ВидСравнения.Равно;
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.Использование = Истина;
		_Ф.СправочникСписок.Отбор.СтатьяОборотов.Значение      = ?(ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам"),ТекДанные.СтатьяОборотовПоБюджетам,ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов);
		
		
		_Ф.СправочникСписок.Порядок.Установить("Индекс Возр");
		
		Если Не _Ф.Открыта() Тогда
			_Ф.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета7СтатьяОборотовПоБюджетамПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета7СтатьяОборотовПоБюджетамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
		ТекДанные.абс_КодБюджетнойСтатьи = ВыбранноеЗначение.абс_КодБюджетнойСтатьи;
		ТекДанные.Итоговая = Истина;
		
		
		//Проверка существует ли в Родительской таблице
		мПоиска = Объект.СоставБюджета.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ВыбранноеЗначение));
		Если мПоиска.Количество() > 0 тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная статья уже присутствует !!!");
		иначе
			ДобавитьСтатьюСоставБюджета(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтатьюСоставБюджета(СтатьяОборотов)
	
	сс = Объект.СоставБюджета.Добавить();
	сс.СтатьяОборотовПоБюджетам = СтатьяОборотов;
	сс.РодительИтогСтатьи = 1;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлан(Команда)
	// Вставить содержимое обработчика.
	
	
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	
	
	Если  ТабЧ = "СоставБюджета7" тогда
		
		
		
		Если СтрДлина(ТабЧ) = 13 тогда //СоставБюджета
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,14,СтрДлина(ИмяТекКолонки)));			
			
		иначе
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
			
		КонецЕсли;	
		
		
		ЕстьВозврат = Истина;
		СтрДлинаКолонки = СтрДлина(ИмяТекКолонки);
		иКолонка = "";
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			иИндекс = Число(Прав(ИмяТекКолонки,2));
		иначе
			иИндекс = Число(Прав(ИмяТекКолонки,1));
		КонецЕсли;		
		
		Если СтрДлинаКолонки  = 6 или СтрДлинаКолонки  = 7  тогда
			
			иКолонка = "Сумма";
			возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 10 или СтрДлинаКолонки  = 11  тогда
			
			иКолонка = "СуммаФакт";
			возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 12 или СтрДлинаКолонки  = 13  тогда
			
			Если Лев(ИмяТекКолонки,7) = "СуммаПр" тогда
				иКолонка = "СуммаПрФакт";
				возврат;
			КонецЕсли;
			
			Если Лев(ИмяТекКолонки,7) = "СуммаБю" тогда
				//иКолонка = "СуммаБюджет";
				_иКолонка = ИмяТекКолонки; 
				иКолонка =  "Сумма"+ Сред(ИмяТекКолонки,12,2);
				
				ЕстьВозврат = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;	   
		
		Если ЕстьВозврат тогда
			возврат;
		КонецЕсли;  
		
		
		
		//_ПоказатьПредупреждение = Ложь;	
		Если НЕ ПустаяСтрока(иКолонка) тогда
			//Для Н = иИндекс По 12 Цикл
			ТекДанные[иКолонка] = ТекДанные[_иКолонка];
			
			//ПроссумируемЕксель(ТабЧ,ТабЧ + (иКолонка + Н),ТекДанные);
			ПроссумируемЕксель(ТабЧ,иКолонка,ТекДанные);
			
		КонецЕсли;	 
		
		
		// Основная расшифровка	
		//Если  ТабЧ = "СоставБюджета7" тогда
		
		
		Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		иначе // Лео_СтатьиОборотовРасшифровка
			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;
		
		//Основная
		мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		Если мПоиска.количество() > 0 тогда
			//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
			_ТекЗнач = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент(ТабЧ,иКолонка,_СтатьяОборотов);
			мПоиска[0][иКолонка] = _ТекЗнач;
			ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
		КонецЕсли;
		
		
		
		
	//	
	//	Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
	//		
	//		// Основная
	//		//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",иКолонка,_СтатьяОборотов);
	//		
	//		
	//			// Расшифровка
	//		 	//_ЗаполнимТаблицуПоРодителюКлиент("СоставБюджета7","РасшСтатья");
	//
	//			//// Основная
	//			//_ЗаполнимТаблицуПоРодителюКлиент(ТабЧитог,"РодительИтогСтатьи");

	//			
	//		//мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
	//		//Если мПоиска.количество() > 0 тогда
	//		//	//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
	//		//	ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
	//		//КонецЕсли;
	//		
	//		//// По клиентам
	//		//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета1",иКолонка,_СтатьяОборотов);
	//		//мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
	//		//Если мПоиска.количество() > 0 тогда
	//		//	//ПроссумируемЕксельКопированием("СоставБюджета1",иКолонка,мПоиска[0]);
	//		//	ПроссумируемЕксель("СоставБюджета1",иКолонка,мПоиска[0]);
	//		//КонецЕсли;
	//		//// ТРМ
	//		//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета2",иКолонка,_СтатьяОборотов);
	//		//мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
	//		//Если мПоиска.количество() > 0 тогда
	//		//	//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
	//		//	ПроссумируемЕксель("СоставБюджета2",иКолонка,мПоиска[0]);
	//		//КонецЕсли;
	//		//// Непрямым
	//		//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета3",иКолонка,_СтатьяОборотов);
	//		//мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
	//		//Если мПоиска.количество() > 0 тогда
	//		//	//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
	//		//	//ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
	//		//	ПроссумируемЕксель("СоставБюджета3",иКолонка,мПоиска[0]);
	//		//КонецЕсли;
	//		
	//		
	//		
	//	КонецЕсли;		
	КонецЕсли;	
	
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////

	Если  ТабЧ = "СоставБюджета5" тогда // ТМ
		
		
		
		Если СтрДлина(ТабЧ) = 13 тогда //СоставБюджета
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,14,СтрДлина(ИмяТекКолонки)));			
			
		иначе
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
			
		КонецЕсли;	
		
		
		ЕстьВозврат = Истина;
		СтрДлинаКолонки = СтрДлина(ИмяТекКолонки);
		иКолонка = "";
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			иИндекс = Число(Прав(ИмяТекКолонки,2));
		иначе
			иИндекс = Число(Прав(ИмяТекКолонки,1));
		КонецЕсли;		
		
		Если СтрДлинаКолонки  = 6 или СтрДлинаКолонки  = 7  тогда
			
			иКолонка = "Сумма";
			возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 10 или СтрДлинаКолонки  = 11  тогда
			
			иКолонка = "СуммаФакт";
			возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 12 или СтрДлинаКолонки  = 13  тогда
			
			Если Лев(ИмяТекКолонки,7) = "СуммаПр" тогда
				иКолонка = "СуммаПрФакт";
				возврат;
			КонецЕсли;
			
			Если Лев(ИмяТекКолонки,7) = "СуммаБю" тогда
				//иКолонка = "СуммаБюджет";
				_иКолонка = ИмяТекКолонки; 
				иКолонка =  "Сумма"+ Сред(ИмяТекКолонки,12,2);
				
				ЕстьВозврат = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;	   
		
		Если ЕстьВозврат тогда
			возврат;
		КонецЕсли;  
		
		
		
		//_ПоказатьПредупреждение = Ложь;	
		Если НЕ ПустаяСтрока(иКолонка) тогда
			//Для Н = иИндекс По 12 Цикл
			ТекДанные[иКолонка] = ТекДанные[_иКолонка];
			
			//ПроссумируемЕксель(ТабЧ,ТабЧ + (иКолонка + Н),ТекДанные);
			ПроссумируемЕксель(ТабЧ,иКолонка,ТекДанные);
			
		КонецЕсли;	 
		
		
		// Основная расшифровка	
		//Если  ТабЧ = "СоставБюджета7" тогда
		
		
		Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		иначе // Лео_СтатьиОборотовРасшифровка
			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;
		
		Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
			
			// ТРМ
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета5","СоставБюджета2",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета2",иКолонка,мПоиска[0]);
			КонецЕсли;

			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета5","СоставБюджета7",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета7",иКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета5","СоставБюджета",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
			КонецЕсли;
			
			
		КонецЕсли;		
	КонецЕсли;	
	
	
	
	

/////////////////////////////////////////////////////////////////////////////////////////////////////////

	Если  ТабЧ = "СоставБюджета6" тогда // Непрямым
		
		
		
		Если СтрДлина(ТабЧ) = 13 тогда //СоставБюджета
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,14,СтрДлина(ИмяТекКолонки)));			
			
		иначе
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
			
		КонецЕсли;	
		
		
		ЕстьВозврат = Истина;
		СтрДлинаКолонки = СтрДлина(ИмяТекКолонки);
		иКолонка = "";
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			иИндекс = Число(Прав(ИмяТекКолонки,2));
		иначе
			иИндекс = Число(Прав(ИмяТекКолонки,1));
		КонецЕсли;		
		
		Если СтрДлинаКолонки  = 6 или СтрДлинаКолонки  = 7  тогда
			
			иКолонка = "Сумма";
			возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 10 или СтрДлинаКолонки  = 11  тогда
			
			иКолонка = "СуммаФакт";
			возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 12 или СтрДлинаКолонки  = 13  тогда
			
			Если Лев(ИмяТекКолонки,7) = "СуммаПр" тогда
				иКолонка = "СуммаПрФакт";
				возврат;
			КонецЕсли;
			
			Если Лев(ИмяТекКолонки,7) = "СуммаБю" тогда
				//иКолонка = "СуммаБюджет";
				_иКолонка = ИмяТекКолонки; 
				иКолонка =  "Сумма"+ Сред(ИмяТекКолонки,12,2);
				
				ЕстьВозврат = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;	   
		
		Если ЕстьВозврат тогда
			возврат;
		КонецЕсли;  
		
		
		
		//_ПоказатьПредупреждение = Ложь;	
		Если НЕ ПустаяСтрока(иКолонка) тогда
			//Для Н = иИндекс По 12 Цикл
			ТекДанные[иКолонка] = ТекДанные[_иКолонка];
			
			//ПроссумируемЕксель(ТабЧ,ТабЧ + (иКолонка + Н),ТекДанные);
			ПроссумируемЕксель(ТабЧ,иКолонка,ТекДанные);
			
		КонецЕсли;	 
		
		
		// Основная расшифровка	
		//Если  ТабЧ = "СоставБюджета7" тогда
		
		
		Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		иначе // Лео_СтатьиОборотовРасшифровка
			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;
		
		Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
			
			// Непрямым
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета6","СоставБюджета3",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
				//ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета3",иКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета6","СоставБюджета7",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета7",иКолонка,мПоиска[0]);
			КонецЕсли;
			
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета6","СоставБюджета",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			
			
		КонецЕсли;		
	КонецЕсли;	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
	
	
	СсылкаНаОбъект = Справочники.ВнешниеОбработки.НайтиПоНаименованию("ОтчетБДР_1");
	
	ДвоичныеДанные = СсылкаНаОбъект.ХранилищеВнешнейОбработки.Получить();
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ИмяФайла);
	
	
	Отчет = ВнешниеОтчеты.Создать(ИмяФайла);
	//Отчет.СхемаКомпоновкиДанных.Параметры[0].Использование = Истина;
	//Отчет.СхемаКомпоновкиДанных.Параметры[0].Значение = Объект.Ссылка;
	//Отчет.ЗаполнитьПараметрыОтчетаНаСервере(Объект.Ссылка);
	ф = Отчет.ПолучитьФорму();
	ф.ПрограммноСформировать(Объект.Ссылка);
	ф.Заголовок = "БДР: " + сокрЛП(Объект.ЦФО);
	ф.Открыть();
	
	// ИмяФайла=ПолучитьИмяФайлаОбработки();
	
	//АдресХранилища="";
	//Результат=ПоместитьФайл(АдресХранилища,ИмяФайла,,Ложь);
	//
	//ИмяОбработки=ПолучитьСсылкуНаОбработку(АдресХранилища);
	//	
	//ОткрытьФорму("ВнешнийОтчет."+ ИмяОбработки+".Форма.ФормаОтчета");	
	
	//УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСсылкуНаОбработку(АдресХранилища)
	Возврат ВнешниеОтчеты.Подключить(АдресХранилища);
КонецФункции

&НаКлиенте
Процедура СоставБюджета7ПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	
	Если Вопрос("Удалить строку?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
	
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	мПоказателей = Новый Массив;
	мПоказателей.Добавить("СуммаБюджет");
	мПоказателей.Добавить("Сумма");
	мПоказателей.Добавить("СуммаПрФакт");
	мПоказателей.Добавить("СуммаФакт");
	
	
	Для каждого иКолонка из мПоказателей цикл
		
		//_ПоказатьПредупреждение = Ложь;	
		//Если НЕ ПустаяСтрока(иКолонка) тогда
		Для Н = 1 По 12 Цикл
			ТекДанные[иКолонка + Н] = 0;
			
			//рПроссумируемЕксель(ТабЧ,(иКолонка + Н),ТекДанные,Истина);
			ПроссумируемЕксель(ТабЧ,(иКолонка + Н),ТекДанные);
			
			//КонецЦикла;
			//КонецЕсли;	 
			
			
			// Основная расшифровка	
			Если  ТабЧ = "СоставБюджета7"  тогда
				
				
				Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
					_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
				иначе // Лео_СтатьиОборотовРасшифровка
					_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
				КонецЕсли;
				
				Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
					
					// Основная
					ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",иКолонка,_СтатьяОборотов);
					мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
					Если мПоиска.количество() > 0 тогда
						мПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0],Истина);
					КонецЕсли;
					// По клиентам
					ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета1",иКолонка,_СтатьяОборотов);
					мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
					Если мПоиска.количество() > 0 тогда
						мПроссумируемЕксель("СоставБюджета1",иКолонка,мПоиска[0],Истина);
					КонецЕсли;
					// ТРМ
					ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета2",иКолонка,_СтатьяОборотов);
					мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
					Если мПоиска.количество() > 0 тогда
						мПроссумируемЕксель("СоставБюджета2",иКолонка,мПоиска[0],Истина);
					КонецЕсли;
					// Непрямым
					ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета3",иКолонка,_СтатьяОборотов);
					мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
					Если мПоиска.количество() > 0 тогда
						//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
						мПроссумируемЕксель("СоставБюджета3",иКолонка,мПоиска[0],Истина);
					КонецЕсли;
					
					
					
				КонецЕсли;		
			КонецЕсли;	
			
		КонецЦикла;
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьТаблицы()
	
		Объект.СоставБюджета.Очистить();
		Объект.СоставБюджета1.Очистить();
        Объект.СоставБюджета2.Очистить();
        Объект.СоставБюджета3.Очистить();
		Объект.СоставБюджета4.Очистить();
        Объект.СоставБюджета5.Очистить();
        Объект.СоставБюджета6.Очистить();
		Объект.СоставБюджета7.Очистить();
        Объект.СоставБюджета8.Очистить();
		Объект.СоставБюджета9.Очистить();
		Объект.СоставБюджета10.Очистить();

		Объект.СоставБюджета11.Очистить();
		Объект.СоставБюджета13.Очистить();
		Объект.СоставБюджета14.Очистить();
		Объект.СоставБюджета15.Очистить();
		Объект.СоставБюджета16.Очистить();
		Объект.СоставБюджета17.Очистить();
		Объект.СоставБюджета18.Очистить();
		
КонецПроцедуры	
	
	
&НаСервере
Процедура ОчиститьТаблицуСервер(Таб)
	
   	Таб = Объект[Таб];

	
	Для каждого сс из Таб цикл
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				сс["СуммаБюджет" + Н] = 0;
				сс["Сумма" + Н]       = 0;
				сс["СуммаПрФакт" + Н] = 0;
				сс["СуммаФакт" + Н]   = 0;
		   КонецЦикла;
	
				сс["ГодовойБюджет"]     = 0;
				сс["ГодовойПрогноз"]    = 0;
				сс["ГодовойОтклонение"] = 0;
	
				сс["БюджетМесяц"]       = 0;
				сс["ПрогнозМесяц"]      = 0;
				сс["ОтклоненияМесяц"]   = 0;
				
	КонецЦикла;

КонецПроцедуры




&НаКлиенте
Функция ПолучитьМассивПроизводсвоЦех()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ЦЕХ_СТАФ");
		 мЦех.Добавить("ЦЕХ_ФОТ_ОП");
		 мЦех.Добавить("ЦЕХ_ФСС_ОП");
		 мЦех.Добавить("ЦЕХ_ФОТ_АУП");
		 мЦех.Добавить("ЦЕХ_ФСС_АУП");
		 мЦех.Добавить("ЦЕХ_ХТП");
		 мЦех.Добавить("ЦЕХ_СПЕЦ");
		 мЦех.Добавить("ЦЕХ_РАСХ");
		 мЦех.Добавить("ЦЕХ_МЕБ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_УС");
		 мЦех.Добавить("ЦЕХ_АРЕН");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 мЦех.Добавить("ЦЕХ_ПРОЧ");
		 
		 
		 возврат  мЦех;
		 
КонецФункции		 


&НаКлиенте
Функция ПолучитьМассивПроизводсвоОТиТБ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ОТ_ФОТ");
		 мЦех.Добавить("ОТ_ПрФОТ");
		 мЦех.Добавить("ОТ_ФСС");
		 мЦех.Добавить("ОТ_ОБУЧ_ЦЕХ");
		 мЦех.Добавить("ОТ_СПЕЦ_ЦЕХ");
		 мЦех.Добавить("ОТ_УС_ЦЕХ");
		 мЦех.Добавить("ОТ_ПРОЧ_ЦЕХ");
		 мЦех.Добавить("ОТ_ОБУЧ_ИТС");
		 мЦех.Добавить("ОТ_СПЕЦ_ИТС");
		 мЦех.Добавить("ОТ_УС_ИТС");
		 мЦех.Добавить("ОТ_ПРОЧ_ИТС");
		 мЦех.Добавить("ОТ_ОБУЧ_СИМ");
		 мЦех.Добавить("ОТ_СПЕЦ_СИМ");
		 мЦех.Добавить("ОТ_ПРОЧ_СИМ");
		 мЦех.Добавить("ОТ_УС_СИМ");
		 мЦех.Добавить("ОТ_ОБУЧ_ГП");
		 мЦех.Добавить("ОТ_СПЕЦ_ГП");
		 мЦех.Добавить("ОТ_ПРОЧ_ГП");
		 

				 
		 
		 
		 
		 возврат  мЦех;
		 
КонецФункции		 


&НаКлиенте
Функция ПолучитьМассивПроизводсвоИТС()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ИТС_ФОТ_ОП");
		 мЦех.Добавить("ИТС_ФСС_ОП");
		 мЦех.Добавить("ИТС_ФОТ_АУП");
		 мЦех.Добавить("ИТС_ФСС_АУП");
		 мЦех.Добавить("ИТС_ПРОЧ");
		 мЦех.Добавить("ИТС_ВЕС");
		 мЦех.Добавить("ИТС_ПРОЕКТ");
		 мЦех.Добавить("ИТС_РЕМ");
		 мЦех.Добавить("ИТС_МАЛ");
		 
		 возврат  мЦех;
		 
КонецФункции		 




&НаКлиенте
Функция ПолучитьМассивПроизводсвоАморт()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("АМ_ТР");
		 мЦех.Добавить("АМ_ОБОР");
		 мЦех.Добавить("АМ_ЗД");
		 
		 возврат  мЦех;
		 
КонецФункции		 


&НаКлиенте
Функция ПолучитьМассивПроизводсвоPR()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("МАР_ТВ");
		 мЦех.Добавить("МАР_ИНТ");
		 мЦех.Добавить("МАР_СОФТ");
		 мЦех.Добавить("МАР_ДИЗ");
		 мЦех.Добавить("МАР_СМИ");
		 мЦех.Добавить("МАР_ПРОМО");
		 мЦех.Добавить("МАР_ИНФО");
		 мЦех.Добавить("МАР_ГЛ");
		 мЦех.Добавить("МАР_РОЛ");
		 мЦех.Добавить("МАР_ВЫС");
		 мЦех.Добавить("МАР_ПРОЧ");
		 мЦех.Добавить("МАР_КР");
		 
		 возврат  мЦех;
		 
КонецФункции	
	 

&НаКлиенте
Функция ПолучитьМассивПроизводсвоЛОГ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ЛОГ_ТРАНС_ФАРМ");
		 мЦех.Добавить("ЛОГ_ТРАНС_МТ");
		 мЦех.Добавить("ЛОГ_ТРАНС_КП");
		 мЦех.Добавить("ЛОГ_ТРАНС_ИНД");
		 мЦех.Добавить("ЛОГ_ТРАНС_ЭКСП");
		 мЦех.Добавить("ЛОГ_ТРАНС_ГУ");
		 мЦех.Добавить("ЛОГ_ТРАНС_ПП");
		 
		 возврат  мЦех;
		 
КонецФункции	

&НаКлиенте
Функция ПолучитьМассивПроизводсвоЗД()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ЗД_ОХР");
		 мЦех.Добавить("ЗД_ЗЕМ");
		 мЦех.Добавить("ЗД_ХОЗ");
		 мЦех.Добавить("ЗД_ТЕКР");
		 мЦех.Добавить("ЗД_КАПР");
		 мЦех.Добавить("ЗД_МЕБ");
		 мЦех.Добавить("ЗД_СТАФ");
		 мЦех.Добавить("ЗД_ПРОЧ");
		 мЦех.Добавить("ЗД_ВОД");
		 
		 возврат  мЦех;
		 
КонецФункции	

Функция ПолучитьМассивПроизводсвоЗД_Пр()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ЗД_КОММ");
		 
		 возврат  мЦех;
		 
КонецФункции	



&НаКлиенте
Функция ПолучитьМассивПроизводсвоЗД_ОТиТБ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ОТ_ОБУЧ_ЗД");
		 мЦех.Добавить("ОТ_СПЕЦ_ЗД");
		 мЦех.Добавить("ОТ_УС_ЗД");
		 мЦех.Добавить("ОТ_ПРОЧ_ЗД");
		 мЦех.Добавить("ОТ_ОБУЧ_ОБЩ");
		 мЦех.Добавить("ОТ_СПЕЦ_ОБЩ");
		 мЦех.Добавить("ОТ_УС_КС");
		 мЦех.Добавить("ОТ_УС_ОБЩ");
		 мЦех.Добавить("ОТ_ПРОЧ_ОБЩ");
		 
		 возврат  мЦех;
		 
КонецФункции	

&НаКлиенте
Функция ПолучитьМассивПроизводсвоИТ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ИТ_ОРГ");
		 мЦех.Добавить("ИТ_ООТ");
		 мЦех.Добавить("ИТ_РАСХ");
		 мЦех.Добавить("ИТ_ПО");
		 мЦех.Добавить("ИТ_КИС");
		 мЦех.Добавить("ИТ_БЕЗОП");
		 мЦех.Добавить("ИТ_САЙТ");
		 мЦех.Добавить("ИТ_ПРОЧ");
		 мЦех.Добавить("ИТ_СВЯЗЬ");
		 
		 возврат  мЦех;
		 
КонецФункции



&НаКлиенте
Функция ПолучитьМассивПроизводсвоНалог()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ИМУЩ");
		 мЦех.Добавить("НАЛОГ_ПРОЧ");
		 
		 возврат  мЦех;
		 
КонецФункции

	 

&НаКлиенте
Функция ПолучитьМассивПроизводсвоСП()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("СП_ОБУЧ");
		 мЦех.Добавить("СП_ПЕРСОН");
		 мЦех.Добавить("СП_КОРП");
		 
		 возврат  мЦех;
		 
КонецФункции


&НаКлиенте
Функция ПолучитьМассивПроизводсвоПРИЕМ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ПРИЕМ_КАНЦ");
		 мЦех.Добавить("ПРИЕМ_КОМ");
		 мЦех.Добавить("ПРИЕМ_ПОДПИС");
		 мЦех.Добавить("ПРИЕМ_РП");
		 
		 возврат  мЦех;
		 
КонецФункции


&НаКлиенте
Функция ПолучитьМассивПроизводсвоСБ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("СБ_ПРОЧ");
	 
		 возврат  мЦех;
		 
КонецФункции


&НаКлиенте
Функция ПолучитьМассивПроизводсвоАН()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("АН_ИНФО");
	 
		 возврат  мЦех;
		 
КонецФункции



	 
&НаКлиенте
Функция ПолучитьМассивПроизводсвоОГТ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ОГТ_СР_УС");
		 мЦех.Добавить("ОГТ_СР_ПРОЧ");
		 мЦех.Добавить("ОГТ_ФОТ");
		 мЦех.Добавить("ОГТ_ФСС");
		 
		 возврат  мЦех;
		 
КонецФункции	

&НаКлиенте
Функция ПолучитьМассивПроизводсвоОКК()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ОКК_СР_ПК");
		 мЦех.Добавить("ОКК_СР_ИСО");
		 мЦех.Добавить("ОКК_СР_ЛАБ");
		 мЦех.Добавить("ОКК_СР_ПРОЧ");
		 мЦех.Добавить("ОКК_ФОТ");
		 мЦех.Добавить("ОКК_ФСС");
		 
		 возврат  мЦех;
		 
КонецФункции	

&НаКлиенте
Функция ПолучитьМассивПроизводсвоОРП()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ОРП_СР_ИС");
		 мЦех.Добавить("ОРП_СР_СЫР");
		 мЦех.Добавить("ОРП_СР_ПРОЧ");
		 мЦех.Добавить("ОРП_ФОТ");
		 мЦех.Добавить("ОРП_ФСС");
		 
		 возврат  мЦех;
		 
КонецФункции	


&НаКлиенте
Функция ПолучитьМассивПроизводсвоОТР()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ОТР_СР_СР");
		 мЦех.Добавить("ОТР_СР_ИС");
		 мЦех.Добавить("ОТР_СР_ПРОЧ");
		 мЦех.Добавить("ОТР_ФОТ");
		 мЦех.Добавить("ОТР_ФСС");
		 
		 возврат  мЦех;
		 
КонецФункции	

&НаКлиенте
Функция ПолучитьМассивПроизводсвоЮР()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("ЮР_ИС");
		 мЦех.Добавить("ЮР_ОФИС");
		 мЦех.Добавить("ЮР_ИКУ");
		 мЦех.Добавить("ЮР_ФОТ");
		 мЦех.Добавить("ЮР_ФСС");
		 
		 возврат  мЦех;
		 
КонецФункции	


&НаКлиенте
Функция ПолучитьМассивПроизводсвоБУХ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("БУХ_ИКУ");
		 мЦех.Добавить("БУХ_ФОТ");
		 мЦех.Добавить("БУХ_ФСС");
		 
		 возврат  мЦех;
		 
		 
КонецФункции






&НаКлиенте
Функция ПолучитьМассивПроизводсвоФОТ()
	
	     мЦех = Новый Массив;
		 мЦех.Добавить("АН_ФОТ");
		 мЦех.Добавить("БУХ_ФОТ");
		 мЦех.Добавить("БУХ_ПрФОТ");
		 мЦех.Добавить("ЗД_ФОТ");
		 мЦех.Добавить("ИТ_ФОТ");
		 мЦех.Добавить("ЛОГ_ФОТ");
		 мЦех.Добавить("ОГТ_ФОТ");
		 мЦех.Добавить("ОКК_ФОТ");
		 мЦех.Добавить("ОРП_ФОТ");
		 мЦех.Добавить("ОТР_ФОТ");
		 мЦех.Добавить("ПРИЕМ_ФОТ");
		 мЦех.Добавить("СБ_ФОТ");
		 мЦех.Добавить("СП_ФОТ");
		 мЦех.Добавить("ФО_ФОТ");
		 мЦех.Добавить("ЮР_ФОТ");
		 мЦех.Добавить("МАР_ФОТ");
		 мЦех.Добавить("СНАБ_ФОТ");
		 мЦех.Добавить("ПЛАН_ФОТ");
		 мЦех.Добавить("АДМИН_ФОТ");
		 
		 мЦех.Добавить("АН_ФСС");
		 мЦех.Добавить("БУХ_ФСС");
		 мЦех.Добавить("БУХ_ПрФСС");
		 мЦех.Добавить("ЗД_ФСС");
		 мЦех.Добавить("ИТ_ФСС");
		 мЦех.Добавить("ЛОГ_ФСС");
		 мЦех.Добавить("ОГТ_ФСС");
		 мЦех.Добавить("ОКК_ФСС");
		 мЦех.Добавить("ОРП_ФСС");
		 мЦех.Добавить("ОТР_ФСС");
		 мЦех.Добавить("ПРИЕМ_ФСС");
		 мЦех.Добавить("СБ_ФСС");
		 мЦех.Добавить("СП_ФСС");
		 мЦех.Добавить("ФО_ФСС");
		 мЦех.Добавить("ЮР_ФСС");
		 мЦех.Добавить("МАР_ФСС");
		 мЦех.Добавить("СНАБ_ФСС");
		 мЦех.Добавить("ПЛАН_ФСС");
		 мЦех.Добавить("АДМИН_ФСС");
		 
		 
		 мЦех.Добавить("ГУ_ФОТ");
		 мЦех.Добавить("ИН_ФОТ");
		 мЦех.Добавить("КП_ФОТ");
		 мЦех.Добавить("МТ_ФОТ");
		 мЦех.Добавить("ФАРМ_ФОТ");
		 мЦех.Добавить("ЭКС_ФОТ");
		 мЦех.Добавить("АДМИН_КС_ФОТ");
		
		 мЦех.Добавить("ГУ_ФСС");
		 мЦех.Добавить("ИН_ФСС");
		 мЦех.Добавить("КП_ФСС");
		 мЦех.Добавить("МТ_ФСС");
		 мЦех.Добавить("ФАРМ_ФСС");
		 мЦех.Добавить("ЭКС_ФСС");
		 мЦех.Добавить("АДМИН_КС_ФСС");
		 
		 
		 
		 возврат  мЦех;
		 
КонецФункции
	 

&НаКлиенте
Процедура ДобавитьКонтрагентовИзПланаПродаж(Команда)
	// Вставить содержимое обработчика.
	
	/////////////////////////////////////////////////////
	/////////////////////////////////////////////////////
	
	
	Если СокрЛП(Объект.ЦФО.Код) = "001" тогда // ЦФО (БДР док)

	// 1. ДОХОДЫ	
		
		
	ТЗ = ПолучитьПланПродаж();
	ТЗ_КУ = ПолучитьПланПродажКУ();
		
	    // КУ
		БезНДС_ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_КУ_безНДС");
		КУ_Канал = "ФАРМ";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,БезНДС_ФАРМ_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
	
		БезНДС_МТ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_КУ_безНДС");
		КУ_Канал = "МТ";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,БезНДС_МТ_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_КП_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_КУ_безНДС");
		КУ_Канал = "КП";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,БезНДС_КП_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_ИН_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_КУ_безНДС");
		КУ_Канал = "ИНД";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,БезНДС_ИН_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_ЭКС_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_КУ_безНДС");
		КУ_Канал = "ЭКСП";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,БезНДС_ЭКС_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_ГУ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_КУ_безНДС");
		КУ_Канал = "ГУ";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,БезНДС_ГУ_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		
		
		
		
		// НЕТТО
		БезНДС_ФАРМ_НЕТТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_безНДС");
		КУ_Канал = "ФАРМ";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ,БезНДС_ФАРМ_НЕТТО_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
	
		БезНДС_МТ_НЕТТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_безНДС");
		КУ_Канал = "МТ";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ,БезНДС_МТ_НЕТТО_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_КП_НЕТТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_безНДС");
		КУ_Канал = "КП";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ,БезНДС_КП_НЕТТО_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_ИН_НЕТТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_безНДС");
		КУ_Канал = "ИНД";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ,БезНДС_ИН_НЕТТО_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_ЭКС_НЕТТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_НЕТТО_безНДС");
		КУ_Канал = "ЭКСП";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ,БезНДС_ЭКС_НЕТТО_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		БезНДС_ГУ_НЕТТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_безНДС");
		КУ_Канал = "ГУ";
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ,БезНДС_ГУ_НЕТТО_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		
		
		// Скидки
		// ФАРМ
		Скидка_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_скидка");
		п_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ");
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОРД ФАРМ");
        ЗаполнитьСкидкиДоходовФАРМ_ТМ("СоставБюджета1",Скидка_СтатьяОборотов,п_СтатьяОборотов,"ФАРМ",ЦФО); 		
		
		// МТ
		Скидка_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_скидка");
		п_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТРМ");
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОРД МТ");
        ЗаполнитьСкидкиДоходовФАРМ_ТМ("СоставБюджета1",Скидка_СтатьяОборотов,п_СтатьяОборотов,"МТ",ЦФО); 		
		
		// КП
		Скидка_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_скидка");
		п_СтатьяОборотов = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_УС_СК");
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОКП");
        ЗаполнитьСкидкиДоходовКП("СоставБюджета1",Скидка_СтатьяОборотов,п_СтатьяОборотов,"КП",ЦФО); 		
		
		ЗаполнимТаблицуСерверСуммированиемВсех("СоставБюджета1",неопределено,Истина,неопределено);
		//ЗаполнимТаблицуСерверРасшифровкаГруппировкиИндекс ("СоставБюджета1");
		ЗаполнимТаблицуСервер("СоставБюджета1",Истина);
		
		
		
	// 2. ПРОИЗВОДСТВО	
	
	// 2.1 Цех (Производство)
	
		мЦех = ПолучитьМассивПроизводсвоЦех(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Производство");
        ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета2",мЦех,ЦФО); 		
		
	// 2.2 ОТ и ТБ
	
		мЦех = ПолучитьМассивПроизводсвоОТиТБ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОТ и ТБ");
        ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета2",мЦех,ЦФО); 		
		
	// 2.3 ИТС
	
		мЦех = ПолучитьМассивПроизводсвоИТС(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ИТС");
        ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета2",мЦех,ЦФО); 		
		
		
	// 2.4 Амортизация
	
		мЦех = ПолучитьМассивПроизводсвоАморт(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Амортизация");
        ЗаполнитьСкидкиДоходовАмортизация("СоставБюджета2",мЦех,ЦФО); 		
		
		
		
		
	// 2.5 Эксплуатация
		мЦех = ПолучитьМассивПроизводсвоЗД_Пр(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЭКСПЛУАТАЦИЯ");
		ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета2",мЦех,ЦФО); 		

		
		
		
		
		ЗаполнимТаблицуСерверСуммированиемВсех("СоставБюджета2",неопределено,Истина,неопределено);
		//ЗаполнимТаблицуСерверРасшифровкаГруппировкиИндекс ("СоставБюджета2");
		ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
		
		
	// 3. КОММЕРЧЕСКИЕ	
		
	// 3.1 Маркетинг (МАР)
		мЦех = ПолучитьМассивПроизводсвоPR(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","PR");
        ЗаполнитьСкидкиДоходовБренд("СоставБюджета3",мЦех,ЦФО); 		
	
		
	// 3.2 Логистика (ЛОГ)
		мЦех = ПолучитьМассивПроизводсвоЛОГ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЛОГИСТИКА_ГП");
        ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета3",мЦех,ЦФО); 		
		
		
		
		
		
		
		
		
		
	
		ЗаполнимТаблицуСерверСуммированиемВсех("СоставБюджета3",неопределено,Истина,неопределено);
		//ЗаполнимТаблицуСерверРасшифровкаГруппировкиИндекс ("СоставБюджета2");
		ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
	
	
	// 4. ОПЕРАЦИОННЫЕ
	
	// 4.1 Маркетинг (МАР)
		мЦех = ПолучитьМассивПроизводсвоPR(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","PR");
        ЗаполнитьСкидкиДоходовОбщие("СоставБюджета13",мЦех,ЦФО); 		
		
		
		
	// 4.2 Эксплуатация
		мЦех = ПолучитьМассивПроизводсвоЗД(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЭКСПЛУАТАЦИЯ");
		ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета13",мЦех,ЦФО); 		
		
		
	// 4.3 ОТ и ТБ
		мЦех = ПолучитьМассивПроизводсвоЗД_ОТиТБ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОТ и ТБ");
        ЗаполнитьСкидкиДоходовПроизводство("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.4 ОГТ
		мЦех = ПолучитьМассивПроизводсвоОГТ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОГТ");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
		
	// 4.5 ОКК
		мЦех = ПолучитьМассивПроизводсвоОКК(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОКК");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.6 ОРП
		мЦех = ПолучитьМассивПроизводсвоОРП(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОРП");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.7 ОТР
		мЦех = ПолучитьМассивПроизводсвоОТР(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОТР");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.8 ЮР
		мЦех = ПолучитьМассивПроизводсвоЮР(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЮО");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
		
	// 4.9 БУХ
		мЦех = ПолучитьМассивПроизводсвоБУХ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","БУХ");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.10 ИТ
		мЦех = ПолучитьМассивПроизводсвоИТ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ИТ");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
		
		
	// 4.11 НАЛОГИ
		мЦех = ПолучитьМассивПроизводсвоНалог(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Налоги");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
		
	// 4.11 СП
		мЦех = ПолучитьМассивПроизводсвоСП(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","СЛУЖБА ПЕРСОНАЛА");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.11 ПРИЕМ
		мЦех = ПолучитьМассивПроизводсвоПРИЕМ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ПРИЕМНАЯ");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.11 СБ
		мЦех = ПолучитьМассивПроизводсвоСБ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","СБ");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
	// 4.11 АН
		мЦех = ПолучитьМассивПроизводсвоАН(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","АН");
        ЗаполнитьСкидкиДоходовОКК_ОРП("СоставБюджета13",мЦех,ЦФО); 		
		
		
		
		
	// 4.20 ФОТ
	
	
		мЦех = ПолучитьМассивПроизводсвоФОТ(); 
		ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ФОТ");
        ЗаполнитьСкидкиДоходовФОТ("СоставБюджета13",мЦех,ЦФО); 		
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
		ЗаполнимТаблицуСерверСуммированиемВсех("СоставБюджета13",неопределено,Истина,неопределено);
		//ЗаполнимТаблицуСерверРасшифровкаГруппировкиИндекс ("СоставБюджета13");
		ЗаполнимТаблицуСервер("СоставБюджета13",Истина);
		
		
		
	// 5. БДР
	
        ЗаполнитьЗакладкуБДР();
		
		
		
		ЗаполнимТаблицуСерверСуммированиемВсех("СоставБюджета",неопределено,Истина,неопределено);
		
		//ЗаполнимТаблицуСерверРасшифровкаГруппировкиИндекс ("СоставБюджета");
		ЗаполнимТаблицуСервер("СоставБюджета",Истина);
		
		
		ЗаполнитьЗакладкуФинРез();
		
		
	// 6. БДР old (заполнение)
	
	Для каждого сс из Объект["СоставБюджета"] цикл
		
		мПоиска = Объект["СоставБюджета17"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		Если мПоиска.Количество() > 0 тогда
			Если мПоиска[0].Итоговая тогда продолжить КонецЕсли;
			ЗаполнитьПоказателиДаннымиОтчетПериодКлиент(мПоиска[0],сс);
			
		иначе // ищем соответствие в регистре абс_СтатьиБюджетаПоЦФО
			
			//сДанных = РегистрыСведений.абс_СтатьиБюджетаПоЦФО.ПолучитьПоследнее(Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Раздел",Объект.ЦФО,сс.СтатьяОборотовПоБюджетам,"_СоставБюджета"));
			_Статья = ПолучитьСтатьюОборотовИЗСоответствия(Объект.ЦФО,сс.СтатьяОборотовПоБюджетам);
			Если _Статья <> неопределено тогда
				мПоиска = Объект["СоставБюджета17"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_Статья));
				Если мПоиска.Количество() > 0 тогда
					ЗаполнитьПоказателиДаннымиОтчетПериодКлиент(мПоиска[0],сс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	// Итоговые строки
	ТЗит = Объект["СоставБюджета17"];
    ЗаполнитьИтоговыеСтрокиВсе("СоставБюджета17",ТЗит, Истина);
	
    ЗаполнитьЗакладкуФинРезOLD("СоставБюджета17");	
	
	
	
	
	//////////
		
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("БДР заполнен !!!");	
		
	    возврат;
	КонецЕсли;
	
	
	
	_Перезаполнить = Ложь;
	
    //ОчиститьТаблицы();	

	//////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////
	// По клиентам
	
    ОчиститьТаблицуСервер("СоставБюджета1"); // Расходы по клиентам С НДС
	ОчиститьТаблицуСервер("СоставБюджета2"); // Расходы по клиентам Без НДС
		
	// План продаж НЕТТО
	ЗаполнитьБюджетПланомПродажПоВсемКонтрагентам(_Перезаполнить);
	
	
	// Непрямым
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
	ЗаполнитьБюджетПланомПродажПоНепрямым(_Перезаполнить);
	КонецЕсли;
	
	
	// ТМ
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" 
	или  Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" 	
		тогда 
	ЗаполнитьБюджетПланомПродажТМ(_Перезаполнить);
	КонецЕсли;
	
	
	//ТабЧ = Элемент.Имя;
	//ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	//ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
    //ОчиститьТаблицуСервер("СоставБюджета1");

	Если _Перезаполнить тогда
		
		// СНДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета1","СоставБюджета4",Истина);	
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета7","СоставБюджета4",Истина);
		
		ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета7");

		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета4",Истина);
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета4",Истина);
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета","СоставБюджета1",Истина);
		
		
		
		ЗаполнимТаблицуСервер("СоставБюджета1",Истина);
		//ЗаполнимТаблицуСервер("СоставБюджета2",Истина);                 
		//ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета4",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета",Истина);
		
		
		// БезНДС ФАРМ
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
		
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета5",Истина);	
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета10","СоставБюджета5",Истина);
		
		ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета10");

		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета4",Истина);
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета4",Истина);
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета9","СоставБюджета2",Истина);
		
		
		
		ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
		//ЗаполнимТаблицуСервер("СоставБюджета2",Истина);                 
		//ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
		
		
		// Заполним Основную ТО для Непрямым 
		   // С НДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета1",Истина);	//ТО
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета6",Истина); //ПРЕМ
				ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
				ЗаполнимТаблицуСервер("СоставБюджета6",Истина);
		
		   //Без НДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета13","СоставБюджета2",Истина);	 //ТО
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета13","СоставБюджета14",Истина); //ПРЕМ
				ЗаполнимТаблицуСервер("СоставБюджета13",Истина);
				ЗаполнимТаблицуСервер("СоставБюджета14",Истина);
				
		// Заполним Основную ТО для ТМ
		   // С НДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета15","СоставБюджета1",Истина);	//ТО
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета15","СоставБюджета16",Истина); //ТРМ
				ЗаполнимТаблицуСервер("СоставБюджета15",Истина);
				ЗаполнимТаблицуСервер("СоставБюджета16",Истина);
		
		   //Без НДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета17","СоставБюджета2",Истина);	 //ТО
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета17","СоставБюджета18",Истина); //ТРМ
				ЗаполнимТаблицуСервер("СоставБюджета17",Истина);
				ЗаполнимТаблицуСервер("СоставБюджета18",Истина);
				
				
		//Заполним Осн Значениями Непрямым и ТРМ
				ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета","СоставБюджета3",Истина);  //Непрямым
				ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета","СоставБюджета15",Истина); //ТРМ
				
		        ЗаполнимТаблицуСервер("СоставБюджета",Истина);
		
		///////////////////////////////////////////////////////////
		/// Заполним Расшифровку Основная СНДС, БезНДС
        ЗаполнимРасшифровкуФАРМ_БОНУС_ТОВ_ИСГ("СоставБюджета","СоставБюджета7");// СНДС
        ЗаполнимРасшифровкуФАРМ_БОНУС_ТОВ_ИСГ("СоставБюджета9","СоставБюджета10")// БезНДС
		
		
		КонецЕСли;
		
		//////////////////////////////////////////////////////////////////////////
		
		
		
		// БезНДС ФАРМ
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ
		
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета5",Истина);	
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета10","СоставБюджета5",Истина);
		
		ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета10");

		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета4",Истина);
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета4",Истина);
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета9","СоставБюджета2",Истина);
		
		
		
		ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
		//ЗаполнимТаблицуСервер("СоставБюджета2",Истина);                 
		//ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
		
		
		//// Заполним Основную ТО для Непрямым 
		//   // С НДС
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета1",Истина);	//ТО
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета6",Истина); //ПРЕМ
		//		ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
		//		ЗаполнимТаблицуСервер("СоставБюджета6",Истина);
		//
		//   //Без НДС
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета13","СоставБюджета2",Истина);	 //ТО
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета13","СоставБюджета14",Истина); //ПРЕМ
		//		ЗаполнимТаблицуСервер("СоставБюджета13",Истина);
		//		ЗаполнимТаблицуСервер("СоставБюджета14",Истина);
				
		// Заполним Основную ТО для ТМ
		   // С НДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета15","СоставБюджета1",Истина);	//ТО
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета15","СоставБюджета16",Истина); //ТРМ
				ЗаполнимТаблицуСервер("СоставБюджета15",Истина);
				ЗаполнимТаблицуСервер("СоставБюджета16",Истина);
		
		   //Без НДС
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета17","СоставБюджета2",Истина);	 //ТО
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета17","СоставБюджета18",Истина); //ТРМ
				ЗаполнимТаблицуСервер("СоставБюджета17",Истина);
				ЗаполнимТаблицуСервер("СоставБюджета18",Истина);
				
				
		//Заполним Осн Значениями Непрямым и ТРМ
				ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета","СоставБюджета3",Истина);  //Непрямым
				ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета","СоставБюджета15",Истина); //ТРМ
				
		        ЗаполнимТаблицуСервер("СоставБюджета",Истина);
		
		///////////////////////////////////////////////////////////
		/// Заполним Расшифровку Основная СНДС, БезНДС
        ЗаполнимРасшифровкуФАРМ_БОНУС_ТОВ_ИСГ("СоставБюджета","СоставБюджета7");// СНДС
        ЗаполнимРасшифровкуФАРМ_БОНУС_ТОВ_ИСГ("СоставБюджета9","СоставБюджета10")// БезНДС
		
		
		КонецЕСли;
		
		//////////////////////////////////////////////////////////////////////////
		
		
		
		// Без НДС
		// (КП, ИНД)
		Если Объект.ЦФО.Лео_ЦЗ = "ОКП"           //КП
			 или Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" //ИНД
			 или Объект.ЦФО.Лео_ЦЗ = "ЭО"        //ЭКС
			
			тогда 
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета5",Истина);	
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета10","СоставБюджета5",Истина);
		
		ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета10");

		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета2","СоставБюджета4",Истина);
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета3","СоставБюджета4",Истина);
		ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета9","СоставБюджета2",Истина);
		
		
		
		ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
		//ЗаполнимТаблицуСервер("СоставБюджета2",Истина);                 
		//ЗаполнимТаблицуСервер("СоставБюджета3",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
		
		
		ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
		КонецЕСли;
		
		
		
		
		
		
		//// Без НДС
		//// (ИНД_ТО_без НДС)
		//Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда // Индустриальный
		//ЗаполнимИтоговуюТаблицуБезФакта("СоставБюджета9","СоставБюджета1",Истина);
		//ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
		////ЗаполнимТаблицуБезНДС("СоставБюджета9",Ложь);
		//КонецЕСли;
		
		
		//ПроссумируемЕксель(ТабЧ,ИмяТекКолонки,ТекДанные);
		
	КонецЕсли;
	
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные из План продаж загружены !");
	
	Предупреждение("Данные из Плана продаж загружены !");
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЗакладкуБДР()
	
	
	
	Раздел = "СоставБюджета";
	ЦФО = Справочники.Подразделения.НайтиПоКоду("001");
	
	
	Для каждого сс из Объект.СоставБюджета цикл
		

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_СтатьиБюджетаПоЦФО.ЦФО,
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	абс_СтатьиБюджетаПоЦФО.Раздел,
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетамРесурс,
		|	абс_СтатьиБюджетаПоЦФО.РазделРесурс
		|ИЗ
		|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		|ГДЕ
		|	абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам = &СтатьяОборотовПоБюджетам
		|	И абс_СтатьиБюджетаПоЦФО.Раздел = &Раздел";

	Запрос.УстановитьПараметр("Раздел", Раздел);
	Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам", сс.СтатьяОборотовПоБюджетам);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.РазделРесурс) тогда
			Если Выборка.РазделРесурс = "Производство" тогда
				Таб = "СоставБюджета2";
			ИначеЕсли Выборка.РазделРесурс = "Операционные" тогда
				Таб = "СоставБюджета13";
			ИначеЕсли Выборка.РазделРесурс = "Коммерческие" тогда
				Таб = "СоставБюджета3";
			ИначеЕсли Выборка.РазделРесурс = "Доходы" тогда
				Таб = "СоставБюджета1";
			КонецЕсли;
			
			ПоискПоРесурс = Истина;
			мПоиска  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Выборка.СтатьяОборотовПоБюджетам));
			Если мПоиска.Количество() > 0 тогда
				ЗаполнитьПоказателиДанными(сс,мПоиска[0]);
			ПоискПоРесурс = Ложь;
			КонецЕсли;	
			
			
			Если ПоискПоРесурс тогда
			мПоиска  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Выборка.СтатьяОборотовПоБюджетамРесурс));
			Если мПоиска.Количество() > 0 тогда
				ЗаполнитьПоказателиДанными(сс,мПоиска[0]);
			КонецЕсли;	
			КонецЕсли;	
			
		 
		 
			
		КонецЕсли;
	Конецесли;	
		
		
	
	
   КонецЦикла;	

   
   
   // ФОТ производства
   
      ЗаполнитьФОТпроизводства();
   
   // Взносы с ФОТ производства
   
      ЗаполнитьВзносыСФОТпроизводства();
   
   
   
   
   
   
   
   
   

   //// АМОРТИЗАЦИЯ
   //
   //
   // 	мЦех = Новый Массив;
   // 	мЦех.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(".Амортизация"));
   // 	ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Амортизация");
   //	 ЗаполнитьСкидкиДоходовАмортизация("СоставБюджета",мЦех,ЦФО); 		




КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВзносыСФОТпроизводства()
	
	ТабИст = Объект["Составбюджета2"];
	
	мФОТ = Новый Массив;
	мФОТ.Добавить("ЦЕХ_ФСС_ОП");
	мФОТ.Добавить("ИТС_ФСС_ОП");
	мФОТ.Добавить("ЦЕХ_ФСС_АУП");
	мФОТ.Добавить("ИТС_ФСС_АУП");
	мФОТ.Добавить("ОТ_ФСС");
	
	ТЗрез = ТабИст.Выгрузить().СкопироватьКолонки();
	ТЗрез.Колонки.Добавить("_Взносы");
	Для каждого оо из ТабИст цикл
		Если мФОТ.Найти(оо.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи) <> неопределено тогда
			дд = ТЗрез.Добавить();
			ЗаполнитьЗначенияСвойств(дд,оо);
			дд._Взносы = "_Взносы";
	    Конецесли;
	КонецЦикла;

	
	ТЗрез.Свернуть("_Взносы",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	|Факт1,Факт2,Факт3,
	|БюджетМесяц,ПрогнозМесяц,ОтклоненияМесяц,
	|ГодовойБюджет,ГодовойПрогноз,ГодовойОтклонение
	
	|");
	
	_Статья = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Взносы с ФОТ производства");
	мПоикаПрием = Объект["Составбюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_Статья));
	Если мПоикаПрием.Количество() > 0 тогда
		 ЗаполнитьЗначенияСвойств(мПоикаПрием[0],ТЗрез[0]);
	КонецЕсли;
	


	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьФОТпроизводства()
	
	
	ТабИст = Объект["Составбюджета2"];
	
	мФОТ = Новый Массив;
	мФОТ.Добавить("ЦЕХ_ФОТ_ОП");
	мФОТ.Добавить("ИТС_ФОТ_ОП");
	мФОТ.Добавить("ЦЕХ_ФОТ_АУП");
	мФОТ.Добавить("ИТС_ФОТ_АУП");
	мФОТ.Добавить("ОТ_ФОТ");
	мФОТ.Добавить("ОТ_ПрФОТ");

	ТЗрез = ТабИст.Выгрузить().СкопироватьКолонки();
	ТЗрез.Колонки.Добавить("_ФОТпроизводства");
	Для каждого оо из ТабИст цикл
		Если мФОТ.Найти(оо.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи) <> неопределено тогда
			дд = ТЗрез.Добавить();
			ЗаполнитьЗначенияСвойств(дд,оо);
			дд._ФОТпроизводства = "_ФОТпроизводства";
	    Конецесли;
	КонецЦикла;

	
	ТЗрез.Свернуть("_ФОТпроизводства",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	|Факт1,Факт2,Факт3,
	|БюджетМесяц,ПрогнозМесяц,ОтклоненияМесяц,
	|ГодовойБюджет,ГодовойПрогноз,ГодовойОтклонение
	
	|");
	
	_Статья = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ФОТ производства");
	мПоикаПрием = Объект["Составбюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_Статья));
	Если мПоикаПрием.Количество() > 0 тогда
		 ЗаполнитьЗначенияСвойств(мПоикаПрием[0],ТЗрез[0]);
	КонецЕсли;
	
	
КонецПроцедуры




&НаСервере
Процедура ЗаполнитьЗакладкуФинРез()
	
	
	
	Таб = "СоставБюджета";
 
   
   ///////////////////////////////////////////////////////////////
   // Фин показатели
   
   //1.МАРЖИНАЛЬНЫЙ ДОХОД  = ДОХОДЫ - Прямые расходы (себестоимость)
   
   МАРЖИНАЛЬНЫЙ_ДОХОД = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("МАРЖИНАЛЬНЫЙ ДОХОД"))); 
   ДОХОДЫ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","1.")); 
   ПрямыеРасходы = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","2.1.")); 
   
   
   Для сч = 1 по 12 цикл
	   
	   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["СуммаБюджет" + сч] = ДОХОДЫ[0]["СуммаБюджет" + сч] - ПрямыеРасходы[0]["СуммаБюджет" + сч];	
	   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["Сумма" + сч]       = ДОХОДЫ[0]["Сумма" + сч]       - ПрямыеРасходы[0]["Сумма" + сч];	
	   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["СуммаПрФакт" + сч] = ДОХОДЫ[0]["СуммаПрФакт" + сч] - ПрямыеРасходы[0]["СуммаПрФакт" + сч];	
	   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["СуммаФакт" + сч]   = ДОХОДЫ[0]["СуммаФакт" + сч]   - ПрямыеРасходы[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["Факт" + сч] = ДОХОДЫ[0]["Факт" + сч] - ПрямыеРасходы[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["БюджетМесяц"]     = ДОХОДЫ[0]["БюджетМесяц"]     - ПрямыеРасходы[0]["БюджетМесяц"];	
   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ПрогнозМесяц"]    = ДОХОДЫ[0]["ПрогнозМесяц"]    - ПрямыеРасходы[0]["ПрогнозМесяц"];	
   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ОтклоненияМесяц"] = ДОХОДЫ[0]["ОтклоненияМесяц"] - ПрямыеРасходы[0]["ОтклоненияМесяц"];	
   
   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ГодовойБюджет"]     = ДОХОДЫ[0]["ГодовойБюджет"]     - ПрямыеРасходы[0]["ГодовойБюджет"];	
   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ГодовойПрогноз"]    = ДОХОДЫ[0]["ГодовойПрогноз"]    - ПрямыеРасходы[0]["ГодовойПрогноз"];	
   МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ГодовойОтклонение"] = ДОХОДЫ[0]["ГодовойОтклонение"] - ПрямыеРасходы[0]["ГодовойОтклонение"];	
   
   
		   
   //2.ПРИБЫЛЬ от ПРОДАЖ  = МАРЖИНАЛЬНЫЙ ДОХОД - Коммерческие расходы
   
   ПРИБЫЛЬотПРОДАЖ = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ПРИБЫЛЬ от ПРОДАЖ"))); 
   МАРЖИНАЛЬНЫЙ_ДОХОД = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("МАРЖИНАЛЬНЫЙ ДОХОД"))); 
   КоммРасходы = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","2.2.")); 
   
   
   Для сч = 1 по 12 цикл
	   
	   ПРИБЫЛЬотПРОДАЖ[0]["СуммаБюджет" + сч] = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["СуммаБюджет" + сч] - КоммРасходы[0]["СуммаБюджет" + сч];	
	   ПРИБЫЛЬотПРОДАЖ[0]["Сумма" + сч]       = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["Сумма" + сч]       - КоммРасходы[0]["Сумма" + сч];	
	   ПРИБЫЛЬотПРОДАЖ[0]["СуммаПрФакт" + сч] = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["СуммаПрФакт" + сч] - КоммРасходы[0]["СуммаПрФакт" + сч];	
	   ПРИБЫЛЬотПРОДАЖ[0]["СуммаФакт" + сч]   = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["СуммаФакт" + сч]   - КоммРасходы[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ПРИБЫЛЬотПРОДАЖ[0]["Факт" + сч] = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["Факт" + сч] - КоммРасходы[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ПРИБЫЛЬотПРОДАЖ[0]["БюджетМесяц"]     = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["БюджетМесяц"]     - КоммРасходы[0]["БюджетМесяц"];	
   ПРИБЫЛЬотПРОДАЖ[0]["ПрогнозМесяц"]    = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ПрогнозМесяц"]    - КоммРасходы[0]["ПрогнозМесяц"];	
   ПРИБЫЛЬотПРОДАЖ[0]["ОтклоненияМесяц"] = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ОтклоненияМесяц"] - КоммРасходы[0]["ОтклоненияМесяц"];	
   
   ПРИБЫЛЬотПРОДАЖ[0]["ГодовойБюджет"]     = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ГодовойБюджет"]     - КоммРасходы[0]["ГодовойБюджет"];	
   ПРИБЫЛЬотПРОДАЖ[0]["ГодовойПрогноз"]    = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ГодовойПрогноз"]    - КоммРасходы[0]["ГодовойПрогноз"];	
   ПРИБЫЛЬотПРОДАЖ[0]["ГодовойОтклонение"] = МАРЖИНАЛЬНЫЙ_ДОХОД[0]["ГодовойОтклонение"] - КоммРасходы[0]["ГодовойОтклонение"];	
   
   
   
   //3.ПРИБЫЛЬ до налогообложения  = ПРИБЫЛЬотПРОДАЖ - Опер расходы
   
   ПРИБЫЛЬотПРОДАЖ = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("ПРИБЫЛЬ от ПРОДАЖ"))); 
   ПРИБЫЛЬдоНалогообложения = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   ОперРасходы = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","2.3.")); 
   
   
   Для сч = 1 по 12 цикл
	   
	   ПРИБЫЛЬдоНалогообложения[0]["СуммаБюджет" + сч] = ПРИБЫЛЬотПРОДАЖ[0]["СуммаБюджет" + сч] - ОперРасходы[0]["СуммаБюджет" + сч];	
	   ПРИБЫЛЬдоНалогообложения[0]["Сумма" + сч]       = ПРИБЫЛЬотПРОДАЖ[0]["Сумма" + сч]       - ОперРасходы[0]["Сумма" + сч];	
	   ПРИБЫЛЬдоНалогообложения[0]["СуммаПрФакт" + сч] = ПРИБЫЛЬотПРОДАЖ[0]["СуммаПрФакт" + сч] - ОперРасходы[0]["СуммаПрФакт" + сч];	
	   ПРИБЫЛЬдоНалогообложения[0]["СуммаФакт" + сч]   = ПРИБЫЛЬотПРОДАЖ[0]["СуммаФакт" + сч]   - ОперРасходы[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ПРИБЫЛЬдоНалогообложения[0]["Факт" + сч] = ПРИБЫЛЬотПРОДАЖ[0]["Факт" + сч] - ОперРасходы[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ПРИБЫЛЬдоНалогообложения[0]["БюджетМесяц"]     = ПРИБЫЛЬотПРОДАЖ[0]["БюджетМесяц"]     - ОперРасходы[0]["БюджетМесяц"];	
   ПРИБЫЛЬдоНалогообложения[0]["ПрогнозМесяц"]    = ПРИБЫЛЬотПРОДАЖ[0]["ПрогнозМесяц"]    - ОперРасходы[0]["ПрогнозМесяц"];	
   ПРИБЫЛЬдоНалогообложения[0]["ОтклоненияМесяц"] = ПРИБЫЛЬотПРОДАЖ[0]["ОтклоненияМесяц"] - ОперРасходы[0]["ОтклоненияМесяц"];	
   
   ПРИБЫЛЬдоНалогообложения[0]["ГодовойБюджет"]     = ПРИБЫЛЬотПРОДАЖ[0]["ГодовойБюджет"]     - ОперРасходы[0]["ГодовойБюджет"];	
   ПРИБЫЛЬдоНалогообложения[0]["ГодовойПрогноз"]    = ПРИБЫЛЬотПРОДАЖ[0]["ГодовойПрогноз"]    - ОперРасходы[0]["ГодовойПрогноз"];	
   ПРИБЫЛЬдоНалогообложения[0]["ГодовойОтклонение"] = ПРИБЫЛЬотПРОДАЖ[0]["ГодовойОтклонение"] - ОперРасходы[0]["ГодовойОтклонение"];	
   
   
   //3.5 Налог на прибыль  = ПРИБЫЛЬдоНалогообложения * 0.2
   
   ПРИБЫЛЬдоНалогообложения = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   НалогНаприбыль = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","4.")); 
   ЧИСТАЯПРИБЫЛЬ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","5.")); 
   
   Для сч = 1 по 12 цикл
	   
	   НалогНаприбыль[0]["СуммаБюджет" + сч] = ПРИБЫЛЬдоНалогообложения[0]["СуммаБюджет" + сч] * 0.2;	
	   НалогНаприбыль[0]["Сумма" + сч]       = ПРИБЫЛЬдоНалогообложения[0]["Сумма" + сч]       * 0.2;	
	   НалогНаприбыль[0]["СуммаПрФакт" + сч] = ПРИБЫЛЬдоНалогообложения[0]["СуммаПрФакт" + сч] * 0.2;	
	   НалогНаприбыль[0]["СуммаФакт" + сч]   = ПРИБЫЛЬдоНалогообложения[0]["СуммаФакт" + сч]   * 0.2;	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   НалогНаприбыль[0]["Факт" + сч] = ПРИБЫЛЬдоНалогообложения[0]["Факт" + сч]  * 0.2;	
	   
   КонецЦикла;
   
   НалогНаприбыль[0]["БюджетМесяц"]     = ПРИБЫЛЬдоНалогообложения[0]["БюджетМесяц"]      * 0.2;	
   НалогНаприбыль[0]["ПрогнозМесяц"]    = ПРИБЫЛЬдоНалогообложения[0]["ПрогнозМесяц"]     * 0.2;	
   НалогНаприбыль[0]["ОтклоненияМесяц"] = ПРИБЫЛЬдоНалогообложения[0]["ОтклоненияМесяц"]  * 0.2;	
   
   НалогНаприбыль[0]["ГодовойБюджет"]     = ПРИБЫЛЬдоНалогообложения[0]["ГодовойБюджет"]      * 0.2;	
   НалогНаприбыль[0]["ГодовойПрогноз"]    = ПРИБЫЛЬдоНалогообложения[0]["ГодовойПрогноз"]     * 0.2;	
   НалогНаприбыль[0]["ГодовойОтклонение"] = ПРИБЫЛЬдоНалогообложения[0]["ГодовойОтклонение"]  * 0.2;	
   
   
   
   //4.ЧИСТАЯ ПРИБЫЛЬ  = ПРИБЫЛЬдоНалогообложения - Налог на прибыль
   
   ПРИБЫЛЬдоНалогообложения = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   НалогНаприбыль = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","4.")); 
   ЧИСТАЯПРИБЫЛЬ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","5.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ЧИСТАЯПРИБЫЛЬ[0]["СуммаБюджет" + сч] = ПРИБЫЛЬдоНалогообложения[0]["СуммаБюджет" + сч] - НалогНаприбыль[0]["СуммаБюджет" + сч];	
	   ЧИСТАЯПРИБЫЛЬ[0]["Сумма" + сч]       = ПРИБЫЛЬдоНалогообложения[0]["Сумма" + сч]       - НалогНаприбыль[0]["Сумма" + сч];	
	   ЧИСТАЯПРИБЫЛЬ[0]["СуммаПрФакт" + сч] = ПРИБЫЛЬдоНалогообложения[0]["СуммаПрФакт" + сч] - НалогНаприбыль[0]["СуммаПрФакт" + сч];	
	   ЧИСТАЯПРИБЫЛЬ[0]["СуммаФакт" + сч]   = ПРИБЫЛЬдоНалогообложения[0]["СуммаФакт" + сч]   - НалогНаприбыль[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ЧИСТАЯПРИБЫЛЬ[0]["Факт" + сч] = ПРИБЫЛЬдоНалогообложения[0]["Факт" + сч] - НалогНаприбыль[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ЧИСТАЯПРИБЫЛЬ[0]["БюджетМесяц"]     = ПРИБЫЛЬдоНалогообложения[0]["БюджетМесяц"]     - НалогНаприбыль[0]["БюджетМесяц"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ПрогнозМесяц"]    = ПРИБЫЛЬдоНалогообложения[0]["ПрогнозМесяц"]    - НалогНаприбыль[0]["ПрогнозМесяц"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ОтклоненияМесяц"] = ПРИБЫЛЬдоНалогообложения[0]["ОтклоненияМесяц"] - НалогНаприбыль[0]["ОтклоненияМесяц"];	
   
   ЧИСТАЯПРИБЫЛЬ[0]["ГодовойБюджет"]     = ПРИБЫЛЬдоНалогообложения[0]["ГодовойБюджет"]     - НалогНаприбыль[0]["ГодовойБюджет"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ГодовойПрогноз"]    = ПРИБЫЛЬдоНалогообложения[0]["ГодовойПрогноз"]    - НалогНаприбыль[0]["ГодовойПрогноз"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ГодовойОтклонение"] = ПРИБЫЛЬдоНалогообложения[0]["ГодовойОтклонение"] - НалогНаприбыль[0]["ГодовойОтклонение"];	

   
   
   //5.ФИНАНСОВЫЙ РЕЗУЛЬТАТ ДЕЯТЕЛЬНОСТИ  = ЧИСТАЯПРИБЫЛЬ - Расходы из чистой прибыли
   
   ФИНАНСОВЫЙРЕЗУЛЬТАТ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","7.")); 
   РасходыИзЧистойПрибыли = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","6.")); 
   ЧИСТАЯПРИБЫЛЬ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","5.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["СуммаБюджет" + сч] = ЧИСТАЯПРИБЫЛЬ[0]["СуммаБюджет" + сч] - РасходыИзЧистойПрибыли[0]["СуммаБюджет" + сч];	
	   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["Сумма" + сч]       = ЧИСТАЯПРИБЫЛЬ[0]["Сумма" + сч]       - РасходыИзЧистойПрибыли[0]["Сумма" + сч];	
	   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["СуммаПрФакт" + сч] = ЧИСТАЯПРИБЫЛЬ[0]["СуммаПрФакт" + сч] - РасходыИзЧистойПрибыли[0]["СуммаПрФакт" + сч];	
	   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["СуммаФакт" + сч]   = ЧИСТАЯПРИБЫЛЬ[0]["СуммаФакт" + сч]   - РасходыИзЧистойПрибыли[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["Факт" + сч] = ЧИСТАЯПРИБЫЛЬ[0]["Факт" + сч] - РасходыИзЧистойПрибыли[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["БюджетМесяц"]     = ЧИСТАЯПРИБЫЛЬ[0]["БюджетМесяц"]     - РасходыИзЧистойПрибыли[0]["БюджетМесяц"];	
   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["ПрогнозМесяц"]    = ЧИСТАЯПРИБЫЛЬ[0]["ПрогнозМесяц"]    - РасходыИзЧистойПрибыли[0]["ПрогнозМесяц"];	
   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["ОтклоненияМесяц"] = ЧИСТАЯПРИБЫЛЬ[0]["ОтклоненияМесяц"] - РасходыИзЧистойПрибыли[0]["ОтклоненияМесяц"];	
   
   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["ГодовойБюджет"]     = ЧИСТАЯПРИБЫЛЬ[0]["ГодовойБюджет"]     - РасходыИзЧистойПрибыли[0]["ГодовойБюджет"];	
   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["ГодовойПрогноз"]    = ЧИСТАЯПРИБЫЛЬ[0]["ГодовойПрогноз"]    - РасходыИзЧистойПрибыли[0]["ГодовойПрогноз"];	
   ФИНАНСОВЫЙРЕЗУЛЬТАТ[0]["ГодовойОтклонение"] = ЧИСТАЯПРИБЫЛЬ[0]["ГодовойОтклонение"] - РасходыИзЧистойПрибыли[0]["ГодовойОтклонение"];	
   
   
   
   //6.EBITDA  = ПРИБЫЛЬдоНалогообложения + Амортизация
   
   EBITDA = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","8.")); 
   ПРИБЫЛЬдоНалогообложения = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   Амортизация = Объект[Таб].НайтиСтроки(Новый Структура("НомерСтроки",18)); 
   
   Для сч = 1 по 12 цикл
	   
	   EBITDA[0]["СуммаБюджет" + сч] = ПРИБЫЛЬдоНалогообложения[0]["СуммаБюджет" + сч] + Амортизация[0]["СуммаБюджет" + сч];	
	   EBITDA[0]["Сумма" + сч]       = ПРИБЫЛЬдоНалогообложения[0]["Сумма" + сч]       + Амортизация[0]["Сумма" + сч];	
	   EBITDA[0]["СуммаПрФакт" + сч] = ПРИБЫЛЬдоНалогообложения[0]["СуммаПрФакт" + сч] + Амортизация[0]["СуммаПрФакт" + сч];	
	   EBITDA[0]["СуммаФакт" + сч]   = ПРИБЫЛЬдоНалогообложения[0]["СуммаФакт" + сч]   + Амортизация[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   EBITDA[0]["Факт" + сч] = ПРИБЫЛЬдоНалогообложения[0]["Факт" + сч] + Амортизация[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   EBITDA[0]["БюджетМесяц"]     = ПРИБЫЛЬдоНалогообложения[0]["БюджетМесяц"]     + Амортизация[0]["БюджетМесяц"];	
   EBITDA[0]["ПрогнозМесяц"]    = ПРИБЫЛЬдоНалогообложения[0]["ПрогнозМесяц"]    + Амортизация[0]["ПрогнозМесяц"];	
   EBITDA[0]["ОтклоненияМесяц"] = ПРИБЫЛЬдоНалогообложения[0]["ОтклоненияМесяц"] + Амортизация[0]["ОтклоненияМесяц"];	
   
   EBITDA[0]["ГодовойБюджет"]     = ПРИБЫЛЬдоНалогообложения[0]["ГодовойБюджет"]     + Амортизация[0]["ГодовойБюджет"];	
   EBITDA[0]["ГодовойПрогноз"]    = ПРИБЫЛЬдоНалогообложения[0]["ГодовойПрогноз"]    + Амортизация[0]["ГодовойПрогноз"];	
   EBITDA[0]["ГодовойОтклонение"] = ПРИБЫЛЬдоНалогообложения[0]["ГодовойОтклонение"] + Амортизация[0]["ГодовойОтклонение"];	
   
   
	   
   

   //// АМОРТИЗАЦИЯ
   //
   //
   // 	мЦех = Новый Массив;
   // 	мЦех.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(".Амортизация"));
   // 	ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Амортизация");
   //	 ЗаполнитьСкидкиДоходовАмортизация("СоставБюджета",мЦех,ЦФО); 		




КонецПроцедуры



&НаСервере
Процедура ЗаполнитьЗакладкуФинРезOLD(Таб)
	
	
	
	//Таб = "СоставБюджета17";
 
   
   ///////////////////////////////////////////////////////////////
   // Фин показатели
   
   //1.Валовый доход  = ДОХОДЫ - Себестоимость продукции
   
   ВаловыйДоход = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Валовый доход"))); 
   ДОХОДЫ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","1.")); 
   Себестоимость = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","2.1.")); 
   
   
   Для сч = 1 по 12 цикл
	   
	   ВаловыйДоход[0]["СуммаБюджет" + сч] = ДОХОДЫ[0]["СуммаБюджет" + сч] - Себестоимость[0]["СуммаБюджет" + сч];	
	   ВаловыйДоход[0]["Сумма" + сч]       = ДОХОДЫ[0]["Сумма" + сч]       - Себестоимость[0]["Сумма" + сч];	
	   ВаловыйДоход[0]["СуммаПрФакт" + сч] = ДОХОДЫ[0]["СуммаПрФакт" + сч] - Себестоимость[0]["СуммаПрФакт" + сч];	
	   ВаловыйДоход[0]["СуммаФакт" + сч]   = ДОХОДЫ[0]["СуммаФакт" + сч]   - Себестоимость[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ВаловыйДоход[0]["Факт" + сч] = ДОХОДЫ[0]["Факт" + сч] - Себестоимость[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ВаловыйДоход[0]["БюджетМесяц"]     = ДОХОДЫ[0]["БюджетМесяц"]     - Себестоимость[0]["БюджетМесяц"];	
   ВаловыйДоход[0]["ПрогнозМесяц"]    = ДОХОДЫ[0]["ПрогнозМесяц"]    - Себестоимость[0]["ПрогнозМесяц"];	
   ВаловыйДоход[0]["ОтклоненияМесяц"] = ДОХОДЫ[0]["ОтклоненияМесяц"] - Себестоимость[0]["ОтклоненияМесяц"];	
   
   ВаловыйДоход[0]["ГодовойБюджет"]     = ДОХОДЫ[0]["ГодовойБюджет"]     - Себестоимость[0]["ГодовойБюджет"];	
   ВаловыйДоход[0]["ГодовойПрогноз"]    = ДОХОДЫ[0]["ГодовойПрогноз"]    - Себестоимость[0]["ГодовойПрогноз"];	
   ВаловыйДоход[0]["ГодовойОтклонение"] = ДОХОДЫ[0]["ГодовойОтклонение"] - Себестоимость[0]["ГодовойОтклонение"];	
   
   
		   
   //2.Прибыль от реализации продукции, работ, услуг  = ВаловыйДоход - Внепроизводственные расходы - Административно-управленческие расходы
   
   ВаловыйДоход = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("Валовый доход"))); 
   Внепроизводственные = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","2.2.")); 
   Административно = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","2.3.")); 
   ПрибыльОтРеализации = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ПрибыльОтРеализации[0]["СуммаБюджет" + сч] = ВаловыйДоход[0]["СуммаБюджет" + сч] - Внепроизводственные[0]["СуммаБюджет" + сч] - Административно[0]["СуммаБюджет" + сч];	
	   ПрибыльОтРеализации[0]["Сумма" + сч]       = ВаловыйДоход[0]["Сумма" + сч]       - Внепроизводственные[0]["Сумма" + сч]       - Административно[0]["Сумма" + сч];	
	   ПрибыльОтРеализации[0]["СуммаПрФакт" + сч] = ВаловыйДоход[0]["СуммаПрФакт" + сч] - Внепроизводственные[0]["СуммаПрФакт" + сч] - Административно[0]["СуммаПрФакт" + сч];	
	   ПрибыльОтРеализации[0]["СуммаФакт" + сч]   = ВаловыйДоход[0]["СуммаФакт" + сч]   - Внепроизводственные[0]["СуммаФакт" + сч]   - Административно[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ПрибыльОтРеализации[0]["Факт" + сч] = ВаловыйДоход[0]["Факт" + сч] - Внепроизводственные[0]["Факт" + сч] - Административно[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ПрибыльОтРеализации[0]["БюджетМесяц"]     = ВаловыйДоход[0]["БюджетМесяц"]     - Внепроизводственные[0]["БюджетМесяц"]    - Административно[0]["БюджетМесяц"];	
   ПрибыльОтРеализации[0]["ПрогнозМесяц"]    = ВаловыйДоход[0]["ПрогнозМесяц"]    - Внепроизводственные[0]["ПрогнозМесяц"]   - Административно[0]["ПрогнозМесяц"];	
   ПрибыльОтРеализации[0]["ОтклоненияМесяц"] = ВаловыйДоход[0]["ОтклоненияМесяц"] - Внепроизводственные[0]["ОтклоненияМесяц"]- Административно[0]["ОтклоненияМесяц"];	
   
   ПрибыльОтРеализации[0]["ГодовойБюджет"]     = ВаловыйДоход[0]["ГодовойБюджет"]     - Внепроизводственные[0]["ГодовойБюджет"]     - Административно[0]["ГодовойБюджет"];	
   ПрибыльОтРеализации[0]["ГодовойПрогноз"]    = ВаловыйДоход[0]["ГодовойПрогноз"]    - Внепроизводственные[0]["ГодовойПрогноз"]    - Административно[0]["ГодовойПрогноз"];	
   ПрибыльОтРеализации[0]["ГодовойОтклонение"] = ВаловыйДоход[0]["ГодовойОтклонение"] - Внепроизводственные[0]["ГодовойОтклонение"] - Административно[0]["ГодовойОтклонение"];	
   
   
   
   
   //3.Прибыль от финансово-хозяйственной деятельности  = ПрибыльОтРеализации - Проценты по кредитам и займам - Налоги (без НДС и налога на прибыль) - Прочие операционные расходы
   
   ПрибыльОтФинансово = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","4.")); 
   Проценты = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.1.")); 
   Налоги = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.2.")); 
   Прочие = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.3.")); 
   ПрибыльОтРеализации = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ПрибыльОтФинансово[0]["СуммаБюджет" + сч] = ПрибыльОтРеализации[0]["СуммаБюджет" + сч] - Проценты[0]["СуммаБюджет" + сч] - Налоги[0]["СуммаБюджет" + сч] - Прочие[0]["СуммаБюджет" + сч];	
	   ПрибыльОтФинансово[0]["Сумма" + сч]       = ПрибыльОтРеализации[0]["Сумма" + сч]       - Проценты[0]["Сумма" + сч]       - Налоги[0]["Сумма" + сч]       - Прочие[0]["Сумма" + сч];	
	   ПрибыльОтФинансово[0]["СуммаПрФакт" + сч] = ПрибыльОтРеализации[0]["СуммаПрФакт" + сч] - Проценты[0]["СуммаПрФакт" + сч] - Налоги[0]["СуммаПрФакт" + сч] - Прочие[0]["СуммаПрФакт" + сч];	
	   ПрибыльОтФинансово[0]["СуммаФакт" + сч]   = ПрибыльОтРеализации[0]["СуммаФакт" + сч]   - Проценты[0]["СуммаФакт" + сч]   - Налоги[0]["СуммаФакт" + сч]   - Прочие[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ПрибыльОтФинансово[0]["Факт" + сч] = ПрибыльОтРеализации[0]["Факт" + сч] - Проценты[0]["Факт" + сч] - Налоги[0]["Факт" + сч] - Прочие[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ПрибыльОтФинансово[0]["БюджетМесяц"]     = ПрибыльОтРеализации[0]["БюджетМесяц"]     - Проценты[0]["БюджетМесяц"]    - Налоги[0]["БюджетМесяц"]     - Прочие[0]["БюджетМесяц"];	
   ПрибыльОтФинансово[0]["ПрогнозМесяц"]    = ПрибыльОтРеализации[0]["ПрогнозМесяц"]    - Проценты[0]["ПрогнозМесяц"]   - Налоги[0]["ПрогнозМесяц"]    - Прочие[0]["ПрогнозМесяц"];	
   ПрибыльОтФинансово[0]["ОтклоненияМесяц"] = ПрибыльОтРеализации[0]["ОтклоненияМесяц"] - Проценты[0]["ОтклоненияМесяц"]- Налоги[0]["ОтклоненияМесяц"] - Прочие[0]["ОтклоненияМесяц"];	
   
   ПрибыльОтФинансово[0]["ГодовойБюджет"]     = ПрибыльОтРеализации[0]["ГодовойБюджет"]     - Проценты[0]["ГодовойБюджет"]     - Налоги[0]["ГодовойБюджет"]     - Прочие[0]["ГодовойБюджет"];	
   ПрибыльОтФинансово[0]["ГодовойПрогноз"]    = ПрибыльОтРеализации[0]["ГодовойПрогноз"]    - Проценты[0]["ГодовойПрогноз"]    - Налоги[0]["ГодовойПрогноз"]    - Прочие[0]["ГодовойПрогноз"];	
   ПрибыльОтФинансово[0]["ГодовойОтклонение"] = ПрибыльОтРеализации[0]["ГодовойОтклонение"] - Проценты[0]["ГодовойОтклонение"] - Налоги[0]["ГодовойОтклонение"] - Прочие[0]["ГодовойОтклонение"];	
   
   
   //4.Прибыль до налогообложения  = ПрибыльОтФинансово - Прочие внереализационные расходы (премии)
   
   ПрибыльДоНалог = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","5.")); 
   ПрочиеВнереализационные = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","4.1.")); 
   ПрибыльОтФинансово = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","4.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ПрибыльДоНалог[0]["СуммаБюджет" + сч] = ПрибыльОтФинансово[0]["СуммаБюджет" + сч] - ПрочиеВнереализационные[0]["СуммаБюджет" + сч];	
	   ПрибыльДоНалог[0]["Сумма" + сч]       = ПрибыльОтФинансово[0]["Сумма" + сч]       - ПрочиеВнереализационные[0]["Сумма" + сч];	
	   ПрибыльДоНалог[0]["СуммаПрФакт" + сч] = ПрибыльОтФинансово[0]["СуммаПрФакт" + сч] - ПрочиеВнереализационные[0]["СуммаПрФакт" + сч];	
	   ПрибыльДоНалог[0]["СуммаФакт" + сч]   = ПрибыльОтФинансово[0]["СуммаФакт" + сч]   - ПрочиеВнереализационные[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ПрибыльДоНалог[0]["Факт" + сч] = ПрибыльОтФинансово[0]["Факт" + сч] - ПрочиеВнереализационные[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ПрибыльДоНалог[0]["БюджетМесяц"]     = ПрибыльОтФинансово[0]["БюджетМесяц"]     - ПрочиеВнереализационные[0]["БюджетМесяц"];	
   ПрибыльДоНалог[0]["ПрогнозМесяц"]    = ПрибыльОтФинансово[0]["ПрогнозМесяц"]    - ПрочиеВнереализационные[0]["ПрогнозМесяц"];	
   ПрибыльДоНалог[0]["ОтклоненияМесяц"] = ПрибыльОтФинансово[0]["ОтклоненияМесяц"] - ПрочиеВнереализационные[0]["ОтклоненияМесяц"];	

   ПрибыльДоНалог[0]["ГодовойБюджет"]     = ПрибыльОтФинансово[0]["ГодовойБюджет"]     - ПрочиеВнереализационные[0]["ГодовойБюджет"];	
   ПрибыльДоНалог[0]["ГодовойПрогноз"]    = ПрибыльОтФинансово[0]["ГодовойПрогноз"]    - ПрочиеВнереализационные[0]["ГодовойПрогноз"];	
   ПрибыльДоНалог[0]["ГодовойОтклонение"] = ПрибыльОтФинансово[0]["ГодовойОтклонение"] - ПрочиеВнереализационные[0]["ГодовойОтклонение"];	
   
   
   //5.ЧИСТАЯ ПРИБЫЛЬ  = ПрибыльОтРеализации - Налог на прибыль
   
   ЧИСТАЯПРИБЫЛЬ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","6.")); 
   ПрибыльОтРеализации = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.")); 
   Налог = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","5.1.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ЧИСТАЯПРИБЫЛЬ[0]["СуммаБюджет" + сч] = ПрибыльОтРеализации[0]["СуммаБюджет" + сч] - Налог[0]["СуммаБюджет" + сч];	
	   ЧИСТАЯПРИБЫЛЬ[0]["Сумма" + сч]       = ПрибыльОтРеализации[0]["Сумма" + сч]       - Налог[0]["Сумма" + сч];	
	   ЧИСТАЯПРИБЫЛЬ[0]["СуммаПрФакт" + сч] = ПрибыльОтРеализации[0]["СуммаПрФакт" + сч] - Налог[0]["СуммаПрФакт" + сч];	
	   ЧИСТАЯПРИБЫЛЬ[0]["СуммаФакт" + сч]   = ПрибыльОтРеализации[0]["СуммаФакт" + сч]   - Налог[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ЧИСТАЯПРИБЫЛЬ[0]["Факт" + сч] = ПрибыльОтРеализации[0]["Факт" + сч] - Налог[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ЧИСТАЯПРИБЫЛЬ[0]["БюджетМесяц"]     = ПрибыльОтРеализации[0]["БюджетМесяц"]     - Налог[0]["БюджетМесяц"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ПрогнозМесяц"]    = ПрибыльОтРеализации[0]["ПрогнозМесяц"]    - Налог[0]["ПрогнозМесяц"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ОтклоненияМесяц"] = ПрибыльОтРеализации[0]["ОтклоненияМесяц"] - Налог[0]["ОтклоненияМесяц"];	

   ЧИСТАЯПРИБЫЛЬ[0]["ГодовойБюджет"]     = ПрибыльОтРеализации[0]["ГодовойБюджет"]     - Налог[0]["ГодовойБюджет"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ГодовойПрогноз"]    = ПрибыльОтРеализации[0]["ГодовойПрогноз"]    - Налог[0]["ГодовойПрогноз"];	
   ЧИСТАЯПРИБЫЛЬ[0]["ГодовойОтклонение"] = ПрибыльОтРеализации[0]["ГодовойОтклонение"] - Налог[0]["ГодовойОтклонение"];	
   
   
   //5.ФинРезультат  = ЧИСТАЯПРИБЫЛЬ - Расходы из чистой прибыли
   
   ЧИСТАЯПРИБЫЛЬ = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","6.")); 
   ФинРезультат = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","7.")); 
   Расходы = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","6.1.")); 
   
   Для сч = 1 по 12 цикл
	   
	   ФинРезультат[0]["СуммаБюджет" + сч] = ЧИСТАЯПРИБЫЛЬ[0]["СуммаБюджет" + сч] - Расходы[0]["СуммаБюджет" + сч];	
	   ФинРезультат[0]["Сумма" + сч]       = ЧИСТАЯПРИБЫЛЬ[0]["Сумма" + сч]       - Расходы[0]["Сумма" + сч];	
	   ФинРезультат[0]["СуммаПрФакт" + сч] = ЧИСТАЯПРИБЫЛЬ[0]["СуммаПрФакт" + сч] - Расходы[0]["СуммаПрФакт" + сч];	
	   ФинРезультат[0]["СуммаФакт" + сч]   = ЧИСТАЯПРИБЫЛЬ[0]["СуммаФакт" + сч]   - Расходы[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   ФинРезультат[0]["Факт" + сч] = ЧИСТАЯПРИБЫЛЬ[0]["Факт" + сч] - Расходы[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   ФинРезультат[0]["БюджетМесяц"]     = ЧИСТАЯПРИБЫЛЬ[0]["БюджетМесяц"]     - Расходы[0]["БюджетМесяц"];	
   ФинРезультат[0]["ПрогнозМесяц"]    = ЧИСТАЯПРИБЫЛЬ[0]["ПрогнозМесяц"]    - Расходы[0]["ПрогнозМесяц"];	
   ФинРезультат[0]["ОтклоненияМесяц"] = ЧИСТАЯПРИБЫЛЬ[0]["ОтклоненияМесяц"] - Расходы[0]["ОтклоненияМесяц"];	

   ФинРезультат[0]["ГодовойБюджет"]     = ЧИСТАЯПРИБЫЛЬ[0]["ГодовойБюджет"]     - Расходы[0]["ГодовойБюджет"];	
   ФинРезультат[0]["ГодовойПрогноз"]    = ЧИСТАЯПРИБЫЛЬ[0]["ГодовойПрогноз"]    - Расходы[0]["ГодовойПрогноз"];	
   ФинРезультат[0]["ГодовойОтклонение"] = ЧИСТАЯПРИБЫЛЬ[0]["ГодовойОтклонение"] - Расходы[0]["ГодовойОтклонение"];	
     
   
   
   
   
   //6.EBITDA  = ПрибыльДоНалог + Амортизация + Проценты по кредитам и займам
   
   Амортизация = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(".Амортизация"))); 
   Проценты = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","3.1.")); 
   EBITDA = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","8.")); 
   ПрибыльДоНалог = Объект[Таб].НайтиСтроки(Новый Структура("НомерПредставление","5.")); 
   
   Для сч = 1 по 12 цикл
	   
	   EBITDA[0]["СуммаБюджет" + сч] = ПрибыльДоНалог[0]["СуммаБюджет" + сч] + Амортизация[0]["СуммаБюджет" + сч] + Проценты[0]["СуммаБюджет" + сч];	
	   EBITDA[0]["Сумма" + сч]       = ПрибыльДоНалог[0]["Сумма" + сч]       + Амортизация[0]["Сумма" + сч]       + Проценты[0]["Сумма" + сч];	
	   EBITDA[0]["СуммаПрФакт" + сч] = ПрибыльДоНалог[0]["СуммаПрФакт" + сч] + Амортизация[0]["СуммаПрФакт" + сч] + Проценты[0]["СуммаПрФакт" + сч];	
	   EBITDA[0]["СуммаФакт" + сч]   = ПрибыльДоНалог[0]["СуммаФакт" + сч]   + Амортизация[0]["СуммаФакт" + сч]   + Проценты[0]["СуммаФакт" + сч];	
	   
   КонецЦикла;
   Для сч = 1 по 3 цикл
	   
	   EBITDA[0]["Факт" + сч] = ПрибыльДоНалог[0]["Факт" + сч] + Амортизация[0]["Факт" + сч] + Проценты[0]["Факт" + сч];	
	   
   КонецЦикла;
   
   EBITDA[0]["БюджетМесяц"]     = ПрибыльДоНалог[0]["БюджетМесяц"]     + Амортизация[0]["БюджетМесяц"]    + Проценты[0]["БюджетМесяц"];	
   EBITDA[0]["ПрогнозМесяц"]    = ПрибыльДоНалог[0]["ПрогнозМесяц"]    + Амортизация[0]["ПрогнозМесяц"]   + Проценты[0]["ПрогнозМесяц"];	
   EBITDA[0]["ОтклоненияМесяц"] = ПрибыльДоНалог[0]["ОтклоненияМесяц"] + Амортизация[0]["ОтклоненияМесяц"]+ Проценты[0]["ОтклоненияМесяц"];	
   
   EBITDA[0]["ГодовойБюджет"]     = ПрибыльДоНалог[0]["ГодовойБюджет"]     + Амортизация[0]["ГодовойБюджет"]     + Проценты[0]["ГодовойБюджет"];	
   EBITDA[0]["ГодовойПрогноз"]    = ПрибыльДоНалог[0]["ГодовойПрогноз"]    + Амортизация[0]["ГодовойПрогноз"]    + Проценты[0]["ГодовойПрогноз"];	
   EBITDA[0]["ГодовойОтклонение"] = ПрибыльДоНалог[0]["ГодовойОтклонение"] + Амортизация[0]["ГодовойОтклонение"] + Проценты[0]["ГодовойОтклонение"];	
   
   
   
   
   
   
   
   
   
   
   
   
	   
   

   //// АМОРТИЗАЦИЯ
   //
   //
   // 	мЦех = Новый Массив;
   // 	мЦех.Добавить(Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(".Амортизация"));
   // 	ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Амортизация");
   //	 ЗаполнитьСкидкиДоходовАмортизация("СоставБюджета",мЦех,ЦФО); 		




КонецПроцедуры




&НаСервере
Процедура ЗаполнитьПоказателиДанными(пр,ис)
	
	
			Для Н = 1 По 12 Цикл
				пр["СуммаБюджет" + Н] = ис["СуммаБюджет" + Н];
				пр["Сумма" + Н]       = ис["Сумма" + Н];
				пр["СуммаПрФакт" + Н] = ис["СуммаПрФакт" + Н];
				пр["СуммаФакт" + Н]   = ис["СуммаФакт" + Н];
			КонецЦикла;
			
			Для Н = 1 По 3 Цикл
				пр["Факт" + Н] = ис["Факт" + Н];
			КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателиДаннымиОтчетПериодКлиент(пр,ис)
	
	
			Для Н = 1 По 12 Цикл
				пр["СуммаБюджет" + Н] = ис["СуммаБюджет" + Н];
				пр["Сумма" + Н]       = ис["Сумма" + Н];
				пр["СуммаПрФакт" + Н] = ис["СуммаПрФакт" + Н];
				пр["СуммаФакт" + Н]   = ис["СуммаФакт" + Н];
			КонецЦикла;
			
			Для Н = 1 По 3 Цикл
				пр["Факт" + Н] = ис["Факт" + Н];
			КонецЦикла;
	
				пр["ГодовойБюджет"]     = ис["ГодовойБюджет"];
				пр["ГодовойПрогноз"]    = ис["ГодовойПрогноз"];
				пр["ГодовойОтклонение"] = ис["ГодовойОтклонение"];
				
				пр["БюджетМесяц"]     = ис["БюджетМесяц"];
				пр["ПрогнозМесяц"]    = ис["ПрогнозМесяц"];
				пр["ОтклоненияМесяц"] = ис["ОтклоненияМесяц"];
				
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоказателиДаннымиОтчетПериод(пр,ис)
	
	
			Для Н = 1 По 12 Цикл
				пр["СуммаБюджет" + Н] = ис["СуммаБюджет" + Н];
				пр["Сумма" + Н]       = ис["Сумма" + Н];
				пр["СуммаПрФакт" + Н] = ис["СуммаПрФакт" + Н];
				пр["СуммаФакт" + Н]   = ис["СуммаФакт" + Н];
			КонецЦикла;
			
			Для Н = 1 По 3 Цикл
				пр["Факт" + Н] = ис["Факт" + Н];
			КонецЦикла;
	
				пр["ГодовойБюджет"]     = ис["ГодовойБюджет"];
				пр["ГодовойПрогноз"]    = ис["ГодовойПрогноз"];
				пр["ГодовойОтклонение"] = ис["ГодовойОтклонение"];
				
				пр["БюджетМесяц"]     = ис["БюджетМесяц"];
				пр["ПрогнозМесяц"]    = ис["ПрогнозМесяц"];
				пр["ОтклоненияМесяц"] = ис["ОтклоненияМесяц"];
				
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСкидкиДоходовФАРМ_ТМ(Таб,СтатьяОборотовСкидка,СтатьяОборотовПоБюджетам,Канал,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//|	Лео_ВводБюджетаСоставБюджета17.СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета9 КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО
		|	И Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам = &СтатьяОборотовПоБюджетам";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",СтатьяОборотовПоБюджетам);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();

	мПоикаКУ = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотовСкидка));
	
	Если Канал <> неопределено и мПоикаКУ.Количество() > 0 и ТЗдок.Количество() > 0 тогда
			
			ЗаполнитьЗначенияСвойств(мПоикаКУ[0],ТЗдок[0]);
			//Если КУ_Канал = оо.Канал тогда	
			//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
			//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
			//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
			//	Конецесли;
			//Конецесли;
	Конецесли;

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСкидкиДоходовАмортизация(Таб,мСтатей,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО
		//|	И Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам В (&СтатьяОборотовПоБюджетам)
		|УПОРЯДОЧИТЬ ПО
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Дата УБЫВ";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	//Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",мСтатей);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();
	Если ТЗдок.Количество() > 0 тогда
	
	Для каждого сс из мСтатей цикл

	//СтатьяПоиска = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",сс);
	СтатьяПоиска = СтатьиОборотовПоБюджетамНайтиПоРеквизиту(сс);

	//СтатьяПоиска = сс;
	
	мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска.Лео_РодительскаяСтатья));
	мПоикаДок = ТЗдок.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	
	    Если мПоикаКУ.Количество() > 0 и  мПоикаДок.Количество() > 0 тогда
            _Статья = мПоикаКУ[0].СтатьяОборотовПоБюджетам;
            ЗаполнитьЗначенияСвойств(мПоикаКУ[0],мПоикаДок[0]);
			 мПоикаКУ[0].СтатьяОборотовПоБюджетам = _Статья;
			
			//Если КУ_Канал = оо.Канал тогда	
			//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
			//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
			//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
			//	Конецесли;
			//Конецесли;
		Конецесли;
		
   КонецЦикла;		
		Конецесли;

КонецПроцедуры







&НаСервере
Процедура ЗаполнитьСкидкиДоходовПроизводство(Таб,мСтатей,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета10 КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО
		//|	И Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам В (&СтатьяОборотовПоБюджетам)
		|УПОРЯДОЧИТЬ ПО
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Дата УБЫВ";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	//Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",мСтатей);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();
	Если ТЗдок.Количество() > 0 тогда
	
	Для каждого сс из мСтатей цикл

	//СтатьяПоиска = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",сс);
	СтатьяПоиска = СтатьиОборотовПоБюджетамНайтиПоРеквизиту(сс);

	
	мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	мПоикаДок = ТЗдок.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	
	    Если мПоикаКУ.Количество() > 0 и  мПоикаДок.Количество() > 0 тогда
            _Статья = мПоикаКУ[0].СтатьяОборотовПоБюджетам;
            ЗаполнитьЗначенияСвойств(мПоикаКУ[0],мПоикаДок[0]);
			 мПоикаКУ[0].СтатьяОборотовПоБюджетам = _Статья;
			
			//Если КУ_Канал = оо.Канал тогда	
			//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
			//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
			//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
			//	Конецесли;
			//Конецесли;
		Конецесли;
		
   КонецЦикла;		
		Конецесли;

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСкидкиДоходовОКК_ОРП(Таб,мСтатей,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета9 КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО
		//|	И Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам В (&СтатьяОборотовПоБюджетам)
		|УПОРЯДОЧИТЬ ПО
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Дата УБЫВ";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	//Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",мСтатей);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();
	Если ТЗдок.Количество() > 0 тогда
	
	Для каждого сс из мСтатей цикл

	//СтатьяПоиска = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",сс);
	СтатьяПоиска = СтатьиОборотовПоБюджетамНайтиПоРеквизиту(сс);
	
	
	
	мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	мПоикаДок = ТЗдок.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	
	    Если мПоикаКУ.Количество() > 0 и  мПоикаДок.Количество() > 0 тогда
            _Статья = мПоикаКУ[0].СтатьяОборотовПоБюджетам;
            ЗаполнитьЗначенияСвойств(мПоикаКУ[0],мПоикаДок[0]);
			 мПоикаКУ[0].СтатьяОборотовПоБюджетам = _Статья;
			
			//Если КУ_Канал = оо.Канал тогда	
			//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
			//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
			//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
			//	Конецесли;
			//Конецесли;
		Конецесли;
		
   КонецЦикла;		
		Конецесли;

КонецПроцедуры




&НаСервере
Функция СтатьиОборотовПоБюджетамНайтиПоРеквизиту(абс_КодБюджетнойСтатьи)	
	
	
	СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиОборотовПоБюджетам.Ссылка КАК Статья,
		|	СтатьиОборотовПоБюджетам.абс_КодБюджетнойСтатьи
		|ИЗ
		|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам
		|ГДЕ
		|	НЕ СтатьиОборотовПоБюджетам.ПометкаУдаления
		|	И СтатьиОборотовПоБюджетам.абс_КодБюджетнойСтатьи = &абс_КодБюджетнойСтатьи";

	Запрос.УстановитьПараметр("абс_КодБюджетнойСтатьи",абс_КодБюджетнойСтатьи);	

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда 
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтатьяОборотов = ВыборкаДетальныеЗаписи.Статья;

    КонецЕсли;
	
	
	Возврат СтатьяОборотов;
	
	
КонецФункции	




&НаСервере
Процедура ЗаполнитьСкидкиДоходовФОТ(Таб,мСтатей,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО
		//|	И Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам В (&СтатьяОборотовПоБюджетам)
		|";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	//Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",мСтатей);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();
	Если ТЗдок.Количество() > 0 тогда
	
	Для каждого сс из мСтатей цикл

	//СтатьяПоиска = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",сс);
	СтатьяПоиска = СтатьиОборотовПоБюджетамНайтиПоРеквизиту(сс);

	
	мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	мПоикаДок = ТЗдок.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
	
	    Если мПоикаКУ.Количество() > 0 и  мПоикаДок.Количество() > 0 тогда
            _Статья = мПоикаКУ[0].СтатьяОборотовПоБюджетам;
            ЗаполнитьЗначенияСвойств(мПоикаКУ[0],мПоикаДок[0]);
			 мПоикаКУ[0].СтатьяОборотовПоБюджетам = _Статья;
			
			//Если КУ_Канал = оо.Канал тогда	
			//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
			//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
			//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
			//	Конецесли;
			//Конецесли;
		Конецесли;
		
   КонецЦикла;		
		Конецесли;

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСкидкиДоходовБренд(Таб,мСтатей,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Выбор когда 
		|    ТИПЗНАЧЕНИЯ(Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам) = ТИП(Справочник.Лео_СтатьиОборотовРасшифровка)
		|    тогда Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам.СтатьяОборотов
		|    иначе Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам Конец как СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.Бренд
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета10 КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	//Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",мСтатей);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();
	
	
	ТЗдок.Свернуть("Бренд,СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	|БюджетМесяц,ПрогнозМесяц,ОтклоненияМесяц,
	|ГодовойБюджет,ГодовойПрогноз,ГодовойОтклонение,
	|Факт1,Факт2,Факт3
	|");
	
	нТЗ = ТЗдок.СкопироватьКолонки();
	Для каждого лл из ТЗдок цикл
		Если лл.Бренд.Пустая() тогда продолжить конецесли;
		зз = нТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(зз,лл);	
		
	КонецЦикла;
	
	
	
	
	
	Если нТЗ.Количество() > 0 тогда
		
		Для каждого сс из мСтатей цикл
			
			//СтатьяПоиска = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",сс);
			СтатьяПоиска = СтатьиОборотовПоБюджетамНайтиПоРеквизиту(сс);

			
			мПоикаДок = нТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
			
			Для каждого оо из мПоикаДок цикл
			
			Если СокрЛП(оо.Бренд) = "ХЗН" тогда
				пПоискАналитика = "Реклама и PR бренд ХЗН" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Champ" тогда
				пПоискАналитика = "Реклама и PR бренд Champ" 
			ИначеЕсли СокрЛП(оо.Бренд) = "БАД" тогда
				пПоискАналитика = "Реклама и PR бренд БАД" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Gastro" тогда
				пПоискАналитика = "Реклама и PR бренд Gastro" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Energizer" тогда
				пПоискАналитика = "Реклама и PR бренд Energi" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Кисель/компот" тогда
				пПоискАналитика = "Реклама и PR бренд Кисель/компот" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Detox" тогда
				пПоискАналитика = "Реклама и PR бренд Detox" 
			//ИначеЕсли СокрЛП(оо.Бренд) = "Бренд 4" тогда
			//	пПоискАналитика = "Реклама и PR бренд ХЗН" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Леовит" тогда
				пПоискАналитика = "Реклама и PR бренд Леовит" 
			ИначеЕсли СокрЛП(оо.Бренд) = "Onco" тогда
				пПоискАналитика = "Реклама и PR бренд Onco" 
			ИначеЕсли СокрЛП(оо.Бренд) = "ОБЩИЕ" тогда
				
			продолжить;	
				
				//	пПоискАналитика = "Реклама и PR бренд ОБЩИЕ" 
				
				
				
			конецесли;
			
			АналитикаБюджета = Справочники.абс_АналитикиБюджета.НайтиПоНаименованию(пПоискАналитика,,,СтатьяПоиска);
			мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,АналитикаБюджета",СтатьяПоиска,АналитикаБюджета));
			
			
			Если мПоикаКУ.Количество() > 0 и  НЕ АналитикаБюджета.Пустая() тогда
				_Статья = мПоикаКУ[0].СтатьяОборотовПоБюджетам;
				ЗаполнитьЗначенияСвойств(мПоикаКУ[0],оо);
				мПоикаКУ[0].СтатьяОборотовПоБюджетам = _Статья;
				
				//Если КУ_Канал = оо.Канал тогда	
				//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
				//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
				//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
				//	Конецесли;
				//Конецесли;
			Конецесли;
		КонецЦикла;		
		КонецЦикла;		
	Конецесли;

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСкидкиДоходовОбщие(Таб,мСтатей,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Выбор когда 
		|    ТИПЗНАЧЕНИЯ(Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам) = ТИП(Справочник.Лео_СтатьиОборотовРасшифровка)
		|    тогда Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам.СтатьяОборотов
		|    иначе Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам Конец как СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.Бренд
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета10 КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	//Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",мСтатей);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();
	
	
	ТЗдок.Свернуть("Бренд,СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	|БюджетМесяц,ПрогнозМесяц,ОтклоненияМесяц,
	|ГодовойБюджет,ГодовойПрогноз,ГодовойОтклонение,
	|Факт1,Факт2,Факт3
	|");
	
	Если ТЗдок.Количество() > 0 тогда
		
		Для каждого сс из мСтатей цикл
			
			//СтатьяПоиска = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",сс);
			СтатьяПоиска = СтатьиОборотовПоБюджетамНайтиПоРеквизиту(сс);
	
			
			мПоикаДок = ТЗдок.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
			
			Для каждого оо из мПоикаДок цикл
			
			Если СокрЛП(оо.Бренд) = "ОБЩИЕ" тогда
				
				
				иначе
			продолжить;	
				
				//	пПоискАналитика = "Реклама и PR бренд ОБЩИЕ" 
				
				
				
			конецесли;
			
			//АналитикаБюджета = Справочники.абс_АналитикиБюджета.НайтиПоНаименованию(пПоискАналитика,,,СтатьяПоиска);
			//мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,АналитикаБюджета",СтатьяПоиска,АналитикаБюджета));
			мПоикаКУ  = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяПоиска));
			
			
			//Если мПоикаКУ.Количество() > 0 и  НЕ АналитикаБюджета.Пустая() тогда
			Если мПоикаКУ.Количество() > 0 тогда
				_Статья = мПоикаКУ[0].СтатьяОборотовПоБюджетам;
				ЗаполнитьЗначенияСвойств(мПоикаКУ[0],оо);
				мПоикаКУ[0].СтатьяОборотовПоБюджетам = _Статья;
				
				//Если КУ_Канал = оо.Канал тогда	
				//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
				//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
				//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
				//	Конецесли;
				//Конецесли;
			Конецесли;
		КонецЦикла;		
		КонецЦикла;		
	Конецесли;

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСкидкиДоходовКП(Таб,СтатьяОборотовСкидка,СтатьяОборотовПоБюджетам,Канал,ЦФО)
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//|	Лео_ВводБюджетаСоставБюджета17.СтатьяОборотовПоБюджетам,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма1,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма2,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма3,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма4,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма5,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма6,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма7,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма8,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма9,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма10,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма11,
		|	Лео_ВводБюджетаСоставБюджета9.Сумма12,
		|	Лео_ВводБюджетаСоставБюджета9.Факт1,
		|	Лео_ВводБюджетаСоставБюджета9.Факт2,
		|	Лео_ВводБюджетаСоставБюджета9.Факт3,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойБюджет,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойПрогноз,
		|	Лео_ВводБюджетаСоставБюджета9.ГодовойОтклонение,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаБюджет12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаПрФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт1,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт2,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт3,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт4,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт5,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт6,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт7,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт8,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт9,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт10,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт11,
		|	Лео_ВводБюджетаСоставБюджета9.СуммаФакт12,
		|	Лео_ВводБюджетаСоставБюджета9.БюджетМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ПрогнозМесяц,
		|	Лео_ВводБюджетаСоставБюджета9.ОтклоненияМесяц
		|ИЗ
		|	Документ.Лео_ВводБюджета.СоставБюджета10 КАК Лео_ВводБюджетаСоставБюджета9
		|ГДЕ
		|	Лео_ВводБюджетаСоставБюджета9.Ссылка.Проведен
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.БДР_Участвует
		|	И Лео_ВводБюджетаСоставБюджета9.Ссылка.ЦФО = &ЦФО
		|	И Лео_ВводБюджетаСоставБюджета9.СтатьяОборотовПоБюджетам = &СтатьяОборотовПоБюджетам";

		
		
		
	Запрос.УстановитьПараметр("ЦФО",ЦФО);	
	Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетам",СтатьяОборотовПоБюджетам);	
	Результат = Запрос.Выполнить();

	ТЗдок = Результат.Выгрузить();

	мПоикаКУ = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяОборотовСкидка));
	
	Если Канал <> неопределено и мПоикаКУ.Количество() > 0 и ТЗдок.Количество() > 0 тогда
			
			ЗаполнитьЗначенияСвойств(мПоикаКУ[0],ТЗдок[0]);
			//Если КУ_Канал = оо.Канал тогда	
			//	мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
			//	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
			//		мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
			//	Конецесли;
			//Конецесли;
	Конецесли;

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьКУПланомПродаж(Таб,ТЗ_КУ,ФАРМ_КУ_СтатьяОборотов,БезНДС_ФАРМ_КУ_СтатьяОборотов,КУ_Канал)

	мПоикаКУ = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ФАРМ_КУ_СтатьяОборотов));
	Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
		мПоикаБезНДС_КУ = Объект[Таб].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",БезНДС_ФАРМ_КУ_СтатьяОборотов));
	Конецесли;
	
	Если КУ_Канал <> неопределено и мПоикаКУ.Количество() > 0 и ?(БезНДС_ФАРМ_КУ_СтатьяОборотов = неопределено,Истина,мПоикаБезНДС_КУ.Количество() > 0)  тогда
		Для каждого оо из ТЗ_КУ цикл
			Если КУ_Канал = оо.Канал тогда	
				мПоикаКУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот + оо.НДСОборот;
				Если БезНДС_ФАРМ_КУ_СтатьяОборотов <> неопределено тогда
					мПоикаБезНДС_КУ[0]["СуммаБюджет" + Месяц(оо.Период)] = оо.СтоимостьОборот;
				Конецесли;
			Конецесли;
		КонецЦикла;
	Конецесли;

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБюджетПланомПродажПоВсемКонтрагентам(_Перезаполнить)
	
	ТЗ = ПолучитьПланПродаж();
	ТЗ_КУ = ПолучитьПланПродажКУ();
	
	
	
	// КУ
	Если ТЗ_КУ <> неопределено тогда
		
		КУ_Канал = неопределено;
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ

		ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_КУ_сНДС");
			
		БезНДС_ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_КУ_безНДС");
		
		КУ_Канал = "ФАРМ";
	    КонецЕсли;	
	
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ

		ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_КУ_сНДС");
			
		БезНДС_ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_КУ_безНДС");
		
		КУ_Канал = "МТ";
	    КонецЕсли;	
	
		Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда // КП

		ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_КУ_сНДС");
			
		БезНДС_ФАРМ_КУ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_КУ_безНДС");
		
		КУ_Канал = "КП";
		КонецЕсли;	
		
		ЗаполнитьКУПланомПродаж("СоставБюджета",ТЗ_КУ,ФАРМ_КУ_СтатьяОборотов,неопределено,КУ_Канал);   // Осн
		ЗаполнитьКУПланомПродаж("СоставБюджета9",ТЗ_КУ,ФАРМ_КУ_СтатьяОборотов,неопределено,КУ_Канал);  // Осн БезНДС
		ЗаполнитьКУПланомПродаж("СоставБюджета1",ТЗ_КУ,ФАРМ_КУ_СтатьяОборотов,БезНДС_ФАРМ_КУ_СтатьяОборотов,КУ_Канал); // Клиенты
		ЗаполнитьКУПланомПродаж("СоставБюджета2",ТЗ_КУ,ФАРМ_КУ_СтатьяОборотов,БезНДС_ФАРМ_КУ_СтатьяОборотов,КУ_Канал); // Клиенты БезНДС
		
	КонецЕсли;
	
	
	
////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////
	
	
	Если ТЗ <> неопределено тогда
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД" тогда  //ОП Дистрибьюция ОБЩИЕ

		ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС");
		МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС");
		
		БезНДС_ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_безНДС");
		БезНДС_МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_безНДС");
		
		
		ФАРМ_БОНУС_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_ФАРМ_БОНУС");
		МТ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ДИС_МТ_БОНУС");
		
		КонецЕсли;	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда // Ключевые покупатели
			
		КП_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_сНДС");
		
		БезНДС_КП_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТО_НЕТТО_безНДС");
				
		КП_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_БОНУС");
		
		КП_ТОВ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","КП_ТОВ");
		
		КонецЕсли;	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда // Индустриальный

		ИН_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_сНДС");
			
		БезНДС_ИН_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_ТО_НЕТТО_безНДС");
				
		ИН_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ИН_БОНУС");
		
		КонецЕсли;	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ

		ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_сНДС");
			
		БезНДС_ФАРМ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТО_НЕТТО_безНДС");
				
		ФАРМ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_БОНУС");
		
		ФАРМ_ТОВ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТОВ");
		
		ФАРМ_ИСГ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ИСГ");
		
		КонецЕсли;	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ

		МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_сНДС");
			
		БезНДС_МТ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТО_НЕТТО_безНДС");
				
		МТ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_БОНУС");
		
		МТ_ТОВ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ТОВ");
		
		МТ_ИСГ_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","МТ_ИСГ");
		
		КонецЕсли;	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" тогда // ГУ

		ГУ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_сНДС");
			
		БезНДС_ГУ_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_ТО_НЕТТО_безНДС");
				
		ГУ_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ГУ_БОНУС");
		
		КонецЕсли;	
		
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда // ЭКС

		ЭКС_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_НЕТТО_сНДС");
			
		БезНДС_ЭКС_ТО_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_ТО_НЕТТО_безНДС");
				
		ЭКС_БОНУС_СтатьяОборотов   = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ЭКС_БОНУС");
		
		КонецЕсли;	
		
		
		
        //Очистим таблицу Клиентов
        Объект.СоставБюджета4.Очистить();
        //Очистим таблицу Клиентов БезНДС
        Объект.СоставБюджета5.Очистить();
		
		// Заполним Расшифровку по клиентам контрагентами
		//мКонтрагентов = ТЗ.ВыгрузитьКолонку("Контрагент");
		ПроцентТОВ = Объект.ПроцентТОВ;
		ПроцентИСГ = Объект.ПроцентИСГ;
		
		ТЗконтр = ТЗ.Скопировать();
		ТЗконтр.Свернуть("Контрагент");
		ТЗконтр.Сортировать("Контрагент");
		Для каждого сс из ТЗконтр цикл
			ДобавитьКонтрагентаКлиентаВРасшифровку(сс.Контрагент,"СоставБюджета4");
			ДобавитьКонтрагентаКлиентаВРасшифровку(сс.Контрагент,"СоставБюджета5");
		КонецЦикла;
		
		
		/////////////////////////////////////////////////////////////////////////
		// СНДС
		Для каждого стр из Объект.СоставБюджета4 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ТО_СтатьяОборотов 
				 или стр.СтатьяОборотовПоБюджетам = ИН_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = КП_ТО_СтатьяОборотов
				 или стр.СтатьяОборотовПоБюджетам = ЭКС_ТО_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот + смтр.НДСОборот; // с НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			Если стр.СтатьяОборотовПоБюджетам = БезНДС_ФАРМ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = БезНДС_МТ_ТО_СтатьяОборотов 
				 или стр.СтатьяОборотовПоБюджетам = БезНДС_ИН_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = БезНДС_КП_ТО_СтатьяОборотов 
				 или стр.СтатьяОборотовПоБюджетам = БезНДС_ГУ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = БезНДС_ЭКС_ТО_СтатьяОборотов
				 тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;	
			
			
			
			
			// БОНУС
			//Если ОбщегоНазначения.ТолькоЦифрыВСтроке(стр.Условия) и ЗначениеЗаполнено(стр.Условия) тогда
			Если ЗначениеЗаполнено(стр.Условия) тогда
				Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_БОНУС_СтатьяОборотов
					или стр.СтатьяОборотовПоБюджетам = ИН_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = КП_БОНУС_СтатьяОборотов
					или стр.СтатьяОборотовПоБюджетам = ГУ_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = ЭКС_БОНУС_СтатьяОборотов)
					И Число(стр.Условия) > 0 тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // БезНДС
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = 0;							
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот) * Число(стр.Условия))/100 ; // БезНДС
							
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			//ТОВ
			//Если ЗначениеЗаполнено(стр.Условия) тогда
			Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_ТОВ_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ТОВ_СтатьяОборотов
				  или стр.СтатьяОборотовПоБюджетам = КП_ТОВ_СтатьяОборотов
					)
					//И Число(стр.Условия) > 0
					тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // СНДС
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = 0;							
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * ПроцентТОВ)/100 ; // С НДС
							стр["Условия"] = Сокрлп(ПроцентТОВ);
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			//КонецЕсли;
			
			//ИСГ
			//Если ЗначениеЗаполнено(стр.Условия) тогда
				Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_ИСГ_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ИСГ_СтатьяОборотов)
					//И Число(стр.Условия) > 0 
					тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // СНДС
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = 0;							
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * ПроцентИСГ)/100 ; // СНДС
							стр["Условия"] = Сокрлп(ПроцентИСГ);
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			//КонецЕсли;
			
			
		КонецЦикла;
		
		
		/////////////////////////////////////////////////////////////////////////
		// БезНДС
		Для каждого стр из Объект.СоставБюджета5 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ТО_СтатьяОборотов 
				 или стр.СтатьяОборотовПоБюджетам = ИН_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = КП_ТО_СтатьяОборотов
				 или стр.СтатьяОборотовПоБюджетам = ГУ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = ЭКС_ТО_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот + смтр.НДСОборот; // с НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	                                                                            
			КонецЕсли;
			
			Если стр.СтатьяОборотовПоБюджетам = БезНДС_ФАРМ_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = БезНДС_МТ_ТО_СтатьяОборотов 
				 или стр.СтатьяОборотовПоБюджетам = БезНДС_ИН_ТО_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = БезНДС_КП_ТО_СтатьяОборотов 
				 или стр.СтатьяОборотовПоБюджетам = БезНДС_ГУ_ТО_СтатьяОборотов  или стр.СтатьяОборотовПоБюджетам = БезНДС_ЭКС_ТО_СтатьяОборотов
				 тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;	
			
			
			
			
			// БОНУС
			//Если ОбщегоНазначения.ТолькоЦифрыВСтроке(стр.Условия) и ЗначениеЗаполнено(стр.Условия) тогда
			Если ЗначениеЗаполнено(стр.Условия) тогда
				Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_БОНУС_СтатьяОборотов
					или стр.СтатьяОборотовПоБюджетам = ИН_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = КП_БОНУС_СтатьяОборотов
					или стр.СтатьяОборотовПоБюджетам = ГУ_БОНУС_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = ЭКС_БОНУС_СтатьяОборотов)
					И Число(стр.Условия) > 0 тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // БезНДС
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = 0;							
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот) * Число(стр.Условия))/100 ; // БезНДС
							
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			
			//ТОВ
			//Если ЗначениеЗаполнено(стр.Условия) тогда
				Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_ТОВ_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ТОВ_СтатьяОборотов
				  или стр.СтатьяОборотовПоБюджетам = КП_ТОВ_СтатьяОборотов
					)
					//И Число(стр.Условия) > 0 
					тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // БезНДС
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = 0;							
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот) * ПроцентТОВ)/100 ; // БезНДС
							стр["Условия"] = Сокрлп(ПроцентТОВ);
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			//КонецЕсли;
			
			//ИСГ
			//Если ЗначениеЗаполнено(стр.Условия) тогда
				Если (стр.СтатьяОборотовПоБюджетам = ФАРМ_ИСГ_СтатьяОборотов или стр.СтатьяОборотовПоБюджетам = МТ_ИСГ_СтатьяОборотов)
					//И Число(стр.Условия) > 0 
					тогда
					
					мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
					Если мСтрок.количество() > 0 тогда
						Для каждого смтр из мСтрок цикл 
							//стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот + смтр.НДСОборот) * Число(стр.Условия))/100 ; // БезНДС
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = 0;							
							
							стр["СуммаБюджет" + Месяц(смтр.Период)] = ((смтр.СтоимостьОборот) * ПроцентИСГ)/100 ; // БезНДС
							стр["Условия"] = Сокрлп(ПроцентИСГ);
						КонецЦикла;
					КонецЕсли;	
				КонецЕсли;
			//КонецЕсли;
			
			
			
			
		КонецЦикла;
		
		
	
		
		_Перезаполнить = Истина;	
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБюджетПланомПродажПоНепрямым(_Перезаполнить)
	
	ТЗ = ПолучитьПланПродаж();
	Если ТЗ <> неопределено тогда
		
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ

		ФАРМ_ПРЕМ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ПРЕМ");
		
		КонецЕсли;	
		
		
		
		
        //Очистим таблицу Нпрямым
        Объект.СоставБюджета6.Очистить();
        //Очистим таблицу Нпрямым БезНДС
        Объект.СоставБюджета14.Очистить();
		
		// Заполним Расшифровку по клиентам контрагентами
		//мКонтрагентов = ТЗ.ВыгрузитьКолонку("Контрагент");
		
		ТЗконтр = ТЗ.Скопировать();
		ТЗконтр.Свернуть("Контрагент");
		ТЗконтр.Сортировать("Контрагент");
		
		ДобавитьКонтрагентаКлиентаОдногоКонтрагенты("Неизвестный клиент (ФАРМ_ПРЕМ)","СоставБюджета6",ФАРМ_ПРЕМ_СтатьяОборотов,"ФАРМ_ПРЕМ");
		ДобавитьКонтрагентаКлиентаОдногоКонтрагенты("Неизвестный клиент (ФАРМ_ПРЕМ)","СоставБюджета14",ФАРМ_ПРЕМ_СтатьяОборотов,"ФАРМ_ПРЕМ");

		//Для каждого сс из ТЗконтр цикл
		//	ДобавитьКонтрагентаКлиентаВРасшифровку(сс.Контрагент,"СоставБюджета6");
		//	ДобавитьКонтрагентаКлиентаВРасшифровку(сс.Контрагент,"СоставБюджета14");
		//КонецЦикла;
		
		
		/////////////////////////////////////////////////////////////////////////
		// СНДС
		Для каждого стр из Объект.СоставБюджета6 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ПРЕМ_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот + смтр.НДСОборот; // с НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		/////////////////////////////////////////////////////////////////////////
		// БезНДС
		Для каждого стр из Объект.СоставБюджета14 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ПРЕМ_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // Без НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		
		_Перезаполнить = Истина;	
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБюджетПланомПродажТМ(_Перезаполнить)
	
	ТЗ = ПолучитьПланПродаж();
	Если ТЗ <> неопределено тогда
		
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ

		ФАРМ_ТРМ_СтатьяОборотов = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи","ФАРМ_ТРМ");
		
		КонецЕсли;	
		
		
		
		
        //Очистим таблицу ТМ
        Объект.СоставБюджета16.Очистить();
        //Очистим таблицу ТМ БезНДС
        Объект.СоставБюджета18.Очистить();
		
		// Заполним Расшифровку по клиентам контрагентами
		//мКонтрагентов = ТЗ.ВыгрузитьКолонку("Контрагент");
		
		ТЗконтр = ТЗ.Скопировать();
		ТЗконтр.Свернуть("Контрагент");
		ТЗконтр.Сортировать("Контрагент");
		
		ДобавитьКонтрагентаКлиентаОдногоКонтрагенты("Неизвестный клиент (ФАРМ_ТРМ)","СоставБюджета16",ФАРМ_ТРМ_СтатьяОборотов,"ФАРМ_ТРМ");
		ДобавитьКонтрагентаКлиентаОдногоКонтрагенты("Неизвестный клиент (ФАРМ_ТРМ)","СоставБюджета18",ФАРМ_ТРМ_СтатьяОборотов,"ФАРМ_ТРМ");

		//Для каждого сс из ТЗконтр цикл
		//	ДобавитьКонтрагентаКлиентаВРасшифровку(сс.Контрагент,"СоставБюджета16");
		//	ДобавитьКонтрагентаКлиентаВРасшифровку(сс.Контрагент,"СоставБюджета18");
		//КонецЦикла;
		
		
		/////////////////////////////////////////////////////////////////////////
		// СНДС
		Для каждого стр из Объект.СоставБюджета16 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ТРМ_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот + смтр.НДСОборот; // с НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		/////////////////////////////////////////////////////////////////////////
		// БезНДС
		Для каждого стр из Объект.СоставБюджета18 цикл
			Если стр.СтатьяОборотовПоБюджетам = ФАРМ_ТРМ_СтатьяОборотов тогда
				
				мСтрок = ТЗ.НайтиСтроки(Новый Структура("Контрагент",стр.Контрагент));
				Если мСтрок.количество() > 0 тогда
					Для каждого смтр из мСтрок цикл 
						стр["СуммаБюджет" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // Без НДС
						//стр["СуммаБезНДС" + Месяц(смтр.Период)] = смтр.СтоимостьОборот; // без НДС
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		
		_Перезаполнить = Истина;	
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	
	СообщитьНезаполненВидМесяцОплаты("СоставБюджета7");
	СообщитьНезаполненВидМесяцОплаты("СоставБюджета4");
	СообщитьНезаполненВидМесяцОплаты("СоставБюджета5");
	СообщитьНезаполненВидМесяцОплаты("СоставБюджета6");
	
	
КонецПроцедуры


&НаКлиенте
Функция ПропускатьОпределенныеВидыСтатейДляФАРМ(КодСтатьи)
	
	Признак = Ложь;
	Если Лев(КодСтатьи,7) = "ФАРМ_ТО_НЕТТО_сНДС" 
	или	 Лев(КодСтатьи,10) = "ФАРМ_БОНУС" 
	или	 Лев(КодСтатьи,8) = "ФАРМ_ТРМ" 
	или	 Лев(КодСтатьи,8) = "ФАРМ_ТОВ" 
	или	 Лев(КодСтатьи,9) = "ФАРМ_ПРЕМ" 
	или	 Лев(КодСтатьи,8) = "ФАРМ_ИСГ" 
		
		
		тогда
		
		
		
	Признак = Истина;
	КонецЕсли;
	
	возврат Признак;
КонецФункции

&НаКлиенте
Процедура СообщитьНезаполненВидМесяцОплаты(Таб)
	
	
	ТзПроверки = Новый ТаблицаЗначений;
	ТзПроверки.Колонки.Добавить("НомерСтроки");
	ТзПроверки.Колонки.Добавить("Месяц");
	ТзПроверки.Колонки.Добавить("Коммент");
	
	Для каждого сс из Объект[Таб] цикл
		
		Если сс.Итоговая тогда продолжить КонецЕсли;
		
		
		//ФАРМ
		Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
			КодСтатьи = сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		Если Таб = "СоставБюджета7" и ПропускатьОпределенныеВидыСтатейДляФАРМ(КодСтатьи) тогда
			продолжить;
		КонецЕсли;	
		Если Таб = "СоставБюджета4" и Лев(КодСтатьи,7) = "ФАРМ_ТО_НЕТТО_сНДС" тогда
			продолжить;
		КонецЕсли;	
		КонецЕсли;	
		
		
		
		Для н = 1 по 12 цикл
			Если НЕ ЗначениеЗаполнено(сс["ВидОплаты" + н]) и  
				(ЗначениеЗаполнено(сс["СуммаБюджет" + н]) или
				ЗначениеЗаполнено(сс["Сумма" + н]) или
				ЗначениеЗаполнено(сс["СуммаПрФакт" + н]) или
				ЗначениеЗаполнено(сс["СуммаФакт" + н]))
				
				тогда 
				мм = ТзПроверки.Добавить();
				мм.НомерСтроки = сс.НомерСтроки;
				мм.Месяц = лео_ПолучитьМесяц(Строка(н));
				мм.Коммент = "Вид оплаты не указан! Строка: " + сокрлп(мм.НомерСтроки) + ", Месяц: "+ мм.Месяц;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(сс["МесяцОплаты" + н]) и 
				(ЗначениеЗаполнено(сс["СуммаБюджет" + н]) или
				ЗначениеЗаполнено(сс["Сумма" + н]) или
				ЗначениеЗаполнено(сс["СуммаПрФакт" + н]) или
				ЗначениеЗаполнено(сс["СуммаФакт" + н]))
				
				тогда 
				
			Если ЗначениеЗаполнено(сс["ВидОплаты" + н])  тогда
				
				Если Строка(сс["ВидОплаты" + н]) = "Безналичный" или Строка(сс["ВидОплаты" + н]) = "Наличный" тогда
				иначе
					продолжить;
				Конецесли;	
				
				мм = ТзПроверки.Добавить();
				мм.НомерСтроки = сс.НомерСтроки;
				мм.Месяц = лео_ПолучитьМесяц(Строка(н));
				мм.Коммент = "Месяц оплаты не указан! Строка: " + сокрлп(мм.НомерСтроки) + ", Месяц: "+ мм.Месяц;
			КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	
	ТзПроверки.Сортировать("НомерСтроки");
	Для каждого ии из ТзПроверки цикл
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ии.Коммент);
        Сообщить(ии.Коммент, СтатусСообщения.Важное);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета7ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Элемент.Имя = "СоставБюджета7" тогда
		
		
		Если Вопрос("Для добавления Расшифровки используйте правую кнопку мыши !
			|                               Добавить Статью оборотов ?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		КонецЕсли;
		
	Конецесли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБДДСпоБДР(Команда)
	// Вставить содержимое обработчика.
	
	ЗаполнитьСтруктураТаблицыПоИсточнику("СоставБюджета","СоставБюджета11");
    // Очистим факт
	Для каждого бб из Объект.СоставБюджета11 цикл
		бб.Факт1 = 0;
		бб.Факт2 = 0;
		бб.Факт3 = 0;
	КонецЦикла;
	
	
	
	ЗаполнитьБДДСпоБДРСервер();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБДДСпоБДРСерверОчистить(ии,сс)
	
	ЗаполнитьЗначенияСвойств(ии,сс);
	
	// очистим
	Для сч = 1 по 12 цикл
		ии["СуммаБюджет" + сч] = 0;
		ии["Сумма"       + сч] = 0;
		ии["СуммаФакт"   + сч] = 0;
		ии["СуммаПрФакт" + сч] = 0;
	КонецЦикла; 
	ии["ГодовойБюджет"]     = 0;
	ии["ГодовойПрогноз"]    = 0;
	ии["ГодовойОтклонение"] = 0;
	ии["БюджетМесяц"]       = 0;
	ии["ПрогнозМесяц"]      = 0;
	ии["ОтклоненияМесяц"]   = 0;
	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьБДДСпоБДРСерверРасшифровка(Таб)
	
	
	//Для каждого  сс из Объект.СоставБюджета4 цикл // Расшифровка по клиентам
	Для каждого  сс из Объект[Таб] цикл // Расшифровка по клиентам
		
		Если сс.Итоговая тогда
			//_иОплаты = 0;	
			//Для сч = 1 по 12 цикл
			//	Если сс["МесяцОплаты" + сч] > 0 тогда
			//		_иОплаты  = _иОплаты + сс["МесяцОплаты" + сч];
			//	КонецЕсли;
			//КонецЦикла;
			//
			//Если _иОплаты = 0 тогда
			//	ии = Объект.СоставБюджета8.Добавить();
			//	ЗаполнитьЗначенияСвойств(ии,сс);;
			
		ии = Объект.СоставБюджета8.Добавить();
		ии.абс_КодБюджетнойСтатьи   = сс.абс_КодБюджетнойСтатьи;
		ии.СтатьяОборотовПоБюджетам = сс.СтатьяОборотовПоБюджетам;
		ии.Итоговая                 = сс.Итоговая;
		ии.РодительИтогСтатьи       = сс.РодительИтогСтатьи;
			
			
				
				продолжить; // Итоговые пропускаю
				
			//КонецЕсли; 
		конецесли;
		
		_мОплаты = 0;
		Для сч = 1 по 12 цикл
			Если сс["МесяцОплаты" + сч] > 0 тогда
				_мОплаты  = сс["МесяцОплаты" + сч];
			КонецЕсли;
		КонецЦикла;
		Если _мОплаты = 0 тогда продолжить конецесли;
		
		
		ии = Объект.СоставБюджета8.Добавить();
		ЗаполнитьБДДСпоБДРСерверОчистить(ии,сс);
		ии.абс_КодБюджетнойСтатьи = сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		ТЗоплатСуммаБюджет = Новый ТаблицаЗначений;
		ТЗоплатСуммаБюджет.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаБюджет.Колонки.Добавить("Сумма");
		
		ТЗоплатСумма = Новый ТаблицаЗначений;
		ТЗоплатСумма.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСумма.Колонки.Добавить("Сумма");
		
		ТЗоплатСуммаПрФакт = Новый ТаблицаЗначений;
		ТЗоплатСуммаПрФакт.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаПрФакт.Колонки.Добавить("Сумма");
		
		ТЗоплатСуммаФакт = Новый ТаблицаЗначений;
		ТЗоплатСуммаФакт.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаФакт.Колонки.Добавить("Сумма");
		
		//заполним по месяцам
		Для сч = 1 по 12 цикл
			
			//	Бюджет 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаБюджет" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаБюджет" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаБюджет" + _мОплаты] + сс["СуммаБюджет" + сч], сс["СуммаБюджет" + сч]);
				гг = ТЗоплатСуммаБюджет.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаБюджет" + сч];
			КонецЕсли;
			
			//	План 
			Если сс["МесяцОплаты" + сч] > 0 и сс["Сумма" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["Сумма" + _мОплаты] = ?(_мОплаты <> сч, сс["Сумма" + _мОплаты] + сс["Сумма" + сч], сс["Сумма" + сч]);
				гг = ТЗоплатСумма.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["Сумма" + сч];
			КонецЕсли;
			
			
			//	Пр/Факт 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаПрФакт" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаПрФакт" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаПрФакт" + _мОплаты] + сс["СуммаПрФакт" + сч], сс["СуммаПрФакт" + сч]);
				гг = ТЗоплатСуммаПрФакт.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаПрФакт" + сч];
			КонецЕсли;
			
			//	Факт 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаФакт" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаФакт" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаФакт" + _мОплаты] + сс["СуммаФакт" + сч], сс["СуммаФакт" + сч]);
				гг = ТЗоплатСуммаФакт.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаФакт" + сч];
			КонецЕсли;
			
		КонецЦикла; 
		
		ТЗоплатСуммаБюджет.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаБюджет цикл
			ии["СуммаБюджет" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСумма.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСумма цикл
			ии["Сумма" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСуммаПрФакт.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаПрФакт цикл
			ии["СуммаПрФакт" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСуммаФакт.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаФакт цикл
			ии["СуммаФакт" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		
	КонецЦикла;	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьБДДСпоБДРСерверЭКСПЛУАТАЦИЯ(Таб)
	
	
	//Для каждого  сс из Объект.СоставБюджета4 цикл // Расшифровка по клиентам
	
	//Очистим итоговые в БДДС
	
	ТабБДДС = Объект["СоставБюджета8"];
	
	Для каждого  сс из Объект[Таб] цикл // Расшифровка эксплуатация		
		Если сс.Итоговая тогда
			
			мСтрок = ТабБДДС.НайтиСтроки(Новый Структура("Контрагент",сс.СтатьяОборотовПоБюджетам));
			Если мСтрок.количество() > 0 тогда
				
				// Обнулим итоги сначала	
				Для Н = 1 По 12 Цикл
					мСтрок[0]["СуммаБюджет" + Н] = 0;
					мСтрок[0]["Сумма" + Н]       = 0;
					мСтрок[0]["СуммаПрФакт" + Н] = 0;
					мСтрок[0]["СуммаФакт" + Н]   = 0;
				КонецЦикла;
				
				мСтрок[0]["ГодовойБюджет"]     = 0;
				мСтрок[0]["ГодовойПрогноз"]    = 0;
				мСтрок[0]["ГодовойОтклонение"] = 0;
				
				мСтрок[0]["БюджетМесяц"]       = 0;
				мСтрок[0]["ПрогнозМесяц"]      = 0;
				мСтрок[0]["ОтклоненияМесяц"]   = 0;
				
				мСтрок[0]["МесяцОплаты"]       = 0;
				мСтрок[0]["ВидОплаты"]         = Перечисления.Лео_ВидОплаты.ПустаяСсылка();
				
			КонецЕсли;
			
		//	//_иОплаты = 0;	
		//	//Для сч = 1 по 12 цикл
		//	//	Если сс["МесяцОплаты" + сч] > 0 тогда
		//	//		_иОплаты  = _иОплаты + сс["МесяцОплаты" + сч];
		//	//	КонецЕсли;
		//	//КонецЦикла;
		//	//
		//	//Если _иОплаты = 0 тогда
		//	//	ии = Объект.СоставБюджета8.Добавить();
		//	//	ЗаполнитьЗначенияСвойств(ии,сс);;
		//	
		//ии = Объект.СоставБюджета8.Добавить();
		//ии.абс_КодБюджетнойСтатьи   = сс.абс_КодБюджетнойСтатьи;
		//ии.СтатьяОборотовПоБюджетам = сс.СтатьяОборотовПоБюджетам;
		//ии.Итоговая                 = сс.Итоговая;
		//ии.РодительИтогСтатьи       = сс.РодительИтогСтатьи;
		//	
		//	
		//		
		//		продолжить; // Итоговые пропускаю
		//		
			КонецЕсли; 
		КонецЦикла;
		
		
	Для каждого  сс из Объект[Таб] цикл // Расшифровка эксплуатация		
		
		Если НЕ сс.Итоговая тогда
		
		
		_мОплаты = 0;
		Для сч = 1 по 12 цикл
			Если сс["МесяцОплаты" + сч] > 0 тогда
				_мОплаты  = сс["МесяцОплаты" + сч];
			КонецЕсли;
		КонецЦикла;
		Если _мОплаты = 0 тогда продолжить конецесли;
		
		
		//ии = Объект.СоставБюджета8.Добавить();
		//ЗаполнитьБДДСпоБДРСерверОчистить(ии,сс);
		
			мСтрок = ТабБДДС.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам.СтатьяОборотов));
			Если мСтрок.количество() > 0 тогда
		
		
		//ии.абс_КодБюджетнойСтатьи = сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		ТЗоплатСуммаБюджет = Новый ТаблицаЗначений;
		ТЗоплатСуммаБюджет.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаБюджет.Колонки.Добавить("Сумма");
		
		ТЗоплатСумма = Новый ТаблицаЗначений;
		ТЗоплатСумма.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСумма.Колонки.Добавить("Сумма");
		
		ТЗоплатСуммаПрФакт = Новый ТаблицаЗначений;
		ТЗоплатСуммаПрФакт.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаПрФакт.Колонки.Добавить("Сумма");
		
		ТЗоплатСуммаФакт = Новый ТаблицаЗначений;
		ТЗоплатСуммаФакт.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаФакт.Колонки.Добавить("Сумма");
		
		//заполним по месяцам
		Для сч = 1 по 12 цикл
			
			//	Бюджет 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаБюджет" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаБюджет" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаБюджет" + _мОплаты] + сс["СуммаБюджет" + сч], сс["СуммаБюджет" + сч]);
				гг = ТЗоплатСуммаБюджет.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаБюджет" + сч];
			КонецЕсли;
			
			//	План 
			Если сс["МесяцОплаты" + сч] > 0 и сс["Сумма" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["Сумма" + _мОплаты] = ?(_мОплаты <> сч, сс["Сумма" + _мОплаты] + сс["Сумма" + сч], сс["Сумма" + сч]);
				гг = ТЗоплатСумма.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["Сумма" + сч];
			КонецЕсли;
			
			
			//	Пр/Факт 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаПрФакт" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаПрФакт" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаПрФакт" + _мОплаты] + сс["СуммаПрФакт" + сч], сс["СуммаПрФакт" + сч]);
				гг = ТЗоплатСуммаПрФакт.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаПрФакт" + сч];
			КонецЕсли;
			
			//	Факт 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаФакт" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаФакт" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаФакт" + _мОплаты] + сс["СуммаФакт" + сч], сс["СуммаФакт" + сч]);
				гг = ТЗоплатСуммаФакт.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаФакт" + сч];
			КонецЕсли;
			
		КонецЦикла; 
		
		ТЗоплатСуммаБюджет.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаБюджет цикл
			мСтрок[0]["СуммаБюджет" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСумма.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСумма цикл
			мСтрок[0]["Сумма" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСуммаПрФакт.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаПрФакт цикл
			мСтрок[0]["СуммаПрФакт" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСуммаФакт.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаФакт цикл
			мСтрок[0]["СуммаФакт" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБДДСпоБДР_ФАРМ_Клиенты(Таб)
	
	
	//Для каждого  сс из Объект.СоставБюджета4 цикл // Расшифровка по клиентам
	Для каждого  сс из Объект[Таб] цикл // Расшифровка по клиентам
		
		Если сс.Итоговая тогда
			
				продолжить; // Итоговые пропускаю
			//_иОплаты = 0;	
			//Для сч = 1 по 12 цикл
			//	Если сс["МесяцОплаты" + сч] > 0 тогда
			//		_иОплаты  = _иОплаты + сс["МесяцОплаты" + сч];
			//	КонецЕсли;
			//КонецЦикла;
			//
			//Если _иОплаты = 0 тогда
			//	ии = Объект.СоставБюджета8.Добавить();
			//	ЗаполнитьЗначенияСвойств(ии,сс);;
			
		ии = Объект.СоставБюджета8.Добавить();
		ии.абс_КодБюджетнойСтатьи   = сс.абс_КодБюджетнойСтатьи;
		ии.СтатьяОборотовПоБюджетам = сс.СтатьяОборотовПоБюджетам;
		ии.Итоговая                 = сс.Итоговая;
		ии.РодительИтогСтатьи       = сс.РодительИтогСтатьи;
			
			
				
			//	продолжить; // Итоговые пропускаю
				
			//КонецЕсли; 
		конецесли;
		
		_мОплаты = 0;
		Для сч = 1 по 12 цикл
			Если сс["МесяцОплаты" + сч] > 0 тогда
				_мОплаты  = сс["МесяцОплаты" + сч];
			КонецЕсли;
		КонецЦикла;
		Если _мОплаты = 0 тогда продолжить конецесли;
		
		
		
		// Только Нал и Безнал
		_мВидОплаты = 0;
		Для сч = 1 по 12 цикл
		Если сс["ВидОплаты" + сч] = Перечисления.Лео_ВидОплаты.Безналичный
			или сс["ВидОплаты" + сч] = Перечисления.Лео_ВидОплаты.Наличный тогда
		_мВидОплаты = 1;
			КонецЕсли;
		КонецЦикла;
		Если _мВидОплаты = 0 тогда продолжить конецесли;
		
		
		
		ии = Объект.СоставБюджета8.Добавить();
		ЗаполнитьБДДСпоБДРСерверОчистить(ии,сс);
		ии.абс_КодБюджетнойСтатьи = сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		ТЗоплатСуммаБюджет = Новый ТаблицаЗначений;
		ТЗоплатСуммаБюджет.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаБюджет.Колонки.Добавить("Сумма");
		
		ТЗоплатСумма = Новый ТаблицаЗначений;
		ТЗоплатСумма.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСумма.Колонки.Добавить("Сумма");
		
		ТЗоплатСуммаПрФакт = Новый ТаблицаЗначений;
		ТЗоплатСуммаПрФакт.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаПрФакт.Колонки.Добавить("Сумма");
		
		ТЗоплатСуммаФакт = Новый ТаблицаЗначений;
		ТЗоплатСуммаФакт.Колонки.Добавить("МесяцОплаты");
		ТЗоплатСуммаФакт.Колонки.Добавить("Сумма");
		
		//заполним по месяцам
		Для сч = 1 по 12 цикл
			
		// Только Нал и Безнал
		_мВидОплаты = 0;
		Если сс["ВидОплаты" + сч] = Перечисления.Лео_ВидОплаты.Безналичный
			или сс["ВидОплаты" + сч] = Перечисления.Лео_ВидОплаты.Наличный
			тогда
		_мВидОплаты = 1;
			КонецЕсли;

		Если _мВидОплаты = 0 тогда продолжить конецесли;
			
			
			
			//	Бюджет 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаБюджет" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаБюджет" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаБюджет" + _мОплаты] + сс["СуммаБюджет" + сч], сс["СуммаБюджет" + сч]);
				гг = ТЗоплатСуммаБюджет.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаБюджет" + сч];
			КонецЕсли;
			
			//	План 
			Если сс["МесяцОплаты" + сч] > 0 и сс["Сумма" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["Сумма" + _мОплаты] = ?(_мОплаты <> сч, сс["Сумма" + _мОплаты] + сс["Сумма" + сч], сс["Сумма" + сч]);
				гг = ТЗоплатСумма.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["Сумма" + сч];
			КонецЕсли;
			
			
			//	Пр/Факт 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаПрФакт" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаПрФакт" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаПрФакт" + _мОплаты] + сс["СуммаПрФакт" + сч], сс["СуммаПрФакт" + сч]);
				гг = ТЗоплатСуммаПрФакт.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаПрФакт" + сч];
			КонецЕсли;
			
			//	Факт 
			Если сс["МесяцОплаты" + сч] > 0 и сс["СуммаФакт" + сч] > 0  тогда
				_мОплаты  = сс["МесяцОплаты" + сч];	
				Если _мОплаты > 12 тогда продолжить конецесли;
				//ии["СуммаФакт" + _мОплаты] = ?(_мОплаты <> сч, сс["СуммаФакт" + _мОплаты] + сс["СуммаФакт" + сч], сс["СуммаФакт" + сч]);
				гг = ТЗоплатСуммаФакт.Добавить();
				гг.МесяцОплаты = _мОплаты;
				гг.Сумма       = сс["СуммаФакт" + сч];
			КонецЕсли;
			
		КонецЦикла; 
		
		ТЗоплатСуммаБюджет.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаБюджет цикл
			ии["СуммаБюджет" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСумма.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСумма цикл
			ии["Сумма" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСуммаПрФакт.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаПрФакт цикл
			ии["СуммаПрФакт" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		ТЗоплатСуммаФакт.Свернуть("МесяцОплаты","Сумма");
		Для каждого оо из ТЗоплатСуммаФакт цикл
			ии["СуммаФакт" + оо.МесяцОплаты] = оо.Сумма;
		КонецЦикла;
		
		
	КонецЦикла;	
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьБДДСпоБДРСервер()
	
	Объект.СоставБюджета8.Очистить();
	
	//Для каждого  сс из Объект.СоставБюджета7 цикл
	
	//// Коммерсы
	//ЗаполнитьБДДСпоБДРСерверРасшифровка("СоставБюджета4"); // Расшифровка по клиентам
	//ЗаполнитьБДДСпоБДРСерверРасшифровка("СоставБюджета5"); // ТМ
	//ЗаполнитьБДДСпоБДРСерверРасшифровка("СоставБюджета6"); // Непрямым
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
		
	ЗаполнитьБДДСпоБДР_ФАРМ_Клиенты("СоставБюджета7"); // Расшифровка Осн
	
	ЗаполнитьБДДСпоБДР_ФАРМ_Клиенты("СоставБюджета4"); // Расшифровка по клиентам
	
	ЗаполнитьБДДСпоБДР_ФАРМ_Клиенты("СоставБюджета6"); // Непрямым
    ЗаполнитьБДДСпоБДР_ФАРМ_Клиенты("СоставБюджета16"); // ТМ

	
		
		иначе // остальные
			
	ЗаполнитьБДДСпоБДРСерверРасшифровка("СоставБюджета7"); // Расшифровка
	
	КонецЕсли;
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" тогда // Эксплуатация
	
	ЗаполнитьБДДСпоБДРСерверЭКСПЛУАТАЦИЯ("СоставБюджета6"); // Страница эксплуатация
		
	КонецЕсли;	
	
	//ЗаполнимТаблицуИтоговаяСервер("СоставБюджета8");
	//ЗаполнимТаблицуСервер("СоставБюджета8",Истина);
	
	// очистим Факт
	Для каждого бб из Объект.СоставБюджета8 цикл
		бб.Факт1 = 0;
		бб.Факт2 = 0;
		бб.Факт3 = 0;
	КонецЦикла;
	
	
	
	
	
		ЗаполнимИтоговуюТаблицуРасшифровка("СоставБюджета11","СоставБюджета8",Истина);
		
	//Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" тогда // Эксплуатация
	//	ЗаполнимИтоговуюТаблицуРасшифровкаЭксплуатация("СоставБюджета11","СоставБюджета8",Истина);
	//КонецЕсли;	
		
	
	ЗаполнимТаблицуИтоговаяСервер("СоставБюджета8");  // поправить !!!
	ЗаполнимТаблицуСервер("СоставБюджета8",Истина);
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" тогда // Эксплуатация
		ЗаполнимИтоговуюТаблицуРасшифровкаЭксплуатация("СоставБюджета11","СоставБюджета8",Истина);
	КонецЕсли;	
	
	
		ЗаполнимТаблицуСервер("СоставБюджета11",Истина);
	
		
		
		
	
	ОбработатьИтоговыеСтроки();
	СоставБюджета4ВыделитьТО();
	СоставБюджета5ВыделитьТО();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнимТаблицуИтоговаяСервер(Таб)
	
	
	Таб = Объект[Таб];
	
	ПромТЗ = Таб.Выгрузить(); 
	
	ПромТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	|");
	
	
	
	// Заполнение
	Для каждого сс из ПромТЗ цикл
		
		Если сс.РодительИтогСтатьи = 0 тогда продолжить конецесли;
		
		мСтр = Таб.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
		Если мСтр.Количество() > 0 тогда
			Для Н = 1 По 12 Цикл
				мСтр[0]["СуммаБюджет" + Н] = сс["СуммаБюджет" + Н];
				мСтр[0]["Сумма" + Н]       = сс["Сумма" + Н];
				мСтр[0]["СуммаПрФакт" + Н] = сс["СуммаПрФакт" + Н];
				мСтр[0]["СуммаФакт" + Н]   = сс["СуммаФакт" + Н];
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры	



&НаКлиенте
Процедура СоставБюджета8ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	// Вставить содержимое обработчика.
	
	//Сообщить("!!!");
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета8ПередУдалением(Элемент, Отказ)
	// Вставить содержимое обработчика.
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета8ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставБюджета8СтатьяОборотовПоБюджетамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
		ТекДанные.абс_КодБюджетнойСтатьи = ВыбранноеЗначение.абс_КодБюджетнойСтатьи;	
		ТекДанные.Итоговая = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДСКлиент(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.Лео_СтавкиНДС.НДС20 Тогда
		Возврат 20;
		
	ИначеЕсли СтавкаНДС = Перечисления.Лео_СтавкиНДС.НДС10 Тогда
		Возврат 10;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.Лео_СтавкиНДС.НДС20 Тогда
		Возврат 20;
		
	ИначеЕсли СтавкаНДС = Перечисления.Лео_СтавкиНДС.НДС10 Тогда
		Возврат 10;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции



&НаКлиенте
Процедура ПересчитатьБезНДССтроку(ии)
	
	
	Если ЗначениеЗаполнено(ии.СтавкаНДС) тогда
		
		
		Для Н = 1 По 12 Цикл
			
			Если ии["СуммаБюджет" + Н] > 0 тогда 
				ии["СуммаБюджетБезНДС" + Н] = ии["СуммаБюджет" + Н] - РассчитатьСуммуНДСКлиент(ии["СуммаБюджет" + Н], Истина, Истина, ПолучитьСтавкуНДСКлиент(ии.СтавкаНДС));
			КонецЕсли;
			Если ии["Сумма" + Н] > 0 тогда 
				ии["СуммаБезНДС" + Н]       = ии["Сумма" + Н]       - РассчитатьСуммуНДСКлиент(ии["Сумма" + Н], Истина, Истина, ПолучитьСтавкуНДСКлиент(ии.СтавкаНДС));
			КонецЕсли;  
			Если ии["СуммаПрФакт" + Н] > 0 тогда 
				ии["СуммаПрФактБезНДС" + Н] = ии["СуммаПрФакт" + Н] - РассчитатьСуммуНДСКлиент(ии["СуммаПрФакт" + Н], Истина, Истина, ПолучитьСтавкуНДСКлиент(ии.СтавкаНДС));
			КонецЕсли;  
			Если ии["СуммаФакт" + Н] > 0 тогда 
				ии["СуммаФактБезНДС" + Н]   = ии["СуммаФакт" + Н]   - РассчитатьСуммуНДСКлиент(ии["СуммаФакт" + Н], Истина, Истина, ПолучитьСтавкуНДСКлиент(ии.СтавкаНДС));
			КонецЕсли;  
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  УчитыватьНДС     - булево, признак учета НДС в сумме, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДСКлиент(Сумма, УчитыватьНДС, СуммаВключаетНДС, СтавкаНДС) Экспорт
	
	Если (УчитыватьНДС) И (СуммаВключаетНДС) Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;
	
	Если УчитыватьНДС Тогда 
		Если НЕ СуммаВключаетНДС Тогда
			СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции // РассчитатьСуммуНДС()



&НаСервере
Процедура ПересчитатьБезНДССтрокуНаСервере(ии)
	
	
	Если ЗначениеЗаполнено(ии.СтавкаНДС) и ии.СтавкаНДС <> Перечисления.Лео_СтавкиНДС.БезНДС тогда
		
		
		Для Н = 1 По 12 Цикл
			                                                               
			Если ии["СуммаБюджет" + Н] > 0 тогда 
				ии["СуммаБюджет" + Н]            = ии["СуммаБюджет" + Н] - УчетНДС.РассчитатьСуммуНДС(ии["СуммаБюджет" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;
			Если ии["Сумма" + Н] > 0 тогда 
				ии["Сумма" + Н]                  = ии["Сумма" + Н]       - УчетНДС.РассчитатьСуммуНДС(ии["Сумма" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;  
			Если ии["СуммаПрФакт" + Н] > 0 тогда 
				ии["СуммаПрФакт" + Н]            = ии["СуммаПрФакт" + Н] - УчетНДС.РассчитатьСуммуНДС(ии["СуммаПрФакт" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;  
			Если ии["СуммаФакт" + Н] > 0 тогда 
				ии["СуммаФакт" + Н]              = ии["СуммаФакт" + Н]   - УчетНДС.РассчитатьСуммуНДС(ии["СуммаФакт" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;  
			
		КонецЦикла;
		
		
		// Справочно (Факт)
		Для Н = 1 По 3 Цикл
          ии["Факт" + Н]            = ии["Факт" + Н] - УчетНДС.РассчитатьСуммуНДС(ии["Факт" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));		
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьБезНДССтрокуНаКлиенте(ии)
	
	
	Если ЗначениеЗаполнено(ии.СтавкаНДС) и ии.СтавкаНДС <> Перечисления.Лео_СтавкиНДС.БезНДС тогда
		
		
		Для Н = 1 По 12 Цикл
			
			Если ии["СуммаБюджет" + Н] > 0 тогда 
				ии["СуммаБюджет" + Н]            = ии["СуммаБюджет" + Н] - РассчитатьСуммуНДСКлиент(ии["СуммаБюджет" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;
			Если ии["Сумма" + Н] > 0 тогда 
				ии["Сумма" + Н]                  = ии["Сумма" + Н]       - РассчитатьСуммуНДСКлиент(ии["Сумма" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;  
			Если ии["СуммаПрФакт" + Н] > 0 тогда 
				ии["СуммаПрФакт" + Н]            = ии["СуммаПрФакт" + Н] - РассчитатьСуммуНДСКлиент(ии["СуммаПрФакт" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;  
			Если ии["СуммаФакт" + Н] > 0 тогда 
				ии["СуммаФакт" + Н]              = ии["СуммаФакт" + Н]   - РассчитатьСуммуНДСКлиент(ии["СуммаФакт" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));
			КонецЕсли;  
			
		КонецЦикла;
		
		
		// Справочно (Факт)
		Для Н = 1 По 3 Цикл
          ии["Факт" + Н]            = ии["Факт" + Н] - РассчитатьСуммуНДСКлиент(ии["Факт" + Н], Истина, Истина, ПолучитьСтавкуНДС(ии.СтавкаНДС));		
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйДокБезНДС(Команда)
	// Вставить содержимое обработчика.
	
	//док =  СоздатьНовыйДокБезНДССервер();
	//док.ПолучитьФорму("Форма.ФормаДокумента").Открыть();
	
	Форма = ПолучитьФорму("Документ.Лео_ВводБюджета.Форма.ФормаДокумента");
	док = Форма.Объект;
	
	
	док.Организация      = Объект.Организация;
	док.ЦФО              = Объект.ЦФО;
	док.СценарийПродаж   = Объект.СценарийПродаж;
	док.ДатаПланирования = Объект.ДатаПланирования;
	док.ВидОперации      = Объект.ВидОперации;
	док.Ответственный    = Объект.Ответственный;
	док.Комментарий      = Объект.Комментарий;
	док.Состояние        = Объект.Состояние;
	док.ЗакрытыйПериод   = Объект.ЗакрытыйПериод;
	док.ПланПродаж       = Объект.ПланПродаж;
	
	док.БезНДС           = Истина;
	
	Для каждого сс из Объект.СоставБюджета цикл
		ии = док.СоставБюджета.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета1 цикл
		ии = док.СоставБюджета1.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета2 цикл
		ии = док.СоставБюджета2.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета3 цикл
		ии = док.СоставБюджета3.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета4 цикл
		ии = док.СоставБюджета4.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
		ПересчитатьБезНДССтроку(ии);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета5 цикл
		ии = док.СоставБюджета5.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
		ПересчитатьБезНДССтроку(ии);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета6 цикл
		ии = док.СоставБюджета6.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
	КонецЦикла;
	
	Для каждого сс из Объект.СоставБюджета7 цикл
		ии = док.СоставБюджета7.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);
		ПересчитатьБезНДССтроку(ии);
	КонецЦикла;
	
	
	//ЗаполнимТаблицуСервер("СоставБюджета4",Истина);
	//ЗаполнимИтоговуюТаблицу("СоставБюджета1","СоставБюджета4",Истина);
	//
	//ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
	//ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета5",Истина);
	//
	//ЗаполнимТаблицуСервер("СоставБюджета6",Истина);
	//ЗаполнимИтоговуюТаблицу("СоставБюджета3","СоставБюджета6",Истина);
	
	//ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
	
	ЗаполнимИтоговуюТаблицуРасшифровкаДок(док,"СоставБюджета","СоставБюджета7",Истина);
	
	//ЗаполнимТаблицуИтоговаяСервер("СоставБюджета");
	ЗаполнимТаблицуСерверДок(док,"СоставБюджета",Истина);
	
	
	
	//ЗаполнимТаблицуСерверРасшифровкаГруппировки(док,"СоставБюджета7");
	
	ЗаполнимТаблицуСерверРасшифровка(док,"СоставБюджета7",Истина);
	
	
	
	
	
	КопироватьДанныеФормы(док,Форма.Объект);
	
	//Оповестить("_Перечитать",Форма);
	
	//ЗначениеВДанныеФормы(ДанныеФормыВЗначение(Форма.Объект, Тип("ДокументОбъект.Лео_ВводБюджета")),док);
	
	
	//// БДДС
	//Для каждого сс из Объект.СоставБюджета8 цикл
	//	   ии = док.СоставБюджета8.Добавить();
	//	   ЗаполнитьЗначенияСвойств(ии,сс);
	//КонецЦикла;
	
	
	
	Форма.Открыть();
	
	//ОткрытьФорму("Документ.Лео_ВводБюджета.Форма.ФормаДокумента", Новый Структура("Ключ", док));	
КонецПроцедуры     


&НаКлиенте
Процедура ПоказатьСправочно(Команда)
	// Вставить содержимое обработчика.
	Элементы.ПоказатьСправочно.Пометка = НЕ Элементы.ПоказатьСправочно.Пометка;
	
	УстановитьВидимостьСправочно(Элементы.ПоказатьСправочно.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСправочно(ВидимостьПоказатьСправочно)
	
	Элементы.СоставСправочноФакт.Видимость   = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт1.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт2.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт3.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт4.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт5.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт6.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт7.Видимость  = ВидимостьПоказатьСправочно;
	//Элементы.СоставСправочноФакт8.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт9.Видимость  = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт10.Видимость = ВидимостьПоказатьСправочно;
	//Элементы.СоставСправочноФакт12.Видимость = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт11.Видимость = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт13.Видимость = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт14.Видимость = ВидимостьПоказатьСправочно;

	Элементы.СоставСправочноФакт15.Видимость = ВидимостьПоказатьСправочно;
    Элементы.СоставСправочноФакт17.Видимость = ВидимостьПоказатьСправочно;

	
	Элементы.СоставСправочноФакт16.Видимость = ВидимостьПоказатьСправочно;
	Элементы.СоставСправочноФакт18.Видимость = ВидимостьПоказатьСправочно;
	
	//Элементы.СоставБюджетаГруппаКонтрагент7.Видимость  = ВидимостьПоказатьСправочно;
	//Элементы.СоставБюджетаГруппаКонтрагент8.Видимость  = ВидимостьПоказатьСправочно;
	//Элементы.СоставБюджетаГруппаКонтрагент4.Видимость  = ВидимостьПоказатьСправочно;
	//Элементы.СоставБюджетаГруппаКонтрагент5.Видимость  = ВидимостьПоказатьСправочно;
	//Элементы.СоставБюджетаГруппаКонтрагент6.Видимость  = ВидимостьПоказатьСправочно;
	////Элементы.СоставБюджетаГруппаКонтрагент9.Видимость  = ВидимостьПоказатьСправочно;
	//Элементы.СоставБюджетаГруппаКонтрагент10.Видимость = ВидимостьПоказатьСправочно;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	
	_Ф = Документы.ПланПродаж.ПолучитьФормуВыбора(,ЭтаФорма);
	Если Не _Ф.Открыта() Тогда
		//_Ф.МножественныйВыбор = Истина;
		_Ф.Отбор.Дата.ВидСравнения = ВидСравнения.БольшеИлиРавно;
		_Ф.Отбор.Дата.Значение = НачалоГода(ДобавитьМесяц(ТекущаяДата(), - 12));
		_Ф.Отбор.Дата.Использование = Истина;
		_Ф.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБезНДС(Команда)
	// Вставить содержимое обработчика.
	Элементы.ПоказатьБезНДС.Пометка =  НЕ Элементы.ПоказатьБезНДС.Пометка;
	
	УстановитьВидимостьБезНДС(Элементы.ПоказатьБезНДС.Пометка);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьБезНДС(ВидимостьПоказатьСправочно)
	
	Элементы.СтраницаБезНДС.Видимость  = ВидимостьПоказатьСправочно;
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" 
		или Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" 
		или Объект.ЦФО.Лео_ЦЗ = "ОКП" 
		или Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" 
		или Объект.ЦФО.Лео_ЦЗ = "ОСП (ГУ)" 
		или Объект.ЦФО.Лео_ЦЗ = "ЭО" 
		
		тогда
	Элементы.СтраницаПоКлиентамБезНДС.Видимость  = ВидимостьПоказатьСправочно;
	КонецЕсли;
	
	Элементы.СтраницаНепрямымБезНДС.Видимость  = ?(Объект.Непрямым,ВидимостьПоказатьСправочно,Ложь);
	Элементы.СтраницаТМБезНДС.Видимость  = ?(Объект.ТМ,ВидимостьПоказатьСправочно,Ложь);
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьСтруктураТаблицыПоИсточнику(ТабИсточник,ТабПриемник)
	
	
	
	Объект[ТабПриемник].Очистить();
	Для каждого кк из Объект[ТабИсточник] цикл
		
		
		ии = Объект[ТабПриемник].Добавить();
		
		ЗаполнитьЗначенияСвойств(ии,кк);
		
		ии.Факт1 = 0;
		ии.Факт2 = 0;
		ии.Факт3 = 0;
		
		
		
		Для Н = 1 По 12 Цикл
			
			//Если ии["СуммаБюджет" + Н] > 0 тогда 
				ии["СуммаБюджетБезНДС" + Н] = 0;
			//КонецЕсли;
			//Если ии["Сумма" + Н] > 0 тогда 
				ии["СуммаБезНДС" + Н]       = 0;
			//КонецЕсли;  
			//Если ии["СуммаПрФакт" + Н] > 0 тогда 
				ии["СуммаПрФактБезНДС" + Н] = 0;
			//КонецЕсли;  
			//Если ии["СуммаФакт" + Н] > 0 тогда 
				ии["СуммаФактБезНДС" + Н]   = 0;
			//КонецЕсли;  
			
				ии["СуммаБюджет" + Н] = 0;
				ии["Сумма" + Н]       = 0;
				ии["СуммаПрФакт" + Н] = 0;
				ии["СуммаФакт" + Н]   = 0;
			
		КонецЦикла;
		
		//Если  кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи ="ФАРМ_ТО_НЕТТО_сНДС"
		//	или кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи ="МТ_ТО_НЕТТО_сНДС"
		//	или кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи ="ИН_ТО_НЕТТО_сНДС"
		//	или кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи ="КП_ТО_НЕТТО_сНДС"
		//	или кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи ="ГУ_ТО_НЕТТО_сНДС"
		//	или кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи ="ЭКС_ТО_НЕТТО_сНДС"
		//	тогда  // Выручку не показываем из БДДС
		// ии.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("<< БДДС >>"); // Служебное << БДДС >>
		//КонецЕсли;
		
		
		абс_КодБюджетнойСтатьи = кк.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		Если  абс_КодБюджетнойСтатьи ="ФАРМ_ТО_НЕТТО_сНДС"
			или абс_КодБюджетнойСтатьи ="МТ_ТО_НЕТТО_сНДС"
			или абс_КодБюджетнойСтатьи ="ИН_ТО_НЕТТО_сНДС"
			или абс_КодБюджетнойСтатьи ="КП_ТО_НЕТТО_сНДС"
			или абс_КодБюджетнойСтатьи ="ГУ_ТО_НЕТТО_сНДС"
			или абс_КодБюджетнойСтатьи ="ЭКС_ТО_НЕТТО_сНДС"
			тогда  // Выручку не показываем из БДДС
		 ии.СтатьяОборотовПоБюджетам = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию("<< БДДС >>"); // Служебное << БДДС >>
		КонецЕсли;
		
		
		
		
		
	КонецЦикла;

	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранимФактБезНДС(СтруктураФактБезНДС,Таб)
	
	мФакт1 = Новый Массив;
	мФакт2 = Новый Массив;
	мФакт3 = Новый Массив;
	
    СтруктураФактБезНДС.Вставить("мФакт1",мФакт1);
	СтруктураФактБезНДС.Вставить("мФакт2",мФакт2);
	СтруктураФактБезНДС.Вставить("мФакт3",мФакт3);

	Для каждого гг из Объект[Таб] цикл
		мФакт1.Добавить(гг.Факт1);
		мФакт2.Добавить(гг.Факт2);
		мФакт3.Добавить(гг.Факт3);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВосстановимФактБезНДС(СтруктураФактБезНДС,Таб)
	
	
	
	
	мФакт1 = СтруктураФактБезНДС.мФакт1;
	мФакт2 = СтруктураФактБезНДС.мФакт2;
	мФакт3 = СтруктураФактБезНДС.мФакт3;
	сч = 0;
	Для каждого гг из Объект[Таб] цикл
		гг.Факт1 = мФакт1[сч];
		гг.Факт2 = мФакт2[сч];
		гг.Факт3 = мФакт3[сч];
	сч = сч + 1;
    КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьЗакладкуБезНДС(Команда)
	// Вставить содержимое обработчика.
	
	
	Объект.БезНДС           = Истина;
	
	
	//Объект.СоставБюджета9.Очистить();
	//Объект.СоставБюджета10.Очистить();
	
	
	
	
	//Для каждого сс из Объект.СоставБюджета цикл
	//	ПересчитатьБезНДССтроку(сс);
	//КонецЦикла;
	
	
 Если Объект.ЦФО.Лео_ЦЗ = "ОРД" //тогда  //ОП Дистрибьюция ОБЩИЕ
	тогда	
		
		
ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОРД ФАРМ" тогда // ФАРМ
		
		
		
	
	// По клиентам	 
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета4","СоставБюджета5");
    Для каждого сс из Объект.СоставБюджета5 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	// Непрямым
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета6","СоставБюджета14");
    Для каждого сс из Объект.СоставБюджета14 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	// ТМ
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета16","СоставБюджета18");
    Для каждого сс из Объект.СоставБюджета18 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета5");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета5");
    ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета5",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета14");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета14");
    ЗаполнимТаблицуСервер("СоставБюджета14",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета13","СоставБюджета14",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета13",Истина);
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета18");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета18");
    ЗаполнимТаблицуСервер("СоставБюджета18",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета17","СоставБюджета18",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета17",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ("СоставБюджета5","СоставБюджета10");
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ("СоставБюджета14","СоставБюджета10");
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ("СоставБюджета18","СоставБюджета10");
    //ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ_Осн("СоставБюджета7","СоставБюджета10");
   // ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
   
ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОРД МТ" тогда // МТ
		
		
		
	
	// По клиентам	 
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета4","СоставБюджета5");
    Для каждого сс из Объект.СоставБюджета5 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	//// Непрямым
	//ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета6","СоставБюджета14");
	//Для каждого сс из Объект.СоставБюджета14 цикл
	//	ПересчитатьБезНДССтроку(сс);
	//КонецЦикла;
	
	// ТМ
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета16","СоставБюджета18");
    Для каждого сс из Объект.СоставБюджета18 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета5");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета5");
    ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета5",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
	
	
	//ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета14");
	//ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета14");
	//ЗаполнимТаблицуСервер("СоставБюджета14",Истина);
	//ЗаполнимИтоговуюТаблицу("СоставБюджета13","СоставБюджета14",Истина);
	//ЗаполнимТаблицуСервер("СоставБюджета13",Истина);
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета18");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета18");
    ЗаполнимТаблицуСервер("СоставБюджета18",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета17","СоставБюджета18",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета17",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямМТ("СоставБюджета5","СоставБюджета10");
	//ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямФАРМ("СоставБюджета14","СоставБюджета10");
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямМТ("СоставБюджета18","СоставБюджета10");
    //ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямМТ_Осн("СоставБюджета7","СоставБюджета10");
   // ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
   
   
   
   
ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОКП" тогда // КП

		
	
	// По клиентам	 
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета4","СоставБюджета5");
    Для каждого сс из Объект.СоставБюджета5 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета5");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета5");
    ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета5",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
	
	
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямКП("СоставБюджета5","СоставБюджета10");
    //ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямКП_Осн("СоставБюджета7","СоставБюджета10");
   // ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
   
   
ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ЭО" тогда // ЭКС

		
	
	// По клиентам	 
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета4","СоставБюджета5");
    Для каждого сс из Объект.СоставБюджета5 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета5");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета5");
    ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета5",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
	
	
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямЭО("СоставБюджета5","СоставБюджета10");
    //ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямЭО_Осн("СоставБюджета7","СоставБюджета10");
   // ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
   
ИначеЕсли Объект.ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда // ИН

		
	
	// По клиентам	 
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета4","СоставБюджета5");
    Для каждого сс из Объект.СоставБюджета5 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	
	
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям("СоставБюджета5");
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета5");
    ЗаполнимТаблицуСервер("СоставБюджета5",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета2","СоставБюджета5",Истина);
    ЗаполнимТаблицуСервер("СоставБюджета2",Истина);
	
	
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямКП("СоставБюджета5","СоставБюджета10");
    //ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	
	
	ЗаполнимРодительскуюТаблицуБезНДСПоСтатьямКП_Осн("СоставБюджета7","СоставБюджета10");
   // ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
   
   
	
иначе //остальные (ИТ и др.)
	
	//Заполним структуру таблиц СоставБюджета7
	
	СтруктураФактБезНДС = Новый Структура;
	
	СохранимФактБезНДС(СтруктураФактБезНДС,"СоставБюджета10");
	ЗаполнитьСтруктураТаблицыПоИсточнику("СоставБюджета7","СоставБюджета10");
	
	//ВосстановимФактБезНДС(СтруктураФактБезНДС,"СоставБюджета10");
	//ЗаполнитьСтруктураТаблицыПоИсточнику("СоставБюджета","СоставБюджета9");
	ЗаполнимТаблицуБезНДС_ФАРМ_МТ("СоставБюджета7","СоставБюджета10");

	ВосстановимФактБезНДС(СтруктураФактБезНДС,"СоставБюджета10");
	
	
	Для каждого сс из Объект.СоставБюджета10 цикл
		ПересчитатьБезНДССтроку(сс);
	КонецЦикла;
	
	
	//ЗаполнимРодительскуюТаблицуБезНДСПоРегионам("СоставБюджета10","СоставБюджета9");
КонецЕсли;	
	
	
	//Для каждого сс из Объект.СоставБюджета цикл
	//	ии = Объект.СоставБюджета9.Добавить();
	//	ЗаполнитьЗначенияСвойств(ии,сс);
	//	
	//	
	//	Для Н = 1 По 12 Цикл
	//		
	//		Если ии["СуммаБюджетБезНДС" + Н] > 0 тогда 
	//			ии["СуммаБюджет" + Н] = ии["СуммаБюджетБезНДС" + Н];
	//		КонецЕсли;
	//		Если ии["СуммаБезНДС" + Н] > 0 тогда 
	//			ии["Сумма" + Н]       = ии["СуммаБезНДС" + Н];
	//		КонецЕсли;  
	//		Если ии["СуммаПрФактБезНДС" + Н] > 0 тогда 
	//			ии["СуммаПрФакт" + Н] = ии["СуммаПрФактБезНДС" + Н];
	//		КонецЕсли;  
	//		Если ии["СуммаФактБезНДС" + Н] > 0 тогда 
	//			ии["СуммаФакт" + Н]   = ии["СуммаФактБезНДС" + Н];
	//		КонецЕсли;  
	//		
	//	КонецЦикла;
	//	
	//	
	//КонецЦикла;
	
	//Для каждого сс из Объект.СоставБюджета1 цикл
	//	   ии = док.СоставБюджета1.Добавить();
	//	   ЗаполнитьЗначенияСвойств(ии,сс);
	//КонецЦикла;
	//
	
	Для каждого сс из Объект.СоставБюджета10 цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда продолжить конецесли;
		
		
		//ии = Объект.СоставБюджета10.Добавить();
		//ЗаполнитьЗначенияСвойств(ии,сс);
		
		сс.абс_КодБюджетнойСтатьи = сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		Для Н = 1 По 12 Цикл
			
			Если сс["СуммаБюджетБезНДС" + Н] > 0 тогда 
				сс["СуммаБюджет" + Н] = сс["СуммаБюджетБезНДС" + Н];
			КонецЕсли;
			Если сс["СуммаБезНДС" + Н] > 0 тогда 
				сс["Сумма" + Н]       = сс["СуммаБезНДС" + Н];
			КонецЕсли;  
			Если сс["СуммаПрФактБезНДС" + Н] > 0 тогда 
				сс["СуммаПрФакт" + Н] = сс["СуммаПрФактБезНДС" + Н];
			КонецЕсли;  
			Если сс["СуммаФактБезНДС" + Н] > 0 тогда 
				сс["СуммаФакт" + Н]   = сс["СуммаФактБезНДС" + Н];
			КонецЕсли;  
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	
	//ЗаполнимТаблицуСервер("СоставБюджета4",Истина);
	//ЗаполнимИтоговуюТаблицу("СоставБюджета1","СоставБюджета4",Истина);
	//
	//ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	
	//ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета10");
    ЗаполнимТаблицуСерверРасшифровкаГруппировкиКлиент("СоставБюджета10");	
	
	
    //ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
    ЗаполнимТаблицуКлиент("СоставБюджета10",Истина);
	
	//ЗаполнимИтоговуюТаблицуРасшифровка("СоставБюджета9","СоставБюджета10",Истина);
	
	//ЗаполнимИтоговуюТаблицу("СоставБюджета9","СоставБюджета10",Истина);
	
	ЗаполнимТаблицуБезНДС_Осн("СоставБюджета10","СоставБюджета9");

	//ЗаполнимИтоговуюТаблицуКлиент("СоставБюджета9","СоставБюджета10",Истина);

	
	//ЗаполнимИтоговуюТаблицуБезИтоговых("СоставБюджета9","СоставБюджета10",Истина);
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ОТ и ТБ" тогда // ОТ и ТБ
	ЗаполнимИтоговуюТаблицуБезКода("СоставБюджета9",Истина);
    КонецЕсли;
	
    //ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
    ЗаполнимТаблицуКлиент("СоставБюджета9",Истина);

	
    ЗаполнимТаблицуСерверРасшифровкаГруппировкиКлиентИндекс("СоставБюджета9");	
	
	
	////ЗаполнимТаблицуИтоговаяСервер("СоставБюджета");
	//ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
	//ЗаполнимТаблицуСерверРасшифровкаГруппировки("СоставБюджета10");
	//
	//ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	////ОбработатьИтоговыеСтроки();	
	
КонецПроцедуры


&НаСервере
Процедура	ЗаполнимТаблицуБезНДС_ФАРМ_МТ_ПоОснПолям(Таб);

	Для каждого сс из Объект[Таб] цикл
		Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда продолжить конецесли;
		
		
		//ии = Объект.СоставБюджета10.Добавить();
		//ЗаполнитьЗначенияСвойств(ии,сс);
		
		//сс.абс_КодБюджетнойСтатьи = сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи;
		
		Для Н = 1 По 12 Цикл
			
			Если сс["СуммаБюджетБезНДС" + Н] > 0 тогда 
				сс["СуммаБюджет" + Н] = сс["СуммаБюджетБезНДС" + Н];
			КонецЕсли;
			Если сс["СуммаБезНДС" + Н] > 0 тогда 
				сс["Сумма" + Н]       = сс["СуммаБезНДС" + Н];
			КонецЕсли;  
			Если сс["СуммаПрФактБезНДС" + Н] > 0 тогда 
				сс["СуммаПрФакт" + Н] = сс["СуммаПрФактБезНДС" + Н];
			КонецЕсли;  
			Если сс["СуммаФактБезНДС" + Н] > 0 тогда 
				сс["СуммаФакт" + Н]   = сс["СуммаФактБезНДС" + Н];
			КонецЕсли;  
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	ЗаполнитьЗаголовкиПоДатаПланирования();
	
	ОбработатьИтоговыеСтроки();
	СоставБюджета4ВыделитьТО();
	СоставБюджета5ВыделитьТО();
	
КонецПроцедуры


&НаКлиенте
Процедура ПереброситьСумму(Команда)
	// Вставить содержимое обработчика.
	
	
	ТабЧ = ЭтаФорма.ТекущийЭлемент.Имя;
	ИмяТекКолонки 	= Элементы[ТабЧ].ТекущийЭлемент.Имя;
	ТекДанные 		= Элементы[ТабЧ].ТекущиеДанные;	
	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	
	_Ф = Документы.Лео_ВводБюджета.ПолучитьФорму("ФормаПереброски");
	Если Не _Ф.Открыта() Тогда
		//_Ф.МножественныйВыбор = Истина;
		Оповестить("_ПередатьСтатью",ТекДанные.СтатьяОборотовПоБюджетам,_Ф);
		сФормы = _Ф.ОткрытьМодально();
	КонецЕсли;
	
	Если сФормы =  неопределено тогда возврат конецЕсли;
	Если сФормы.Сумма = 0 тогда возврат конецЕсли;
	
	
	
	
	
	
	
	 
	
	
	
	///////////////////////////////////////////////////////////////////////////////////////////
	
	Если  ТабЧ = "СоставБюджета7" тогда
		
		
		
		Если СтрДлина(ТабЧ) = 13 тогда //СоставБюджета
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,14,СтрДлина(ИмяТекКолонки)));			
			
		иначе
			
			ИмяТекКолонки = сокрлп(Сред(ИмяТекКолонки,15,СтрДлина(ИмяТекКолонки)));			
			
		КонецЕсли;	
		
		
		ЕстьВозврат = Истина;
		СтрДлинаКолонки = СтрДлина(ИмяТекКолонки);
		иКолонка = "";
		
		Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Прав(ИмяТекКолонки,2)) тогда
			иИндекс = Число(Прав(ИмяТекКолонки,2));
		иначе
			иИндекс = Число(Прав(ИмяТекКолонки,1));
		КонецЕсли;		
		
		Если СтрДлинаКолонки  = 6 или СтрДлинаКолонки  = 7  тогда
			
			иКолонка = "Сумма";
				иКолонка = ИмяТекКолонки;
			//возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 10 или СтрДлинаКолонки  = 11  тогда
			
			иКолонка = "СуммаФакт";
				иКолонка = ИмяТекКолонки;
			//возврат;
			
		ИначеЕсли СтрДлинаКолонки  = 12 или СтрДлинаКолонки  = 13  тогда
			
			Если Лев(ИмяТекКолонки,7) = "СуммаПр" тогда
				иКолонка = "СуммаПрФакт";
				иКолонка = ИмяТекКолонки;
			//	возврат;
			КонецЕсли;
			
			Если Лев(ИмяТекКолонки,7) = "СуммаБю" тогда
				//иКолонка = "СуммаБюджет";
				//_иКолонка = ИмяТекКолонки; 
				///иКолонка =  "Сумма"+ Сред(ИмяТекКолонки,12,2);
				иКолонка = "СуммаБюджет";
				иКолонка = ИмяТекКолонки;
			//	ЕстьВозврат = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;	   
		
		//Если ЕстьВозврат тогда
		//	возврат;
		//КонецЕсли;  
		
		
		//	ОбработатьНовуюСтрокуСумму = Истина;
		//_ПоказатьПредупреждение = Ложь;	
		Если НЕ ПустаяСтрока(иКолонка) тогда
			
			// 1.обработаем предыдущую статью
			ТекДанные[ИмяТекКолонки] = ТекДанные[ИмяТекКолонки] - сФормы.Сумма;
			ПроссумируемЕксель(ТабЧ,иКолонка,ТекДанные);
			
			
			
		Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		иначе // Лео_СтатьиОборотовРасшифровка
			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;
		
		Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
			
			// Основная
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
			КонецЕсли;
			//// По клиентам
			//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета1",иКолонка,_СтатьяОборотов);
			//мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксельКопированием("СоставБюджета1",иКолонка,мПоиска[0]);
			//	ПроссумируемЕксель("СоставБюджета1",иКолонка,мПоиска[0]);
			//КонецЕсли;
			//// ТРМ
			//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета2",иКолонка,_СтатьяОборотов);
			//мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
			//	ПроссумируемЕксель("СоставБюджета2",иКолонка,мПоиска[0]);
			//КонецЕсли;
			//// Непрямым
			//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета3",иКолонка,_СтатьяОборотов);
			//мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
			//	//ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
			//	ПроссумируемЕксель("СоставБюджета3",иКолонка,мПоиска[0]);
			//КонецЕсли;
			
		КонецЕсли;		
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			
			// 2.обработаем новую статью
			сПоиска = Объект[ТабЧ].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", сФормы.СтатьяОборотов));
			Если сПоиска.Количество() > 0 тогда
			  сПоиска[0][ИмяТекКолонки] = сПоиска[0][ИмяТекКолонки] + abs(сФормы.Сумма);
			  ПроссумируемЕксель(ТабЧ,иКолонка,сПоиска[0]);
		   КонецЕсли;
		  
		  
		  
		  
		Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		иначе // Лео_СтатьиОборотовРасшифровка
			_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		КонецЕсли;
		
		Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
			
			// Основная
			ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",иКолонка,_СтатьяОборотов);
			мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			Если мПоиска.количество() > 0 тогда
				//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
				ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
			КонецЕсли;
			//// По клиентам
			//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета1",иКолонка,_СтатьяОборотов);
			//мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксельКопированием("СоставБюджета1",иКолонка,мПоиска[0]);
			//	ПроссумируемЕксель("СоставБюджета1",иКолонка,мПоиска[0]);
			//КонецЕсли;
			//// ТРМ
			//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета2",иКолонка,_СтатьяОборотов);
			//мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
			//	ПроссумируемЕксель("СоставБюджета2",иКолонка,мПоиска[0]);
			//КонецЕсли;
			//// Непрямым
			//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета3",иКолонка,_СтатьяОборотов);
			//мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
			//Если мПоиска.количество() > 0 тогда
			//	//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
			//	//ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
			//	ПроссумируемЕксель("СоставБюджета3",иКолонка,мПоиска[0]);
			//КонецЕсли;
			
		КонецЕсли;		
		  
		  
		  
		
		КонецЕсли;	 
		
		
		//// Основная расшифровка	
		////Если  ТабЧ = "СоставБюджета7" тогда
		//
		//
		//Если ТипЗнч(ТекДанные.СтатьяОборотовПоБюджетам) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
		//	_СтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
		//иначе // Лео_СтатьиОборотовРасшифровка
		//	_СтатьяОборотов = ТекДанные.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		//КонецЕсли;
		//
		//Если НЕ ЗаполнятьОсновнуюВкладкуИРасшифровку(_СтатьяОборотов) тогда
		//	
		//	// Основная
		//	ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета",иКолонка,_СтатьяОборотов);
		//	мПоиска = Объект["СоставБюджета"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	Если мПоиска.количество() > 0 тогда
		//		//ПроссумируемЕксельКопированием("СоставБюджета",иКолонка,мПоиска[0]);
		//		ПроссумируемЕксель("СоставБюджета",иКолонка,мПоиска[0]);
		//	КонецЕсли;
		//	//// По клиентам
		//	//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета1",иКолонка,_СтатьяОборотов);
		//	//мПоиска = Объект["СоставБюджета1"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	//Если мПоиска.количество() > 0 тогда
		//	//	//ПроссумируемЕксельКопированием("СоставБюджета1",иКолонка,мПоиска[0]);
		//	//	ПроссумируемЕксель("СоставБюджета1",иКолонка,мПоиска[0]);
		//	//КонецЕсли;
		//	//// ТРМ
		//	//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета2",иКолонка,_СтатьяОборотов);
		//	//мПоиска = Объект["СоставБюджета2"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	//Если мПоиска.количество() > 0 тогда
		//	//	//ПроссумируемЕксельКопированием("СоставБюджета2",иКолонка,мПоиска[0]);
		//	//	ПроссумируемЕксель("СоставБюджета2",иКолонка,мПоиска[0]);
		//	//КонецЕсли;
		//	//// Непрямым
		//	//ЗаполнимРодительскуюТаблицуКопированием("СоставБюджета7","СоставБюджета3",иКолонка,_СтатьяОборотов);
		//	//мПоиска = Объект["СоставБюджета3"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СтатьяОборотов));
		//	//Если мПоиска.количество() > 0 тогда
		//	//	//ПроссумируемЕксель("СоставБюджета3",иКолонка + "1" ,мПоиска[0]);
		//	//	//ПроссумируемЕксельКопированием("СоставБюджета3",иКолонка,мПоиска[0]);
		//	//	ПроссумируемЕксель("СоставБюджета3",иКолонка,мПоиска[0]);
		//	//КонецЕсли;
		//	
		//КонецЕсли;		
		
		
		//Если ОбработатьНовуюСтрокуСумму тогда
		//	// обработаем новую статью
		//	
		//	сПоиска = Объект[ТабЧ].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", сФормы.СтатьяОборотов));
		//	Если сПоиска.Количество() > 0 тогда
		//	  сПоиска[0][ИмяТекКолонки] = сПоиска[0][ИмяТекКолонки] + abs(сФормы.Сумма);
		//	  ПроссумируемЕксель(ТабЧ,иКолонка,сПоиска[0]);
		//	КонецЕсли;
		//  
		//  
		//  
		//КонецЕсли;	 
		
		
		
		
		
	КонецЕсли;	
	
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнениеЛогистики(Команда)
	// Вставить содержимое обработчика.
	
	//Заполнение Логистики
    Если Объект.ЦФО.Лео_ЦЗ = "ЛОГИСТИКА_ГП" тогда  //ОП ЛОГИСТИКА_ГП
		иначе
		возврат;
	КонецЕсли;
	
	ЗаполнениеЛогистикиНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеЛогистикиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.Контрагент,
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.Процент,
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.Сценарий,
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.Месяц,
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.БезНДС,
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.СНДС,
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.Канал
		//|ИЗ
		//|	Документ.Лео_РасходыНаДоставкуПоКлиентам.ТЧ КАК Лео_РасходыНаДоставкуПоКлиентамТЧ
		//|ГДЕ
		//|	Лео_РасходыНаДоставкуПоКлиентамТЧ.Ссылка.Проведен";
		
		
		    "ВЫБРАТЬ
		    |	Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Канал,
		    |	Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.абс_КодБюджетнойСтатьи,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет1) КАК СуммаБюджет1,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет2) КАК СуммаБюджет2,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет3) КАК СуммаБюджет3,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет4) КАК СуммаБюджет4,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет5) КАК СуммаБюджет5,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет6) КАК СуммаБюджет6,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет7) КАК СуммаБюджет7,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет8) КАК СуммаБюджет8,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет9) КАК СуммаБюджет9,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет10) КАК СуммаБюджет10,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет11) КАК СуммаБюджет11,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаБюджет12) КАК СуммаБюджет12,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма1) КАК Сумма1,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма2) КАК Сумма2,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма3) КАК Сумма3,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма4) КАК Сумма4,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма5) КАК Сумма5,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма6) КАК Сумма6,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма7) КАК Сумма7,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма8) КАК Сумма8,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма9) КАК Сумма9,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма10) КАК Сумма10,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма11) КАК Сумма11,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Сумма12) КАК Сумма12,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт1) КАК СуммаПрФакт1,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт2) КАК СуммаПрФакт2,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт3) КАК СуммаПрФакт3,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт4) КАК СуммаПрФакт4,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт5) КАК СуммаПрФакт5,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт6) КАК СуммаПрФакт6,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт7) КАК СуммаПрФакт7,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт8) КАК СуммаПрФакт8,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт9) КАК СуммаПрФакт9,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт10) КАК СуммаПрФакт10,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт11) КАК СуммаПрФакт11,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаПрФакт12) КАК СуммаПрФакт12,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт1) КАК СуммаФакт1,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт2) КАК СуммаФакт2,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт3) КАК СуммаФакт3,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт4) КАК СуммаФакт4,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт5) КАК СуммаФакт5,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт6) КАК СуммаФакт6,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт7) КАК СуммаФакт7,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт8) КАК СуммаФакт8,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт9) КАК СуммаФакт9,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт10) КАК СуммаФакт10,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт11) КАК СуммаФакт11,
		    |	СУММА(Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.СуммаФакт12) КАК СуммаФакт12
		    |ИЗ
		    |	Документ.Лео_РасходыНаДоставкуПоКлиентам.СоставБюджета7 КАК Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7
		    |ГДЕ
		    |	Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Ссылка.Проведен 
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.Канал,
		    |	Лео_РасходыНаДоставкуПоКлиентамСоставБюджета7.абс_КодБюджетнойСтатьи"
		 ;
		
		
		

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведите документ: ""Лео Расходы на доставку по клиентам""");
		возврат;
	иначе
		ТЗлогистика = Результат.Выгрузить();		
	КонецЕсли;
	
	 //ТЗ_СоставБюджета7 = Объект.СоставБюджета7.Выгрузить();
	 //мКодСтатьи = ТЗ_СоставБюджета7.НайтиСтроки(Новый Структура("РодительИтогСтатьи",Ложь)); 
	 //ТЗкодСтатьи = Новый ТаблицаЗначений;
	 //ТЗкодСтатьи.Колонки.Добавить("абс_КодБюджетнойСтатьи");
	 //ТЗкодСтатьи.Колонки.Добавить("Постфикс");
	 //Для каждого тт из мКодСтатьи цикл
	 //КонецЦикла;
	 
	 ОчиститьДанныеЛогистики();
	 
	 
	 Для каждого ии из ТЗлогистика цикл
		 
		 
		 Если ии.Канал = "ФАРМ" тогда
			 
		 Если ии.абс_КодБюджетнойСтатьи = "ЛОГ_ОПЕР" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ОПЕР_ГП_1");
		 ИначеЕсли ии.абс_КодБюджетнойСтатьи = "ЛОГ_ТРАНС" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ТРАНС_ФАРМ_1");
		 КонецЕсли;	 
			
		ИначеЕсли ии.Канал = "МТ" тогда
			
		 Если ии.абс_КодБюджетнойСтатьи = "ЛОГ_ОПЕР" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ОПЕР_ГП_1");
		 ИначеЕсли ии.абс_КодБюджетнойСтатьи = "ЛОГ_ТРАНС" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ТРАНС_МТ_1");
		 КонецЕсли;	 
			 
		 ИначеЕсли ии.Канал = "ИНД" тогда

		 Если ии.абс_КодБюджетнойСтатьи = "ЛОГ_ОПЕР" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ОПЕР_ГП_1");
		 ИначеЕсли ии.абс_КодБюджетнойСтатьи = "ЛОГ_ТРАНС" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ТРАНС_ИНД_1");
		 КонецЕсли;	 
			 
		 ИначеЕсли ии.Канал = "КП" тогда
			 
		 Если ии.абс_КодБюджетнойСтатьи = "ЛОГ_ОПЕР" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ОПЕР_ГП_1");
		 ИначеЕсли ии.абс_КодБюджетнойСтатьи = "ЛОГ_ТРАНС" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ТРАНС_КП_1");
		 КонецЕсли;	 
			 
		 ИначеЕсли ии.Канал = "ЭКСП" тогда
			 
		 Если ии.абс_КодБюджетнойСтатьи = "ЛОГ_ОПЕР" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ОПЕР_ГП_1");
		 ИначеЕсли ии.абс_КодБюджетнойСтатьи = "ЛОГ_ТРАНС" тогда
            ЗаполнитьЛогистикуРасходыНадоставку(ии,"ЛОГ_ТРАНС_ЭКСП_1");
		 КонецЕсли;	 
			 
		 КонецЕсли;
		 
		 
		 
		 
			//мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ОПЕР_ГП_1"));
			//Если мПоиска.количество() > 0 тогда
			//	
			//	мПрефикс = Месяц(ии.Месяц);
			//	Сумма = (ии.СНДС/100)* 3;
			//	мПоиска[0]["Сумма" + сокрлп(мПрефикс)]        = мПоиска[0]["Сумма" + сокрлп(мПрефикс)]       + Сумма;
			//	мПоиска[0]["СуммаБюджет" + сокрлп(мПрефикс)]  = мПоиска[0]["СуммаБюджет" + сокрлп(мПрефикс)] + Сумма;
			//	//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			//КонецЕсли;
		 
		 
		 
		КонецЦикла; 
		
		ЗаполнимТаблицуСерверПересчет("СоставБюджета7");		
        ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
		
		ЗаполнимИтоговуюТаблицу("СоставБюджета","СоставБюджета7",Истина);
		ЗаполнимТаблицуСервер("СоставБюджета",Истина);                 
	
КонецПроцедуры
	



&НаСервере
Процедура ЗаполнимТаблицуСерверПересчет(ТабЧ)
	
	
	
	
	//ТабЧитог = Объект[ТабЧитог];
	ТабЧ = Объект[ТабЧ];
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
	КонецЦикла;
	
		ТЗ.Колонки.Добавить("Факт1");
		ТЗ.Колонки.Добавить("Факт2");
		ТЗ.Колонки.Добавить("Факт3");
	
	
	
	Для каждого сс из ТабЧ цикл
		
		//Если НЕ Исключениие  тогда
		//	Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
		//		продолжить;
		//	КонецЕсли;
		//КонецЕсли;
		
		стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(стр,сс);
		
		
		
		//// 	("ФАРМ_ТО_без НДС");
		////  	("МТ_ТО_без НДС");
		//Если сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "ФАРМ_ТО_без НДС" или
		//	сс.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи = "МТ_ТО_без НДС" тогда
		//	Для Н = 1 По 12 Цикл
		//   	 стр["СуммаБюджет" + Н] = сс["СуммаБезНДС" + Н];
		//	КонецЦикла;		
		//КонецЕсли;	  
		
	КонецЦикла;
	
	ТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
				
		КонецЕсли;
		
	КонецЦикла;	
	
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("РодительИтогСтатьи");
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;	
	
	
		ТЗ.Колонки.Добавить("Факт1");
		ТЗ.Колонки.Добавить("Факт2");
		ТЗ.Колонки.Добавить("Факт3");
	
	
	Для каждого сс из ТабЧ цикл
		стр = ТЗ.Добавить();
		Если сс.Итоговая тогда продолжить КонецЕсли;
		ЗаполнитьЗначенияСвойств(стр,сс);
	КонецЦикла;
	
	ТЗ.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧ.НайтиСтроки(Новый Структура("ИндексСтатьи,Итоговая",сс.РодительИтогСтатьи,Истина));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = мСтрок[0]["Факт1"]   + сс["Факт1"];
				мСтрок[0]["Факт2"]   = мСтрок[0]["Факт2"]   + сс["Факт2"];
				мСтрок[0]["Факт3"]   = мСтрок[0]["Факт3"]   + сс["Факт3"];
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры


	
	
 
&НаСервере 
Процедура ЗаполнитьЛогистикуРасходыНадоставку(ии,КодСтатьяЛогистика)
	

			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",КодСтатьяЛогистика));
			Если мПоиска.количество() > 0 тогда
				
				//мПрефикс = Месяц(ии.Месяц);
				//Процент = ии.Процент * 100;
				//Сумма = (ии.СНДС/100)* Процент;
				
				Для сч = 1 по 12 цикл
				
				мПоиска[0]["Сумма" + сокрлп(сч)]        = мПоиска[0]["Сумма" + сокрлп(сч)]       +  ии["Сумма" + сокрлп(сч)];
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = мПоиска[0]["СуммаБюджет" + сокрлп(сч)] +  ии["СуммаБюджет" + сокрлп(сч)];
				//ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
				КонецЦикла;
				
				
				
			КонецЕсли;
	 
	 
 КонецПроцедуры
	 

&НаСервере 
Процедура ОчиститьДанныеЛогистики()
	

			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ОПЕР_ГП_1"));
			Если мПоиска.количество() > 0 тогда
				Для сч = 1 по 12 цикл
				мПоиска[0]["Сумма" + сокрлп(сч)]        = 0;
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = 0;
				КонецЦикла;
			КонецЕсли;
			
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ТРАНС_ФАРМ_1"));
			Если мПоиска.количество() > 0 тогда
				Для сч = 1 по 12 цикл
				мПоиска[0]["Сумма" + сокрлп(сч)]        = 0;
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = 0;
				КонецЦикла;
			КонецЕсли;
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ТРАНС_МТ_1"));
			Если мПоиска.количество() > 0 тогда
				Для сч = 1 по 12 цикл
				мПоиска[0]["Сумма" + сокрлп(сч)]        = 0;
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = 0;
				КонецЦикла;
			КонецЕсли;
			
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ТРАНС_ИНД_1"));
			Если мПоиска.количество() > 0 тогда
				Для сч = 1 по 12 цикл
				мПоиска[0]["Сумма" + сокрлп(сч)]        = 0;
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = 0;
				КонецЦикла;
			КонецЕсли;
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ТРАНС_КП_1"));
			Если мПоиска.количество() > 0 тогда
				Для сч = 1 по 12 цикл
				мПоиска[0]["Сумма" + сокрлп(сч)]        = 0;
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = 0;
				КонецЦикла;
			КонецЕсли;
			
			
			мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи","ЛОГ_ТРАНС_ЭКСП_1"));
			Если мПоиска.количество() > 0 тогда
				Для сч = 1 по 12 цикл
				мПоиска[0]["Сумма" + сокрлп(сч)]        = 0;
				мПоиска[0]["СуммаБюджет" + сокрлп(сч)]  = 0;
				КонецЦикла;
			КонецЕсли;
			
			
 КонецПроцедуры


&НаКлиенте
 Процедура ЗаполнитьБренды(Команда)
	 // Вставить содержимое обработчика.
	 ЗаполнитьБрендыСервер();
	 	 
 КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьБрендыСервер() 
	
   ТабЧ = Объект["СоставБюджета6"];	
	
    ТЗ = Объект.СоставБюджета7.Выгрузить();
   
   
	ТЗ_БезНДС = ТЗ.Скопировать();
	Для каждого сс из ТЗ_БезНДС цикл
		ПересчитатьБезНДССтрокуНаСервере(сс);
	КонецЦикла;
   
   
	ТЗ.Свернуть("Бренд",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	
	ТЗ_БезНДС.Свернуть("Бренд",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");

	
	
	// С_НДС
	Для каждого сс из ТЗ цикл
		
		
		СтатьяБренд = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(сокрлп(сс.Бренд)+"_СНДС",1);
		
		мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяБренд));
		
			
			
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = сс["Факт1"];
				мСтрок[0]["Факт2"]   = сс["Факт2"];
				мСтрок[0]["Факт3"]   = сс["Факт3"];
				
		КонецЕсли;
		
	КонецЦикла;	
	
	
	// Без_НДС
	Для каждого сс из ТЗ_БезНДС цикл
		
		
		СтатьяБренд = Справочники.СтатьиОборотовПоБюджетам.НайтиПоНаименованию(сокрлп(сс.Бренд)+"_БезНДС",1);
		
		мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",СтатьяБренд));
		
			
			
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
				мСтрок[0]["Факт1"] = 0;
				мСтрок[0]["Факт2"] = 0;
				мСтрок[0]["Факт3"] = 0;
			
			
			// Заполнение	
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
				
			КонецЦикла;	
			
				мСтрок[0]["Факт1"]   = сс["Факт1"];
				мСтрок[0]["Факт2"]   = сс["Факт2"];
				мСтрок[0]["Факт3"]   = сс["Факт3"];
				
		КонецЕсли;
		
	КонецЦикла;	
	
	
	
	
		ЗаполнимТаблицуСерверПересчет("СоставБюджета6");		
        ЗаполнимТаблицуСервер("СоставБюджета6",Истина);
		
		
		
	
КонецПроцедуры	

&НаКлиенте
Процедура ТМПриИзменении(Элемент)
	
	
	УстановитьВидимостьТМ(объект.ТМ);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьТМ(ВидимостьТМ)
	
	Элементы.СтраницаТМ.Видимость  = ВидимостьТМ;
	//Элементы.СтраницаТМБезНДС.Видимость  = ВидимостьТМ;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьНепрямым(ВидимостьНепрямым)
	
	Элементы.СтраницаНепрямым.Видимость  = ВидимостьНепрямым;
	//Элементы.СтраницаНепрямымБезНДС.Видимость  = ВидимостьНепрямым;
	
КонецПроцедуры


&НаКлиенте
Процедура НепрямымПриИзменении(Элемент)
	
	УстановитьВидимостьНепрямым(объект.Непрямым);
	
КонецПроцедуры


&НаКлиенте
Процедура ФОТсвернутьПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
    СоставБюджетаФОТ(Объект.ФОТсвернуть);

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьФАКТ(Команда)
	// Вставить содержимое обработчика.
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лео_ОборотыБюджетовОбороты.Сценарий,
	|	Лео_ОборотыБюджетовОбороты.ЦФО,
	|	Лео_ОборотыБюджетовОбороты.СтатьяОборотов,
	|	Лео_ОборотыБюджетовОбороты.Расшифровка,
	|	СУММА(Лео_ОборотыБюджетовОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(Лео_ОборотыБюджетовОбороты.СуммаУпрОборот) КАК СуммаУпрОборот,
	|	НАЧАЛОПЕРИОДА(Лео_ОборотыБюджетовОбороты.Регистратор.Лео_ПериодРасхода, МЕСЯЦ) КАК Период,
	|	СУММА(Лео_ОборотыБюджетовОбороты.СуммаСценарияОборот) КАК СуммаСценарияОборот,
	|	СУММА(Лео_ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот) КАК СуммаУпрБезНДСОборот
	|ИЗ
	|	РегистрНакопления.Лео_ОборотыБюджетов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ЦФО = &ЦФО
	|				И Сценарий = &Сценарий) КАК Лео_ОборотыБюджетовОбороты
	|ГДЕ
	|	Лео_ОборотыБюджетовОбороты.Регистратор ССЫЛКА Документ.ЗаявкаНаРасходованиеСредств
	|	И Лео_ОборотыБюджетовОбороты.Регистратор.Лео_ПериодРасхода МЕЖДУ &Период1 И &Период2
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Лео_ОборотыБюджетовОбороты.Регистратор.Лео_ПериодРасхода, МЕСЯЦ),
	|	Лео_ОборотыБюджетовОбороты.Сценарий,
	|	Лео_ОборотыБюджетовОбороты.ЦФО,
	|	Лео_ОборотыБюджетовОбороты.СтатьяОборотов,
	|	Лео_ОборотыБюджетовОбороты.Расшифровка";
	
	Запрос.УстановитьПараметр("Сценарий", Справочники.СценарииПланирования.БухгалтерскийФакт);
	Запрос.УстановитьПараметр("ЦФО", Объект.ЦФО);
	//Запрос.УстановитьПараметр("Период1",  НачалоГода(Объект.ДатаПланирования));
	//Запрос.УстановитьПараметр("Период2",  КонецГода(Объект.ДатаПланирования));
	
	//_ТекДата = ТекущаяДата();
	_ТекДата = Объект.ДатаУтверждения;
	
	
	//Запрос.УстановитьПараметр("Период1",  Новый Граница(НачалоДня(Объект.ДатаПланирования), ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("Период2",  Новый Граница(КонецДня(Объект.ДатаПланирования), ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("Период1",  НачалоМесяца(_ТекДата)); // прошлый месяц
	Запрос.УстановитьПараметр("Период2",  КонецМесяца(_ТекДата));
	
	
	
	Результат = Запрос.Выполнить();
	
	
	// ЕстьИзменения = Ложь;
	
	
	Если Результат.Пустой() тогда
		возврат;
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	// С НДС	
		
		_СттатьяОборотов = ?(ВыборкаДетальныеЗаписи.Расшифровка = Справочники.Лео_СтатьиОборотовРасшифровка.ПустаяСсылка(),ВыборкаДетальныеЗаписи.СтатьяОборотов,ВыборкаДетальныеЗаписи.Расшифровка);	
		мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СттатьяОборотов));	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
			Если мПоиска.Количество() = 0 тогда	
				_СттатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов;	
				мПоиска = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СттатьяОборотов));	
			КонецЕсли;	
		КонецЕсли;
		
		
		
		ЭтоРасшифровка = Ложь;
		Если ТипЗнч(ВыборкаДетальныеЗаписи.СтатьяОборотов) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			//РодСтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
			РодСтатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов.Лео_РодительскаяСтатья;
			Если РодСтатьяОборотов.пустая() тогда РодСтатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов конецесли;
		иначе // Лео_СтатьиОборотовРасшифровка
			РодСтатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов.СтатьяОборотов;
			ЭтоРасшифровка = Истина;
		КонецЕсли;
		
		
		
		
		Если мПоиска.Количество() > 0 тогда
			
			// ПредФакт
			
			мПоиска[0]["СуммаПрФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)] =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
			//мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)]   =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
			
			ТекКолонка = "СуммаПрФакт" + Месяц(ВыборкаДетальныеЗаписи.Период);
			
			
			
			Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,РодСтатьяОборотов);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент("СоставБюджета7",ТекКолонка,РодСтатьяОборотов);
				
				
			иначе // Остальные
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				
				
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска1 = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска1.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска1[0]);
				_мПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
			
			
			
			
			// Факт
			
			мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)] =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
			//мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)]   =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
			
			ТекКолонка = "СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период);
			
			
			
			Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,РодСтатьяОборотов);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент("СоставБюджета7",ТекКолонка,РодСтатьяОборотов);
				
			иначе // Остальные
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				
				
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мПоиска1 = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мПоиска1.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска1[0]);
				_мПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
			КонецЕсли;
			
		КонецЕсли;	
		
		
		
		
		
		// Расшифровка
		Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
			
			мПоиска22 = Объект["СоставБюджета6"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",ВыборкаДетальныеЗаписи.Расшифровка));
			
			Если мПоиска22.Количество() > 0 тогда
				
				// ПредФакт
				мПоиска22[0]["СуммаПрФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)] =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
				//мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)]   =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
				
				ТекКолонка = "СуммаПрФакт" + Месяц(ВыборкаДетальныеЗаписи.Период);
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент("СоставБюджета7",ТекКолонка,РодСтатьяОборотов);
				Если мПоиска22.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета6",ТекКолонка,мПоиска22[0]);
				КонецЕсли;
				
				ПроссумируемЕксельБезРодителя("СоставБюджета6",ТекКолонка,мПоиска22[0],Ложь);
				
				
				//ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				//мПоиска1 = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				//Если мПоиска1.количество() > 0 тогда
				//	ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска1[0]);
				//	_мПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
				//КонецЕсли;
				
				
				
				// Факт
				
				мПоиска22[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)] =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
				//мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)]   =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
				
				ТекКолонка = "СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период);
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент("СоставБюджета7",ТекКолонка,РодСтатьяОборотов);
				Если мПоиска22.количество() > 0 тогда
					ПроссумируемЕксель("СоставБюджета6",ТекКолонка,мПоиска22[0]);
				КонецЕсли;
				
				ПроссумируемЕксельБезРодителя("СоставБюджета6",ТекКолонка,мПоиска22[0],Ложь);
				
				
				//ЗаполнимРодительскуюТаблицу("СоставБюджета7",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
				//мПоиска1 = Объект["СоставБюджета7"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
				//Если мПоиска1.количество() > 0 тогда
				//	ПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска1[0]);
				//	_мПроссумируемЕксель("СоставБюджета7",ТекКолонка,мПоиска[0]);
				//КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;	
		
		
	///////////////////////////////////////////////////////////////////////////////////////////////////
	// Без НДС	
		
		_СттатьяОборотов = ?(ВыборкаДетальныеЗаписи.Расшифровка = Справочники.Лео_СтатьиОборотовРасшифровка.ПустаяСсылка(),ВыборкаДетальныеЗаписи.СтатьяОборотов,ВыборкаДетальныеЗаписи.Расшифровка);	
		мбПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СттатьяОборотов));	
		
		
		Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
			Если мбПоиска.Количество() = 0 тогда	
				_СттатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов;	
				мбПоиска = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_СттатьяОборотов));	
			КонецЕсли;	
		КонецЕсли;
		
		
		
		ЭтоРасшифровка = Ложь;
		Если ТипЗнч(ВыборкаДетальныеЗаписи.СтатьяОборотов) = Тип("СправочникСсылка.СтатьиОборотовПоБюджетам") тогда
			//РодСтатьяОборотов = ПолучитьРодителькуюСтатьюОборотов(ТекДанные.СтатьяОборотовПоБюджетам);
			РодСтатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов.Лео_РодительскаяСтатья;
			Если РодСтатьяОборотов.пустая() тогда РодСтатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов конецесли;
		иначе // Лео_СтатьиОборотовРасшифровка
			РодСтатьяОборотов = ВыборкаДетальныеЗаписи.СтатьяОборотов.СтатьяОборотов;
			ЭтоРасшифровка = Истина;
		КонецЕсли;
		
		
		
		
		Если мбПоиска.Количество() > 0 тогда
			
			// ПредФакт
			
			мбПоиска[0]["СуммаПрФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)] =  - ВыборкаДетальныеЗаписи.СуммаУпрБезНДСОборот;
			//мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)]   =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
			
			ТекКолонка = "СуммаПрФакт" + Месяц(ВыборкаДетальныеЗаписи.Период);
			
			
			
			Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,РодСтатьяОборотов);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент("СоставБюджета10",ТекКолонка,РодСтатьяОборотов);
				
				
			иначе // Остальные
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент("СоставБюджета10",ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				
				
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мбПоиска1 = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мбПоиска1.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мбПоиска1[0]);
				_мПроссумируемЕксель("СоставБюджета10",ТекКолонка,мбПоиска[0]);
			КонецЕсли;
			
			
			
			
			
			// Факт
			
			мбПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)] =  - ВыборкаДетальныеЗаписи.СуммаУпрБезНДСОборот;
			//мПоиска[0]["СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период)]   =  - ВыборкаДетальныеЗаписи.СуммаУпрОборот;
			
			ТекКолонка = "СуммаФакт" + Месяц(ВыборкаДетальныеЗаписи.Период);
			
			
			
			Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатация(ТабЧ,ТекКолонка,РодСтатьяОборотов);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовЭксплуатацияКлиент("СоставБюджета10",ТекКолонка,РодСтатьяОборотов);
				
			иначе // Остальные
				
				//ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотов(ТабЧ,ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				ТекЗначПоСтатье = ПолучитьСвернутоеЗначениеПоСтатьеОборотовКлиент("СоставБюджета10",ТекКолонка,РодСтатьяОборотов,ЭтоРасшифровка);
				
				
			КонецЕсли;
			
			
			ЗаполнимРодительскуюТаблицу("СоставБюджета10",ТекКолонка,РодСтатьяОборотов,ТекЗначПоСтатье);
			мбПоиска1 = Объект["СоставБюджета10"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",РодСтатьяОборотов));
			Если мбПоиска1.количество() > 0 тогда
				ПроссумируемЕксель("СоставБюджета10",ТекКолонка,мбПоиска1[0]);
				_мПроссумируемЕксель("СоставБюджета10",ТекКолонка,мбПоиска[0]);
			КонецЕсли;
			
		КонецЕсли;	
		
		
		
		
	КонецЦикла;
	
	//Если ЕстьИзменения тогда
	//об.Записать();
	//КонецЕсли;
	
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или Объект.ЦФО.Лео_ЦЗ = "ИТС" тогда // Эксплуатация, ИТС
		ЗаполнимРасшифровкуДляИТС("СоставБюджета6","СоставБюджета7");
		ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
	КонецЕсли;	
	
	
	// С НДС
	ЗаполнимИтоговуюТаблицу("СоставБюджета","СоставБюджета7",Истина);
	ЗаполнимТаблицуСервер("СоставБюджета",Истина);
	
	
	// Без НДС
	ЗаполнимИтоговуюТаблицу("СоставБюджета9","СоставБюджета10",Истина);
	ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнимРасшифровкуДляИТС(ТабИсточник,ТабПриемник)
	
	
	ТабИ = Объект[ТабИсточник];
	
	ПромТЗ = ТабИ.Выгрузить(); 
	ПромТЗ.Очистить();
	Для каждого сс из ТабИ цикл
		Если НЕ сс.Итоговая тогда продолжить КонецЕсли;
		оо = ПромТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(оо,сс);
		
	КонецЦикла;	
	
	//ПромТЗ.Свернуть("СтатьяОборотовПоБюджетам",
	//"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	//|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	//|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	//|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//
	////|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	////|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	////|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	//
	//|");
	
	
	
	
	
	ТабЧ = Объект[ТабПриемник];
	
	Для каждого сс из ПромТЗ цикл
		//Если НЕ ЗначениеЗаполнено(сс.СтавкаНДС) тогда Продолжить конецесли;

			СтатьяПоиска = сс.СтатьяОборотовПоБюджетам;
		
		
		
      мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",СтатьяПоиска,Ложь));
	  Если мСтрок.Количество() > 0 тогда 
      //ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  
		   Для сч = 1 по 12 цикл
	  
			   мСтрок[0]["СуммаБюджет"+сч] = сс["СуммаБюджет"+сч];
			   мСтрок[0]["Сумма"+сч]       = сс["Сумма"+сч];
			   мСтрок[0]["СуммаПрФакт"+сч] = сс["СуммаПрФакт"+сч];
			   мСтрок[0]["СуммаФакт"+сч]   = сс["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	КонецЦикла;	
	
	
	// Итоговые
	иТаб = ТабЧ.Выгрузить();
	
	иТаб.Свернуть("РодительИтогСтатьи,Итоговая",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	
	//|СуммаБюджетБезНДС1,СуммаБюджетБезНДС2,СуммаБюджетБезНДС3,СуммаБюджетБезНДС4,СуммаБюджетБезНДС5,СуммаБюджетБезНДС6,СуммаБюджетБезНДС7,СуммаБюджетБезНДС8,СуммаБюджетБезНДС9,СуммаБюджетБезНДС10,СуммаБюджетБезНДС11,СуммаБюджетБезНДС12,
	|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|СуммаПрФактБезНДС1,СуммаПрФактБезНДС2,СуммаПрФактБезНДС3,СуммаПрФактБезНДС4,СуммаПрФактБезНДС5,СуммаПрФактБезНДС6,СуммаПрФактБезНДС7,СуммаПрФактБезНДС8,СуммаПрФактБезНДС9,СуммаПрФактБезНДС10,СуммаПрФактБезНДС11,СуммаПрФактБезНДС12,
	//|СуммаФактБезНДС1,СуммаФактБезНДС2,СуммаФактБезНДС3,СуммаФактБезНДС4,СуммаФактБезНДС5,СуммаФактБезНДС6,СуммаФактБезНДС7,СуммаФактБезНДС8,СуммаФактБезНДС9,СуммаФактБезНДС10,СуммаФактБезНДС11,СуммаФактБезНДС12
	
	|");
	
	
	Для каждого рр из иТаб цикл
		Если рр.Итоговая тогда продолжить КонецЕсли;
	
	
      мПоиск = ТабЧ.НайтиСтроки(Новый Структура("РодительИтогСтатьи,Итоговая",рр.РодительИтогСтатьи,Истина));
	  Если мПоиск.Количество() > 0 тогда 
      //ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	  
		   Для сч = 1 по 12 цикл
	  
			   мПоиск[0]["СуммаБюджет"+сч] = рр["СуммаБюджет"+сч];
			   мПоиск[0]["Сумма"+сч]       = рр["Сумма"+сч];
			   мПоиск[0]["СуммаПрФакт"+сч] = рр["СуммаПрФакт"+сч];
			   мПоиск[0]["СуммаФакт"+сч]   = рр["СуммаФакт"+сч];
			   
	  
	       КонецЦикла
	  
	  КонецЕсли;
	
	
	КонецЦикла;
	
	
	//мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",СтатьяОборотов,Регион));
	//мПромТЗ = ПромТЗ.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Регион",СтатьяОборотов,Регион));
	
	
	//	
	//	//Если мСтрок.Количество() > 0 тогда
	//	//	
	//	//мСтрок[0][Колонка] = мСтрок[0][Колонка] + ТекЗначение;	
	//	//
	//	//КонецЕсли;
	//
	//Если мСтрок.Количество() > 0 и мПромТЗ.Количество() > 0 тогда
	//Для каждого сс из ПромТЗ цикл
	//	мСтрок = ТабЧ.НайтиСтроки(Новый Структура("СтатьяОборотовИзРасшифровки,Регион",сс.СтатьяОборотовПоБюджетам,сс.Регион));
	//	
	//	Если мСтрок.Количество() > 0 тогда
	//		ЗаполнитьЗначенияСвойств(мСтрок[0],сс);
	//	КонецЕсли;		
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры

	
	
	
	
	
	
	

&НаСервере
Функция ПолучитьСтатьюОборотовИЗСоответствия(ЦФО,СтатьяОборотовПоБюджетам)
        _статья = неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
		|ИЗ
		|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		|ГДЕ
		|	абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетамРесурс = &СтатьяОборотовПоБюджетамРесурс
		|	И абс_СтатьиБюджетаПоЦФО.Раздел = ""_СоставБюджета""
		|	И абс_СтатьиБюджетаПоЦФО.РазделРесурс = ""_СоставБюджета""";

	//Запрос.УстановитьПараметр("Раздел", "_СоставБюджета");
	//Запрос.УстановитьПараметр("Раздел", "_СоставБюджета");
	Запрос.УстановитьПараметр("СтатьяОборотовПоБюджетамРесурс", СтатьяОборотовПоБюджетам);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);

	Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() тогда
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	_статья = ВыборкаДетальныеЗаписи.СтатьяОборотовПоБюджетам;
	Конецесли;
			
		возврат _статья;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьБДР_Старый(Команда)
	// Вставить содержимое обработчика.
	
	Для каждого сс из Объект["СоставБюджета"] цикл
		
		мПоиска = Объект["СоставБюджета17"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",сс.СтатьяОборотовПоБюджетам));
		
		Если мПоиска.Количество() > 0 тогда
			Если мПоиска[0].Итоговая тогда продолжить КонецЕсли;
			ЗаполнитьПоказателиДаннымиОтчетПериодКлиент(мПоиска[0],сс);
			
		иначе // ищем соответствие в регистре абс_СтатьиБюджетаПоЦФО
			
			//сДанных = РегистрыСведений.абс_СтатьиБюджетаПоЦФО.ПолучитьПоследнее(Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Раздел",Объект.ЦФО,сс.СтатьяОборотовПоБюджетам,"_СоставБюджета"));
			_Статья = ПолучитьСтатьюОборотовИЗСоответствия(Объект.ЦФО,сс.СтатьяОборотовПоБюджетам);
			Если _Статья <> неопределено тогда
				мПоиска = Объект["СоставБюджета17"].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",_Статья));
				Если мПоиска.Количество() > 0 тогда
					ЗаполнитьПоказателиДаннымиОтчетПериодКлиент(мПоиска[0],сс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	// Итоговые строки
	ТЗит = Объект["СоставБюджета17"];
    ЗаполнитьИтоговыеСтрокиВсе("СоставБюджета17",ТЗит, Истина);
	
    ЗаполнитьЗакладкуФинРезOLD("СоставБюджета17");	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИтоговыеСтрокиВсе(ТабПрием,ТЗит,Выгружать)
	
	НужноПовторить = Ложь;
	
	Если Выгружать тогда
	ТЗит = ТЗит.Выгрузить();
	ТЗпром = ТЗит.СкопироватьКолонки();
	КонецЕсли;
	
	
	ТЗит.Свернуть("РодительИтогСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|,Факт1,Факт2,Факт3
	|,ГодовойБюджет,ГодовойПрогноз,ГодовойОтклонение
	|,БюджетМесяц,ПрогнозМесяц,ОтклоненияМесяц
	|");
	
	
	ТЗит.Сортировать("РодительИтогСтатьи Убыв");
	Для каждого сс из ТЗит цикл
	
		мПоиска = Объект[ТабПрием].НайтиСтроки(Новый Структура("ИндексСтатьи",сс.РодительИтогСтатьи));
		Если мПоиска.Количество() > 0 тогда
			 ЗаполнитьПоказателиДаннымиОтчетПериод(мПоиска[0],сс);
			 
			 
		     мПоискаР = Объект[ТабПрием].НайтиСтроки(Новый Структура("ИндексСтатьи",мПоиска[0].РодительИтогСтатьи));
		     Если мПоискаР.Количество() > 0 тогда
			     НужноПовторить = Истина;
				 нСтр = ТЗпром.Добавить();
				 ЗаполнитьЗначенияСвойств(нСтр,мПоиска[0]);
				 
	         КонецЕсли;
	    КонецЕсли;
	КонецЦикла;

	Если НужноПовторить тогда
      ЗаполнитьИтоговыеСтрокиВсе(ТабПрием,ТЗпром,Ложь);		
	Конецесли;

КонецПроцедуры



&НаКлиенте
Функция ПолучитьДокПоЦФО(ЦФО)
	
    дЦФО = Документы.Лео_ВводБюджета.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лео_ВводБюджета.Ссылка как Док
		|ИЗ
		|	Документ.Лео_ВводБюджета КАК Лео_ВводБюджета
		|ГДЕ
		|	Лео_ВводБюджета.ЦФО = &ЦФО
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лео_ВводБюджета.Дата УБЫВ";

	Запрос.УстановитьПараметр("ЦФО", ЦФО);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		   дЦФО  = ВыборкаДетальныеЗаписи.Док;
	КонецЦикла;

	возврат дЦФО;
	
КонецФункции	




&НаКлиенте
Процедура ЗаполнитьФОТпоЦФО(Команда)
	// Вставить содержимое обработчика.
	
	Объект.ФОТ_ЦФО.Очистить();
	
	ФОТ_ЦФО = Объект.ФОТ_ЦФО;
	
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ИТ");
	стр.Префикс = СокрЛП(стр.ЦФО.Лео_ЦЗ)+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	// ПРИЕМ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ПРИЕМНАЯ");
	стр.Префикс = СокрЛП("ПРИЕМ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ПЛАН_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ПЛАН");
	стр.Префикс = СокрЛП(стр.ЦФО.Лео_ЦЗ)+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//СБ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","СБ");
	стр.Префикс = СокрЛП(стр.ЦФО.Лео_ЦЗ)+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//МАР_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","PR");
	стр.Префикс = СокрЛП("МАР")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ЛОГ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЛОГИСТИКА_ГП");
	стр.Префикс = СокрЛП("ЛОГ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ЗД_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЭКСПЛУАТАЦИЯ");
	стр.Префикс = СокрЛП("ЗД")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ФО_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ФО");
	стр.Префикс = СокрЛП("ФО")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ЮР_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЮО");
	стр.Префикс = СокрЛП("ЮР")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//СНАБ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Снабжение");
	стр.Префикс = СокрЛП("СНАБ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//СП_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","СЛУЖБА ПЕРСОНАЛА");
	стр.Префикс = СокрЛП("СП")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ОКК_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОКК");
	стр.Префикс = СокрЛП("ОКК")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ОТР_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОТР");
	стр.Префикс = СокрЛП("ОТР")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ОРП_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОРП");
	стр.Префикс = СокрЛП("ОРП")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ОГТ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОГТ");
	стр.Префикс = СокрЛП("ОГТ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//БУХ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","БУХ");
	стр.Префикс = СокрЛП("БУХ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//АН_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","АН");
	стр.Префикс = СокрЛП("АН")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//МТ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОРД МТ");
	стр.Префикс = СокрЛП("МТ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ФАРМ_ПрФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОРД ФАРМ");
	стр.Префикс = СокрЛП("ФАРМ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ГУ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОСП (ГУ)");
	стр.Префикс = СокрЛП("ГУ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ЭКС_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ЭО");
	стр.Префикс = СокрЛП("ЭКС")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//ИН_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОСП (ИНД)");
	стр.Префикс = СокрЛП("ИН")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	//КП_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОКП");
	стр.Префикс = СокрЛП("КП")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ОТ_ФСС_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ОТ и ТБ");
	стр.Префикс = СокрЛП("ОТ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ИТС_ФСС_ОП_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","ИТС");
	стр.Префикс = СокрЛП("ИТС")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	//ЦЕХ_ФСС_ОП_1
	стр = ФОТ_ЦФО.Добавить();
	стр.ЦФО = Справочники.Подразделения.НайтиПоРеквизиту("Лео_ЦЗ","Производство");
	стр.Префикс = СокрЛП("ЦЕХ")+"_";
	стр.докЦФО  = ПолучитьДокПоЦФО(стр.ЦФО);
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФОТпоЦФО(Команда)
	// Вставить содержимое обработчика.
	
    ЗагрузитьФОТпоЦФОСервер();	
		
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьФОТпоЦФОСервер()
	// Вставить содержимое обработчика.
	
	
	ТЗ = Объект.СоставБюджета7.Выгрузить();
	ТЧ = Объект.ФОТ_ЦФО;
	Для каждого сс из ТЧ цикл
		Если НЕ сс.Флаг тогда продолжить конецесли;
		
		//мПоиска = ТЗ.НайтиСтроки(Новый Структура("ЦФО",сс.ЦФО));
		мПоиска = Новый Массив;
		
		Для каждого тт из ТЗ цикл
			
		ДлинаПрефикса = СтрДлина(сс.Префикс);	
		Если Лев(тт.абс_КодБюджетнойСтатьи,ДлинаПрефикса + 3) = сс.Префикс + "ФОТ" 
		или	 Лев(тт.абс_КодБюджетнойСтатьи,ДлинаПрефикса + 3) = сс.Префикс + "ФСС"			
			тогда
			мПоиска.Добавить(тт);
		КонецЕсли;	
	    КонецЦикла;	
		
		Если мПоиска.Количество() > 0 тогда
			
			об = сс.докЦФО.ПолучитьОбъект();
			Для каждого тт из мПоиска цикл
				
				цПоиска = об.СоставБюджета7.НайтиСтроки(Новый Структура("абс_КодБюджетнойСтатьи",тт.абс_КодБюджетнойСтатьи));
				
				Если цПоиска.Количество() > 0 тогда
					ЗаполнитьПоказателиСервер(цПоиска[0],тт);
					
				Конецесли;
				
				// осн таб
				оПоиска = об.СоставБюджета.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",тт.СтатьяОборотовПоБюджетам));
				Если оПоиска.Количество() > 0 тогда
					ЗаполнитьПоказателиСервер(оПоиска[0],тт);
					
				Конецесли;
				
				
			КонецЦикла;
			
			ЗаполнимИтоговуюТаблицуБезКода("СоставБюджета",Ложь);
			об.Записать();
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ФОТ обновлен, док: " + сокрлп(об.Ссылка));
			
			
			
			
			
		Конецесли;
	КонецЦикла;	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоказателиСервер(прием, ист)
	
	Для сч = 1 по 12 цикл
	прием["СуммаБюджет" + сч] = ист["СуммаБюджет" + сч];	
	прием["Сумма" + сч]       = ист["Сумма" + сч];	
	прием["СуммаПрФакт" + сч] = ист["СуммаПрФакт" + сч];	
	прием["СуммаФакт" + сч]   = ист["СуммаФакт" + сч];	
	КонецЦикла;
	Для сч = 1 по 3 цикл
	прием["Факт" + сч] = ист["Факт" + сч];	
    КонецЦикла;

	прием["БюджетМесяц"]     = ист["БюджетМесяц"];	
	прием["ПрогнозМесяц"]    = ист["ПрогнозМесяц"];	
	прием["ОтклоненияМесяц"] = ист["ОтклоненияМесяц"];	

	прием["ГодовойБюджет"]     = ист["ГодовойБюджет"];	
	прием["ГодовойПрогноз"]    = ист["ГодовойПрогноз"];	
	прием["ГодовойОтклонение"] = ист["ГодовойОтклонение"];	
	
    прием["Контрагент"] = ист["Контрагент"];


КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагФОТ(Команда)
	Для каждого сс из Объект.ФОТ_ЦФО цикл
	     сс.Флаг = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагФОТ(Команда)
	Для каждого сс из Объект.ФОТ_ЦФО цикл
	     сс.Флаг = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлФОТ(Команда)
	// Вставить содержимое обработчика.
	
	
	Обработка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Лео_ВыборФайлаЕксель");
	ДвоичныеДанные = Обработка.ХранилищеВнешнейОбработки.Получить();
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ИмяФайла);
	
	             
	Обработка1 = ВнешниеОбработки.Создать(ИмяФайла);
	ф = Обработка1.ПолучитьФорму();
	Ф.Лео_ВводБюджета = Объект;
	//Ф.НачСтрока = 54;
	Ф.ОткрытьМодально();
	//ПутьКФайлу = Ф.ПутьКФайлу;	
	//НачСтрока = Ф.НачСтрока;	
	
		
	//ТЗ = ЗаполнитьТЗЕксель(Объект.ЦФО,ПутьКФайлу,Ложь,НачСтрока);
	//ЗаполнитьДокИзЕкселя(Объект.ЦФО,ТЗ,Ложь);
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДокИзЕкселя(ЦФО,ТЗ,ОснБезНДС)
	
	
	Если ТЗ.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные Excel не прочитаны !!!");
		
		возврат;
	Конецесли;	
	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Остальные	
	
	
	Если НЕ ОснБезНДС тогда
          ТабЧ = "СоставБюджета";
          ТабП = "СоставБюджета7";
	иначе
          ТабЧ = "СоставБюджета9";
          ТабП = "СоставБюджета10";
	КонецЕсли;	
	
	
	
	//Об1Док = ДокЛео.ПолучитьОбъект();
	
	
	
	//Очистить показатели
	Для каждого дд из Объект[ТабЧ] цикл
		
		дд.Факт1 = 0;
		дд.Факт2 = 0;
		дд.Факт3 = 0;
		
		дд.ГодовойБюджет = 0;
		дд.ГодовойПрогноз = 0;
		дд.ГодовойОтклонение = 0;
		
		дд.БюджетМесяц = 0;
		дд.ПрогнозМесяц = 0;
		дд.ОтклоненияМесяц = 0;
		
		
		
		
		Для Н = 1 По 12 Цикл
			//дд["ВидОплаты" + Н] = неопределено;
			//дд["МесяцОплаты" + Н] = 0;
			дд["СуммаБюджет" + Н] = 0;
			дд["Сумма" + Н] = 0;
			дд["СуммаПрФакт" + Н] = 0;
			дд["СуммаФакт" + Н] = 0;
		КонецЦикла;
	КонецЦикла;
	
	
	
	
	
	Для каждого дд из Объект[ТабП] цикл
		
		дд.Факт1 = 0;
		дд.Факт2 = 0;
		дд.Факт3 = 0;
		
		дд.ГодовойБюджет = 0;
		дд.ГодовойПрогноз = 0;
		дд.ГодовойОтклонение = 0;
		
		дд.БюджетМесяц = 0;
		дд.ПрогнозМесяц = 0;
		дд.ОтклоненияМесяц = 0;
		
		
		
		
		Для Н = 1 По 12 Цикл
			дд["ВидОплаты" + Н] = неопределено;
			дд["МесяцОплаты" + Н] = 0;
			дд["СуммаБюджет" + Н] = 0;
			дд["Сумма" + Н] = 0;
			дд["СуммаПрФакт" + Н] = 0;
			дд["СуммаФакт" + Н] = 0;
		КонецЦикла;
	КонецЦикла;
	
	
	
	
	
	//Заполнить показатели
	Для каждого тт из ТЗ цикл
		
		Если ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ"  или ЦФО.Лео_ЦЗ = "ИТС" тогда  //Эксплуатация, ИТС 
			
			пСтатьяОборотов = тт.СтатьяОборотовПоБюджетам;
			
		иначе // Остальные
			
			пСтатьяОборотов = _пСтатьяОборотов(тт.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи);
			
		КонецЕсли;
		
		
		мПоиска = Объект[ТабП].НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",пСтатьяОборотов));
		Если мПоиска.Количество()>0 тогда
			ЗаполнитьЗначенияСвойств(мПоиска[0],тт);
			
			
			
			
			
			
			мПоиска[0].Контрагент       = _ЗаполнитьКонтрагента(тт);
			мПоиска[0].СтавкаНДС        = _ЗаполнитьСтавкуНДС(тт);
			
		иначе 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена статья: "+сокрлп(пСтатьяОборотов)+" код: "+сокрлп(тт.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи)); 
			
			
			
			
		Конецесли;
	КонецЦикла;
	
	
	
	
	
	
		Если НЕ ОснБезНДС тогда
	
	
	
	
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета7");
	
	
	Если Объект.ЦФО.Лео_ЦЗ = "ФОТ" тогда  //ФОТ
	  ЗаполнимТаблицуСерверРасшифровкаГруппировкиФОТ ("СоставБюджета7");
	КонецЕсли;	
	
	ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
	
	//ЗаполнимИтоговуюТаблицуРасшифровка("СоставБюджета9","СоставБюджета10",Истина);
	
	ЗаполнимИтоговуюТаблицу("СоставБюджета","СоставБюджета7",Истина);
	//ЗаполнимТаблицуСерверРасшифровкаГруппировки (Об1Док,"СоставБюджета");
	
	ЗаполнимИтоговуюТаблицуБезКода("СоставБюджета",Истина);
	
	ЗаполнимТаблицуСервер("СоставБюджета",Истина);
	
	
	иначе
	
	////Заполним Основная БезНДС
	//Для каждого  тт из ТЗФакт цикл
	//	
	//	мП =  Об1Док.СоставБюджета10.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам", тт.СтатьяОборотовПоБюджетам));
	//	Если мП.Количество() > 0 тогда
	//		мП[0].Факт1 = тт.Факт1;
	//		мП[0].Факт2 = тт.Факт2;
	//		мП[0].Факт3 = тт.Факт3;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	
	
	ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета10");
	ЗаполнимТаблицуСервер("СоставБюджета10",Истина);
	ЗаполнимИтоговуюТаблицу("СоставБюджета9","СоставБюджета10",Истина);
	//ЗаполнимТаблицуСерверРасшифровкаГруппировки (Об1Док,"СоставБюджета");
	ЗаполнимИтоговуюТаблицуБезКода("СоставБюджета9",Истина);
	
	ЗаполнимТаблицуСервер("СоставБюджета9",Истина);
	
	
	КонецЕсли;
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	// Эксплуатация
	
	Если ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ"  или ЦФО.Лео_ЦЗ = "ИТС" тогда  //Эксплуатация, ИТС
		
		//Очистить показатели
		Для каждого дд из Объект.СоставБюджета6 цикл
			
			дд.Факт1 = 0;
			дд.Факт2 = 0;
			дд.Факт3 = 0;
			
			дд.ГодовойБюджет = 0;
			дд.ГодовойПрогноз = 0;
			дд.ГодовойОтклонение = 0;
			
			дд.БюджетМесяц = 0;
			дд.ПрогнозМесяц = 0;
			дд.ОтклоненияМесяц = 0;
			
			
			
			
			Для Н = 1 По 12 Цикл
				//дд["ВидОплаты" + Н] = неопределено;
				//дд["МесяцОплаты" + Н] = 0;
				дд["СуммаБюджет" + Н] = 0;
				дд["Сумма" + Н] = 0;
				дд["СуммаПрФакт" + Н] = 0;
				дд["СуммаФакт" + Н] = 0;
			КонецЦикла;
		КонецЦикла;
		
	    ТЗ_Экс =  ТЗ.Скопировать();
		
		//Заполнить показатели
		Для каждого тт из ТЗ_Экс цикл
			
			пСтатьяОборотов = _пСтатьяОборотов(тт.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи);
			
			мПоиска = Объект.СоставБюджета6.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам",пСтатьяОборотов));
			Если мПоиска.Количество()>0 тогда
				ЗаполнитьЗначенияСвойств(мПоиска[0],тт);
				
				
				мПоиска[0].Контрагент       = _ЗаполнитьКонтрагента(тт);
				мПоиска[0].СтавкаНДС        = _ЗаполнитьСтавкуНДС(тт);
				
			иначе 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена статья: "+сокрлп(пСтатьяОборотов)+" код: "+сокрлп(тт.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи)); 
				
				
				
				
			Конецесли;
		КонецЦикла;
		
		
		ЗаполнимТаблицуСерверРасшифровкаГруппировки ("СоставБюджета6");
		ЗаполнимТаблицуСервер("СоставБюджета6",Истина);
		
		
		
		
	КонецЕсли;	
	
	
	
	
	//Об1Док.Записать();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка завершена !");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнимТаблицуСерверРасшифровкаГруппировкиФОТ(ТабЧитог)
	
	
	
	
	ТабЧитог = Объект[ТабЧитог];
	
	//Заполнить итоговые поля РодительИтогСтатьи
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Лео_РодительскаяСтатья");
	
	ТЗ.Колонки.Добавить("Факт1");
	ТЗ.Колонки.Добавить("Факт2");
	ТЗ.Колонки.Добавить("Факт3");
	
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт" + Строка(Н));
		
		//ТЗ.Колонки.Добавить("СуммаБезНДС" + Строка(Н));
		
	КонецЦикла;		
	
	Для каждого сс из ТабЧитог цикл
		стр = ТЗ.Добавить();
		Если сс.Итоговая тогда продолжить конецЕсли; 
		ЗаполнитьЗначенияСвойств(стр,сс);
		статья = сс.СтатьяОборотовПоБюджетам.СтатьяОборотов;
		стр.Лео_РодительскаяСтатья = статья.Лео_РодительскаяСтатья;
	КонецЦикла;
	
	ТЗ.Свернуть("Лео_РодительскаяСтатья",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	Для каждого сс из ТЗ цикл
		
		мСтрок = ТабЧитог.НайтиСтроки(Новый Структура("СтатьяОборотовПоБюджетам,Итоговая",сс.Лео_РодительскаяСтатья,Истина));
		
		Если мСтрок.Количество() > 0 тогда
			
			// Обнулим итоги сначала	
			мСтрок[0]["Факт1"] = 0;
			мСтрок[0]["Факт2"] = 0;
			мСтрок[0]["Факт3"] = 0;
			
			
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = 0;
				мСтрок[0]["Сумма" + Н]       = 0;
				мСтрок[0]["СуммаПрФакт" + Н] = 0;
				мСтрок[0]["СуммаФакт" + Н]   = 0;
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = 0;
				
			КонецЦикла;		
			
			
			// Заполнение	
			мСтрок[0]["Факт1"] = сс["Факт1"];
			мСтрок[0]["Факт2"] = сс["Факт2"];
			мСтрок[0]["Факт3"] = сс["Факт3"];
			
			
			Для Н = 1 По 12 Цикл
				мСтрок[0]["СуммаБюджет" + Н] = мСтрок[0]["СуммаБюджет" + Н] + сс["СуммаБюджет" + Н];
				мСтрок[0]["Сумма" + Н]       = мСтрок[0]["Сумма" + Н]       + сс["Сумма" + Н];
				мСтрок[0]["СуммаПрФакт" + Н] = мСтрок[0]["СуммаПрФакт" + Н] + сс["СуммаПрФакт" + Н];
				мСтрок[0]["СуммаФакт" + Н]   = мСтрок[0]["СуммаФакт" + Н]   + сс["СуммаФакт" + Н];
				
				//мСтрок[0]["СуммаБезНДС" + Н]   = мСтрок[0]["СуммаБезНДС" + Н]   + сс["СуммаБезНДС" + Н];
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры



&НаСервере
Функция _пСтатьяОборотов(абс_КодБюджетнойСтатьи)
	СтатьяОборотов = Справочники.Лео_СтатьиОборотовРасшифровка.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лео_СтатьиОборотовРасшифровка.Ссылка как Статья,
	|	Лео_СтатьиОборотовРасшифровка.ПометкаУдаления,
	|	Лео_СтатьиОборотовРасшифровка.абс_КодБюджетнойСтатьи
	|ИЗ
	|	Справочник.Лео_СтатьиОборотовРасшифровка КАК Лео_СтатьиОборотовРасшифровка
	|ГДЕ
	|	Лео_СтатьиОборотовРасшифровка.абс_КодБюджетнойСтатьи = &абс_КодБюджетнойСтатьи
	|	И НЕ Лео_СтатьиОборотовРасшифровка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("абс_КодБюджетнойСтатьи", абс_КодБюджетнойСтатьи);
	
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		СтатьяОборотов =  ВыборкаДетальныеЗаписи.Статья;
	КонецЕсли;
	
	возврат СтатьяОборотов;
КонецФункции	


&НаСервере
Функция _ЗаполнитьВидОплаты(с)
	
	ВидОплаты = Перечисления.Лео_ВидОплаты.ПустаяСсылка();
	Если с = "1" тогда
		
		ВидОплаты = Перечисления.Лео_ВидОплаты.Безналичный;
		
	ИначеЕсли с = "2" тогда
		
		ВидОплаты = Перечисления.Лео_ВидОплаты.Наличный;
		
	ИначеЕсли с = "3" тогда
		
		ВидОплаты = Перечисления.Лео_ВидОплаты.Взаимозачет;
		
	ИначеЕсли с = "4" тогда
		
		ВидОплаты = Перечисления.Лео_ВидОплаты.ПредоставлениеСкидки;
		
	ИначеЕсли с = "5" тогда
		
		ВидОплаты = Перечисления.Лео_ВидОплаты.БесплатнаяОтгрузка;
		
	КонецЕсли;	
	
	возврат ВидОплаты;
КонецФункции	


&НаСервере
Функция _ЗаполнитьКонтрагента(с)
	
	Конт = Справочники.Контрагенты.ПустаяСсылка();
	Если с.Контрагент = "ЛВ" тогда
		
		Конт = Справочники.Контрагенты.НайтиПоКоду("К00000011");
	ИначеЕсли с.Контрагент = "ЛТ" тогда
		
		Конт = Справочники.Контрагенты.НайтиПоКоду("К00001098");
	ИначеЕсли с.Контрагент = "ЛД" тогда
		
		Конт = Справочники.Контрагенты.НайтиПоКоду("К00002087");
	ИначеЕсли с.Контрагент = "ЛЭ" тогда
		
		Конт = Справочники.Контрагенты.НайтиПоКоду("К00000893");
		
	ИначеЕсли с.Контрагент = "ЭЙ" тогда
		
		Конт = Справочники.Контрагенты.НайтиПоКоду("К00001149");
		
	КонецЕсли;	
	
	возврат Конт;
КонецФункции

&НаСервере
Функция _ЗаполнитьСтавкуНДС(с)
	
	//НДС = Перечисления.СтавкиНДС.БезНДС;
	//Если с.СтавкаНДС = "1,2" тогда
	//	
	//	НДС = Перечисления.СтавкиНДС.НДС20;
	//ИначеЕсли с.СтавкаНДС = "1,1" тогда
	//	
	//	НДС = Перечисления.СтавкиНДС.НДС10;
	//КонецЕсли;	
	
	
	НДС = Перечисления.Лео_СтавкиНДС.БезНДС;
	Если с.СтавкаНДС = "1,2" тогда
		
		НДС = Перечисления.Лео_СтавкиНДС.НДС20;
	ИначеЕсли с.СтавкаНДС = "1,1" тогда
		
		НДС = Перечисления.Лео_СтавкиНДС.НДС10;    
		
	КонецЕсли;	
	
	
	
	возврат НДС;
КонецФункции	




&НаСервере
Функция ЗаполнитьТЗЕксель(ЦФО,ПутьКФайлу,ОснБезНДС,НачСтрока)
	

	
	//Структура ТЗ
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СтатьяОборотовПоБюджетам");
	ТЗ.Колонки.Добавить("Контрагент");
	ТЗ.Колонки.Добавить("СтавкаНДС");
	ТЗ.Колонки.Добавить("КомментарийАкции");
	
	ТЗ.Колонки.Добавить("Бренд");
	
	
	ТЗ.Колонки.Добавить("Факт1");
	ТЗ.Колонки.Добавить("Факт2");
	ТЗ.Колонки.Добавить("Факт3");
	

	
	
	Для Н = 1 По 12 Цикл
		ТЗ.Колонки.Добавить("ВидОплаты"   + Строка(Н));
		ТЗ.Колонки.Добавить("МесяцОплаты" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаБюджет" + Строка(Н));
		ТЗ.Колонки.Добавить("Сумма"       + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаПрФакт" + Строка(Н));
		ТЗ.Колонки.Добавить("СуммаФакт"   + Строка(Н));
	КонецЦикла;
	
	
	
	ТЗФакт =  ТЗ.Скопировать();
	
	ТЗ_Экс =  ТЗ.Скопировать();
	
	
	
	
	
	Попытка
		ExcelApp = Новый COMОбъект("Excel.Application");
	Исключение
		Возврат ТЗ;
	КонецПопытки;
	
	Книга = ExcelApp.WorkBooks.Open(ПутьКФайлу);
	
	Если НЕ ОснБезНДС тогда
	Страница = Книга.WorkSheets(1);  
	иначе
	Страница = Книга.WorkSheets(2);  
	КонецЕсли;
	//возврат;
	
	ТЗ_Расшифровок = ТЗ.Скопировать();
	
	ТЗ_Расшифровок.Очистить();
	//ВсегоСтрок = Страница.Cells(1,1).SpecialCells(11).Row;
	//НомерПервойСтроки = 54;
	НомерПервойСтроки = НачСтрока;
	ВсегоСтрок = 3000;
	Для Номер = НомерПервойСтроки по ВсегоСтрок цикл
		
		
		
		
		
		
		// !!!! Подразделения в Доке
		
		_Код = сокрлп(Формат(ExcelApp.Cells(Номер,2).Value,"ЧГ=0"));
		_Код = СтрЗаменить(_Код," ","");
		
		
		Если НЕ ЗначениеЗаполнено(_Код) тогда
			продолжить;
			//иначе
			////	продолжить;
		Конецесли;
		
		//Если ExcelApp.Cells(Номер,НомерКолонкиИзменения).Value = 1 тогда
		
		Стр = ТЗ_Расшифровок.Добавить();
		
		//Стр.Подразделение = сокрлп(Формат(ExcelApp.Cells(Номер,9).Value,"ЧГ=0"));
		
		Стр.абс_КодБюджетнойСтатьи = _Код;
		
		////ЧЦ=8; ЧВН=; ЧГ=0
		//Если СтрДлина(сокрлп(_Код)) < 6 тогда
		// Стр.Код = 	Формат(Число(_Код),"ЧЦ=8; ЧВН=; ЧГ=0");
		//КонецЕсли;
		
		Стр.Наименование = Формат(ExcelApp.Cells(Номер,3).Value,"ЧГ=0");
		
		//спр = Справочники.Лео_СтатьиОборотовРасшифровка.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",_Код);
		//спр = _пСтатьяОборотов(_Код);
		
		Если ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или ЦФО.Лео_ЦЗ = "ИТС" тогда  //Эксплуатация, ИТС
			
			спр = Справочники.СтатьиОборотовПоБюджетам.НайтиПоРеквизиту("абс_КодБюджетнойСтатьи",_Код);
			
		ИначеЕсли ЦФО.Лео_ЦЗ = "ОСП (ИНД)" тогда  //Индустриальный	
			
			
			// ИН, ИНД
			
			спр = _пСтатьяОборотов(_Код);
			Если спр.Пустая() тогда  // замена ИН на ИНД
                _Код = "ИНД" + Сред(_Код,3,СтрДлина(_Код)-2);				
			спр = _пСтатьяОборотов(_Код);
			КонецЕсли;
			
		ИначеЕсли ЦФО.Лео_ЦЗ = "ФОТ" тогда  //ФОТ	
			
		_Код = сокрлп(Формат(ExcelApp.Cells(Номер,1).Value,"ЧГ=0"));
		_Код = СтрЗаменить(_Код," ","");
			
			спр = _пСтатьяОборотов(_Код);
			
		иначе // Остальные
			
			спр = _пСтатьяОборотов(_Код);
			
			
			
    	КонецЕсли;	
		
		
		
		Если НЕ спр.Пустая() тогда
			Стр.Расшифровка = спр;
			
			Если ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ" или ЦФО.Лео_ЦЗ = "ИТС" тогда  //Эксплуатация, ИТС
				Стр.СтатьяОборотов = спр;
			иначе // Остальные 	
				Стр.СтатьяОборотов = спр.СтатьяОборотов;
			КонецЕсли;
			
			Стр.Флаг = истина;
			
			
			Если ЦФО.Лео_ЦЗ = "PR" тогда  //PR
				
				Бренд = Формат(ExcelApp.Cells(Номер,6).Value,"ЧГ=0");
				Стр.Бренд = Справочники.Лео_Бренды.НайтиПоНаименованию(Бренд);
				
			КонецЕсли;	
			
			
			
			
			//Соберем данные в ТЗ
			дд = ТЗ.Добавить();
			
			дд.СтатьяОборотовПоБюджетам = спр;
			
			дд.Контрагент       = Формат(ExcelApp.Cells(Номер,4).Value,"ЧГ=0");
			дд.СтавкаНДС        = Формат(ExcelApp.Cells(Номер,5).Value,"ЧГ=0");
			//дд.КомментарийАкции = Формат(ExcelApp.Cells(Номер,6).Value,"ЧГ=0");
			
			дд.Факт1            = Формат(ExcelApp.Cells(Номер,7).Value,"ЧГ=0");
			дд.Факт2            = Формат(ExcelApp.Cells(Номер,8).Value,"ЧГ=0");
			дд.Факт3            = Формат(ExcelApp.Cells(Номер,9).Value,"ЧГ=0");
			
			
			Если ЦФО.Лео_ЦЗ = "PR" тогда  //PR
				
				Бренд = Формат(ExcelApp.Cells(Номер,6).Value,"ЧГ=0");
				дд.Бренд = Справочники.Лео_Бренды.НайтиПоНаименованию(Бренд);
				
			КонецЕсли;	
			
			Для Н = 1 По 12 Цикл
				
				СуммаЗн = Формат(ExcelApp.Cells(Номер,18+(Н-1)*6).Value,"ЧГ=0");
				дд["ВидОплаты" + Н] = _ЗаполнитьВидОплаты(СуммаЗн);
				
				СуммаЗн = Формат(ExcelApp.Cells(Номер,19+(Н-1)*6).Value,"ЧГ=0");
				дд["МесяцОплаты" + Н] = СуммаЗн;
				
				СуммаЗн = Формат(ExcelApp.Cells(Номер,20+(Н-1)*6).Value,"ЧГ=0");
				дд["СуммаБюджет" + Н] = СуммаЗн;
				
				СуммаЗн = Формат(ExcelApp.Cells(Номер,21+(Н-1)*6).Value,"ЧГ=0");
				дд["Сумма" + Н] = СуммаЗн;
				
				СуммаЗн = Формат(ExcelApp.Cells(Номер,22+(Н-1)*6).Value,"ЧГ=0");
				дд["СуммаПрФакт" + Н] = СуммаЗн;
				
				СуммаЗн = Формат(ExcelApp.Cells(Номер,23+(Н-1)*6).Value,"ЧГ=0");
				дд["СуммаФакт" + Н] = СуммаЗн;
				
				
			КонецЦикла;
			
			
			
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ExcelApp.Application.Quit();  
	
	
	
	
//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////
	
	// Эксплуатация
	Если ЦФО.Лео_ЦЗ = "ЭКСПЛУАТАЦИЯ"   или ЦФО.Лео_ЦЗ = "ИТС" тогда  //Эксплуатация, ИТС
		
		Книга = ExcelApp.WorkBooks.Open(ПутьКФайлу);
		Страница = Книга.WorkSheets(3).Activate();  
		
		//возврат;
		
		//ТЗ_Расшифровок.Очистить();
		//ВсегоСтрок = Страница.Cells(1,1).SpecialCells(11).Row;
		НомерПервойСтроки = 14;
		ВсегоСтрок = 3000;
		Для Номер = НомерПервойСтроки по ВсегоСтрок цикл
			
			
			
			
			
			
			// !!!! Подразделения в Доке
			
			_Код = сокрлп(Формат(ExcelApp.Cells(Номер,2).Value,"ЧГ=0"));
		    _Код = СтрЗаменить(_Код," ","");
			
			
			Если НЕ ЗначениеЗаполнено(_Код) тогда
				продолжить;
				//иначе
				////	продолжить;
			Конецесли;
			
			
			спр = _пСтатьяОборотов(_Код);
			
			
			
			
			Если НЕ спр.Пустая() тогда
				//Стр.Расшифровка = спр;
				//Стр.СтатьяОборотов = спр.СтатьяОборотов;
				//
				//Стр.Флаг = истина;
				//
				//
				//Если ЦФО.Лео_ЦЗ = "PR" тогда  //PR
				//	
				//	 Бренд = Формат(ExcelApp.Cells(Номер,4).Value,"ЧГ=0");
				//	 Стр.Бренд = Справочники.Лео_Бренды.НайтиПоНаименованию(Бренд);
				//	
				//КонецЕсли;	
				
				
				
				
				//Соберем данные в ТЗ
				дд = ТЗ_Экс.Добавить();
				
				дд.СтатьяОборотовПоБюджетам = спр;
				
				дд.Контрагент       = Формат(ExcelApp.Cells(Номер,4).Value,"ЧГ=0");
				дд.СтавкаНДС        = Формат(ExcelApp.Cells(Номер,5).Value,"ЧГ=0");
				дд.КомментарийАкции = Формат(ExcelApp.Cells(Номер,6).Value,"ЧГ=0");
				
				дд.Факт1            = Формат(ExcelApp.Cells(Номер,7).Value,"ЧГ=0");
				дд.Факт2            = Формат(ExcelApp.Cells(Номер,8).Value,"ЧГ=0");
				дд.Факт3            = Формат(ExcelApp.Cells(Номер,9).Value,"ЧГ=0");
				
				
				Если ЦФО.Лео_ЦЗ = "PR" тогда  //PR
					
					Бренд = Формат(ExcelApp.Cells(Номер,6).Value,"ЧГ=0");
					дд.Бренд = Справочники.Лео_Бренды.НайтиПоНаименованию(Бренд);
					
				КонецЕсли;	
				
				Для Н = 1 По 12 Цикл
					
					СуммаЗн = Формат(ExcelApp.Cells(Номер,18+(Н-1)*6).Value,"ЧГ=0");
					дд["ВидОплаты" + Н] = _ЗаполнитьВидОплаты(СуммаЗн);
					
					СуммаЗн = Формат(ExcelApp.Cells(Номер,19+(Н-1)*6).Value,"ЧГ=0");
					дд["МесяцОплаты" + Н] = СуммаЗн;
					
					СуммаЗн = Формат(ExcelApp.Cells(Номер,20+(Н-1)*6).Value,"ЧГ=0");
					дд["СуммаБюджет" + Н] = СуммаЗн;
					
					СуммаЗн = Формат(ExcelApp.Cells(Номер,21+(Н-1)*6).Value,"ЧГ=0");
					дд["Сумма" + Н] = СуммаЗн;
					
					СуммаЗн = Формат(ExcelApp.Cells(Номер,22+(Н-1)*6).Value,"ЧГ=0");
					дд["СуммаПрФакт" + Н] = СуммаЗн;
					
					СуммаЗн = Формат(ExcelApp.Cells(Номер,23+(Н-1)*6).Value,"ЧГ=0");
					дд["СуммаФакт" + Н] = СуммаЗн;
					
					
				КонецЦикла;
				
				
				
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		ExcelApp.Application.Quit();  
		
	КонецЕсли;	
	
	
	возврат ТЗ;
	
КонецФункции




