
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Записывать = Истина;
	Движения.Лео_ПланФактПримииНепрямымКлиентам.Очистить();
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.Лео_ПланФактПримииНепрямымКлиентам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекСтрокаПлан.НачалоПериода;
		Движение.Контрагент = ТекСтрокаПлан.Контрагент;
		Движение.Сеть = ТекСтрокаПлан.Сеть;
		Движение.ТорговаяТочка = ТекСтрокаПлан.ТорговаяТочка;
		Движение.Товарооборот = ТекСтрокаПлан.Товарооборот;
		Движение.ФиксированнаяСумма = ТекСтрокаПлан.ФиксированнаяСумма;
		Движение.Премия = ТекСтрокаПлан.Премия;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ответственный = Справочники.Пользователи.ПустаяСсылка() Тогда
		 Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
