
Процедура абс_ОповещениеПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НастройкиОповещения.ТипОповещения,
	|	абс_НастройкиОповещения.Действует,
	|	абс_НастройкиОповещения.АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.абс_НастройкиОповещения КАК абс_НастройкиОповещения
	|ГДЕ
	|	абс_НастройкиОповещения.Действует
	|	И абс_НастройкиОповещения.ТипОповещения = ЗНАЧЕНИЕ(Перечисление.абс_ТипыОповещений.ОкончаниеДействияСертификатов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипОповещения = Перечисления.абс_ТипыОповещений.ОкончаниеДействияСертификатов И Не Выборка.АдресЭлектроннойПочты= "" Тогда
			ВыполнитьРассылкуОбОкончанииДействияСертификатов(Выборка.АдресЭлектроннойПочты);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРассылкуОбОкончанииДействияСертификатов(АдресЭлектроннойПочты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СертификатНаТовары.Номер,
	|	абс_СертификатНаТовары.Дата,
	|	абс_СертификатНаТовары.ВидСертификата
	|ИЗ
	|	Документ.абс_СертификатНаТовары КАК абс_СертификатНаТовары
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(абс_СертификатНаТовары.ДатаОкончанияДействияСертификата, ДЕНЬ) = &ТекущаяДата
	|	И абс_СертификатНаТовары.ПометкаУдаления = ЛОЖЬ
	|	И абс_СертификатНаТовары.Проведен = ИСТИНА
	|	И абс_СертификатНаТовары.Неактуальный = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПисьма = Формат(ТекущаяДата(),"ДФ=""дд.ММ.гггг""")+" заканчивается срок действия следующих сертификатов: <BR> <BR>";
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекстПисьма = ТекстПисьма + Строка(Выборка.ВидСертификата) + " №" + Выборка.Номер + " от " + Формат(Выборка.Дата, "ДФ=""дд.ММ.гггг""") + " <BR>";
		
	КонецЦикла;
		
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "Оповещение об окончании действия сертификатов");
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	МассивАдресов = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресЭлектроннойПочты, ",");
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		
			Попытка
				ОбъектПисьмо.Записать();
			Исключение
				Продолжить;;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
	    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПараметрыСеанса.ТекущийПользователь,,
									ИзмененныйСоставПисем, Истина , , Ложь, );
	
КонецПроцедуры

Процедура абс_ОбработкаСтопЛиста() Экспорт
	
	//Обновим статусы в стоп листе
	ТаблицаСтопЛиста = абс_УправлениеДебиторскойЗадолженностью.ПолучитьТаблицуСтопЛиста();
	абс_УправлениеДебиторскойЗадолженностью.УстановитьСтатусыСтопЛиста(ТаблицаСтопЛиста);
	
КонецПроцедуры

Процедура абс_РассылкаСтопЛиста() Экспорт
	
	МассивФайлов = Новый Массив;
	МассивКонтрагентов = Новый Массив;
	
	абс_УправлениеДебиторскойЗадолженностью.СформироватьОтчетСтопЛист(МассивФайлов, МассивКонтрагентов);
	
	Если МассивФайлов.Количество()>0 Тогда
		абс_УправлениеДебиторскойЗадолженностью.ВыполнитьРассылкуОтчетаСтопЛист(МассивФайлов, МассивКонтрагентов);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиТопыркинЛеотон() Экспорт
	Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714281617");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leoton_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	//ЛефЭкспо
	
		Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344"); //Леотон
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7714822344");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "LefExpo_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	//Леовит
	
		Если 0 + Лев(ТекущаяДата(),2) <= 5 Тогда
		
		// Отчет снимается с 1-го по 5-е число
		
		// 1-е число позапрошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095"); //Леовит
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Месяц перед позапрошлым месяцем	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-3)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095"); //Леовит
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-3), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	
	
	Если 0 + Лев(ТекущаяДата(),2) > 5 Тогда
		
		// Отчет снимается после 5-го числа 
		
		// 1-е число прошлого месяца по сегодняшний день
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = ТекущаяДата(); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji"+".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		// Позапрошлый месяц	
		ОтчетДебеторка = Отчеты.лео_ПродажиТопыркин.Создать();
		КомпоновщикНастроек = ОтчетДебеторка.КомпоновщикНастроек;
		
		Настройки = КомпоновщикНастроек.Настройки;
		Настройки.ПараметрыДанных.Элементы[0].Значение = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); //начало
		Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[1].Значение = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-2)); // конец
		Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
		Настройки.ПараметрыДанных.Элементы[2].Значение = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7713204095");
		Настройки.ПараметрыДанных.Элементы[2].Использование = Истина;
		
		ТабличныйДокумент = ОтчетДебеторка.ВывестиОтчет();
		
		ИмяДокумента = "Leovit_Prodaji_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабличныйДокумент.Записать("\\december\1C_Exchange\Sales\Cube\1c\"+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	


КонецПроцедуры	                                                        

//231030 Степан ++
Процедура лео_ИзменениеСпецификацийИТехкарт(СпецификацияТехКарта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НастройкиОповещения.ТипОповещения,
	|	абс_НастройкиОповещения.Действует,
	|	абс_НастройкиОповещения.АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.абс_НастройкиОповещения КАК абс_НастройкиОповещения
	|ГДЕ
	|	абс_НастройкиОповещения.Действует
	|	И абс_НастройкиОповещения.ТипОповещения = ЗНАЧЕНИЕ(Перечисление.абс_ТипыОповещений.ИзменениеСпецификацийИТехкарт)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.АдресЭлектроннойПочты = "" Тогда
			ВыполнитьРассылкуОбИзмененииСпецификацийИТехкарт(Выборка.АдресЭлектроннойПочты, СпецификацияТехКарта);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРассылкуОбИзмененииСпецификацийИТехкарт(АдресЭлектроннойПочты, СпецификацияТехКарта)
	
	ТекстПисьма = Формат(ТекущаяДата(),"ДФ=""дд.ММ.гггг""")+" внесены изменения в: <BR> <BR>";
	ТекстПисьма = ТекстПисьма + Сред(ТипЗнч(СпецификацияТехКарта),20) + " " + СпецификацияТехКарта + " <BR>";
		
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "Внесены изменения в "+СпецификацияТехКарта);
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	МассивАдресов = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресЭлектроннойПочты, ",");

	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		
			Попытка
				ОбъектПисьмо.Записать();
			Исключение
				Продолжить;;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
	    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПараметрыСеанса.ТекущийПользователь,,
									ИзмененныйСоставПисем, Истина , , Ложь, );
	
КонецПроцедуры
//231030 Степан --
