
&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СоставБюджета.Очистить();
		КонецЕсли;
	КонецЕсли;
    ЗаполнитьСервер();
	ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.РаспределитьБюджетПоЦД(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПериодПриИзменении(Элемент)
	
	Объект.ТекущийПериод = НачалоМесяца(Объект.ТекущийПериод);
	
КонецПроцедуры




