
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.Записывать = Истина;
	Движения.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.Очистить();
	Для Каждого ТекСтрокаСоответствиеНоменклатуры Из СоответствиеНоменклатуры Цикл
		Движение = Движения.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.СетьТорговаТочка = ТекСтрокаСоответствиеНоменклатуры.СетьТорговаяТочка;
		Движение.Номенклатура = ТекСтрокаСоответствиеНоменклатуры.Номенклатура;
		Движение.АртикулВСистемеКлиента = ТекСтрокаСоответствиеНоменклатуры.АртикулВСистемеКлиента;
		Движение.НаименованиеВСистемеКлиента = ТекСтрокаСоответствиеНоменклатуры.НаименованиеВСистемеКлиента;
	КонецЦикла;
КонецПроцедуры
