
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РежимВыбора") Тогда		
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
		Если Параметры.Свойство("Организация") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
		КонецЕсли;
		Если Параметры.Свойство("ЦФО") Тогда
			Если НЕ Параметры.ЦФО.Пустая() Тогда
				Список.Параметры.УстановитьЗначениеПараметра("ЦФО", Параметры.ЦФО);
			КонецЕсли;
		КонецЕсли;
		Если Параметры.Свойство("ВидОперации") Тогда			
			Список.Параметры.УстановитьЗначениеПараметра("ВидОперации", Параметры.ВидОперации);
		КонецЕсли;
		Если Параметры.Свойство("Состояние") Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Состояние", Параметры.Состояние);		
		КонецЕсли;
		Если Параметры.РежимВыбора Тогда
			Список.Параметры.УстановитьЗначениеПараметра("Проведен", Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Список.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ОповеститьОВыборе(ВыбраннаяСтрока.Ссылка);
	КонецЕсли;
КонецПроцедуры
