
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Объект.Валюта = глЗначениеПеременной("ВалютаУправленческогоУчета");
		Объект.ВидСкидки = Перечисления.ВидыСкидок.Оптовая;
		Объект.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий Тогда
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Истина;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
		Элементы.ОграничениеСкидкиНаценки.Видимость = Ложь;
		Элементы.абс_ПрименятьСкидкуДоОграничения.Видимость = Ложь;
		Элементы.абс_ДатаНачалаНакопления.Видимость = Ложь;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_ПроцентомСОграничением Тогда 
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Истина;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
		Элементы.ОграничениеСкидкиНаценки.Видимость = Истина;
		Элементы.абс_ПрименятьСкидкуДоОграничения.Видимость = Истина;
		Элементы.абс_ДатаНачалаНакопления.Видимость = Истина;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_Количеством Тогда 
		Элементы.ГруппаСкидкаКоличеством.Видимость = Истина;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_СуммойНаДокумент Тогда
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Истина;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
	ИначеЕсли Объект.Условие = Перечисления.УсловияСкидкиНаценки.абс_СпециальнаяЦена Тогда
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Истина;
	Иначе
		Элементы.ГруппаСкидкаКоличеством.Видимость = Ложь;
		Элементы.ГруппаСкидкаПроцентом.Видимость = Ложь;
		Элементы.ГруппаСкидкаСуммой.Видимость = Ложь;
		Элементы.ГруппаСпециальнаяЦена.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
