&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("абс_ВводБюджета_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ДатаПланирования = ЭтотОбъект.ДатаПланирования;
	
	Макет = Документы.абс_ВводБюджета.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаСтатья 	= Макет.ПолучитьОбласть("Шапка|Статья");
	ОбластьШапкаПериод 	= Макет.ПолучитьОбласть("Шапка|Период");
	ОбластьСтрокаСтатья = Макет.ПолучитьОбласть("Строка|Статья");
	ОбластьСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");
	
	ТабДок.Вывести(ОбластьШапкаСтатья);
	
	ТекМесяц = НачалоГода(ДатаПланирования);
	Пока ТекМесяц <= КонецГода(ДатаПланирования) Цикл
		ОбластьШапкаПериод.Параметры.Период = ТекМесяц;		
		ТабДок.Присоединить(ОбластьШапкаПериод);		
		ТекМесяц = ДобавитьМесяц(ТекМесяц, 1);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.абс_КодБюджетнойСтатьи КАК КодБС,
	|	абс_ВводБюджетаСоставБюджета.ЦФО.Представление КАК ЦФО,
	|	абс_ВводБюджетаСоставБюджета.СтатьяОборотовПоБюджетам.Представление КАК СтатьяОборотов,
	|	абс_ВводБюджетаСоставБюджета.АналитикаБюджета.Представление КАК Аналитика,
	|	абс_ВводБюджетаСоставБюджета.Номенклатура.Артикул КАК Артикул,
	|	абс_ВводБюджетаСоставБюджета.Номенклатура.Представление КАК Номенклатура,
	|	абс_ВводБюджетаСоставБюджета.Контрагент.Представление КАК Контрагент,
	|	абс_ВводБюджетаСоставБюджета.ДоговорКонтрагента.Представление КАК Договор,
	|	абс_ВводБюджетаСоставБюджета.Регион.Представление КАК Регион,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС1,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС2,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС3,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС4,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС5,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС6,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС7,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС8,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС9,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС10,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС11,
	|	абс_ВводБюджетаСоставБюджета.СуммаБезНДС12,
	|	абс_ВводБюджетаСоставБюджета.Сумма1,
	|	абс_ВводБюджетаСоставБюджета.Сумма2,
	|	абс_ВводБюджетаСоставБюджета.Сумма3,
	|	абс_ВводБюджетаСоставБюджета.Сумма4,
	|	абс_ВводБюджетаСоставБюджета.Сумма5,
	|	абс_ВводБюджетаСоставБюджета.Сумма6,
	|	абс_ВводБюджетаСоставБюджета.Сумма7,
	|	абс_ВводБюджетаСоставБюджета.Сумма8,
	|	абс_ВводБюджетаСоставБюджета.Сумма9,
	|	абс_ВводБюджетаСоставБюджета.Сумма10,
	|	абс_ВводБюджетаСоставБюджета.Сумма11,
	|	абс_ВводБюджетаСоставБюджета.Сумма12,
	|	абс_ВводБюджетаСоставБюджета.Количество1,
	|	абс_ВводБюджетаСоставБюджета.Количество2,
	|	абс_ВводБюджетаСоставБюджета.Количество3,
	|	абс_ВводБюджетаСоставБюджета.Количество4,
	|	абс_ВводБюджетаСоставБюджета.Количество5,
	|	абс_ВводБюджетаСоставБюджета.Количество6,
	|	абс_ВводБюджетаСоставБюджета.Количество7,
	|	абс_ВводБюджетаСоставБюджета.Количество8,
	|	абс_ВводБюджетаСоставБюджета.Количество9,
	|	абс_ВводБюджетаСоставБюджета.Количество10,
	|	абс_ВводБюджетаСоставБюджета.Количество11,
	|	абс_ВводБюджетаСоставБюджета.Количество12
	|ИЗ
	|	Документ.абс_ВводБюджета.СоставБюджета КАК абс_ВводБюджетаСоставБюджета
	|ГДЕ
	|	абс_ВводБюджетаСоставБюджета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрокаСтатья.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСтрокаСтатья);
		
		Для Сч=1 По 12 Цикл
			
			ОбластьСтрокаПериод.Параметры.Количество = Выборка["Количество"+Сч];
			ОбластьСтрокаПериод.Параметры.СуммаБезНДС = Выборка["СуммаБезНДС"+Сч];
			ОбластьСтрокаПериод.Параметры.Сумма = Выборка["Сумма"+Сч];
			ТабДок.Присоединить(ОбластьСтрокаПериод);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
