
&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТранспортСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиТранспорта(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.СоставБюджета.Количество()>0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			Объект.СоставБюджета.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСервер();
    ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСтатьиДДС(ЭтотОбъект);
	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
КонецПроцедуры




