
&НаКлиенте
Процедура ПланЦенаЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ПланЦенаЦвет = ПланЦенаЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ФактЦенаЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика. 
	Объект.ФактЦенаЦвет = ФактЦенаЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	ПланЦенаЦвет = Объект.ПланЦенаЦвет;
	ФактЦенаЦвет = Объект.ФактЦенаЦвет;
	ПланКоличествоЦвет = Объект.ПланКоличествоЦвет;
	ФактКоличествоЦвет = Объект.ФактКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ПланКоличествоЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ПланКоличествоЦвет = ПланКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ФактКоличествоЦветПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.ФактКоличествоЦвет = ФактКоличествоЦвет;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика 
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) тогда
		 Объект.Наименование = СокрЛП(Объект.Номенклатура);
	КонецЕсли;	
КонецПроцедуры
