&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
		
	Оповестить(ПолучитьТипОповещения(), Загрузка);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипОповещения()
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	
	Если обОбъект.Сценарий.абс_ТипСценарияПланирования=Перечисления.абс_ТипСценарияПланирования.Прогноз18 Тогда
		ТипОповещения = "ЗагрузкаEXCEL_Прогноз18";
	Иначе
		ТипОповещения = "ЗагрузкаEXCEL_ГодовойПлан";
	КонецЕсли;	
	
	Возврат ТипОповещения;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	дПериодПланирования = обОбъект.ДатаПланирования;
	Если ОбОбъект.Сценарий.абс_ТипСценарияПланирования=Перечисления.абс_ТипСценарияПланирования.Прогноз18 Тогда
		КоличествоМесяцев=18;
		Макет = Документы.ПланПродаж.ПолучитьМакет("ЗагрузкаEXCEL_Прогноз18");
	Иначе
		КоличествоМесяцев=12;
		Макет = Документы.ПланПродаж.ПолучитьМакет("ЗагрузкаEXCEL_ГодовойПлан");
	КонецЕсли;

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаКлиентНоменклатура 	= Макет.ПолучитьОбласть("Шапка|КлиентНоменклатура");
	ОбластьШапкаПериодКоличество 	= Макет.ПолучитьОбласть("Шапка|ПериодКоличество");
	ОбластьШапкаПериодСумма 		= Макет.ПолучитьОбласть("Шапка|ПериодСумма");
	ОбластьСтрокаКлиентНоменклатура = Макет.ПолучитьОбласть("Строка|КлиентНоменклатура");
	ОбластьСтрокаПериодКоличество 	= Макет.ПолучитьОбласть("Строка|ПериодКоличество");
	ОбластьСтрокаПериодСумма 		= Макет.ПолучитьОбласть("Строка|ПериодСумма");
	
	//нарисуем шапку
	ТабДок.Вывести(ОбластьШапкаКлиентНоменклатура);
	
	Для Сч = 0 По КоличествоМесяцев-1 Цикл
		ОбластьШапкаПериодКоличество.Параметры.Период = ДобавитьМесяц(дПериодПланирования, Сч);		
		ТабДок.Присоединить(ОбластьШапкаПериодКоличество);		
	КонецЦикла;
	
	Для Сч = 0 По КоличествоМесяцев-1 Цикл
		ОбластьШапкаПериодСумма.Параметры.Период = ДобавитьМесяц(дПериодПланирования, Сч);		
		ТабДок.Присоединить(ОбластьШапкаПериодСумма);		
	КонецЦикла;
	
	//
	//Если ОбОбъект.Сценарий.абс_ТипСценарияПланирования=Перечисления.абс_ТипСценарияПланирования.Прогноз18 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПланПродажСоставПлана.Период, МЕСЯЦ) КАК Период,
		|	ПланПродажСоставПлана.Контрагент КАК Клиент,
		|	ПланПродажСоставПлана.Контрагент.Код КАК КодКлиента,
		|	ПланПродажСоставПлана.Номенклатура КАК Номенклатура,
		|	ПланПродажСоставПлана.Номенклатура.Артикул КАК Артикул,
		|	ПланПродажСоставПлана.Количество КАК Количество,
		|	ПланПродажСоставПлана.Сумма КАК Сумма,
		|	ПланПродажСоставПлана.абс_Организация КАК Организация,
		|	ПланПродажСоставПлана.абс_Организация.Код КАК КодОрганизации,
		|	ПланПродажСоставПлана.абс_Подразделение КАК Подразделение,
		|	ПланПродажСоставПлана.абс_Подразделение.Код КАК КодПодразделения,
		|	ПланПродажСоставПлана.абс_БизнесРегион КАК БизнесРегион,
		|	ПланПродажСоставПлана.абс_БизнесРегион.Код КАК КодБизнесРегиона,
		|	ПланПродажСоставПлана.Количество1 КАК Количество1,
		|	ПланПродажСоставПлана.Количество2 КАК Количество2,
		|	ПланПродажСоставПлана.Количество3 КАК Количество3,
		|	ПланПродажСоставПлана.Количество4 КАК Количество4,
		|	ПланПродажСоставПлана.Количество5 КАК Количество5,
		|	ПланПродажСоставПлана.Количество6 КАК Количество6,
		|	ПланПродажСоставПлана.Количество7 КАК Количество7,
		|	ПланПродажСоставПлана.Количество8 КАК Количество8,
		|	ПланПродажСоставПлана.Количество9 КАК Количество9,
		|	ПланПродажСоставПлана.Количество10 КАК Количество10,
		|	ПланПродажСоставПлана.Количество11 КАК Количество11,
		|	ПланПродажСоставПлана.Количество12 КАК Количество12,
		|	ПланПродажСоставПлана.Количество13 КАК Количество13,
		|	ПланПродажСоставПлана.Количество14 КАК Количество14,
		|	ПланПродажСоставПлана.Количество15 КАК Количество15,
		|	ПланПродажСоставПлана.Количество16 КАК Количество16,
		|	ПланПродажСоставПлана.Количество17 КАК Количество17,
		|	ПланПродажСоставПлана.Количество18 КАК Количество18,
		|	ПланПродажСоставПлана.Сумма1 КАК Сумма1,
		|	ПланПродажСоставПлана.Сумма2 КАК Сумма2,
		|	ПланПродажСоставПлана.Сумма3 КАК Сумма3,
		|	ПланПродажСоставПлана.Сумма4 КАК Сумма4,
		|	ПланПродажСоставПлана.Сумма5 КАК Сумма5,
		|	ПланПродажСоставПлана.Сумма6 КАК Сумма6,
		|	ПланПродажСоставПлана.Сумма7 КАК Сумма7,
		|	ПланПродажСоставПлана.Сумма8 КАК Сумма8,
		|	ПланПродажСоставПлана.Сумма9 КАК Сумма9,
		|	ПланПродажСоставПлана.Сумма10 КАК Сумма10,
		|	ПланПродажСоставПлана.Сумма11 КАК Сумма11,
		|	ПланПродажСоставПлана.Сумма12 КАК Сумма12,
		|	ПланПродажСоставПлана.Сумма13 КАК Сумма13,
		|	ПланПродажСоставПлана.Сумма14 КАК Сумма14,
		|	ПланПродажСоставПлана.Сумма15 КАК Сумма15,
		|	ПланПродажСоставПлана.Сумма16 КАК Сумма16,
		|	ПланПродажСоставПлана.Сумма17 КАК Сумма17,
		|	ПланПродажСоставПлана.Сумма18 КАК Сумма18
		|ИЗ
		|	Документ.ПланПродаж.СоставПлана КАК ПланПродажСоставПлана
		|ГДЕ
		|	ПланПродажСоставПлана.Ссылка = &Ссылка
		|	И ПланПродажСоставПлана.Номенклатура ССЫЛКА Справочник.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма),
		|	СУММА(Количество1),
		|	СУММА(Количество2),
		|	СУММА(Количество3),
		|	СУММА(Количество4),
		|	СУММА(Количество5),
		|	СУММА(Количество6),
		|	СУММА(Количество7),
		|	СУММА(Количество8),
		|	СУММА(Количество9),
		|	СУММА(Количество10),
		|	СУММА(Количество11),
		|	СУММА(Количество12),
		|	СУММА(Количество13),
		|	СУММА(Количество14),
		|	СУММА(Количество15),
		|	СУММА(Количество16),
		|	СУММА(Количество17),
		|	СУММА(Количество18),
		|	СУММА(Сумма1),
		|	СУММА(Сумма2),
		|	СУММА(Сумма3),
		|	СУММА(Сумма4),
		|	СУММА(Сумма5),
		|	СУММА(Сумма6),
		|	СУММА(Сумма7),
		|	СУММА(Сумма8),
		|	СУММА(Сумма9),
		|	СУММА(Сумма10),
		|	СУММА(Сумма11),
		|	СУММА(Сумма12),
		|	СУММА(Сумма13),
		|	СУММА(Сумма14),
		|	СУММА(Сумма15),
		|	СУММА(Сумма16),
		|	СУММА(Сумма17),
		|	СУММА(Сумма18)
		|ПО
		|	Клиент,
		|	Номенклатура,
		|	Подразделение,
		|	БизнесРегион,
		|	Организация";

		Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
		Запрос.УстановитьПараметр("НачПериода", дПериодПланирования);
		Запрос.УстановитьПараметр("КонПериода", КонецДня(ДобавитьМесяц(дПериодПланирования,КоличествоМесяцев-1)));

		Результат = Запрос.Выполнить();

		ВыборкаКлиент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаКлиент.Следующий() Цикл
			
			ВыборкаКлиентНоменклатура = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			Пока ВыборкаКлиентНоменклатура.Следующий() Цикл

				ВыборкаКлиентНомПодр = ВыборкаКлиентНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКлиентНомПодр.Следующий() Цикл
					
					ВыборкаКлиентНомПодрБР = ВыборкаКлиентНомПодр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
					Пока ВыборкаКлиентНомПодрБР.Следующий() Цикл
						
						ВыборкаКлиентНомПодрБРОрг = ВыборкаКлиентНомПодрБР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
						Пока ВыборкаКлиентНомПодрБРОрг.Следующий() Цикл
					
							ОбластьСтрокаКлиентНоменклатура.Параметры.Заполнить(ВыборкаКлиентНомПодрБРОрг);
							ОбластьСтрокаКлиентНоменклатура.Параметры.КодКлиента = "'"+ВыборкаКлиентНомПодрБРОрг.КодКлиента;
							ОбластьСтрокаКлиентНоменклатура.Параметры.КодПодразделения = "'"+ВыборкаКлиентНомПодрБРОрг.КодПодразделения;
							ОбластьСтрокаКлиентНоменклатура.Параметры.КодБизнесРегиона = "'"+ВыборкаКлиентНомПодрБРОрг.КодБизнесРегиона;
							ОбластьСтрокаКлиентНоменклатура.Параметры.КодОрганизации = "'"+ВыборкаКлиентНомПодрБРОрг.КодОрганизации;
						  	ТабДок.Вывести(ОбластьСтрокаКлиентНоменклатура);

							Для Н = 1 по КоличествоМесяцев Цикл
								ОбластьСтрокаПериодКоличество.Параметры.Количество = ВыборкаКлиентНомПодрБРОрг["Количество" + Н];
								ТабДок.Присоединить(ОбластьСтрокаПериодКоличество);
							КонецЦикла;
							
							Для Н = 1 по КоличествоМесяцев Цикл
								ОбластьСтрокаПериодСумма.Параметры.Сумма = ВыборкаКлиентНомПодрБРОрг["Сумма" + Н];
								ТабДок.Присоединить(ОбластьСтрокаПериодСумма);
							КонецЦикла;

							//ВыборкаПериод = ВыборкаКлиентНомПодрБРОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

							//Пока ВыборкаПериод.Следующий() Цикл
							//	ОбластьСтрокаПериодКоличество.Параметры.Заполнить(ВыборкаПериод);
							//	ТабДок.Присоединить(ОбластьСтрокаПериодКоличество);
							//КонецЦикла;
							//
							//ВыборкаПериод.Сбросить();

							//Пока ВыборкаПериод.Следующий() Цикл
							//	ОбластьСтрокаПериодСумма.Параметры.Заполнить(ВыборкаПериод);
							//	ТабДок.Присоединить(ОбластьСтрокаПериодСумма);
							//КонецЦикла;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОбластьЗаголовокКоличество = ТабДок.Область(1, 11, 1, 10+КоличествоМесяцев);
		ОбластьЗаголовокКоличество.Объединить();
		ОбластьЗаголовокКоличество.Текст = "План отгрузок, шт";
		ОбластьЗаголовокКоличество = ТабДок.Область(1, 11+КоличествоМесяцев, 1, 10+2*КоличествоМесяцев);
		ОбластьЗаголовокКоличество.Объединить();
		ОбластьЗаголовокКоличество.Текст = "План отгрузок, руб";
		
	//Иначе
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	НАЧАЛОПЕРИОДА(ПланПродажСоставПлана.Период, МЕСЯЦ) КАК Период,
	//		|	ПланПродажСоставПлана.Контрагент КАК Клиент,
	//		|	ПланПродажСоставПлана.Контрагент.Код КАК КодКлиента,
	//		|	ПланПродажСоставПлана.Номенклатура КАК Номенклатура,
	//		|	ПланПродажСоставПлана.Номенклатура.Артикул КАК Артикул,
	//		|	ПланПродажСоставПлана.Количество КАК Количество,
	//		|	ПланПродажСоставПлана.Сумма КАК Сумма
	//		|ИЗ
	//		|	Документ.ПланПродаж.СоставПлана КАК ПланПродажСоставПлана
	//		|ГДЕ
	//		|	ПланПродажСоставПлана.Ссылка = &Ссылка
	//		|	И ПланПродажСоставПлана.Номенклатура ССЫЛКА Справочник.Номенклатура
	//		|
	//		|УПОРЯДОЧИТЬ ПО
	//		|	Период
	//		|ИТОГИ
	//		|	СУММА(Количество),
	//		|	СУММА(Сумма)
	//		|ПО
	//		|	Клиент,
	//		|	Номенклатура,
	//		|	Период ПЕРИОДАМИ(МЕСЯЦ, &НачПериода, &КонПериода)";

	//	Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
	//	Запрос.УстановитьПараметр("НачПериода", дПериодПланирования);
	//	Запрос.УстановитьПараметр("КонПериода", КонецДня(ДобавитьМесяц(дПериодПланирования,КоличествоМесяцев-1)));

	//	Результат = Запрос.Выполнить();

	//	ВыборкаКлиент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//	Пока ВыборкаКлиент.Следующий() Цикл
	//		
	//		ВыборкаКлиентНоменклатура = ВыборкаКлиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//		Пока ВыборкаКлиентНоменклатура.Следующий() Цикл

	//			ОбластьСтрокаКлиентНоменклатура.Параметры.Заполнить(ВыборкаКлиентНоменклатура);
	//		  	ТабДок.Вывести(ОбластьСтрокаКлиентНоменклатура);

	//			ВыборкаПериод = ВыборкаКлиентНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

	//			Пока ВыборкаПериод.Следующий() Цикл
	//				ОбластьСтрокаПериодКоличество.Параметры.Заполнить(ВыборкаПериод);
	//				ТабДок.Присоединить(ОбластьСтрокаПериодКоличество);
	//			КонецЦикла;
	//			
	//			ВыборкаПериод.Сбросить();

	//			Пока ВыборкаПериод.Следующий() Цикл
	//				ОбластьСтрокаПериодСумма.Параметры.Заполнить(ВыборкаПериод);
	//				ТабДок.Присоединить(ОбластьСтрокаПериодСумма);
	//			КонецЦикла;
	//			
	//		КонецЦикла;
	//		
	//	КонецЦикла;
	//	
	//	ОбластьЗаголовокКоличество = ТабДок.Область(1, 5, 1, 4+КоличествоМесяцев);
	//	ОбластьЗаголовокКоличество.Объединить();
	//	ОбластьЗаголовокКоличество.Текст = "План продаж, шт";
	//	ОбластьЗаголовокКоличество = ТабДок.Область(1, 5+КоличествоМесяцев, 1, 4+2*КоличествоМесяцев);
	//	ОбластьЗаголовокКоличество.Объединить();
	//	ОбластьЗаголовокКоличество.Текст = "План продаж, руб";
	//	
	//КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

