// флаг необходимости проверки соотвествия кода и кода региона
Перем ПроверятьСоответствиеКодаИКодаРегиона Экспорт;
//АБС ВСТАВКА   06.05.2014 13:37:42  Балашенко
Перем КонтролироватьПорядок Экспорт;
//АБС ВСТАВКА  КОНЕЦ

//АБС ВСТАВКА 01.07.2014 Обновление менеджеров при записи региона Фролов
Перем мМассивБизнесРегионовДляПроверки Экспорт;
//АБС ВСТАВКА КОНЕЦ

// Обработчик события ПередЗаписью 
//
Процедура ПередЗаписью(Отказ)

	#Если Клиент Тогда 
	
	Если (НЕ ОбменДанными.Загрузка) и ПроверятьСоответствиеКодаИКодаРегиона Тогда
			
		// проверка правильности заполнения кода региона
		КодСтраны = Цел(КодАдресногоЭлемента / 100000000000); 
		Если КодСтраны = 643 Тогда
			КодРег = Цел((КодАдресногоЭлемента - КодСтраны * 100000000000) / 1000000000);
			
			// проверка соответствия кода и кода региона
			Если Строка(КодРег) <> КодРегиона Тогда
				
				Ответ = Вопрос("Код региона не соответствует коду адресного элемента. Установить код региона автоматически?",
								РежимДиалогаВопрос.ДаНет, , , "Проверка кода региона");
								
				Если Ответ = КодВозвратаДиалога.Да Тогда
					КодРегиона = Строка(КодРег);					
				КонецЕсли;					
				
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	
	#КонецЕсли

    //АБС ВСТАВКА   06.05.2014 13:27:51  Балашенко
		Если НЕ Отказ Тогда
			ОбщегоНазначенияЗК.ПередЗаписьюОбъектаПорядка(Отказ, ЭтотОбъект, КонтролироватьПорядок);
		КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ

	//АБС ВСТАВКА 01.07.2014 Обновление менеджеров при записи региона Фролов
	мМассивБизнесРегионовДляПроверки = Новый Массив;
	
	мМассивБизнесРегионовДляПроверки.Добавить(ЭтотОбъект.Родитель);
	мМассивБизнесРегионовДляПроверки.Добавить(ЭтотОбъект.Ссылка.Родитель);
	мМассивБизнесРегионовДляПроверки.Добавить(ЭтотОбъект.Ссылка);
	//АБС ВСТАВКА КОНЕЦ	
	
	//АБС ВСТАВКА 18.07.2014 Заполнение ЦФО по регионам Фролов
	Если НЕ ЗначениеЗаполнено(абс_ЦФО) Тогда
		абс_ЦФО = Родитель.абс_ЦФО;
	КонецЕсли;
	//АБС ВСТАВКА КОНЕЦ
	
КонецПроцедуры

//АБС ВСТАВКА 01.07.2014 Обновление менеджеров при записи региона Фролов
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	абс_Дистрибуция.ПроверитьЗаполнитьМенеджеровПоБизнесРегиону(мМассивБизнесРегионовДляПроверки);
	
	абс_ЗаполнитьЦФОПодчиненныхРегионов();
	
КонецПроцедуры
//АБС ВСТАВКА КОНЕЦ

//АБС ВСТАВКА 18.07.2014 Заполнение ЦФО по регионам Фролов
Процедура абс_ЗаполнитьЦФОПодчиненныхРегионов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Регионы.Ссылка
	|ИЗ
	|	Справочник.Регионы КАК Регионы
	|ГДЕ
	|	Регионы.Ссылка В ИЕРАРХИИ(&ТекСсылка)
	|	И НЕ Регионы.Ссылка = &ТекСсылка
	|	И НЕ Регионы.абс_ЦФО = &ТекЦФО");
	
	Запрос.УстановитьПараметр("ТекСсылка"	, Ссылка);
	Запрос.УстановитьПараметр("ТекЦФО"		, абс_ЦФО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Объект.абс_ЦФО = абс_ЦФО;
		
		Объект.ОбменДанными.Загрузка = Истина;
		
		Объект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
//АБС ВСТАВКА КОНЕЦ

// ТЕКСТ ОСНОВНОЙ ПРОГРАММЫ
///////////////////////////////////////////////////////////////////////////////

ПроверятьСоответствиеКодаИКодаРегиона = Истина;
//АБС ВСТАВКА   06.05.2014 13:37:54  Балашенко
КонтролироватьПорядок = Истина;
//АБС ВСТАВКА  КОНЕЦ

//АБС ВСТАВКА 01.07.2014 Обновление менеджеров при записи региона Фролов
мМассивБизнесРегионовДляПроверки = Новый Массив;
//АБС ВСТАВКА КОНЕЦ