//АБС ВСТАВКА 37010  26.12.2013 17:36:13  Фролов
Процедура ЗаполнитьПоКлассификаторуАдресов() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	АдресныйКлассификатор.КодРегионаВКоде КАК КодРегиона,
	|	АдресныйКлассификатор.Наименование,
	|	АдресныйКлассификатор.Сокращение,
	|	абс_Регионы.Ссылка КАК РегионСсылка,
	|	АдресныйКлассификатор.КодРегионаВКоде КАК абс_КодРегионаВКоде
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.абс_Регионы КАК абс_Регионы
	|		ПО АдресныйКлассификатор.КодРегионаВКоде = абс_Регионы.абс_КодРегионаВКоде
	|ГДЕ
	|	АдресныйКлассификатор.КодРайонаВКоде = 0
	|	И АдресныйКлассификатор.КодГородаВКоде = 0
	|	И АдресныйКлассификатор.КодНаселенногоПунктаВКоде = 0
	|	И АдресныйКлассификатор.КодУлицыВКоде = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодРегиона"); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СоздатьОбновитьРегион(Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьРегион(ДанныеПоРегиону) Экспорт
	
	РегионОбъект = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеПоРегиону.РегионСсылка) Тогда		
		РегионОбъект = ДанныеПоРегиону.РегионСсылка.ПолучитьОбъект();
	Иначе
		РегионОбъект = Справочники.абс_Регионы.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегионОбъект, ДанныеПоРегиону);	
	
	РегионОбъект.ОбменДанными = Истина;
	
	РегионОбъект.Записать();
	
	ОбщегоНазначения.СообщитьИнформациюПользователю("Регион """ + ДанныеПоРегиону.Наименование + """ " + ?(ЗначениеЗаполнено(ДанныеПоРегиону.РегионСсылка), "обновлен", "создан") + "!");
	
	Возврат РегионОбъект.Ссылка;
	
КонецФункции
//АБС ВСТАВКА 37010 КОНЕЦ
