
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СуммаАвтоматическойСкидки = Параметры.СуммаАвтоматическойСкидки;
	СуммаРучнойСкидки = Параметры.СуммаРучнойСкидки;
	СуммаБезСкидок = Параметры.СуммаБезСкидок;
	ПроцентРучнойСкидки = ?(СуммаБезСкидок = 0, 0, СуммаРучнойСкидки/СуммаБезСкидок * 100);
	СуммаСоСкидками = СуммаБезСкидок - СуммаРучнойСкидки - СуммаАвтоматическойСкидки;
	//АБС 27.05.2014 44000
	Комментарий = Параметры.КомментарийРучнойСкидки;	
	//АБС 27.05.2014 44000
	Лео_ТипРучнойСкидки = Параметры.Лео_ТипРучнойСкидки;	
	Лео_НачалоПериодаВозникновенияРасхода = Параметры.Лео_НачалоПериодаВозникновенияРасхода;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Рассчитать(Команда)
	//АБС 27.05.2014 44000
	ВозвращенноеЗначение = Новый Структура;
	ВозвращенноеЗначение.Вставить("СуммаРучнойСкидки", СуммаРучнойСкидки);
	ВозвращенноеЗначение.Вставить("КомментарийРучнойСкидки", Комментарий);
    ВозвращенноеЗначение.Вставить("Лео_ТипРучнойСкидки", Лео_ТипРучнойСкидки);
	ВозвращенноеЗначение.Вставить("Лео_НачалоПериодаВозникновенияРасхода", Лео_НачалоПериодаВозникновенияРасхода);
	//Закрыть(СуммаРучнойСкидки);
	Закрыть(ВозвращенноеЗначение);
	//АБС 27.05.2014 44000
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаКлиенте
Процедура СуммаРучнойСкидкиПриИзменении(Элемент)
	
	ПроцентРучнойСкидки = ?(СуммаБезСкидок = 0, 0, СуммаРучнойСкидки/СуммаБезСкидок*100);
	СуммаСоСкидками = СуммаБезСкидок - СуммаРучнойСкидки - СуммаАвтоматическойСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоцентРучнойСкидкиПриИзменении(Элемент)
	
	СуммаРучнойСкидки = ПроцентРучнойСкидки * СуммаБезСкидок/100;
	СуммаСоСкидками = СуммаБезСкидок - СуммаРучнойСкидки - СуммаАвтоматическойСкидки;
	
КонецПроцедуры

