
Процедура лео_выгрузитьОстаткиВSQL() Экспорт 

	//РегламентноеЗадание = Неопределено;
	//Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	//Для Каждого Фоновое из Фоновые Цикл
	//    РегламентноеЗадание = Фоновое.РегламентноеЗадание;
	//    Если РегламентноеЗадание <> Неопределено Тогда
	//        Если СокрЛП(РегламентноеЗадание.Наименование) = "выгрузить остатки в SQL" Тогда
	//            Возврат; // задание выполняется, еще раз выполнять не нужно
	//        КонецЕсли;
	//    КонецЕсли;
	//КонецЦикла;
	
	//Инициализация переменных
    ИмяСервераSQL = "ASUMT";
    ПользовательSQL = "NEOLAP_datawriter";
    ПарольSQL = "1L4a-e0cj";
    БазаДанныхSQL = "NEOLAP";
    ТаблицаСерий = "product_series";
    ТаблицаSQL = "product_stocks";
	/////////////////////////////////////////
    //Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
        //Сообщить("Успешное подключение!");
    Исключение
        //Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	СтрукПериод = ПолучитьПериодДляЗапроса(); 
	если не струкПериод = неопределено тогда
		ДатаНач = струкПериод.ДатаНач;
 		ДатаКон = струкПериод.ДатаКон;
	   ОчиститьТабЗаПериод = "EXEC sp_stock2_del_period 
		        |@DateFrom = '"+Формат(ДатаНач, "ДФ='гггг-ММ-дд'")+"', 
	            |@DateTo = '"+Формат(ДатаКон, "ДФ='гггг-ММ-дд'")+"'
	            |";
	иначе 
		//сообщить("не задан период!.."); 
		возврат;
	конецЕсли;
	
	Попытка
        Соединение.Execute(ОчиститьТабЗаПериод,,128);
        //Сообщить("очищен период в Product_stocks2");
    Исключение
        //Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	ТабОстатков = ПолучитьТЗ(ДатаНач,ДатаКон);

	Если ТабОстатков.Количество() > 0 Тогда
		//сообщить("строк в таблице "+ТабОстатков.Количество());
		//сообщить("начало обработки "+ТекущаяДата());
		//ОбработкаПрерыванияПользователя();
		нс = 0;
		Для каждого стр из ТабОстатков Цикл   
			
			нс = нс+1;
			ЗапросКБД = "EXEC sp_product_stocks2_lite 
            |@pronumber = '"+стр.Артикул+"', 
            |@pro_semiproduct_expiry_day = '"+стр.ПолныйСрокГодностиПФДни+"',
            |@pro_product_expiry_month = '"+стр.ПолныйСрокГодностиТовараМес+"',
            |@pro_abc = '"+стр.АВС+"',
            |@pro_uniq_assort = '"+стр.Уникальность+"',
			|@proname = '"+стр.Номенклатура+"',
            |@proseries = '"+стр.СерияНоменклатуры+"',
            |@proseriescomment = '"+стр.СерияКомментарий+"',
            |@prostounit = '"+стр.ЕдиницаХранения+"',
            //|@BackupPathLog = '" + ОбщийКаталогСохр + СервSQL_Аудит+"\"+ БазаSQL_Аудит + "LOG\',
            |@prolastplace = '"+Формат(Число(стр.ЦенаПоследняя),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proqudate = '"+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+"',
            |@proquantity =  '"+Формат(Число(стр.КоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proquantityreserve =  '"+Формат(Число(стр.ВРезервеКоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proseriesstr = '"+СтрЗаменить(стр.СерияНоменклатуры,".","")+"',
            |@prostolocid = '"+стр.СкладКод+"', 
            |@protypeid = '"+стр.ВидНоменклатурыКод+"',
            |@progroup = '"+стр.НоменклатурнаяГруппа+"',
            |@probrand = '"+стр.Бренд+"',
            |@procat = '"+стр.Категория+"',
            |@proancat = '"+стр.КатегорияАналитическая+"',
            |@proproid = '"+стр.Product_ID+"'
            |";
			
			Попытка
		        Соединение.Execute(ЗапросКБД,,128);
		        //Сообщить("Запись добавлена!");
		    Исключение
				//Сообщить("стр."+нс+"; "+стр.Артикул+"; "+стр.Номенклатура+"; "+стр.СерияНоменклатуры+"; "+стр.ЕдиницаХранения+"; "+Формат(Число(стр.ЦенаПоследняя),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"; "+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+"; "+Формат(Число(стр.КоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+";" );
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;  
		
		//ЗаписатьВКонтрольныеДатыДлявыгрузкиSQL(ДатаНач,ДатаКон,ТабОстатков.Количество());
		
	КонецЕсли;
	
	//сообщить("записано строк  "+нс);
	//сообщить("окончание обработки "+ТекущаяДата());  
	ОбновитьССиОСГ(ДатаНач,ДатаКон,Соединение);  
	
	Соединение.Close(); 
	
КонецПроцедуры

Процедура лео_выгрузитьПродажиВSQL() Экспорт 

	//РегламентноеЗадание = Неопределено;
	//Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	//Для Каждого Фоновое из Фоновые Цикл
	//    РегламентноеЗадание = Фоновое.РегламентноеЗадание;
	//    Если РегламентноеЗадание <> Неопределено Тогда
	//        Если СокрЛП(РегламентноеЗадание.Наименование) = "выгрузить остатки в SQL" Тогда
	//            Возврат; // задание выполняется, еще раз выполнять не нужно
	//        КонецЕсли;
	//    КонецЕсли;
	//КонецЦикла;
	
	//Инициализация переменных
    ИмяСервераSQL = "ASUMT";
    ПользовательSQL = "NEOLAP_datawriter";
    ПарольSQL = "1L4a-e0cj";
    БазаДанныхSQL = "NEOLAP";
    ТаблицаСерий = "product_series";
    ТаблицаSQL = "product_stocks";
	/////////////////////////////////////////
    //Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
        //Сообщить("Успешное подключение!");
    Исключение
        //Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	СтрукПериод = ПолучитьПериодДляЗапросаПродаж(); 
	//Обновление таб. Факт и Факт ПП 250520 -->
	если не струкПериод = неопределено тогда
		ДатаНач = струкПериод.ДатаНач;
 		ДатаКон = струкПериод.ДатаКон;
	   ОчиститьТабЗаПериод = "EXEC sp_fact_period_delete 
	            |@DateFrom = '"+Формат(ДатаНач, "ДФ='гггг-ММ-дд'")+"', 
	            |@DateTo = '"+Формат(ДатаКон, "ДФ='гггг-ММ-дд'")+"'
	            |";
	иначе 
		//сообщить("не задан период!.."); 
		возврат;
	конецЕсли;
		
		Попытка
	        Соединение.Execute(ОчиститьТабЗаПериод,,128);
	    Исключение
		КонецПопытки; 
		ТабОстатков = ПолучитьТЗПродаж(ДатаНач,ДатаКон);  
		
		Если ТабОстатков.Количество() > 0 Тогда
			//сообщить("строк в таблице "+ТабОстатков.Количество());
			//сообщить("начало обработки "+ТекущаяДата());
			//ОбработкаПрерыванияПользователя();
			нс = 0;
			Для каждого стр из ТабОстатков Цикл
				нс = нс+1; 
				
		Попытка естьДанные1 = число(стр.КоличествоОборот)  
		Исключение
			Продолжить
			КонецПопытки;
		Попытка естьДанные2 = число(стр.СтоимостьОборотБезНДС)  
		Исключение
			Продолжить
			КонецПопытки;
				ЗапросКБД = "EXEC sp_fact_lite_promo 
			 |@realization_number = '"+ стр.НомерДокумента +"',
			 |@realization_date = '"+ Формат(Дата(стр.ДатаДокумента),"ДФ=yyyy.MM.dd") +"', 	 
			 |@year = '"+ Формат(Число(стр._Год),"ЧГ=;") +"',
			 |@month = '"+ Формат(Число(стр._Месяц),"ЧГ=;") +"',
			 |@customer_id = '"+ стр.Контрагент.Код +"',
			 |@product_id = '"+ стр.НоменклатураКод +"',
			 |@product_number = '"+ стр.Артикул +"',
			 |@product_series = '"+ стр.СерияНоменклатуры +"',
			 |@quantity = '"+ Формат(Число(стр.КоличествоОборот),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@amount = '"+  Формат(Число(стр.СтоимостьОборотБезНДС),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@consignee = '"+стр.Грузополучатель+"',
			 |@delivery_address = '"+стр.АдресДоставки+"',
			 |@type_report = '"+"ФАКТ"+"',
			 |@order_number = '"+стр.НомерЗаказа+"',
			 |@order_edi = '"+стр.абс_НомерЗаказаEDI+"',

			 |@customer_name = '"+ стр.Контрагент +"',
			 |@business_region = '"+ ЗаменитьСпецСимволы(стр.абс_БизнесРегион) +"',
			 |@territory = '"+ ЗаменитьСпецСимволы(стр.абс_Территория) +"',
			 |@manager = '"+ стр.абс_Менеджер +"',
			 |@city = '"+ стр.абс_Город +"',
			 |@type = '"+ стр.ТипПокупателя +"',
			 |@department = '"+ стр.абс_Отдел +"',

			 |@category_analytical = '"+ стр.Категория +"',
			 |@torg_marka = '"+ стр.ТорговаяМарка +"',
			 |@brand_pr = '"+ стр.Бренд +"',
			 |@vat_rate = '"+ ЗаменитьСпецСимволы(стр.СтавкаНДС) +"',
			 |@article_replace = '"+ стр.АртикулЗамены +"',
			 |@coef_goods = '"+ Формат(Число(стр.КоличествоГУДС),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@wt_kg = '"+ Формат(Число(стр.Вес),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',			
		 	 |@promo = '"+ стр.Промо +"',
			 |@storage = '"+ стр.Склад +"'     
			 |";
				 Попытка
			        Соединение.Execute(ЗапросКБД,,128); 
				 Исключение
				 КонецПопытки;
			КонецЦикла;  
		КонецЕсли;
	Соединение.Close(); 
	
КонецПроцедуры

Процедура лео_выгрузитьРеализацииВSQL() Экспорт 

	//РегламентноеЗадание = Неопределено;
	//Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	//Для Каждого Фоновое из Фоновые Цикл
	//    РегламентноеЗадание = Фоновое.РегламентноеЗадание;
	//    Если РегламентноеЗадание <> Неопределено Тогда
	//        Если СокрЛП(РегламентноеЗадание.Наименование) = "выгрузить остатки в SQL" Тогда
	//            Возврат; // задание выполняется, еще раз выполнять не нужно
	//        КонецЕсли;
	//    КонецЕсли;
	//КонецЦикла;
	
	//Инициализация переменных
    ИмяСервераSQL = "ASUMT";
    ПользовательSQL = "NEOLAP_datawriter";
    ПарольSQL = "1L4a-e0cj";
    БазаДанныхSQL = "NEOLAP";
    ТаблицаСерий = "product_series";
    ТаблицаSQL = "product_stocks";
	/////////////////////////////////////////
    //Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
        //Сообщить("Успешное подключение!");
    Исключение
        //Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	СтрукПериод = ПолучитьПериодДляЗапросаПродаж(); 
	//fact_real
 	если не струкПериод = неопределено тогда
		ДатаНач = струкПериод.ДатаНач;
 		ДатаКон = струкПериод.ДатаКон;
  ОчиститьТабЗаПериод = "EXEC sp_fact_realization_period_delete 
            |@DateFrom = '"+Формат(ДатаНач, "ДФ='гггг-ММ-дд'")+"', 
            |@DateTo = '"+Формат(ДатаКон, "ДФ='гггг-ММ-дд'")+"'
            |";
	иначе 
		//сообщить("не задан период!.."); 
		возврат;
	конецЕсли;
	Попытка
        Соединение.Execute(ОчиститьТабЗаПериод,,128);
    Исключение
	КонецПопытки;
	ТабОстатков = ПолучитьТЗФактПП(ДатаНач,ДатаКон);  
	
	Если ТабОстатков.Количество() > 0 Тогда
		//сообщить("строк в таблице "+ТабОстатков.Количество());
		//сообщить("начало обработки "+ТекущаяДата());
		//ОбработкаПрерыванияПользователя();
		нс = 0;
		Для каждого стр из ТабОстатков Цикл
			нс = нс+1;
			ЗапросКБД = "EXEC sp_fact_realization_lite 
			 |@realization_number = '"+ стр.НомерДокумента +"',
			 |@realization_date = '"+ Формат(Дата(стр.ДатаДокумента),"ДФ=yyyy.MM.dd") +"', 
			 
			 //|@year = '"+ Формат(Число(стр._Год),"ЧГ=;") +"',
			 //|@month = '"+ Формат(Число(стр._Месяц),"ЧГ=;") +"', 
			 |@year = '"+ Формат(Число(ГОД(стр.ДатаДокумента)),"ЧГ=;") +"',
			 |@month = '"+ Формат(Число(МЕСЯЦ(стр.ДатаДокумента)),"ЧГ=;") +"',
			 
			 |@customer_id = '"+ стр.Контрагент.Код +"',
			 |@product_id = '"+ стр.Номенклатура.Код +"',
			 |@product_number = '"+ стр.Артикул +"',
			 |@product_series = '"+ стр.СерияНоменклатуры +"',
			 |@quantity = '"+ Формат(Число(стр.КоличествоОтгрузки),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@quantity_unloaded = '"+ Формат(Число(стр.КоличествоНеотгружено),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@quantity_order = '"+ Формат(Число(стр.ТекЗаявкиКоличество),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@amount = '"+  Формат(Число(стр.СуммаОтгрузки),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@amount_unloaded = '"+  Формат(Число(стр.СуммаНеотгружено),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@amount_order = '"+  Формат(Число(стр.ТекЗаявкиСумма),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00") +"',
			 |@type_report = '"+"ФАКТ"+"',

			 |@customer_name = '"+ стр.Контрагент +"',
			 |@business_region = '"+ ЗаменитьСпецСимволы(стр.БизнесРегион) +"',
			 |@territory = '"+ ЗаменитьСпецСимволы(стр.Территория) +"',
			 |@manager = '"+ стр.ОсновнойМенеджер +"',
			 |@city = '"+ стр.Город +"',
			 |@type = '"+ стр.ТипПокупателя +"',
			 |@department = '"+ стр.Отдел +"',

			 |@category_analytical = '"+ стр.КатегорияАналитическая +"',
			 |@torg_marka = '"+ стр.ТорговаяМарка +"',
			 |@brand_pr = '"+ стр.БрендPR +"',
			 |@vat_rate = '"+ ЗаменитьСпецСимволы(стр.СтавкаНДС) +"',
			 |@article_replace = '"+ стр.АртикулЗамены +"',
			 |@coef_goods = ' ',
			 |@wt_kg = ' ',			
		 	 |@promo = ' ',
			 |@storage = ' '     
			 |";
			 Попытка
		        Соединение.Execute(ЗапросКБД,,128); 
			 Исключение
			КонецПопытки;
		КонецЦикла;  
	КонецЕсли;
	//Обновление таб. Факт и Факт ПП 250520 <--  
	
	Соединение.Close(); 
	
КонецПроцедуры

Процедура лео_выгрузитьОстаткиВSQLбезпроверок() Экспорт          

	РегламентноеЗадание = Неопределено;
	Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	Для Каждого Фоновое из Фоновые Цикл
	    РегламентноеЗадание = Фоновое.РегламентноеЗадание;
	    Если РегламентноеЗадание <> Неопределено Тогда
	        Если СокрЛП(РегламентноеЗадание.Наименование) = "выгрузить остатки в SQL" Тогда
	            Возврат; // задание выполняется, еще раз выполнять не нужно
	        КонецЕсли;
	    КонецЕсли;
	КонецЦикла;
	
	//Инициализация переменных
    ИмяСервераSQL = "ASUMT";
    ПользовательSQL = "NEOLAP_datawriter";
    ПарольSQL = "1L4a-e0cj";
    БазаДанныхSQL = "NEOLAP";
    ТаблицаСерий = "product_series";
    ТаблицаSQL = "product_stocks";
	/////////////////////////////////////////
    //Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
        //Сообщить("Успешное подключение!");
    Исключение
        //Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	СтрукПериод = ПолучитьПериодДляЗапроса(); 
	если не струкПериод = неопределено тогда
		ДатаНач = струкПериод.ДатаНач;
 		ДатаКон = струкПериод.ДатаКон;
	   ОчиститьТабЗаПериод = "EXEC sp_stock2_del_period 
		        |@DateFrom = '"+Формат(ДатаНач, "ДФ='гггг-ММ-дд'")+"', 
	            |@DateTo = '"+Формат(ДатаКон, "ДФ='гггг-ММ-дд'")+"'
	            |";
	иначе 
		//сообщить("не задан период!.."); 
		возврат;
	конецЕсли;
	
	Попытка
        Соединение.Execute(ОчиститьТабЗаПериод,,128);
        //Сообщить("очищен период в Product_stocks2");
    Исключение
        //Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	ТабОстатков = ПолучитьТЗ(ДатаНач,ДатаКон);

	Если ТабОстатков.Количество() > 0 Тогда
		//сообщить("строк в таблице "+ТабОстатков.Количество());
		//сообщить("начало обработки "+ТекущаяДата());
		//ОбработкаПрерыванияПользователя();
		нс = 0;
		Для каждого стр из ТабОстатков Цикл   
			
			нс = нс+1;
			ЗапросКБД = "EXEC sp_product_stocks2_lite 
            |@pronumber = '"+стр.Артикул+"', 
            |@proname = '"+стр.Номенклатура+"',
            |@proseries = '"+стр.СерияНоменклатуры+"',
            |@prostounit = '"+стр.ЕдиницаХранения+"',
            //|@BackupPathLog = '" + ОбщийКаталогСохр + СервSQL_Аудит+"\"+ БазаSQL_Аудит + "LOG\',
            |@prolastplace = '"+Формат(Число(стр.ЦенаПоследняя),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proqudate = '"+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+"',
            |@proquantity =  '"+Формат(Число(стр.КоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proquantityreserve =  '"+Формат(Число(стр.ВРезервеКоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proseriesstr = '"+СтрЗаменить(стр.СерияНоменклатуры,".","")+"',
            |@prostolocid = '"+стр.СкладКод+"', 
            |@protypeid = '"+стр.ВидНоменклатурыКод+"',
            |@progroup = '"+стр.НоменклатурнаяГруппа+"',
            |@probrand = '"+стр.Бренд+"',
            |@procat = '"+стр.Категория+"',
            |@proancat = '"+стр.КатегорияАналитическая+"',
            |@proproid = '"+стр.Product_ID+"'
            |";
			
			Попытка
		        Соединение.Execute(ЗапросКБД,,128);
		        //Сообщить("Запись добавлена!");
		    Исключение
				//Сообщить("стр."+нс+"; "+стр.Артикул+"; "+стр.Номенклатура+"; "+стр.СерияНоменклатуры+"; "+стр.ЕдиницаХранения+"; "+Формат(Число(стр.ЦенаПоследняя),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"; "+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+"; "+Формат(Число(стр.КоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+";" );
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;  
		
		ЗаписатьВКонтрольныеДатыДлявыгрузкиSQL(ДатаНач,ДатаКон,ТабОстатков.Количество());
		
	КонецЕсли;
	
	//сообщить("записано строк  "+нс);
	//сообщить("окончание обработки "+ТекущаяДата());  
	Соединение.Close(); 
	
КонецПроцедуры

Процедура ЗаписатьВКонтрольныеДатыДлявыгрузкиSQL(ДатаНач,ДатаКон,КолСтрок)

	НаборЗаписей = РегистрыСведений.лео_КонтрольныеДатыВыгрузкиВSQL.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.Отбор.ХранимаяПроцедура.Установить("sp_product_stocks2");
	НаборЗаписей.Отбор.DateFrom.Установить(ДатаНач);
	НаборЗаписей.Отбор.DateTo.Установить(ДатаКон);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].КоличествоСтрок = КолСтрок;
	КонецЕсли;
	//Запись = НаборЗаписей.Добавить();  
	//Запись.Период = ТекущаяДата();
	//Запись.ХранимаяПроцедура = "sp_product_stocks2";
	//Запись.DateFrom = НачалоМесяца(ДобавитьМесяц(ДатаНач,1));
	//Запись.DateTo = КонецМесяца(ДобавитьМесяц(ДатаКон,1)); 
	//Запись.КоличествоСтрок = -1;
	попытка
		НаборЗаписей.Записать(); 
	исключение 
		//сообщить("не записано в регистр!..");
	конецпопытки;     
	
	МенеджерЗаписи = РегистрыСведений.лео_КонтрольныеДатыВыгрузкиВSQL.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ХранимаяПроцедура = "sp_product_stocks2";
	МенеджерЗаписи.DateFrom = НачалоМесяца(ДобавитьМесяц(ДатаНач,1));
	МенеджерЗаписи.DateTo = КонецМесяца(ДобавитьМесяц(ДатаНач,1)); 
	МенеджерЗаписи.КоличествоСтрок = -1;
	попытка
		МенеджерЗаписи.Записать();  
	исключение 
		//сообщить("не записано в регистр!..");
	конецпопытки;     
		
    ТекВремя = ТекущаяДата();
	Время1900 = НачалоДня(ТекВремя) + 60*60*18;//после 18-00 не запускаем новую порцию, кроме субботы
	Время2200 = НачалоДня(ТекВремя) + 60*60*21;//после 21-00 не запускаем новую порцию в субботу
	Если ТекВремя < Время1900 И НЕ ДеньНедели(ТекВремя) = 6 Тогда
		//Если ДатаКон > ТекущаяДата() Тогда  
		    лео_выгрузитьОстаткиВSQL();  
		//иначе
		//    лео_выгрузитьОстаткиВSQLбезПроверок();  
		//конецЕсли;
	ИначеЕсли ТекВремя < Время2200 И ДеньНедели(ТекВремя) = 6 Тогда
		//Если ДатаКон > ТекущаяДата() Тогда  
		    лео_выгрузитьОстаткиВSQL();  
		//иначе
		//    лео_выгрузитьОстаткиВSQLбезПроверок();  
		//конецЕсли;
	Иначе
		возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТЗ(ДатаНач,ДатаКон)
	
	ТЗ	=	Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
			|	&ДатаОстатки,
			|	ТоварыНаСкладахОстатки.Номенклатура.Код КАК Product_ID,
			|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК Артикул,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.Код КАК ВидНоменклатурыКод,
			|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
			|	ТоварыНаСкладахОстатки.СерияНоменклатуры.Комментарий КАК СерияКомментарий,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦенаПоследняяПоСерииНоменклатуры.Цена, 0) КАК ЧИСЛО(15, 2)) КАК ЦенаПоследняя,
			|	ТоварыНаСкладахОстатки.КоличествоОстаток,
			|	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
			|	ТоварыНаСкладахОстатки.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
			|	ТоварыНаСкладахОстатки.Склад.Код КАК СкладКод,
			|	ЗначенияСвойствОбъектов1.Значение КАК Бренд,
			|	ЗначенияСвойствОбъектов2.Значение КАК Категория,
			|	ЗначенияСвойствОбъектов3.Значение КАК КатегорияАналитическая,
			|	ЗначенияСвойствОбъектов4.Значение КАК ПолныйСрокГодностиПФДни,
			|	ЗначенияСвойствОбъектов5.Значение КАК ПолныйСрокГодностиТовараМес,
			|	ЗначенияСвойствОбъектов6.Значение КАК АВС,
			|	ЗначенияСвойствОбъектов7.Значение КАК Уникальность,
			|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК ВРезервеКоличествоОстаток
			|	
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(
			|			&ДатаОстатки,
			//|			Склад = &Склад И 
			//|				Номенклатура.ВидНоменклатуры = &ВидНоменклатуры И 
			//|				НЕ СерияНоменклатуры = &ПустаяСерияНоменклатуры) КАК ТоварыНаСкладахОстатки
			|				) КАК ТоварыНаСкладахОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЦенаПоступления.Номенклатура КАК Номенклатура,
			|			ДатаПоступления.СерияНоменклатуры КАК СерияНоменклатуры,
			|			ДатаПоступления.Дата КАК Дата,
			|			ЦенаПоступления.Цена КАК Цена
			|		ИЗ
			|			(ВЫБРАТЬ
			|				МАКСИМУМ(ПоступлениеТоваровУслугТовары.Ссылка.Дата) КАК Дата,
			|				ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры
			|			ИЗ
			|				Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|			ГДЕ
			//|				ПоступлениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры = ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры И 
			//|				НЕ ПоступлениеТоваровУслугТовары.СерияНоменклатуры = &ПустаяСерияНоменклатуры И 
			|				ПоступлениеТоваровУслугТовары.Ссылка.Проведен
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК ДатаПоступления
			|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата,
			|					ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|					ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
			|					МАКСИМУМ(ПоступлениеТоваровУслугТовары.Цена) КАК Цена
			|				ИЗ
			|					Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ПоступлениеТоваровУслугТовары.Ссылка.Дата,
			|					ПоступлениеТоваровУслугТовары.Номенклатура,
			|					ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК ЦенаПоступления
			|				ПО ДатаПоступления.Дата = ЦенаПоступления.Дата
			|					И ДатаПоступления.СерияНоменклатуры = ЦенаПоступления.СерияНоменклатуры) КАК ЦенаПоследняяПоСерииНоменклатуры
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦенаПоследняяПоСерииНоменклатуры.Номенклатура
			|			И ТоварыНаСкладахОстатки.СерияНоменклатуры = ЦенаПоследняяПоСерииНоменклатуры.СерияНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов1
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов1.Объект
			|			И (&Свойство1 = ЗначенияСвойствОбъектов1.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов2
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов2.Объект
			|			И (&Свойство2 = ЗначенияСвойствОбъектов2.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов3
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов3.Объект
			|			И (&Свойство3 = ЗначенияСвойствОбъектов3.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов4
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов4.Объект
			|			И (&Свойство4 = ЗначенияСвойствОбъектов4.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов5
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов5.Объект
			|			И (&Свойство5 = ЗначенияСвойствОбъектов5.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов6
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов6.Объект
			|			И (&Свойство6 = ЗначенияСвойствОбъектов6.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов7
			|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов7.Объект
			|			И (&Свойство7 = ЗначенияСвойствОбъектов7.Свойство)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
			|			&ДатаОстатки,
			//|			Склад = &Склад И 
			//|				Номенклатура.ВидНоменклатуры = &ВидНоменклатуры И 
			//|				НЕ СерияНоменклатуры = &ПустаяСерияНоменклатуры) КАК ТоварыВРезервеНаСкладахОстатки
			|				) КАК ТоварыВРезервеНаСкладахОстатки
			|		ПО ТоварыВРезервеНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
			|			И ТоварыВРезервеНаСкладахОстатки.Склад = ТоварыНаСкладахОстатки.Склад
			|			И ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
			|";

	//Запрос.УстановитьПараметр("Склад",Склад);
	//Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);				
	Запрос.УстановитьПараметр("ПустаяСерияНоменклатуры",Справочники.СерииНоменклатуры.ПустаяСсылка());	
	Запрос.УстановитьПараметр("Свойство1",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Бренд PR"));
	Запрос.УстановитьПараметр("Свойство2",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Категория"));				
	Запрос.УстановитьПараметр("Свойство3",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Категория аналитическая"));	
	Запрос.УстановитьПараметр("Свойство4",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Полный срок годности полуфабрикаты дни"));
	Запрос.УстановитьПараметр("Свойство5",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Полный срок годности товара, мес."));				
	Запрос.УстановитьПараметр("Свойство6",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АВС"));
	Запрос.УстановитьПараметр("Свойство7",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Уникальность ассортимента"));				
	
	ТЗ.Очистить();
	
	ДатаОстатки	=	ДатаНач;
	Запрос.УстановитьПараметр("ДатаОстатки",КонецДня(ДатаОстатки));				
	ТЗ		=	Запрос.Выполнить().Выгрузить();
	Пока ДатаОстатки<=КонецДня(ДатаКон) Цикл
		
		//Если	ЗначПериода=Перечисления.Периодичность.День Тогда
			ДатаОстатки	=	ДатаОстатки	+ 24*60*60;
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Неделя Тогда
		//	ДатаОстатки	=	ДатаОстатки	+ 7*24*60*60;
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Декада Тогда
		//	ДатаОстатки	=	ДатаОстатки	+ 10*24*60*60;
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Месяц Тогда
		//	ДатаОстатки	=	 ДобавитьМесяц(ДатаОстатки,1);
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Квартал Тогда
		//	ДатаОстатки	=	ДобавитьМесяц(ДатаОстатки,3);
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Полугодие Тогда
		//	ДатаОстатки	=	ДобавитьМесяц(ДатаОстатки,6);
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Год Тогда
		//	ДатаОстатки	=	ДобавитьМесяц(ДатаОстатки,12);
		//Иначе
		//	Прервать;
		//КонецЕсли;
		
		
		Если ДатаОстатки>КонецДня(ДатаКон) Тогда
			Прервать;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаОстатки",КонецДня(ДатаОстатки));				
		ТЗ_День	=	Запрос.Выполнить().Выгрузить();
		
		ДополнитьТаблицу(ТЗ, ТЗ_День);
		
	КонецЦикла;
	
	Возврат ТЗ;
КонецФункции

Функция СтрокаВДату(Знач ДатаСтрока) Экспорт
    
    ПозицияПробела = СтрНайти(ДатаСтрока, " ", );//НаправлениеПоиска.СНачала);
    Если ПозицияПробела > 0 Тогда
        ДатаСтрока = Лев(ДатаСтрока, ПозицияПробела - 1);
    КонецЕсли;
    ДатаСтрока = СокрЛП(СтрЗаменить(ДатаСтрока, ".", ""));
    ДатаСтрока = Сред(ДатаСтрока, 5) + Сред(ДатаСтрока, 3, 2) + Лев(ДатаСтрока, 2);
    Если СтрДлина(ДатаСтрока) = 6 Тогда
        ДатаСтрока = "20" + ДатаСтрока;
    КонецЕсли;
    
    ОписаниеТипа = Новый ОписаниеТипов("Дата");
    Результат    = ОписаниеТипа.ПривестиЗначение(ДатаСтрока);
    
    Возврат Результат;
    
КонецФункции

Процедура ДополнитьТаблицу(ТаблицаПриемник, ТаблицаИсточник) Экспорт
    
    Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
        
        ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
        
    КонецЦикла;
    
КонецПроцедуры

//Функция СтрШаблон(Знач СтрокаПодстановки,
//    Знач Параметр1,    Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
//    Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
//    Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
//    Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодстановки, 
//        Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6,
//        Параметр7, Параметр8, Параметр9);
//КонецФункции // СтрШаблон()

//Функция СтрРазделить(Знач ИсходнаяСтрока, Знач Разделитель, ВключатьПустые = Истина) Экспорт
//    Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсходнаяСтрока, Разделитель, НЕ ВключатьПустые);
//КонецФункции // СтрРазделить()

//Функция СтрСоединить(Знач МассивСлов, Знач Разделитель = "") Экспорт
//    Возврат СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(МассивСлов, Разделитель);
//КонецФункции // СтрСоединить()

//Функция СтрНайти(Знач ИсходнаяСтрока, Знач ПодстрокаПоиска, НаправлениеПоиска = "") Экспорт
//    Возврат Найти(ИсходнаяСтрока, ПодстрокаПоиска);
//КонецФункции // СтрНайти()

//Функция СтрНачинаетсяС(Знач ИсходнаяСтрока, Знач ПодстрокаПоиска) Экспорт
//    Возврат Найти(ИсходнаяСтрока, ПодстрокаПоиска) = 1;
//КонецФункции // СтрНачинаетсяС()

//Функция СтрЗаканчиваетсяНа(Знач ИсходнаяСтрока, Знач ПодстрокаПоиска) Экспорт
//    Возврат Прав(ИсходнаяСтрока, СтрДлина(ПодстрокаПоиска)) = ПодстрокаПоиска;
//КонецФункции // СтрЗаканчиваетсяНа()

Функция ПолучитьПериодДляЗапроса();
	
	Горизонт = 45;
    Время = 0;  
	
	Время = ((ТекущаяДата() - НачалоДня(ТекущаяДата()))/(60*60)); 
	Если Время > 5 Тогда
		Горизонт = 4;
	Иначе 
		Горизонт = 90;
	КонецЕсли;
	
	Струк = Новый Структура;
	//Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*45*2);//перезаполним 90 пред.дней	
	//Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*45);//перезаполним 45 пред.дней	
	//Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*100);//перезаполним 100 пред.дней	
	//Струк.Вставить("ДатаНач",НачалоДня('20240406000000'));//перезаполним с даты	
	Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*Горизонт);//перезаполним Горизонт дней	
	Струк.Вставить("ДатаКон",КонецНедели(ТекущаяДата()));	 

	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.Период,
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.ХранимаяПроцедура,
	//	|	максимум(лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.DateFrom),
	//	|	максимум(лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.DateTo),
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.КоличествоСтрок
	//	|ИЗ
	//	|	РегистрСведений.лео_КонтрольныеДатыВыгрузкиВSQL.СрезПоследних КАК лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних  
	//	|	
	//	|	где  лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.КоличествоСтрок < 0 и
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.ХранимаяПроцедура = ""sp_product_stocks2""
	//	|	сгруппировать по 
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.Период,
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.ХранимаяПроцедура,
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.КоличествоСтрок
	//	|";
	//Рез = Запрос.Выполнить().Выгрузить();
	//Если Рез.Количество() > 0 Тогда
	//	Если Рез[0].DateFrom > ТекущаяДата() Тогда  
	//		Струк.Вставить("ДатаНач",НачалоМесяца(ТекущаяДата()));	
	//		Струк.Вставить("ДатаКон",КонецМесяца(ТекущаяДата()));	 
	//	иначе
	//		Струк.Вставить("ДатаНач",Рез[0].DateFrom);	
	//		Струк.Вставить("ДатаКон",Рез[0].DateTo);	 
	//	КонецЕсли;
	//иначе
	//	струк = неопределено;
	//КонецЕсли;

	возврат струк;
	
КонецФункции

Функция ПолучитьПериодДляЗапросаПродаж();
	
	Горизонт = 45;
    Время = 0;  
	
	Время = ((ТекущаяДата() - НачалоДня(ТекущаяДата()))/(60*60)); 
	Если Время > 5 Тогда
		Горизонт = 30;
	Иначе 
		Горизонт = 90;
	КонецЕсли;
	
	Струк = Новый Структура;
	//Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*45*2);//перезаполним 90 пред.дней	
	//Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*45);//перезаполним 45 пред.дней	
	//Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*100);//перезаполним 100 пред.дней	
	//Струк.Вставить("ДатаНач",НачалоДня('20240406000000'));//перезаполним с даты	
	Струк.Вставить("ДатаНач",НачалоДня(ТекущаяДата())-86400*Горизонт);//перезаполним Горизонт дней	
	Струк.Вставить("ДатаКон",КонецНедели(ТекущаяДата()));	 

	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.Период,
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.ХранимаяПроцедура,
	//	|	максимум(лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.DateFrom),
	//	|	максимум(лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.DateTo),
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.КоличествоСтрок
	//	|ИЗ
	//	|	РегистрСведений.лео_КонтрольныеДатыВыгрузкиВSQL.СрезПоследних КАК лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних  
	//	|	
	//	|	где  лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.КоличествоСтрок < 0 и
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.ХранимаяПроцедура = ""sp_product_stocks2""
	//	|	сгруппировать по 
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.Период,
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.ХранимаяПроцедура,
	//	|	лео_КонтрольныеДатыВыгрузкиВSQLСрезПоследних.КоличествоСтрок
	//	|";
	//Рез = Запрос.Выполнить().Выгрузить();
	//Если Рез.Количество() > 0 Тогда
	//	Если Рез[0].DateFrom > ТекущаяДата() Тогда  
	//		Струк.Вставить("ДатаНач",НачалоМесяца(ТекущаяДата()));	
	//		Струк.Вставить("ДатаКон",КонецМесяца(ТекущаяДата()));	 
	//	иначе
	//		Струк.Вставить("ДатаНач",Рез[0].DateFrom);	
	//		Струк.Вставить("ДатаКон",Рез[0].DateTo);	 
	//	КонецЕсли;
	//иначе
	//	струк = неопределено;
	//КонецЕсли;

	возврат струк;
	
КонецФункции

//Степан 241001 --> Обновить себестоимость и ОСГ по текущему периоду --
Процедура ОбновитьССиОСГ(ДатаНач,ДатаКон,Соединение)
	
	ТабОстатков = ПолучитьТЗ_ССиОСГ(ДатаНач,ДатаКон);  
	РРЦ24безНДС = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000004348");
	
	Если ТабОстатков.Количество() > 0 Тогда
		нс = 0;
		Для каждого стр из ТабОстатков Цикл
			нс = нс+1;
			ЗапросКБД = "EXEC sp_product_stocks2_upd_realprice_osg_gr 
            |@proproid = '"+стр.Product_ID+"',
     	    |@pronumber = '"+стр.Артикул+"', 
            |@pro_semiproduct_expiry_day = '"+стр.ПолныйСрокГодностиПФДни+"',
            |@pro_product_expiry_month = '"+стр.ПолныйСрокГодностиТовараМес+"',
            |@pro_abc = '"+стр.АВС+"',
            |@pro_uniq_assort = '"+стр.Уникальность+"',
            |@proname = '"+ЗаменитьСпецСимволы(стр.Номенклатура)+"',
            |@proseries = '"+стр.СерияНоменклатуры+"',
            |@prostounit = '"+стр.ЕдиницаХранения+"',
            //|@BackupPathLog = '" + ОбщийКаталогСохр + СервSQL_Аудит+"\"+ БазаSQL_Аудит + "LOG\',
            |@prolastplace = '"+Формат(Число(стр.ЦенаПоследняя),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            //|@proqudate = '"+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+" 00:00:00.000"+"',
            |@proqudate = '"+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+"',
            |@proquantity =  '"+Формат(Число(стр.КоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proquantityreserve =  '"+Формат(Число(стр.ВРезервеКоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
            |@proseriesstr = '"+СтрЗаменить(стр.СерияНоменклатуры,".","")+"',
            |@prostolocid = '"+стр.СкладКод+"', 
            //|@protypeid = '"+ВидНоменклатуры.Код+"', 
            |@protypeid = '"+стр.ВидНоменклатурыКод+"',
            |@progroup = '"+стр.НоменклатурнаяГруппа+"',
            |@probrand = '"+стр.Бренд+"',
            |@procat = '"+стр.Категория+"',
            |@proancat = '"+стр.КатегорияАналитическая+"',
	 		|@pro_real_price = '"+Формат(Число(стр.ЦенаФакт),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
	 		|@pro_osg  = '"+Формат(Число(стр.осг_процентах),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"',
	 		|@pro_osg_gr  = '"+стр.осг_группа+"',			
	 		|@pro_expiration_date  = '"+Формат(Дата(стр.СрокГодности),"ДФ=yyyy.MM.dd")+"',
			|@pro_rrc24bezNDS20proc = '"+Формат(Число(Ценообразование.ПолучитьЦенуНоменклатуры(стр.Номенклатура, , РРЦ24безНДС, , , , , , , , )),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"'
            |";
			Попытка
		        Соединение.Execute(ЗапросКБД,,128); 
		    Исключение
			КонецПопытки;
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры   

Функция ПолучитьТЗ_ССиОСГ(ДатаНач,ДатаКон)
	
	ТЗ	=	Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
			|	результат.ДатаОстатки,
			|	результат.Product_ID,
			|	результат.Артикул,
			|	результат.Номенклатура,
			|	результат.ЦенаФакт,
			|	результат.ВидНоменклатурыКод,
			|	результат.СерияНоменклатуры,
			|	результат.ДатаПроизводства,
			|	результат.СрокГодности,
			|	результат.ОсталосьДней,
			|	результат.СрокГодностиДней,
			|	результат.осг_процентах,
			|	ВЫБОР
			|		КОГДА результат.осг_процентах < 20
			|			ТОГДА ""<20""
			|		ИНАЧЕ ВЫБОР
			|				КОГДА результат.осг_процентах > 80
			|					ТОГДА "">80""
			|				ИНАЧЕ ВЫБОР
			|						КОГДА результат.осг_процентах > 50
			|							ТОГДА "">50""
			|						ИНАЧЕ "">20""
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК осг_группа,
			|	результат.ЦенаПоследняя,
			|	результат.КоличествоОстаток,
			|	результат.ЕдиницаХранения,
			|	результат.НоменклатурнаяГруппа,
			|	результат.СкладКод,
			|	результат.Бренд,
			|	результат.Категория,
			|	результат.КатегорияАналитическая,
			|	результат.ПолныйСрокГодностиПФДни,
			|	результат.ПолныйСрокГодностиТовараМес,
			|	результат.АВС,
			|	результат.Уникальность,
			|	результат.ВРезервеКоличествоОстаток
			|ИЗ
			|	(ВЫБРАТЬ
			|		&ДатаОстатки КАК ДатаОстатки,
			|		ТоварыНаСкладахОстатки.Номенклатура.Код КАК Product_ID,
			|		ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК Артикул,
			|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
			|		ЕстьNULL(ЛеоУчетЗатратОПЗС_Свод.ЦенаФакт,0) КАК ЦенаФакт,
			|		ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.Код КАК ВидНоменклатурыКод,
			|		ТоварыНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
			|		ТоварыНаСкладахОстатки.СерияНоменклатуры.абс_ДатаПроизводства КАК ДатаПроизводства,
			|		ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности КАК СрокГодности,
			|		РАЗНОСТЬДАТ(&ДатаОстатки, ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) КАК ОсталосьДней,
			|		РАЗНОСТЬДАТ(ТоварыНаСкладахОстатки.СерияНоменклатуры.абс_ДатаПроизводства, ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) КАК СрокГодностиДней,
			|		ВЫБОР
			|			КОГДА НЕ РАЗНОСТЬДАТ(ТоварыНаСкладахОстатки.СерияНоменклатуры.абс_ДатаПроизводства, ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) = 0
			|				ТОГДА РАЗНОСТЬДАТ(&ДатаОстатки, ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) / РАЗНОСТЬДАТ(ТоварыНаСкладахОстатки.СерияНоменклатуры.абс_ДатаПроизводства, ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности, ДЕНЬ) * 100
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК осг_процентах,
			|		ВЫРАЗИТЬ(ЕСТЬNULL(ЦенаПоследняяПоСерииНоменклатуры.Цена, 0) КАК ЧИСЛО(15, 2)) КАК ЦенаПоследняя,
			|		ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|		ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
			|		ТоварыНаСкладахОстатки.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
			|		ТоварыНаСкладахОстатки.Склад.Код КАК СкладКод,
			|		ЗначенияСвойствОбъектов1.Значение КАК Бренд,
			|		ЗначенияСвойствОбъектов2.Значение КАК Категория,
			|		ЗначенияСвойствОбъектов3.Значение КАК КатегорияАналитическая,
			|		ЗначенияСвойствОбъектов4.Значение КАК ПолныйСрокГодностиПФДни,
			|		ЗначенияСвойствОбъектов5.Значение КАК ПолныйСрокГодностиТовараМес,
			|		ЗначенияСвойствОбъектов6.Значение КАК АВС,
			|		ЗначенияСвойствОбъектов7.Значение КАК Уникальность,
			|		ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК ВРезервеКоличествоОстаток
			|	ИЗ
			|		РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатки, НЕ СерияНоменклатуры = &ПустаяСерияНоменклатуры) КАК ТоварыНаСкладахОстатки
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ЦенаПоступления.Номенклатура КАК Номенклатура,
			|				ДатаПоступления.СерияНоменклатуры КАК СерияНоменклатуры,
			|				ДатаПоступления.Дата КАК Дата,
			|				ЦенаПоступления.Цена КАК Цена
			|			ИЗ
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(ПоступлениеТоваровУслугТовары.Ссылка.Дата) КАК Дата,
			|					ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры
			|				ИЗ
			|					Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|				ГДЕ
			|					НЕ ПоступлениеТоваровУслугТовары.СерияНоменклатуры = &ПустаяСерияНоменклатуры
			|					И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК ДатаПоступления
			|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|						ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата,
			|						ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
			|						ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
			|						МАКСИМУМ(ПоступлениеТоваровУслугТовары.Цена) КАК Цена
			|					ИЗ
			|						Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|					
			|					СГРУППИРОВАТЬ ПО
			|						ПоступлениеТоваровУслугТовары.Ссылка.Дата,
			|						ПоступлениеТоваровУслугТовары.Номенклатура,
			|						ПоступлениеТоваровУслугТовары.СерияНоменклатуры) КАК ЦенаПоступления
			|					ПО ДатаПоступления.Дата = ЦенаПоступления.Дата
			|						И ДатаПоступления.СерияНоменклатуры = ЦенаПоступления.СерияНоменклатуры) КАК ЦенаПоследняяПоСерииНоменклатуры
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЦенаПоследняяПоСерииНоменклатуры.Номенклатура
			|				И ТоварыНаСкладахОстатки.СерияНоменклатуры = ЦенаПоследняяПоСерииНоменклатуры.СерияНоменклатуры
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов1
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов1.Объект
			|				И (&Свойство1 = ЗначенияСвойствОбъектов1.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов2
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов2.Объект
			|				И (&Свойство2 = ЗначенияСвойствОбъектов2.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов3
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов3.Объект
			|				И (&Свойство3 = ЗначенияСвойствОбъектов3.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов4
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов4.Объект
			|				И (&Свойство4 = ЗначенияСвойствОбъектов4.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов5
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов5.Объект
			|				И (&Свойство5 = ЗначенияСвойствОбъектов5.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов6
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов6.Объект
			|				И (&Свойство6 = ЗначенияСвойствОбъектов6.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов7
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов7.Объект
			|				И (&Свойство7 = ЗначенияСвойствОбъектов7.Свойство)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаОстатки, НЕ СерияНоменклатуры = &ПустаяСерияНоменклатуры) КАК ТоварыВРезервеНаСкладахОстатки
			|			ПО (ТоварыВРезервеНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
			|				И (ТоварыВРезервеНаСкладахОстатки.Склад = ТоварыНаСкладахОстатки.Склад)
			|				И (ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры)
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ первые 1000000
			|						МАКСИМУМ(Лео_УчетЗатратОПЗС_Свод.Период) КАК Период,
			|						Лео_УчетЗатратОПЗС_Свод.Номенклатура КАК Номенклатура,
			|						Лео_УчетЗатратОПЗС_Свод.СерияНоменклатуры КАК СерияНоменклатуры,
			|						Лео_УчетЗатратОПЗС_Свод.ЦенаФакт КАК ЦенаФакт
			|					ИЗ
			|						РегистрНакопления.Лео_УчетЗатратОПЗС_Свод КАК Лео_УчетЗатратОПЗС_Свод
			|					ГДЕ
			|						НАЧАЛОПЕРИОДА(Лео_УчетЗатратОПЗС_Свод.Период, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаОстатки, ДЕНЬ)
			|					СГРУППИРОВАТЬ ПО
			|						  Лео_УчетЗатратОПЗС_Свод.Номенклатура
			|						, Лео_УчетЗатратОПЗС_Свод.СерияНоменклатуры
			|						, Лео_УчетЗатратОПЗС_Свод.ЦенаФакт
			|					упорядочить по номенклатура, период убыв, серияноменклатуры
			|				) КАК ЛеоУчетЗатратОПЗС_Свод
			|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЛеоУчетЗатратОПЗС_Свод.Номенклатура
			|				И ТоварыНаСкладахОстатки.СерияНоменклатуры = ЛеоУчетЗатратОПЗС_Свод.СерияНоменклатуры
			|				И (НАЧАЛОПЕРИОДА(ЛеоУчетЗатратОПЗС_Свод.Период, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаОстатки, ДЕНЬ))) КАК результат					
			|";

	//Запрос.УстановитьПараметр("Склад",Склад);
	//Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);				
	Запрос.УстановитьПараметр("ПустаяСерияНоменклатуры",Справочники.СерииНоменклатуры.ПустаяСсылка());	
	Запрос.УстановитьПараметр("Свойство1",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Бренд PR"));
	Запрос.УстановитьПараметр("Свойство2",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Категория"));				
	Запрос.УстановитьПараметр("Свойство3",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Категория аналитическая"));	
	Запрос.УстановитьПараметр("Свойство4",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Полный срок годности полуфабрикаты дни"));
	Запрос.УстановитьПараметр("Свойство5",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Полный срок годности товара, мес."));				
	Запрос.УстановитьПараметр("Свойство6",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АВС"));
	Запрос.УстановитьПараметр("Свойство7",ПланыВидовхарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Уникальность ассортимента"));				
	
	ТЗ.Очистить();
	
	ДатаОстатки	=	ДатаНач;
	Запрос.УстановитьПараметр("ДатаОстатки",КонецДня(ДатаОстатки));				
	ТЗ		=	Запрос.Выполнить().Выгрузить();
	Пока ДатаОстатки <= КонецДня(ДатаКон) Цикл
		
		//Если	ЗначПериода=Перечисления.Периодичность.День Тогда
			ДатаОстатки	=	ДатаОстатки	+ 24*60*60;
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Неделя Тогда
		//	ДатаОстатки	=	ДатаОстатки	+ 7*24*60*60;
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Декада Тогда
		//	ДатаОстатки	=	ДатаОстатки	+ 10*24*60*60;
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Месяц Тогда
		//	ДатаОстатки	=	 ДобавитьМесяц(ДатаОстатки,1);
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Квартал Тогда
		//	ДатаОстатки	=	ДобавитьМесяц(ДатаОстатки,3);
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Полугодие Тогда
		//	ДатаОстатки	=	ДобавитьМесяц(ДатаОстатки,6);
		//ИначеЕсли	ЗначПериода=Перечисления.Периодичность.Год Тогда
		//	ДатаОстатки	=	ДобавитьМесяц(ДатаОстатки,12);
		//Иначе
		//	Прервать;
		//КонецЕсли;
		
		
		Если ДатаОстатки>КонецДня(ДатаКон) Тогда
			Прервать;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаОстатки",КонецДня(ДатаОстатки));				
		ТЗ_День	=	Запрос.Выполнить().Выгрузить();
		
		ДополнитьТаблицу(ТЗ, ТЗ_День);
		
	КонецЦикла;
	
	Возврат ТЗ;       
	
КонецФункции

Функция ЗаменитьСпецСимволы(Стр)

	Проверили = СтрЗаменить(Стр,"'","_");
	Проверили = СтрЗаменить(Проверили,"%","");
	Проверили = СтрЗаменить(Проверили,"Без НДС",0);
	Возврат Проверили;
	
КонецФункции
//Степан 241001 <-- Обновить себестоимость и ОСГ по текущему периоду --  

//Степан 250130 --> Проверить Оперативный статус номенклатуры и поменять на Архив
Процедура Лео_ПроверитьСтатусНоменклатуры() Экспорт
	
	СписокНом = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбраннаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Статус производства"));
	Запрос.УстановитьПараметр("Значение",Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Не актив"));
	Запрос.Текст ="ВЫБРАТЬ
		|	Товар.Ссылка КАК НазваниеТовара,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Остатки,
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ПОМЕСТИТЬ вт_ПолучитьДанные
		|ИЗ
		|	Справочник.Номенклатура КАК Товар
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ВыбраннаяДата, ) КАК ТоварыНаСкладахОстатки
		|		ПО Товар.Наименование = ТоварыНаСкладахОстатки.Номенклатура.Наименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ЗначенияСвойствОбъектов.Объект)
		|		И (&Свойство = ЗначенияСвойствОбъектов.Свойство)
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Значение = &Значение
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ПолучитьДанные.НазваниеТовара,
		|	вт_ПолучитьДанные.Свойство,
		|	вт_ПолучитьДанные.Значение,
		|	вт_ПолучитьДанные.Остатки КАК Остаток
		|ИЗ
		|	вт_ПолучитьДанные КАК вт_ПолучитьДанные
		|ГДЕ 
		|	вт_ПолучитьДанные.Остатки = 0 И 
		|	вт_ПолучитьДанные.Свойство = &Свойство 
		|	И вт_ПолучитьДанные.Значение = &Значение
		|";
	
	ТЗ = Запрос.Выполнить().Выгрузить();

	Для каждого стр из ТЗ Цикл
		
		Эл = Стр.НазваниеТовара.ПолучитьОбъект();
		
		Если Эл.Лео_ОперативныйСтатусНоменклатуры = Справочники.Лео_ОперативныйСтатусНоменклатуры.НайтиПоНаименованию("Актив") Тогда
			Эл.Лео_ОперативныйСтатусНоменклатуры = Справочники.Лео_ОперативныйСтатусНоменклатуры.НайтиПоНаименованию("Архив");
			Эл.Записать();
			СписокНом.Добавить(Эл);
		КонецЕсли;
				
	КонецЦикла;   
	
	Если СписокНом.Количество() > 0 Тогда
		ОповеститьПоМаршруту(СписокНом);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлектронныйАдресПользователя(Пользователь)
	
	ЭлектронныйАдрес = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Пользователь
	|	И КонтактнаяИнформация.Тип  = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты) 
    |"; 
	Запрос.УстановитьПараметр("Пользователь",Пользователь); 
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда 
		ЭлектронныйАдрес = Рез[0].Представление;	
	КонецЕсли;
	Возврат ЭлектронныйАдрес;
	
КонецФункции

Процедура ОповеститьПоМаршруту(Док) 
	
	//Отправляем только из рабочей базы!
	Если НЕ СтрокаСоединенияИнформационнойБазы() = "Srvr=""192.168.100.106"";Ref=""upp83"";"  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда				 
		Если НЕ РольДоступна("ПравоИспользованияЭлектроннойПочты") Тогда				 
			Возврат;
	 	КонецЕсли; 
 	КонецЕсли; 

	//СписокДоступныхЗаписей = УправлениеЭлектроннойПочтой.ПроверитьУчетныеЗаписиДляОтправкиПисем(глЗначениеПеременной("глТекущийПользователь"),Истина,Ложь);
	//Если СписокДоступныхЗаписей.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли; 
	
	//Если СтрокаСоединенияИнформационнойБазы() = "Srvr=""192.168.100.106"";Ref=""test_SD1"";"  Тогда
	//	сообщить("Это отправка из копии базы -> "+СтрокаСоединенияИнформационнойБазы());                 
	//КонецЕсли;

	МассивАдресов = Новый Массив;
	МассивАдресов.Добавить("zakaz@leovit.ru");
	МассивАдресов.Добавить("sdekin@leovit.ru");
	//СписокРассылки = Новый Массив;
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние,
	//|	абс_СостоянияСогласованияДокументовСрезПоследних.Этап
	//|ИЗ
	//|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
	//
	//Запрос.УстановитьПараметр("Ссылка",Док);
	//
	//ТЗСостоянияСогласования = Запрос.Выполнить().Выгрузить();  
	//
	//Если ТЗСостоянияСогласования.Количество() > 0 Тогда 
	//	Если НЕ ТЗСостоянияСогласования[0].Состояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
	//		Для каждого Сотр из ТЗСостоянияСогласования[0].Этап.СогласующиеЛица Цикл
	//			Если Сотр.ДатаДействия = Дата(1, 1, 1) ИЛИ Сотр.ДатаДействия > Док.Дата Тогда 
	//				ЭлектронныйАдрес = ЭлектронныйАдресПользователя(Сотр.Пользователь); 
	//				Если EmailValid(ЭлектронныйАдрес) И ИспользоватьНапоминания(Сотр.Пользователь) Тогда
	//					МассивАдресов.Добавить(ЭлектронныйАдрес);
	//				Иначе
	//					//сообщить("у пользователя " + Сотр.Пользователь + " нет электронного адреса!");                 
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//		//МассивАдресов.Добавить("ikatanovich@leovit.ru");
	//		//МассивАдресов.Добавить("sdekin@leovit.ru");
	//	КонецЕсли;
	//Иначе
	//	Возврат;
	//КонецЕсли;
	
	Если МассивАдресов.Количество() = 0 Тогда 
		Возврат; 
	КонецЕсли;
	
	ТемаПисьма = "Изменение статуса номенклатуры";
	Если УжеОтправленоСегодня(ТемаПисьма) Тогда  
		Возврат; 
	КонецЕсли;
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", ТемаПисьма);
	
	ТекстПисьма = "";
	//ТекстПисьма = "Здравствуйте, коллеги! <BR> <BR>"; 
	Если Док.Количество() > 0 Тогда
		Для каждого эл из Док Цикл
    		ТекстПисьма = ТекстПисьма +  " " + Эл.Артикул +   " " + Эл.Наименование +    " - статус Актив поменяли на Архив;" + "<BR>";
	//ТекстПисьма = ТекстПисьма +  "Инициатор:       " + Док.Ответственный + "<BR>";
	//ТекстПисьма = ТекстПисьма +  "Контрагент:      " + Док.Контрагент + "<BR>";
	//ТекстПисьма = ТекстПисьма +  "Сумма:           " + Док.СуммаДокумента + " " + Док.ВалютаДокумента.Наименование + "<BR>";  
	КонецЦикла; 
	Иначе
		Возврат; 
	КонецЕсли;
	//Если абс_СверхЛимита Тогда  
	//    ТекстПисьма = ТекстПисьма +  "Сверх лимита <BR>";
	//КонецЕсли;
    ТекстПисьма = ТекстПисьма + "<BR>";
    ТекстПисьма = ТекстПисьма +  "автоматическая рассылка из рег.задания" + "<BR>";

	//Для каждого Адр Из СписокРассылки Цикл
	//    ТекстПисьма = ТекстПисьма + Адр + "<BR>";
	//КонецЦикла;
	
    СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	//	Если МассивФайлов.Количество()>0 Тогда
	//	
	//	СписокФайловВложений = Новый СписокЗначений;
	//	
	//	Для каждого Файл из МассивФайлов Цикл
	//		ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(Файл);
	//		
	//		ФайлВложения = СписокФайловВложений.Добавить();
	//		
	//		СтруктураВложения  = Новый Структура();
	//		
	//		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл);
	//		СтруктураВложения.Вставить("Хранилище", ДвоичныеДанныеФайла);
	//		
	//		СтруктураВложения.Вставить("ИмяФайла", ИмяФайла);
	//		
	//		ФайлВложения.Значение = СтруктураВложения;
	//	КонецЦикла;
	//	
	//	СтруктураПараметров.Вставить("СписокФайловВложений", СписокФайловВложений);
	//КонецЕсли;
	
	Попытка   
		
		УстановитьПривилегированныйРежим(Истина);
		СтруктураПисьма = НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
		ЭлектронныеПисьма = Новый Соответствие;
		
		ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		
		ИзмененныйСоставПисем = Новый Соответствие;	
		ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
		Для каждого Письмо Из ЭлектронныеПисьма Цикл
			Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
				ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
				
				ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
					
					ОбъектПисьмо.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			
				Попытка
					ОбъектПисьмо.Записать();
				Исключение
					Продолжить;;
				КонецПопытки;
			Иначе
				Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
					Письмо.Значение.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			КонецЕсли; 
		    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	
	Исключение
		Возврат;
	КонецПопытки;	
		
	ТекстОшибок = "";	
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисемБезЛогирования(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ,,
		ИзмененныйСоставПисем, Истина , , Ложь,ТекстОшибок );
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
	КонецПопытки;	

КонецПроцедуры

Функция EmailValid(Адрес)
	
    //Адрес = "test@me@gmail.narod.am";

    ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";

    Цифры = "0123456789";

    //ищем крайний справа символ @ для правильного выделения локальной и доменной части

    ИндексСобаки = Найти(Адрес,"@");

    //1. строка адреса вообще не содержит разделителя

    Если ИндексСобаки = 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    УрезаемаяСтрока = Сред(Адрес, ИндексСобаки+1);

    Пока Найти(УрезаемаяСтрока,"@") > 0 Цикл

        ИндексСобаки = ИндексСобаки + Найти(УрезаемаяСтрока,"@");

        УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);

    КонецЦикла;

    ДоменнаяЧасть = Сред(Адрес, ИндексСобаки+1);

    ЛокальнаяЧасть = Лев(Адрес, ИндексСобаки-1);

    //2. Проверяем длину локальной части

    Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //3. Проверяем длину доменной части

    Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //4. Проверяем что локальная части не начинается и не заканчивается на "."

    Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //5. Локальная части не содержит 2 или более "." подряд

    Если Найти(ЛокальнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //Проверка доменной части

    //6. Доменная часть не начинается с точки

    Если Лев(ДоменнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //7. Доменная часть не содержит 2 или более "." подряд

    Если Найти(ДоменнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //8. Проверка частей доменной части

    //каждая часть начинается с буквы и заканчивается буквой или цифрой

    //каждая часть длиной не более 63 символов

    ИдентификаторыДоменнойЧасти = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДоменнаяЧасть, ".");

    Для Каждого ИдентификаторДомена ИЗ ИдентификаторыДоменнойЧасти Цикл

        Если СтрДлина(ИдентификаторДомена) > 63 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0

            //для доменов, нарушающих RFC 1035 п.2.3.1, например @1c.ru :)

            И Найти(Цифры, Лев(ИдентификаторДомена,1)) = 0

            Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

    КонецЦикла;

    Возврат ИСТИНА;

КонецФункции

Функция ИспользоватьНапоминания(Пользователь)
	
	ИспользоватьНапомининия = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	       Наименование,
		|	       ЗначениеНастроек.Значение
		|	   ИЗ
		|	       ПланВидовХарактеристик.НастройкиПользователей КАК Настройки
		|	   ЛЕВОЕ СОЕДИНЕНИЕ
		|	       РегистрСведений.НастройкиПользователей КАК ЗначениеНастроек
		|	   ПО
		|	       ЗначениеНастроек.Настройка=Настройки.Ссылка
		|	       И  ЗначениеНастроек.Пользователь=&Пользователь
		|	   ГДЕ
		|	       НЕ ПометкаУдаления
		|	       И Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ИспользоватьНапоминания)
		|";
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		ИспользоватьНапомининия = ТЗ[0].Значение;
	КонецЕсли;
	Возврат ИспользоватьНапомининия;
	
КонецФункции

Функция УжеОтправленоСегодня(Тема)
	
	УжеОтправлено = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмо.ДатаОтправления,
	               |	ЭлектронноеПисьмо.СтатусПисьма,
	               |	ЭлектронноеПисьмо.Тема
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	               |ГДЕ
	               |	ЭлектронноеПисьмо.Тема = &Тема
	               |	И ЭлектронноеПисьмо.ДатаОтправления МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |	И ЭлектронноеПисьмо.СтатусПисьма = &СтатусПисьма";
	Запрос.УстановитьПараметр("Тема",Тема);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("СтатусПисьма",Перечисления.СтатусыПисем.Отправленное);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда 
		УжеОтправлено = Истина;
	КонецЕсли;
	Возврат УжеОтправлено;
	
КонецФункции

// Функция обрабатывает пользовательское событие - создание нового электронного письма.
// 
// Параметры:
//  ТекущийПользователь          - СправочникСсылка.Пользователи, текущий пользователь
//  СтруктураНовогоПисьма        - Структура с данными нового письма
//    Ключи структуры:
//     Тело                 - строка, текст письма (прочтой текст, или текст в формате ХТМЛ)
//     Тема                 - Строка
//     ВидТекста            - ПеречислениеСсылка.ВидыТекстовЭлектронныхПисем, вид текста нового письма
//     СписокФайловВложений - СписокЗначений, где значения - структура параметров и знаяений для создания
//                            нового элемента справочника ВложенияЭлектронныхПисем, ключи структуры
//                            соответствуют именам реквизитов справочника ВложенияЭлектронныхПисем
//     УчетнаяЗапись        - СправочникСсылка.УчетнаяЗапись, учетная запись нового письма
//     Кому                 - Список значений, значение - адрес эл.почты, представление - представление получателя
//     Копии                - Список значений, значение - адрес эл.почты, представление - представление получателя
//     СкрытыеКопии         - Список значений, значение - адрес эл.почты, представление - представление получателя
//     Основание            - ДокументСсылка.ЭлектронноеПисьмо, ДокументСсылка.Событие
//     ГруппаУчетнойЗаписи  - элемент справочника ГруппыПисемЭлектроннойПочты, группа писем для нового письма
//     Ответственный        - элемент справочника Пользователи, ответственный для запоолнения в письме
//     КодировкаПисьма      - строка, задает кодировку письма, кроме ответов, переадресаций и скопированных писем,
//                            т.е. писем с определенным объектом-основанием
//
//  ПеренестиВложенияИзОснования - Булево, переносить ли аттачи письма из основания (действует для копирования и пересылки)
//  Копирование                  - булево, признак копирования электронного письма
//  ТекущийЭлементХТМЛ           - Булево, устанавливать в качестве активного элемента в открытой форме письма поле ХТМЛ(Текстового) документа
//  Дополнительно                - Строка, "Ответ", "Переадресация", вид действия при создании нового письма
//  ФормаВладелец                - Форма, владелец для открываемой формы нового письма
//  ПодписьПодТекстом            - Булево, устанавливать подпись в письме "после" или "перед" текстом.
//  ОткрыватьПисьмо              - Булево, открывать форму письма или записывать письмо и не открывать форму
//
//  ВозвращаемреЗначение
//   СтруктураПараметров - Структура
//     Ключи структуры:
//     Письмо       - ДокументОбъект.ЭлектронноеПисьмо, новое электронное письмо
//     Форма        - Форма, форма нового электронного письма
//     ПисьмоСсылка - ДокументСсылка.ЭлектронноеПисьмо, новое электронное письмо
//
Функция НаписатьПисьмо(ТекущийПользователь, СтруктураНовогоПисьма = Неопределено, ПеренестиВложенияИзОснования = Ложь, Копирование = Ложь,
					   ТекущийЭлементХТМЛ = Ложь, Дополнительно = Неопределено, ФормаВладелец = Неопределено, ПодписьПодТекстом = Ложь,
					   ОткрыватьПисьмо = Истина)

	Перем УчетнаяЗапись;
	Перем Тема;
	Перем Тело;
	Перем ВидТекста;
	Перем СписокФайловВложений;
	Перем ГруппаУчетнойЗаписи;
	Перем Кому;
	Перем Копии;
	Перем СкрытыеКопии;
	Перем Основание;
	Перем Ответственный;
	Перем ПредметКонтакта;
	Перем КодировкаПисьма;
	Перем ЗаявкаКандидата;
	
	Если СтруктураНовогоПисьма = Неопределено Тогда
		СтруктураНовогоПисьма = Новый Структура;
	КонецЕсли; 
	
	// Определим учетную запись для создания письма
	
	СписокДоступныхЗаписей = Новый СписокЗначений;
	СписокДоступныхЗаписей.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	//СписокДоступныхЗаписей = ПроверитьУчетныеЗаписиДляОтправкиПисем(ТекущийПользователь);
	Если СписокДоступныхЗаписей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("УчетнаяЗапись", УчетнаяЗапись);
	Если ЗначениеЗаполнено(УчетнаяЗапись) И СписокДоступныхЗаписей.НайтиПоЗначению(УчетнаяЗапись) = Неопределено Тогда
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяУчетнаяЗапись");
		Если СписокДоступныхЗаписей.НайтиПоЗначению(УчетнаяЗапись) = Неопределено Тогда
			УчетнаяЗапись = Неопределено;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = СписокДоступныхЗаписей[0].Значение;
	КонецЕсли;
	
	Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	Письмо.Дата                             = ТекущаяДата();
	Письмо.УчетнаяЗапись                    = УчетнаяЗапись;
	Письмо.ОтправительИмя                   = УчетнаяЗапись.Наименование;
	Письмо.ОтправительАдресЭлектроннойПочты = УчетнаяЗапись.АдресЭлектроннойПочты;
	Письмо.ОтправительПредставление         = УчетнаяЗапись.Наименование + " <" + УчетнаяЗапись.АдресЭлектроннойПочты + ">";
	
	СтруктураНовогоПисьма.Свойство("СписокФайловВложений", СписокФайловВложений);
	
	ОписаниеТиповПредмета = Новый ОписаниеТипов("Строка");
	СтруктураНовогоПисьма.Свойство("Основание", Основание);
	ЕстьДокументОснование = Ложь;
	Если Основание <> Неопределено Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) Тогда
			ЕстьДокументОснование = Не Основание.Пустая();
		Иначе
			ЕстьДокументОснование = Не Основание.Ссылка.Пустая();
		КонецЕсли;
	КонецЕсли;
	Если ЕстьДокументОснование Тогда
		Письмо.ОснованиеПисьма = ?(Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)), Основание, Основание.Ссылка);
		Если ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			Письмо.мОбъектОснование = Основание;
		КонецЕсли; 
		Если Письмо.УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам Тогда
			СтруктураНовогоПисьма.Свойство("ПредметКонтакта", ПредметКонтакта);
			Если ЗначениеЗаполнено(ПредметКонтакта) И ОписаниеТиповПредмета.СодержитТип(ТипЗнч(ПредметКонтакта)) Тогда
				Письмо.ПредметКонтакта = ПредметКонтакта;
			Иначе
				Если Письмо.УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
					Письмо.ПредметКонтакта = Основание.ПредметКонтакта;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЕстьДокументОснование
	   И УчетнаяЗапись.ФорматПисьмаДляОтветовИПереадресацийБратьИзИсходного
	   И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
		ВидТекста = Основание.ВидТекстаПисьма;
	Иначе
		СтруктураНовогоПисьма.Свойство("ВидТекста", ВидТекста);
	КонецЕсли;
	
	Если ЕстьДокументОснование
	   И УчетнаяЗапись.КодировкуПисьмаДляОтветовБратьИзИсходного
	   И (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")) Тогда
		КодировкаПисьма = Основание.КодировкаПисьма;
	Иначе
		СтруктураНовогоПисьма.Свойство("КодировкаПисьма", КодировкаПисьма);
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("ЗаявкаКандидата", ЗаявкаКандидата);
	Если ЗначениеЗаполнено(ЗаявкаКандидата) Тогда
		Письмо.ЗаявкаКандидата = ЗаявкаКандидата;
	ИначеЕсли ЕстьДокументОснование Тогда
		Письмо.ЗаявкаКандидата = Основание.ЗаявкаКандидата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидТекста) Тогда
		Письмо.ВидТекстаПисьма = УчетнаяЗапись.ФорматТекстаПисьмаПоУмолчанию;
		Если НЕ ЗначениеЗаполнено(Письмо.ВидТекстаПисьма) Тогда
			Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
		КонецЕсли;
	Иначе
		Письмо.ВидТекстаПисьма = ВидТекста;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодировкаПисьма) Тогда
		Письмо.КодировкаПисьма = КодировкаПисьма;
	Иначе
		Письмо.КодировкаПисьма = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "КодировкаПисьмаЭлектроннойПочтыПоУмолчанию");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Письмо.КодировкаПисьма) Тогда
		Письмо.КодировкаПисьма = "utf-8";
	КонецЕсли;
	
	Если Дополнительно = "Ответ" Тогда
		Письмо.Ответ         = Истина;
	ИначеЕсли Дополнительно = "Переадресация" Тогда
		Письмо.Переадресация = Истина;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Тело", Тело);
	Если ЗначениеЗаполнено(Тело) Тогда
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			Письмо.ТекстПисьма = "<HTML><HEAD>
								 |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + ?(ЗначениеЗаполнено(Письмо.КодировкаПисьма), Письмо.КодировкаПисьма, "utf-8") + """" + ">
								 |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
								 |<BODY><DIV>" + Тело + "</DIV></BODY></HTML>";
			
		Иначе
			Письмо.ТекстПисьма = Тело;
			
		КонецЕсли;
	Иначе
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			Письмо.ТекстПисьма = "<HTML><HEAD>
								 |<META http-equiv=Content-Type content=""text/html; charset=" + ?(ЗначениеЗаполнено(Письмо.КодировкаПисьма), Письмо.КодировкаПисьма, "utf-8") + """" + ">
								 |<META content=""MSHTML 6.00.2900.2912"" name=GENERATOR></HEAD>
								 |<BODY><DIV></DIV></BODY></HTML>";
			
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("Тема", Тема);
	Если ЗначениеЗаполнено(Тема) Тогда
		Письмо.Тема = Тема;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.Событие") Тогда
			
			Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				Тело = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY>" + Основание.СодержаниеСобытия + "</BODY></HTML>";
			Иначе
				Тело = Основание.СодержаниеСобытия;
			КонецЕсли
			
		Иначе
			
			Тело = Основание.ТекстПисьма;
			
			Если ((Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками)
			   И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.HTML И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками)
			   ИЛИ ((Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Текст ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.Прочее)
			   И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.Текст И Основание.ВидТекстаПисьма <> Перечисления.ВидыТекстовЭлектронныхПисем.Прочее) Тогда

				Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
					
					Тело = "<HTML><HEAD>
								  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
								  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
								  |<BODY>" + Тело + "</BODY></HTML>";
					
				Иначе
					
					//Тело = ПреобразоватьТекстИзХТМЛФорматаВПростой(Тело);
					
				КонецЕсли; 
			
			КонецЕсли; 
			
		КонецЕсли; 
		
		Письмо.ТекстПисьма = Тело;
		
	КонецЕсли;
	
	СтруктураНовогоПисьма.Свойство("ГруппаУчетнойЗаписи", ГруппаУчетнойЗаписи);
	Если ЗначениеЗаполнено(ГруппаУчетнойЗаписи) И ГруппаУчетнойЗаписи.Владелец = УчетнаяЗапись Тогда
		Письмо.ГруппаУчетнойЗаписи = ГруппаУчетнойЗаписи;
	Иначе
		Письмо.УказатьГруппуПоУмолчанию();
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Ответственный", Ответственный);
	Если ЗначениеЗаполнено(Ответственный) Тогда
		Письмо.Ответственный = Ответственный;
	Иначе
		Письмо.Ответственный = ТекущийПользователь;
	КонецЕсли; 
	
	СтруктураНовогоПисьма.Свойство("Кому", Кому);
	Если ТипЗнч(Кому) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из Кому Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.КомуТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.Кому) Тогда
				Письмо.Кому = Письмо.Кому + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.Кому = Письмо.Кому + ЭлементСписка.Значение;
			Иначе
				Письмо.Кому = Письмо.Кому + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	Письмо.КомуПредставление = ПолучитьПредставлениеПолучателей(Письмо.КомуТЧ);

	СтруктураНовогоПисьма.Свойство("Копии", Копии);
	Если ТипЗнч(Копии) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из Копии Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.КопииТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.Копии) Тогда
				Письмо.Копии = Письмо.Копии + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.Копии = Письмо.Копии + ЭлементСписка.Значение;
			Иначе
				Письмо.Копии = Письмо.Копии + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	Письмо.КопииПредставление = ПолучитьПредставлениеПолучателей(Письмо.КопииТЧ);

	СтруктураНовогоПисьма.Свойство("СкрытыеКопии", СкрытыеКопии);
	Если ТипЗнч(СкрытыеКопии) = Тип("СписокЗначений") Тогда
		Для каждого ЭлементСписка Из СкрытыеКопии Цикл
			Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТЧ = Письмо.СкрытыеКопииТЧ.Добавить();
			СтрокаТЧ.АдресЭлектроннойПочты = ЭлементСписка.Значение;
			СтрокаТЧ.Представление         = ЭлементСписка.Представление;
			Если НЕ ПустаяСтрока(Письмо.СкрытыеКопии) Тогда
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ", ";
			КонецЕсли;
			Если ПустаяСтрока(ЭлементСписка.Представление) Тогда
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ЭлементСписка.Значение;
			Иначе
				Письмо.СкрытыеКопии = Письмо.СкрытыеКопии + ЭлементСписка.Представление + " <" + ЭлементСписка.Значение + ">";
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ФормаВладелец <> Неопределено Тогда
		ФормаПисьма = Письмо.ПолучитьФорму(, ФормаВладелец);
	Иначе
		ФормаПисьма = Письмо.ПолучитьФорму();
	КонецЕсли; 
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо")
	 ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ТекСсылка"   , ?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо"), Основание, Основание.Ссылка));
		Запрос.УстановитьПараметр("ПустаяСтрока", "");
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенияЭлектронныхПисем.ИмяФайла КАК ИмяФайла,
		|	ВложенияЭлектронныхПисем.Хранилище КАК Хранилище,
		|	ВложенияЭлектронныхПисем.Наименование КАК Наименование,
		|	ВложенияЭлектронныхПисем.ИДФайлаПочтовогоПисьма КАК ИДФайлаПочтовогоПисьма
		|ИЗ
		|	Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
		|ГДЕ
		|	ВложенияЭлектронныхПисем.Объект = &ТекСсылка
		|	И (НЕ ВложенияЭлектронныхПисем.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ПустаяСтрока(Выборка.ИДФайлаПочтовогоПисьма) Тогда
					Если ПеренестиВложенияИзОснования Тогда
						СтрокаТЗ = ФормаПисьма.ВложенияПисьмаТЗ.Добавить();
						СтрокаТЗ.ИмяФайла     = Выборка.ИмяФайла;
						СтрокаТЗ.Наименование = Выборка.Наименование;
						СтрокаТЗ.Данные       = Выборка.Хранилище;
					КонецЕсли; 
				Иначе
					СтрокаТЗ = ФормаПисьма.ВложенияПисьмаТЗСкрытые.Добавить();
					СтрокаТЗ.ИмяФайла               = Выборка.ИмяФайла;
					СтрокаТЗ.Наименование           = Выборка.Наименование;
					СтрокаТЗ.Данные                 = Выборка.Хранилище;
					СтрокаТЗ.ИДФайлаПочтовогоПисьма = Выборка.ИДФайлаПочтовогоПисьма;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли;
	#КонецЕсли
	
	// Сформируем текст письма для ответа или переадресации
	Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") ИЛИ ТипЗнч(Основание) = Тип("ДокументОбъект.ЭлектронноеПисьмо"))
	   И НЕ Копирование Тогда
		
		ТекстПисьма = Письмо.ТекстПисьма;
		
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			НачалоТела = Найти(ТекстПисьма, "<BODY");
			
			ДатаИсходногоПисьма = Основание.Дата;
			Если (Основание.СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ Основание.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное) И ЗначениеЗаполнено(Основание.Дата) Тогда
				ДатаИсходногоПисьма = Основание.Дата;
			КонецЕсли;
			
			СтрокаОтправителя = "Отправитель: ";
			Если НЕ ПустаяСтрока(Основание.ОтправительИмя) Тогда
				СтрокаОтправителя = СтрокаОтправителя + СокрЛП(Основание.ОтправительИмя) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(Основание.ОтправительИмя, """", "")) + "<" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + "</A>&gt";
			Иначе
				СтрокаОтправителя = СтрокаОтправителя + "&lt<A href=" + """" + "mailto:" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + """" + ">" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + "</A>&gt";
			КонецЕсли;
			
			СтрокаКому = "";
			Для каждого СтрокаТЧ Из Основание.КомуТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					СтрокаКому = СтрокаКому + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКому = СтрокаКому + СокрЛП(СтрокаТЧ.Представление) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(СтрокаТЧ.Представление, """", "")) + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				Иначе
					СтрокаКому = СтрокаКому + "&lt<A href=" + """" + "mailto:" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКому) Тогда
				СтрокаКому = "Получатели: " + СтрокаКому;
			КонецЕсли; 
			
			СтрокаКопии = "";
			Для каждого СтрокаТЧ Из Основание.КопииТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					СтрокаКопии = СтрокаКопии + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКопии = СтрокаКопии + СокрЛП(СтрокаТЧ.Представление) + " &lt<A href=" + """" + "mailto:" + СокрЛП(СтрЗаменить(СтрокаТЧ.Представление, """", "")) + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">" + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				Иначе
					СтрокаКопии = СтрокаКопии + "&lt<A href=" + """" + "mailto:" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + """" + ">" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + "</A>&gt";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
				СтрокаКопии = "Копии: " + СтрокаКопии;
			КонецЕсли; 
			
			Если НачалоТела > 0 Тогда
				
				// Ищем конец начала тела
				а = НачалоТела;
				КонецНачалаТела = 0;
				Пока Истина Цикл
					Если Сред(ТекстПисьма, а, 1) = ">" Тогда
						КонецНачалаТела = а;
						Прервать;
					Иначе
						а = а + 1;
						Продолжить;
					КонецЕсли; 
				КонецЦикла; 
				
				НовыйТекстПисьма = Лев(ТекстПисьма, КонецНачалаТела) + "<DIV><BR></DIV>" + 
								  "<BLOCKQUOTE dir=ltr style=" + """" + "PADDING-LEFT: 15px; MARGIN-LEFT: 5px; BORDER-LEFT: #000000 2px solid; MARGIN-RIGHT: 0px" + """" + ">" + 
								  "<P><A href="+ """" + Строка(?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо"), Основание.УникальныйИдентификатор(), Основание.Ссылка.УникальныйИдентификатор())) + """" + ">--- Исходное сообщение --- </A>" + 
								  "<BR>Дата: " + Формат(ДатаИсходногоПисьма, "ДЛФ=DT") +
								  "<BR>" + СтрокаОтправителя;
								  
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + СтрокаКому;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + СтрокаКопии;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Основание.Тема) Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + "<BR>" + "Тема: " + Основание.Тема;
				КонецЕсли;
				
				НовыйТекстПисьма = НовыйТекстПисьма + "</P><P><BR></P>";
				
				КонецТела = Найти(ТекстПисьма, "</BODY");
				Если КонецТела > 0 Тогда
					НовыйТекстПисьма = НовыйТекстПисьма + Сред(ТекстПисьма, (КонецНачалаТела + 1), (КонецТела - КонецНачалаТела - 1)) + "</BLOCKQUOTE>" + Сред(ТекстПисьма, КонецТела);
					Письмо.ТекстПисьма = НовыйТекстПисьма;
				КонецЕсли;
			КонецЕсли; 
			
		Иначе
			
			НовыйТекстПисьма = Новый ТекстовыйДокумент;
			
			НовыйТекстПисьма.УстановитьТекст(ТекстПисьма);
			
			НовыйТекстПисьма.ВставитьСтроку(1, "--- Исходное сообщение ---");
			ПоследняяСтрока = 1;
			
			ДатаИсходногоПисьма = Основание.Дата;
			Если (Основание.СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ Основание.СтатусПисьма = Перечисления.СтатусыПисем.Отправленное) И ЗначениеЗаполнено(Основание.Дата) Тогда
				ДатаИсходногоПисьма = Основание.Дата;
			КонецЕсли;
			НовыйТекстПисьма.ВставитьСтроку(2, "Дата: " + Формат(ДатаИсходногоПисьма, "ДЛФ=DT"));
			ПоследняяСтрока = 2;
			
			СтрокаОтправителя = "Отправитель: ";
			Если НЕ ПустаяСтрока(Основание.ОтправительИмя) Тогда
				СтрокаОтправителя = СтрокаОтправителя + СокрЛП(Основание.ОтправительИмя) + " <" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">";
			Иначе
				СтрокаОтправителя = СтрокаОтправителя + "<" + СокрЛП(Основание.ОтправительАдресЭлектроннойПочты) + ">";
			КонецЕсли;
			НовыйТекстПисьма.ВставитьСтроку(3, СтрокаОтправителя);
			ПоследняяСтрока = 3;
			
			СтрокаКому = "";
			Для каждого СтрокаТЧ Из Основание.КомуТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКому) Тогда
					СтрокаКому = СтрокаКому + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКому = СтрокаКому + СокрЛП(СтрокаТЧ.Представление) + " <" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				Иначе
					СтрокаКому = СтрокаКому + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКому) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Получатели: " + СтрокаКому);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли; 
			
			СтрокаКопии = "";
			Для каждого СтрокаТЧ Из Основание.КопииТЧ Цикл
				
				Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
					СтрокаКопии = СтрокаКопии + ", ";
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаТЧ.Представление) Тогда
					СтрокаКопии = СтрокаКопии + СокрЛП(СтрокаТЧ.Представление) + " <" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				Иначе
					СтрокаКопии = СтрокаКопии + "<" + СокрЛП(СтрокаТЧ.АдресЭлектроннойПочты) + ">";
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(СтрокаКопии) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Копии: " + СтрокаКопии);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли; 
			
			Если НЕ ПустаяСтрока(Основание.Тема) Тогда
				НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "Тема: " + Основание.Тема);
				ПоследняяСтрока = ПоследняяСтрока + 1;
			КонецЕсли;
				
			НовыйТекстПисьма.ВставитьСтроку(ПоследняяСтрока + 1, "");
			
			Для а = 1 по НовыйТекстПисьма.КоличествоСтрок() Цикл
				НовыйТекстПисьма.ЗаменитьСтроку(а, ("> " + НовыйТекстПисьма.ПолучитьСтроку(а)));
			КонецЦикла;
			
			НовыйТекстПисьма.ВставитьСтроку(1, "");
			НовыйТекстПисьма.ВставитьСтроку(1, "");
			
			Письмо.ТекстПисьма = НовыйТекстПисьма.ПолучитьТекст();
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// Проставим при необходимости подпись
	Если НЕ Копирование И ((УчетнаяЗапись.ДобавлятьПодписьКИсходящимПисьмам И Дополнительно = Неопределено)
	 ИЛИ ((Дополнительно = "Ответ" ИЛИ Дополнительно = "Переадресация") И УчетнаяЗапись.ДобавлятьПодписьКОтветамИПересылкам = Истина)) Тогда
	 
		Отказ = Ложь;
	
		НовыйКом = Новый COMОбъект("HtmlFile");
		НовыйКом.open("text/html");
		НовыйКом.write(УчетнаяЗапись.ТекстПодписи);
		НовыйКом.close();
		
		Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
			
			ТекстПисьма = Письмо.ТекстПисьма;
			
			Если ПустаяСтрока(ТекстПисьма) Тогда
				ТекстПисьма = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY><DIV></DIV></BODY></HTML>";
			Иначе
				Если Найти(ТекстПисьма, "<BODY") = 0 тогда
				ТекстПисьма = "<HTML><HEAD>
							  |<META http-equiv=Content-Type content=" + """" + "text/html; charset=" + Письмо.КодировкаПисьма + """" + ">
							  |<META content=" + """" + "MSHTML 6.00.2800.1400" + """" + " name=GENERATOR></HEAD>
							  |<BODY>" + ТекстПисьма + "</BODY></HTML>";
				КонецЕсли; 
			КонецЕсли; 
			
			НачалоТела = Найти(ТекстПисьма, "<BODY");
			КонецНачалаТела = 0;
			а = НачалоТела;
			Пока Истина Цикл
				Если Сред(ТекстПисьма, а, 1) = ">" Тогда
					КонецНачалаТела = а;
					Прервать;
				Иначе
					а = а + 1;
				КонецЕсли; 
			КонецЦикла;
			
			Если НачалоТела = 0 ИЛИ КонецНачалаТела = 0 Тогда
				Отказ = Истина;
			КонецЕсли;
			
			ТегBODY = НовыйКом.all.Tags("BODY");
			Если ТегBODY.length > 0 Тогда
				ХТМЛПодписи = ТегBODY.item(0).innerHTML;
				Если ПустаяСтрока(ХТМЛПодписи) Тогда
					Отказ = Истина;
				Иначе
					ХТМЛПодписи = СтрЗаменить(ХТМЛПодписи, "<PRE>", "");
					ХТМЛПодписи = СтрЗаменить(ХТМЛПодписи, "</PRE>", "<BR>");
				КонецЕсли;
			Иначе
				Отказ = Истина;
			КонецЕсли; 
			
			Если НЕ Отказ Тогда
				Если ПодписьПодТекстом Тогда
					НачалоКонцаТела = Найти(ТекстПисьма, "</BODY");
					Если НачалоКонцаТела > 0 Тогда
						НовыйТекстПисьма = Лев(ТекстПисьма, НачалоКонцаТела - 1);
						НовыйТекстПисьма  = НовыйТекстПисьма + "<BR>" + ХТМЛПодписи + Сред(ТекстПисьма, НачалоКонцаТела);
						Письмо.ТекстПисьма = НовыйТекстПисьма;
					КонецЕсли; 
				Иначе
					НовыйТекстПисьма = Лев(ТекстПисьма, КонецНачалаТела);
					НовыйТекстПисьма  = НовыйТекстПисьма + "<DIV>&nbsp;</DIV>" + ХТМЛПодписи + Сред(ТекстПисьма, (КонецНачалаТела + 1));
					Письмо.ТекстПисьма = НовыйТекстПисьма;
				КонецЕсли; 
			КонецЕсли; 
			
		Иначе
			
			ТекстПодписи = Новый ТекстовыйДокумент;
			ТекстПодписи.УстановитьТекст(СтрЗаменить(НовыйКом.all.item(0).innerText, Символ(13), ""));
			
			Если ТекстПодписи.КоличествоСтрок() > 0 Тогда
				
				НовыйТекстПисьма = Новый ТекстовыйДокумент;
				НовыйТекстПисьма.УстановитьТекст(Письмо.ТекстПисьма);
				
				Если НовыйТекстПисьма.КоличествоСтрок() > 0 Тогда
					ПерваяСтрока = НовыйТекстПисьма.ПолучитьСтроку(1);
					Если ПустаяСтрока(ПерваяСтрока) Тогда
						НовыйТекстПисьма.УдалитьСтроку(1);
					КонецЕсли; 
				КонецЕсли; 
				
				Для а = 1 По ТекстПодписи.КоличествоСтрок() Цикл
					Если ПодписьПодТекстом Тогда
						НовыйТекстПисьма.ДобавитьСтроку(ТекстПодписи.ПолучитьСтроку(а));
					Иначе
						НовыйТекстПисьма.ВставитьСтроку(а, ТекстПодписи.ПолучитьСтроку(а));
					КонецЕсли;
				КонецЦикла;
				
				НовыйТекстПисьма.ВставитьСтроку(1, "");
				Письмо.ТекстПисьма = НовыйТекстПисьма.ПолучитьТекст();
				
			КонецЕсли; 
			
		КонецЕсли;
	
	КонецЕсли; 
	
	#Если Клиент Тогда
	Если ОткрыватьПисьмо Тогда
		
		Если ТипЗнч(СписокФайловВложений) = Тип("СписокЗначений") И СписокФайловВложений.Количество() > 0 Тогда
			
			ЗначениеСтруктурыВозврата = Неопределено;
			
			Для каждого ЭлементСписка Из СписокФайловВложений Цикл
				
				НовоеВложение = ФормаПисьма.ВложенияПисьмаТЗ.Добавить();
				
				ЭлементСписка.Значение.Свойство("Хранилище", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					Продолжить;
				Иначе
					Если ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ДвоичныеДанные") Тогда
						НовоеВложение.Данные = Новый ХранилищеЗначения(ЗначениеСтруктурыВозврата, Новый СжатиеДанных);
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ХранилищеЗначения") Тогда
						НовоеВложение.Данные = ЗначениеСтруктурыВозврата;
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("Строка") Тогда
						НовоеВложение.Данные = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеСтруктурыВозврата), Новый СжатиеДанных);
					Иначе
						Продолжить;
					КонецЕсли; 
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("ИмяФайла", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.ИмяФайла = "";
				Иначе
					НовоеВложение.ИмяФайла = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("Наименование", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.Наименование = "";
				Иначе
					НовоеВложение.Наименование = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
		ФормаПисьма.Открыть();
		
		// Установим удобный элемент управления в форме письма - текущим
		Если ТекущийЭлементХТМЛ Тогда
			Если Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ Письмо.ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.ПолеHTMLДокумента;
			Иначе
				ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.ПолеТекстовогоДокумента;
			КонецЕсли; 
		Иначе
			ФормаПисьма.ТекущийЭлемент = ФормаПисьма.ЭлементыФормы.Кому;
		КонецЕсли;
		
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Письмо, ФормаПисьма, Письмо.Ссылка);
		
	КонецЕсли;
	#КонецЕсли

	Если Не ОткрыватьПисьмо Тогда
		
		Попытка
			Письмо.Записать();
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
			
		Если ТипЗнч(СписокФайловВложений) = Тип("СписокЗначений") И СписокФайловВложений.Количество() > 0 Тогда
			
			ЗначениеСтруктурыВозврата = Неопределено;
			
			Для каждого ЭлементСписка Из СписокФайловВложений Цикл
			
				НовоеВложение = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент();
				НовоеВложение.Объект = Письмо.Ссылка;
				
				ЭлементСписка.Значение.Свойство("Хранилище", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					Продолжить;
				Иначе
					Если ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ДвоичныеДанные") Тогда
						НовоеВложение.Хранилище = Новый ХранилищеЗначения(ЗначениеСтруктурыВозврата, Новый СжатиеДанных);
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("ХранилищеЗначения") Тогда
						НовоеВложение.Хранилище = ЗначениеСтруктурыВозврата;
					ИначеЕсли ТипЗнч(ЗначениеСтруктурыВозврата) = Тип("Строка") Тогда
						НовоеВложение.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеСтруктурыВозврата), Новый СжатиеДанных);
					Иначе
						Продолжить;
					КонецЕсли; 
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("ИмяФайла", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.ИмяФайла = "";
				Иначе
					НовоеВложение.ИмяФайла = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				ЭлементСписка.Значение.Свойство("Наименование", ЗначениеСтруктурыВозврата);
				Если ЗначениеСтруктурыВозврата = Неопределено Тогда
					НовоеВложение.Наименование = "";
				Иначе
					НовоеВложение.Наименование = ЗначениеСтруктурыВозврата;
					ЗначениеСтруктурыВозврата = Неопределено;
				КонецЕсли; 
				
				Попытка
					НовоеВложение.Записать();
				Исключение
					Возврат ОписаниеОшибки();
				КонецПопытки;
			
			КонецЦикла; 
			
		КонецЕсли; 
		
		#Если Клиент Тогда
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Письмо, ФормаПисьма, Письмо.Ссылка);
		#Иначе
		СтруктураВозврата = Новый Структура("Письмо, Форма, ПисьмоСсылка", Неопределено, Неопределено, Письмо.Ссылка);
		#КонецЕсли
	
	КонецЕсли; 
	
	Возврат СтруктураВозврата;

КонецФункции

// Получить строку с представлением списка получателей
//
// Параметры
//  КомуТЧ  – Таблица значений – список получателей
//
// Возвращаемое значение:
//   Строка   – Строка с представлением списка получателей
//
// Получить строку с представлением списка получателей
//
// Параметры
//  КомуТЧ  – Таблица значений – список получателей
//
// Возвращаемое значение:
//   Строка   – Строка с представлением списка получателей
//
Функция ПолучитьПредставлениеПолучателей(КомуТЧ)

	Представление = "";
	Для каждого СтрокаКому Из КомуТЧ Цикл
		Представление = Представление + ", " + ?(ПустаяСтрока(СтрокаКому.Представление), СтрокаКому.АдресЭлектроннойПочты, СтрокаКому.Представление);
	КонецЦикла;
	Если НЕ ПустаяСтрока(Представление) Тогда
		Представление = Сред(Представление, 3);
	КонецЕсли;
	
	Возврат Представление;

КонецФункции // ПолучитьПредставлениеПолучателей()  
//Степан 250130 <-- Проверить Оперативный статус номенклатуры и поменять на Архив 

//Степан 250417 --> Обновить спеки
Процедура лео_ОбновитьНСИвSQL() Экспорт 

	//РегламентноеЗадание = Неопределено;
	//Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	//Для Каждого Фоновое из Фоновые Цикл
	//    РегламентноеЗадание = Фоновое.РегламентноеЗадание;
	//    Если РегламентноеЗадание <> Неопределено Тогда
	//        Если СокрЛП(РегламентноеЗадание.Наименование) = "выгрузить остатки в SQL" Тогда
	//            Возврат; // задание выполняется, еще раз выполнять не нужно
	//        КонецЕсли;
	//    КонецЕсли;
	//КонецЦикла;
	
	//Инициализация переменных
    ИмяСервераSQL = "ASUMT";
    ПользовательSQL = "NEOLAP_datawriter";
    ПарольSQL = "1L4a-e0cj";
    БазаДанныхSQL = "NEOLAP";
    ТаблицаСерий = "product_series";
    ТаблицаSQL = "product_stocks";
	/////////////////////////////////////////
    //Подключение к SQL-серверу
    Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
        Соединение.ConnectionString =
            "driver={SQL Server};" +
            "server="+ИмяСервераSQL+";"+
            "uid="+ПользовательSQL+";"+
            "pwd="+ПарольSQL+";"+
            "database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;
        //Сообщить("Успешное подключение!");
    Исключение
        //Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	СтрукПериод = ПолучитьПериодДляЗапроса(); 
	если не струкПериод = неопределено тогда
		ДатаНач = струкПериод.ДатаНач;
 		ДатаКон = струкПериод.ДатаКон;
		ОчиститьТаб = "EXEC sp_specifications_trun"; 
	иначе 
		//сообщить("не задан период!.."); 
		возврат;
	конецЕсли;
	
	Попытка
	   Соединение.Execute(ОчиститьТаб,,128);       
	  // Сообщить("очищена таблица specifications перед загрузкой!");
	Исключение
	  //  Сообщить(ОписаниеОшибки());
	КонецПопытки;  
	
	ТабОстатков = ПолучитьТЗНорм(ДатаНач,ДатаКон);

	Если ТабОстатков.Количество() > 0 Тогда
		//сообщить("строк в таблице "+ТабОстатков.Количество());
		//сообщить("начало обработки "+ТекущаяДата());
		//ОбработкаПрерыванияПользователя();
		нс = 0;
		Для каждого стр из ТабОстатков Цикл
			
			нс = нс+1;
			ЗапросКБД = "EXEC sp_specifications_ins    
				|@specification  = '"+ЗаменитьСпецСимволы(стр.СпецификацияНоменклатуры)+"',
			    |@product  = '"+ЗаменитьСпецСимволы(стр.Продукция)+"',
			    |@product_number  = '"+стр.ПродукцияАртикул+"',
			    |@product_quantity  = '"+Формат(Число(стр.Количество),"ЧГ=; ЧДЦ=2; ЧРД=,; ЧН=0.00")+"',
			    |@ingredient  = '"+ЗаменитьСпецСимволы(стр.Номенклатура)+"',
			    |@ingredient_number  = '" + стр.НоменклатураАртикул + "',
			    |@ingredient_quantity  = '" + Формат(Число(стр.НоменклатураКоличество),"ЧГ=; ЧДЦ=2; ЧРД=,; ЧН=0.00") + "',
			    |@ingredient_type  = '" + стр.НоменклатураВидНоменклатуры + "'			
				|"; 
			
			Попытка
		        Соединение.Execute(ЗапросКБД,,128);
		        //Сообщить("Запись добавлена!");
		    Исключение
				//Сообщить("стр."+нс+"; "+стр.Артикул+"; "+стр.Номенклатура+"; "+стр.СерияНоменклатуры+"; "+стр.ЕдиницаХранения+"; "+Формат(Число(стр.ЦенаПоследняя),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+"; "+Формат(Дата(стр.ДатаОстатки),"ДФ=yyyy.MM.dd")+"; "+Формат(Число(стр.КоличествоОстаток),"ЧГ=; ЧДЦ=2; ЧРД=.; ЧН=0.00")+";" );
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;  
		
		//ЗаписатьВКонтрольныеДатыДлявыгрузкиSQL(ДатаНач,ДатаКон,ТабОстатков.Количество());
		
	КонецЕсли;
	
	//сообщить("записано строк  "+нс);
	//сообщить("окончание обработки "+ТекущаяДата());  
	//ОбновитьССиОСГ(ДатаНач,ДатаКон,Соединение);
	Соединение.Close(); 
	
КонецПроцедуры    

Функция ПолучитьТЗНорм(ДатаНач,ДатаКон)
	
	ТЗ	=	Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	Менеджер = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	
	Запрос.Текст =	"ВЫБРАТЬ
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Период,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры,
	|	ЕСТЬNULL(СпецификацииНоменклатурыВыходныеИзделия.Количество,0) КАК Количество
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрСведений.Лео_ПлановыеСпецификацииНоменклатуры.СрезПоследних КАК Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
	|		ПО Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура = СпецификацииНоменклатурыВыходныеИзделия.Номенклатура

	|СГРУППИРОВАТЬ ПО
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Период,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура.Артикул,
	|	СпецификацииНоменклатурыВыходныеИзделия.Количество
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.СпецификацияНоменклатуры,
	|	ТЗ.Номенклатура КАК Продукция,
	|	ТЗ.Артикул КАК ПродукцияАртикул,
	|	ТЗ.Количество,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура КАК Номенклатура,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ЕСТЬNULL(СпецификацииНоменклатурыИсходныеКомплектующие.Количество,0) КАК НоменклатураКоличество,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура.ВидНоменклатуры
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатурыИсходныеКомплектующие
	|		ПО ТЗ.СпецификацияНоменклатуры = СпецификацииНоменклатурыИсходныеКомплектующие.Ссылка

	|СГРУППИРОВАТЬ ПО
	|	ТЗ.СпецификацияНоменклатуры,
	|	ТЗ.Номенклатура,
	|	ТЗ.Артикул,
	|	ТЗ.Количество,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура.Артикул,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Количество,
	|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура.ВидНоменклатуры

	|УПОРЯДОЧИТЬ ПО
	|	ТЗ.Артикул
	|";

	ТЗ.Очистить();
	
	ДатаОстатки	=	ДатаНач;
	ТЗ		=	Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;       
	
КонецФункции
//Степан 250417 <-- Обновить спеки   

Функция ПолучитьТЗПродаж(ДатаНач,ДатаКон)
	
	ТЗ	=	Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	Менеджер = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	
	Запрос.Текст =	"ВЫБРАТЬ
		|					УстановкаСкидокНоменклатурыТовары.Ссылка.Лео_НомерАктивности,
		|					УстановкаСкидокНоменклатурыТовары.Ссылка КАК Ссылка,
		|					УстановкаСкидокНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|					УстановкаСкидокНоменклатурыТовары.Номенклатура.Артикул КАК Артикул,
		|					УстановкаСкидокНоменклатурыТовары.Ссылка.Лео_ДокументОснование КАК ДокументОснование,
		|					ВложенныйЗапрос.ВложенныйЗапросСсылка,
		|					ВложенныйЗапрос.РеализацияРеализацияСсылка,
		|					ВложенныйЗапрос.Количество КАК Количество,
		|					ВложенныйЗапрос.Сумма КАК Сумма,
		|					ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|					ВложенныйЗапрос.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|					ВложенныйЗапрос.абс_СуммаАвтоматическойСкидкиБезНДС КАК СуммаАвтоматическойСкидкиБезНДС
		|				ПОМЕСТИТЬ ПродажиПромо
		|				ИЗ
		|					Документ.УстановкаСкидокНоменклатуры.Товары КАК УстановкаСкидокНоменклатурыТовары
		|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							МАКСИМУМ(ВложенныйЗапрос.Ссылка) КАК ВложенныйЗапросСсылка,
		|							МАКСИМУМ(Реализация.РеализацияСсылка) КАК РеализацияРеализацияСсылка,
		|							ЗаказПокупателяабс_СкидкиНаценки.Скидка КАК ДокументСкидки,
		|							ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|							СУММА(ВложенныйЗапрос.Количество) КАК КоличествоЗаказано,
		|							СУММА(ВложенныйЗапрос.Сумма) КАК СуммаЗаказано,
		|							ВложенныйЗапрос.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|							СУММА(Реализация.Количество) КАК Количество,
		|							СУММА(Реализация.Сумма) КАК Сумма,
		|							СУММА(Реализация.СуммаБезНДС) КАК СуммаБезНДС,
		|							СУММА(Реализация.СуммаНДС) КАК СуммаНДС,
		|							СУММА(ВЫБОР
		|									КОГДА ВложенныйЗапрос.Ссылка.СуммаВключаетНДС
		|										ТОГДА Реализация.Количество * ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки / ВложенныйЗапрос.Количество
		|									ИНАЧЕ Реализация.Количество * (ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки * (100 + Реализация.СтавкаНДС) / 100) / ВложенныйЗапрос.Количество
		|								КОНЕЦ) КАК абс_СуммаАвтоматическойСкидки,
		|							СУММА(ВЫБОР
		|									КОГДА ВложенныйЗапрос.Ссылка.СуммаВключаетНДС
		|										ТОГДА Реализация.Количество * (ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки / (1 + Реализация.СтавкаНДС / 100)) / ВложенныйЗапрос.Количество
		|									ИНАЧЕ Реализация.Количество * ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки / ВложенныйЗапрос.Количество
		|								КОНЕЦ) КАК абс_СуммаАвтоматическойСкидкиБезНДС
		|						ИЗ
		|							Документ.ЗаказПокупателя.абс_СкидкиНаценки КАК ЗаказПокупателяабс_СкидкиНаценки
		|								ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|									ЗаказПокупателяТовары.Ссылка КАК Ссылка,
		|									ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|									СУММА(ЗаказПокупателяТовары.Сумма) КАК Сумма,
		|									СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|									СУММА(ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки) КАК абс_СуммаАвтоматическойСкидки
		|								ИЗ
		|									Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|								ГДЕ
		|									ЗаказПокупателяТовары.Ссылка.Проведен = ИСТИНА
		|									И ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки <> 0
		|								
		|								СГРУППИРОВАТЬ ПО
		|									ЗаказПокупателяТовары.Ссылка,
		|									ЗаказПокупателяТовары.Номенклатура) КАК ВложенныйЗапрос
		|									ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|										РеализацияТоваровУслугТовары.Ссылка КАК РеализацияСсылка,
		|										РеализацияТоваровУслугТовары.Ссылка.Сделка КАК Сделка,
		|										РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|										РеализацияТоваровУслугТовары.Количество КАК Количество,
		|										СУММА(ВЫБОР
		|												КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		|													ТОГДА РеализацияТоваровУслугТовары.Сумма
		|												ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
		|											КОНЕЦ) КАК Сумма,
		|										СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
		|										ВЫБОР
		|											КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|													ИЛИ РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|												ТОГДА 20
		|											КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|													ИЛИ РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|												ТОГДА 18
		|											КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|													ИЛИ РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|												ТОГДА 10
		|											ИНАЧЕ 0
		|										КОНЕЦ КАК СтавкаНДС,
		|										СУММА(ВЫБОР
		|												КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		|													ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
		|												ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
		|											КОНЕЦ) КАК СуммаБезНДС
		|									ИЗ
		|										Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|									
		|									СГРУППИРОВАТЬ ПО
		|										РеализацияТоваровУслугТовары.Ссылка,
		|										РеализацияТоваровУслугТовары.Ссылка.Сделка,
		|										РеализацияТоваровУслугТовары.Номенклатура,
		|										РеализацияТоваровУслугТовары.Количество,
		|										ВЫБОР
		|											КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|													ИЛИ РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|												ТОГДА 20
		|											КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|													ИЛИ РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|												ТОГДА 18
		|											КОГДА РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|													ИЛИ РеализацияТоваровУслугТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|												ТОГДА 10
		|											ИНАЧЕ 0
		|										КОНЕЦ) КАК Реализация
		|									ПО ВложенныйЗапрос.Ссылка = Реализация.Сделка
		|										И ВложенныйЗапрос.Номенклатура = Реализация.Номенклатура
		|								ПО ЗаказПокупателяабс_СкидкиНаценки.Ссылка = ВложенныйЗапрос.Ссылка
		|									И (Реализация.Количество = ВложенныйЗапрос.Количество)
		|						ГДЕ
		|							ЗаказПокупателяабс_СкидкиНаценки.Ссылка.Проведен = ИСТИНА
		|						
		|						СГРУППИРОВАТЬ ПО
		|							ЗаказПокупателяабс_СкидкиНаценки.Скидка,
		|							ВложенныйЗапрос.Номенклатура,
		|							ВложенныйЗапрос.Ссылка.СуммаВключаетНДС) КАК ВложенныйЗапрос
		|						ПО УстановкаСкидокНоменклатурыТовары.Ссылка = ВложенныйЗапрос.ДокументСкидки
		|							И УстановкаСкидокНоменклатурыТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
		|				ГДЕ
		|					УстановкаСкидокНоменклатурыТовары.Ссылка.Проведен = ИСТИНА  
		|				;
		|				//////////////////////////////////////////////////////////////////////////////////////////////

		|ВЫБРАТЬ
		|	ПродажиОбороты.Регистратор КАК Регистратор,
		|	ПродажиОбороты.Контрагент КАК Контрагент,
		|	ПродажиОбороты.Контрагент.абс_Отдел КАК абс_Отдел,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер = &ПустойПользователь
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|	КОНЕЦ КАК абс_Менеджер,
		|	ПродажиОбороты.Контрагент.абс_БизнесРегион КАК абс_БизнесРегион,
		|	ПродажиОбороты.Контрагент.абс_Территория КАК абс_Территория,
		|	ПродажиОбороты.Контрагент.абс_Город КАК абс_Город,
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПродажиОбороты.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
		|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК СтоимостьОборот,
		|	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СтоимостьБезСкидокОборот,
		|	СУММА(ПродажиОбороты.НДСОборот) КАК НДСОборот,
		|	ГОД(ПродажиОбороты.Период) КАК _Год,
		|	МЕСЯЦ(ПродажиОбороты.Период) КАК _Месяц,
		|	ПродажиОбороты.ДокументПродажи
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(НачалоПериода(&НачалоПериода,ДЕНЬ), КонецПериода(&ОкончаниеПериода,ДЕНЬ), Регистратор, ) КАК ПродажиОбороты

		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Регистратор,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.Контрагент.абс_Отдел,
		|	ПродажиОбороты.Контрагент.абс_БизнесРегион,
		|	ПродажиОбороты.Контрагент.абс_Территория,
		|	ПродажиОбороты.Контрагент.абс_Город,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.Номенклатура.Артикул,
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ГОД(ПродажиОбороты.Период),
		|	МЕСЯЦ(ПродажиОбороты.Период),
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер = &ПустойПользователь
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|	КОНЕЦ,
		|	ПродажиОбороты.ДокументПродажи
		|;
		|ВЫБРАТЬ
		|	ПродажиОбороты.Регистратор КАК Регистратор,
		|	ПродажиОбороты.Контрагент КАК Контрагент,
		|	ПродажиОбороты.Контрагент.абс_Отдел КАК абс_Отдел,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер = &ПустойПользователь
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|	КОНЕЦ КАК абс_Менеджер,
		|	ПродажиОбороты.Контрагент.абс_БизнесРегион КАК абс_БизнесРегион,
		|	ПродажиОбороты.Контрагент.абс_Территория КАК абс_Территория,
		|	ПродажиОбороты.Контрагент.абс_Город КАК абс_Город,
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПродажиОбороты.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
		|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
		|	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СтоимостьБезСкидокОборот,
		|	СУММА(ПродажиОбороты.СтоимостьБезНДСОборот) КАК СтоимостьБезНДСОборот,
		|	СУММА(ПродажиОбороты.НДСОборот) КАК НДСОборот,
		|	ГОД(ПродажиОбороты.Период) КАК _Год,
		|	МЕСЯЦ(ПродажиОбороты.Период) КАК _Месяц,
		|	ПродажиОбороты.ДокументПродажи
		|ПОМЕСТИТЬ Лео_ТЗ
		|ИЗ
		|	РегистрНакопления.Лео_Продажи.Обороты(НачалоПериода(&НачалоПериода,ДЕНЬ), КонецПериода(&ОкончаниеПериода,ДЕНЬ), Регистратор, ) КАК ПродажиОбороты

		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Регистратор,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.Контрагент.абс_Отдел,
		|	ПродажиОбороты.Контрагент.абс_БизнесРегион,
		|	ПродажиОбороты.Контрагент.абс_Территория,
		|	ПродажиОбороты.Контрагент.абс_Город,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.СерияНоменклатуры,
		|	ПродажиОбороты.Номенклатура.Артикул,
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ГОД(ПродажиОбороты.Период),
		|	МЕСЯЦ(ПродажиОбороты.Период),
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер = &ПустойПользователь
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_Территория.абс_Менеджер
		|		КОГДА НЕ ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер ЕСТЬ NULL
		|			ТОГДА ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_Менеджер
		|	КОНЕЦ,
		|	ПродажиОбороты.ДокументПродажи
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Регистратор.Дата КАК ДатаДокумента,
		|	ТЗ.Регистратор.Номер КАК НомерДокумента,
		|	ТЗ.Регистратор КАК ДокументПродажи,
		|	ПродажиПромо.Лео_НомерАктивности КАК Промо,
		|	ТЗ.Контрагент,
		|	ТЗ.Регистратор.Склад КАК Склад,
		|	ТЗ.абс_Отдел,
		|	ТЗ.абс_Менеджер,
		|	ТЗ.абс_БизнесРегион,
		|	ТЗ.абс_Территория,
		|	ТЗ.абс_Город,
		|	ТЗ.Номенклатура.Код,
		|	ТЗ.Номенклатура,
		|	ТЗ.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	Лео_ТЗ.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТЗ.ЗаказПокупателя.Номер КАК НомерЗаказа,
		|	ТЗ.ЗаказПокупателя.абс_НомерЗаказаEDI КАК абс_НомерЗаказаEDI,
		|	ТЗ.Артикул,
		|	ЕСТЬNULL(ТЗ.Номенклатура.ЕдиницаХраненияОстатков.Вес,0) КАК Вес,
		|	ЕСТЬNULL(ТЗ.СтоимостьОборот,0) КАК СтоимостьОборот,
		//|	ЕСТЬNULL(Лео_ТЗ.КоличествоОборот,0)КАК КоличествоОборот,
		//|	ЕСТЬNULL(Лео_ТЗ.СтоимостьБезНДСОборот,0) КАК СтоимостьОборотБезНДС,
		//|	ЕСТЬNULL(ТЗ.КоличествоОборот,0)КАК КоличествоОборот,
		//|	ЕСТЬNULL(Лео_ТЗ.КоличествоОборот,0)КАК КоличествоОборот,
		//|	ЕСТЬNULL(Лео_ТЗ.СтоимостьБезСкидокОборот - Лео_ТЗ.НДСОборот,0) КАК СтоимостьОборотБезНДС,
		//|	ЕСТЬNULL(ТЗ.СтоимостьОборот - ТЗ.НДСОборот,0) КАК СтоимостьОборотБезНДС, 
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(Лео_ТЗ.КоличествоОборот,0) > 0 ТОГДА ЕСТЬNULL(Лео_ТЗ.КоличествоОборот,0)
		|		КОГДА ЕСТЬNULL(Лео_ТЗ.КоличествоОборот,0) = 0 ТОГДА ЕСТЬNULL(ТЗ.КоличествоОборот,0)
		|	КОНЕЦ КАК КоличествоОборот,
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(Лео_ТЗ.СтоимостьБезНДСОборот,0) > 0 ТОГДА ЕСТЬNULL(Лео_ТЗ.СтоимостьБезНДСОборот,0)
		|		КОГДА ЕСТЬNULL(Лео_ТЗ.СтоимостьБезНДСОборот,0) = 0 ТОГДА ЕСТЬNULL(ТЗ.СтоимостьОборот - ТЗ.НДСОборот,0)
		|	КОНЕЦ КАК СтоимостьОборотБезНДС,
		//
		|	ЕСТЬNULL(ТЗ.СтоимостьБезСкидокОборот,0) КАК СтоимостьБезСкидокОборот,
		|	ЕСТЬNULL(ТЗ.НДСОборот,0) КАК НДСОборот,
		|	ЕСТЬNULL(ТЗ._Год,0) КАК _Год,
		|	ЕСТЬNULL(ТЗ._Месяц,0) КАК _Месяц,
		|	ЗначенияСвойствОбъектов.Значение КАК Категория,
		|	ЗначенияСвойствОбъектов_1.Значение КАК ТорговаяМарка,
		|	ЗначенияСвойствОбъектов_2.Значение КАК Бренд,
		|	ЗначенияСвойствОбъектов_3.Значение КАК ТипПокупателя,
		|	ЕСТЬNULL(ЗначенияСвойствОбъектов_4.Значение,0) КАК КоличествоГУДС,
		|	ЗначенияСвойствОбъектов_5.Значение КАК АртикулЗамены,
		|	ВЫРАЗИТЬ(ТЗ.ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Грузополучатель КАК Грузополучатель,
		|	ВЫРАЗИТЬ(ТЗ.ДокументПродажи КАК Документ.РеализацияТоваровУслуг).АдресДоставки КАК АдресДоставки   

		|ИЗ
		|	ТЗ КАК ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ТЗ.Номенклатура = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &Категория)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов_1
		|		ПО ТЗ.Номенклатура = ЗначенияСвойствОбъектов_1.Объект
		|			И (ЗначенияСвойствОбъектов_1.Свойство = &ТорговаяМарка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов_2
		|		ПО ТЗ.Номенклатура = ЗначенияСвойствОбъектов_2.Объект
		|			И (ЗначенияСвойствОбъектов_2.Свойство = &Бренд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов_3
		|		ПО ТЗ.Контрагент = ЗначенияСвойствОбъектов_3.Объект
		|			И (ЗначенияСвойствОбъектов_3.Свойство = &ТипПокупателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов_4
		|		ПО ТЗ.Номенклатура = ЗначенияСвойствОбъектов_4.Объект
		|			И (ЗначенияСвойствОбъектов_4.Свойство = &КоличествоГУДС)  
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов_5
		|		ПО ТЗ.Номенклатура = ЗначенияСвойствОбъектов_5.Объект
		|			И (ЗначенияСвойствОбъектов_5.Свойство = &АртикулЗамены)  
		|		ЛЕВОЕ СОЕДИНЕНИЕ Лео_ТЗ КАК Лео_ТЗ
		|		ПО ТЗ.Регистратор = Лео_ТЗ.Регистратор 
		|			И ТЗ.Номенклатура = Лео_ТЗ.Номенклатура   
		|			
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиПромо КАК ПродажиПромо
		|		ПО ТЗ.Регистратор = ПродажиПромо.РеализацияРеализацияСсылка
		|			И ТЗ.Номенклатура = ПродажиПромо.Номенклатура
		|";

	Запрос.УстановитьПараметр("ПустойПользователь",Справочники.Пользователи.ПустаяСсылка());	
	Запрос.УстановитьПараметр("ТорговаяМарка",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000001"));
	Запрос.УстановитьПараметр("Категория",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000273"));				
	Запрос.УстановитьПараметр("Бренд",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000301"));	
	Запрос.УстановитьПараметр("ТипПокупателя",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000309"));
	Запрос.УстановитьПараметр("АртикулЗамены",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000126"));
	Запрос.УстановитьПараметр("КоличествоГУДС",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000306"));
	Запрос.УстановитьПараметр("НачалоПериода",ДатаНач);				
	Запрос.УстановитьПараметр("ОкончаниеПериода",ДатаКон);				
	
	ТЗ.Очистить();
	
	ДатаОстатки	=	ДатаНач;
	ТЗ		=	Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;       
	
КонецФункции

Функция ПолучитьТЗФактПП(ДатаНач,ДатаКон)
	
	ТЗ	=	Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос; 
	Менеджер = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	
	Запрос.Текст =	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Регистратор.Дата, МЕСЯЦ) КАК ПериодМесяц,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Номенклатура.Артикул КАК Артикул,
	|	ПродажиОбороты.Контрагент.абс_Отдел КАК Отдел,
	|	ПродажиОбороты.Контрагент.абс_БизнесРегион КАК БизнесРегион,
	|	ПродажиОбороты.Контрагент,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|					И ПродажиОбороты.ЗаказПокупателя.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
	|				ТОГДА ПродажиОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОтгрузки,
	|	0 КАК ТекЗаявкиКоличество,
	|	0 КАК КоличествоНеотгружено,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|					И ПродажиОбороты.ЗаказПокупателя.абс_Статус = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыОтгрузки.Отгружен)
	|				ТОГДА ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОтгрузки,
	|	0 КАК ТекЗаявкиСумма,
	|	0 КАК СуммаНеотгружено,
	|	ПродажиОбороты.Регистратор,
	|	NULL КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	НЕ ПродажиОбороты.Контрагент В (&КонтрагентИскл)
	|	И НЕ ПродажиОбороты.Номенклатура.ВидНоменклатуры В (&ВидНоменклатурыПФ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Номенклатура.Артикул,
	|	ПродажиОбороты.Контрагент.абс_Отдел,
	|	ПродажиОбороты.Контрагент.абс_БизнесРегион,
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки, МЕСЯЦ),
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Номенклатура.Артикул,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент.абс_Отдел,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент.абс_БизнесРегион,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	0,
	|	СУММА(ЗаказПокупателяТовары.Количество),
	|	0,
	|	0,
	|	СУММА(ЗаказПокупателяТовары.Сумма - ЗаказПокупателяТовары.СуммаНДС),
	|	0,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.СерияНоменклатуры
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки МЕЖДУ &ТекЗаявкиНачалоПериода И &ТекЗаявкиКонецПериода
	|	И ЗаказПокупателяТовары.Ссылка.Проведен = ИСТИНА
	|	И ЗаказПокупателяТовары.Ссылка.абс_Статус В(&абс_Статус)
	|	И ЗаказПокупателяТовары.Ссылка.Контрагент <> &РЕЗЕРВ
	|	И НЕ ЗаказПокупателяТовары.Ссылка.Контрагент В (&КонтрагентЗаказ)
	|	И НЕ ЗаказПокупателяТовары.Номенклатура.ВидНоменклатуры В (&ВидНоменклатурыПФ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки, МЕСЯЦ),
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Номенклатура.Артикул,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент.абс_Отдел,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент.абс_БизнесРегион,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент,
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.СерияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(абс_Неотгружено.Ссылка.ДатаОтгрузки, МЕСЯЦ),
	|	абс_Неотгружено.Номенклатура,
	|	абс_Неотгружено.Номенклатура.Артикул,
	|	абс_Неотгружено.Ссылка.Контрагент.абс_Отдел,
	|	абс_Неотгружено.Ссылка.Контрагент.абс_БизнесРегион,
	|	абс_Неотгружено.Ссылка.Контрагент,
	|	0,
	|	0,
	|	СУММА(абс_Неотгружено.Количество),
	|	0,
	|	0,
	|	СУММА(абс_Неотгружено.Сумма - абс_Неотгружено.СуммаНДС),
	|	абс_Неотгружено.Ссылка,
	|	абс_Неотгружено.СерияНоменклатуры
	|ИЗ
	|	Документ.ЗаказПокупателя.абс_Неотгружено КАК абс_Неотгружено
	|ГДЕ
	|	абс_Неотгружено.Ссылка.ДатаОтгрузки МЕЖДУ &ТекЗаявкиНачалоПериода И &ТекЗаявкиКонецПериода
	|	И абс_Неотгружено.Ссылка.Проведен = ИСТИНА
	|	И абс_Неотгружено.Ссылка.абс_Статус В(&абс_Статус_Неотгружено)
	|	И абс_Неотгружено.Ссылка.Контрагент <> &РЕЗЕРВ
	|	И НЕ абс_Неотгружено.Ссылка.Контрагент В (&КонтрагентЗаказ)
	|	И НЕ абс_Неотгружено.Номенклатура.ВидНоменклатуры В (&ВидНоменклатурыПФ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(абс_Неотгружено.Ссылка.ДатаОтгрузки, МЕСЯЦ),
	|	абс_Неотгружено.Номенклатура,
	|	абс_Неотгружено.Номенклатура.Артикул,
	|	абс_Неотгружено.Ссылка.Контрагент.абс_Отдел,
	|	абс_Неотгружено.Ссылка.Контрагент.абс_БизнесРегион,
	|	абс_Неотгружено.Ссылка.Контрагент,
	|	абс_Неотгружено.Ссылка,
	|	абс_Неотгружено.СерияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыПереданныеОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыПереданныеОстаткиИОбороты.Номенклатура,
	|	ТоварыПереданныеОстаткиИОбороты.Номенклатура.Артикул,
	|	ТоварыПереданныеОстаткиИОбороты.Контрагент.абс_Отдел,
	|	ТоварыПереданныеОстаткиИОбороты.Контрагент.абс_БизнесРегион,
	|	ТоварыПереданныеОстаткиИОбороты.Контрагент,
	|	СУММА(ТоварыПереданныеОстаткиИОбороты.КоличествоПриход),
	|	0,
	|	0,
	|	СУММА(ТоварыПереданныеОстаткиИОбороты.СуммаВзаиморасчетовПриход),
	|	0,
	|	0,
	|	ТоварыПереданныеОстаткиИОбороты.Регистратор,
	|	ТоварыПереданныеОстаткиИОбороты.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыПереданные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ) КАК ТоварыПереданныеОстаткиИОбороты
	|ГДЕ
	|	ТоварыПереданныеОстаткиИОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыПереданныеОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыПереданныеОстаткиИОбороты.Номенклатура,
	|	ТоварыПереданныеОстаткиИОбороты.Номенклатура.Артикул,
	|	ТоварыПереданныеОстаткиИОбороты.Контрагент.абс_Отдел,
	|	ТоварыПереданныеОстаткиИОбороты.Контрагент.абс_БизнесРегион,
	|	ТоварыПереданныеОстаткиИОбороты.Контрагент,
	|	ТоварыПереданныеОстаткиИОбороты.Регистратор,
	|	ТоварыПереданныеОстаткиИОбороты.СерияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	&Яндекс_абс_Отдел,
	|	&Яндекс_абс_БизнесРегион,
	|	&ЯндексООО,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Склад = &СкладЯндекс) КАК ТоварыНаСкладахОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ГДЕ
	|			ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦен) КАК НоменклатураЦены
	|		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = НоменклатураЦены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	&Алибаба_абс_Отдел,
	|	&Алибаба_абс_БизнесРегион,
	|	&Алибаба,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Склад = &СкладАлибаба) КАК ТоварыНаСкладахОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ГДЕ
	|			ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦен) КАК НоменклатураЦены
	|		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = НоменклатураЦены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	&Приват_абс_Отдел,
	|	&Приват_абс_БизнесРегион,
	|	&Приват,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Склад = &СкладПриват) КАК ТоварыНаСкладахОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ГДЕ
	|			ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦен) КАК НоменклатураЦены
	|		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = НоменклатураЦены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	&МАРКЕТПЛЕЙС_абс_Отдел,
	|	&МАРКЕТПЛЕЙС_абс_БизнесРегион,
	|	&МАРКЕТПЛЕЙС,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , Склад = &СкладМАРКЕТПЛЕЙС) КАК ТоварыНаСкладахОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ГДЕ
	|			ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦен) КАК НоменклатураЦены
	|		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = НоменклатураЦены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата, МЕСЯЦ),
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход * ОКР(НоменклатураЦены.Цена * 0.8, 1),
	|	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.ПериодМесяц,
	|	ЕСТЬNULL(ГОД(ТЗ.ПериодМесяц),0) КАК _Год,
	|	ЕСТЬNULL(МЕСЯЦ(ТЗ.ПериодМесяц),0) КАК _Месяц,
	|	ТЗ.Номенклатура,
	|	ТЗ.Артикул,
	|	ТЗ.Отдел,
	|	ТЗ.БизнесРегион,
	|	ТЗ.Контрагент,
	|	СУММА(ТЗ.КоличествоОтгрузки) КАК КоличествоОтгрузки,
	|	СУММА(ТЗ.ТекЗаявкиКоличество) КАК ТекЗаявкиКоличество,
	|	СУММА(ТЗ.КоличествоНеотгружено) КАК КоличествоНеотгружено,
	|	ЕСТЬNULL(СУММА(ТЗ.СуммаОтгрузки),0) КАК СуммаОтгрузки,
	|	СУММА(ТЗ.ТекЗаявкиСумма) КАК ТекЗаявкиСумма,
	|	СУММА(ТЗ.СуммаНеотгружено) КАК СуммаНеотгружено,
	|	ТЗ.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ТЗ.Контрагент.ОсновнойМенеджерПокупателя КАК ОсновнойМенеджер,
	|	ТЗ.Контрагент.абс_Территория КАК Территория,
	|	ТЗ.Контрагент.абс_Город КАК Город,
	|	КонтрагентТипПокупателя.Значение КАК ТипПокупателя,
	|	НоменклатураАртикулЗамены.Значение КАК АртикулЗамены,
	|	НоменклатураБрендPR.Значение КАК БрендPR,
	|	НоменклатураКатегорияАналитическая.Значение КАК КатегорияАналитическая,
	|	НоменклатураСтатусПроизводства.Значение КАК СтатусПроизводства,
	|	НоменклатураТорговаяМарка.Значение КАК ТорговаяМарка,
	|	НоменклатураABC_Рейтинг.Значение КАК ABC_Рейтинг,
	|	ТЗ.Регистратор,
	|	ТЗ.Регистратор.Дата КАК ДатаДокумента,
	|	ТЗ.Регистратор.Номер КАК НомерДокумента,
	|	ТЗ.СерияНоменклатуры
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &ТипПокупателя) КАК КонтрагентТипПокупателя
	|		ПО ТЗ.Контрагент = КонтрагентТипПокупателя.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &АртикулЗамены) КАК НоменклатураАртикулЗамены
	|		ПО ТЗ.Номенклатура = НоменклатураАртикулЗамены.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &БрендPR) КАК НоменклатураБрендPR
	|		ПО ТЗ.Номенклатура = НоменклатураБрендPR.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &ТорговаяМарка) КАК НоменклатураТорговаяМарка
	|		ПО ТЗ.Номенклатура = НоменклатураТорговаяМарка.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &КатегорияАналитическая) КАК НоменклатураКатегорияАналитическая
	|		ПО ТЗ.Номенклатура = НоменклатураКатегорияАналитическая.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &СтатусПроизводства) КАК НоменклатураСтатусПроизводства
	|		ПО ТЗ.Номенклатура = НоменклатураСтатусПроизводства.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	|			ЗначенияСвойствОбъектов.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ГДЕ
	|			ЗначенияСвойствОбъектов.Свойство = &ABC_Рейтинг) КАК НоменклатураABC_Рейтинг
	|		ПО ТЗ.Номенклатура = НоменклатураABC_Рейтинг.Объект
	|ГДЕ
	|	ТЗ.Отдел <> ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.ПериодМесяц,
	|	ЕСТЬNULL(ГОД(ТЗ.ПериодМесяц),0),
	|	ЕСТЬNULL(МЕСЯЦ(ТЗ.ПериодМесяц),0),
	|	ТЗ.Отдел,
	|	ТЗ.БизнесРегион,
	|	ТЗ.Контрагент,
	|	ТЗ.Номенклатура,
	|	ТЗ.Артикул,
	|	ТЗ.Номенклатура.СтавкаНДС,
	|	ТЗ.Контрагент.ОсновнойМенеджерПокупателя,
	|	ТЗ.Контрагент.абс_Территория,
	|	ТЗ.Контрагент.абс_Город,
	|	КонтрагентТипПокупателя.Значение,
	|	НоменклатураАртикулЗамены.Значение,
	|	НоменклатураБрендPR.Значение,
	|	НоменклатураКатегорияАналитическая.Значение,
	|	НоменклатураСтатусПроизводства.Значение,
	|	НоменклатураТорговаяМарка.Значение,
	|	НоменклатураABC_Рейтинг.Значение,
	|	ТЗ.Регистратор,
	|	ТЗ.Регистратор.Дата,
	|	ТЗ.Регистратор.Номер,
	|	ТЗ.СерияНоменклатуры
	|
	|";
	Запрос.Параметры.Вставить("НачалоПериода", ДатаНач); // <Дата>[01.04.2025 0:00:00]
	Запрос.Параметры.Вставить("КонецПериода", ДатаКон); // <Дата>[30.04.2025 0:00:00]
	Запрос.Параметры.Вставить("ABC_Рейтинг", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000313")); // <Свойства объектов>[АВС], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АВС");
	абс_Статус = Новый СписокЗначений;
	абс_Статус.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);// <Статусы отгрузки>[Согласован], Перечисления.абс_СтатусыОтгрузки.Согласован
	абс_Статус.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);// <Статусы отгрузки>[К отгрузке], Перечисления.абс_СтатусыОтгрузки.КОтгрузке
	Запрос.Параметры.Вставить("абс_Статус", абс_Статус); // <Список значений>[Согласован; К отгрузке]
	абс_Статус_Неотгружено = Новый СписокЗначений;
	абс_Статус_Неотгружено.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);// <Статусы отгрузки>[Согласован], Перечисления.абс_СтатусыОтгрузки.Согласован
	абс_Статус_Неотгружено.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);// <Статусы отгрузки>[К отгрузке], Перечисления.абс_СтатусыОтгрузки.КОтгрузке
	абс_Статус_Неотгружено.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);// <Статусы отгрузки>[Отгружен], Перечисления.абс_СтатусыОтгрузки.Отгружен
	Запрос.Параметры.Вставить("абс_Статус_Неотгружено", абс_Статус_Неотгружено); // <Список значений>[Согласован; К отгрузке; Отгружен]
	Запрос.Параметры.Вставить("Алибаба", Справочники.Контрагенты.НайтиПоКоду("УТ0007415")); // <Контрагент>[АЛИБАБА.КОМ (РУ) ООО], Справочники.Контрагенты.НайтиПоНаименованию("АЛИБАБА.КОМ (РУ) ООО");
	Запрос.Параметры.Вставить("Алибаба_абс_БизнесРегион", Справочники.Регионы.НайтиПоКоду("Б00000330")); // <Бизнес-регионы>[Онлайн-продажи 2], Справочники.Регионы.НайтиПоНаименованию("Онлайн-продажи 2");
	Запрос.Параметры.Вставить("Алибаба_абс_Отдел", Справочники.Регионы.НайтиПоКоду("Б00000017")); // <Бизнес-регионы>[ИНТЕРНЕТ-ПРОДАЖИ], Справочники.Регионы.НайтиПоНаименованию("ИНТЕРНЕТ-ПРОДАЖИ");
	Запрос.Параметры.Вставить("АртикулЗамены", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000126")); // <Свойства объектов>[Артикул замены], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Артикул замены");
	Запрос.Параметры.Вставить("БрендPR", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000301")); // <Свойства объектов>[Бренд PR], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Бренд PR");
	ВидНоменклатурыПФ = Новый СписокЗначений;
	ВидНоменклатурыПФ.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикат"));// <Вид номенклатуры>[Полуфабрикат], Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикат");
	ВидНоменклатурыПФ.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Материал"));// <Вид номенклатуры>[Материал], Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Материал");
	ВидНоменклатурыПФ.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуга"));// <Вид номенклатуры>[Услуга], Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуга");
	Запрос.Параметры.Вставить("ВидНоменклатурыПФ", ВидНоменклатурыПФ); // <Список значений>[Полуфабрикат; Материал; Услуга]
	Запрос.Параметры.Вставить("КатегорияАналитическая", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000273")); // <Свойства объектов>[Категория аналитическая], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Категория аналитическая");
	КонтрагентЗаказ = Новый СписокЗначений;
	КонтрагентЗаказ.Добавить(Справочники.Контрагенты.НайтиПоКоду("К00000893"));// <Контрагент>[ЛефЭкспо], Справочники.Контрагенты.НайтиПоНаименованию("ЛефЭкспо");
	КонтрагентЗаказ.Добавить(Справочники.Контрагенты.НайтиПоКоду("К00001098"));// <Контрагент>[Леотон Трейдинг (пок.)], Справочники.Контрагенты.НайтиПоНаименованию("Леотон Трейдинг (пок.)");
	Запрос.Параметры.Вставить("КонтрагентЗаказ", КонтрагентЗаказ); // <Список значений>[ЛефЭкспо; Леотон Трейдинг (пок.)]
	КонтрагентИскл = Новый СписокЗначений;
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("К00000893"));// <Контрагент>[ЛефЭкспо], Справочники.Контрагенты.НайтиПоНаименованию("ЛефЭкспо");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("К00001098"));// <Контрагент>[Леотон Трейдинг (пок.)], Справочники.Контрагенты.НайтиПоНаименованию("Леотон Трейдинг (пок.)");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("УТ0007124"));// <Контрагент>[Розничный покупатель ЯНДЕКС.МАРКЕТ], Справочники.Контрагенты.НайтиПоНаименованию("Розничный покупатель ЯНДЕКС.МАРКЕТ");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("УТ0007377"));// <Контрагент>[Приват Трэйд ООО], Справочники.Контрагенты.НайтиПоНаименованию("Приват Трэйд ООО");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("УТ0005805"));// <Контрагент>[ВАЙЛДБЕРРИЗ ООО (Главный)], Справочники.Контрагенты.НайтиПоНаименованию("ВАЙЛДБЕРРИЗ ООО (Главный)");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("ККК003794"));// <Контрагент>[Интернет Решения ООО (OZON)], Справочники.Контрагенты.НайтиПоНаименованию("Интернет Решения ООО (OZON)");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("УТ0007314"));// <Контрагент>[МайМаркет ООО], Справочники.Контрагенты.НайтиПоНаименованию("МайМаркет ООО");
	КонтрагентИскл.Добавить(Справочники.Контрагенты.НайтиПоКоду("УТ0006910"));// <Контрагент>[МАРКЕТПЛЕЙС ООО], Справочники.Контрагенты.НайтиПоНаименованию("МАРКЕТПЛЕЙС ООО");
	Запрос.Параметры.Вставить("КонтрагентИскл", КонтрагентИскл); // <Список значений>[ЛефЭкспо; Леотон Трейдинг (пок.); Розничный покупатель ЯНДЕ...; Приват Трэйд ООО; ВАЙЛДБЕРРИЗ ООО (Главный); Интернет Решения ООО (OZO...; МайМаркет ООО; МАРКЕТПЛЕЙС ООО]
	Запрос.Параметры.Вставить("МАРКЕТПЛЕЙС", Справочники.Контрагенты.НайтиПоКоду("УТ0006910")); // <Контрагент>[МАРКЕТПЛЕЙС ООО], Справочники.Контрагенты.НайтиПоНаименованию("МАРКЕТПЛЕЙС ООО");
	Запрос.Параметры.Вставить("МАРКЕТПЛЕЙС_абс_БизнесРегион", Справочники.Регионы.НайтиПоКоду("Б00000335")); // <Бизнес-регионы>[Онлайн-продажи 3], Справочники.Регионы.НайтиПоНаименованию("Онлайн-продажи 3");
	Запрос.Параметры.Вставить("МАРКЕТПЛЕЙС_абс_Отдел", Справочники.Регионы.НайтиПоКоду("Б00000017")); // <Бизнес-регионы>[ИНТЕРНЕТ-ПРОДАЖИ], Справочники.Регионы.НайтиПоНаименованию("ИНТЕРНЕТ-ПРОДАЖИ");
	Запрос.Параметры.Вставить("Приват", Справочники.Контрагенты.НайтиПоКоду("УТ0007377")); // <Контрагент>[Приват Трэйд ООО], Справочники.Контрагенты.НайтиПоНаименованию("Приват Трэйд ООО");
	Запрос.Параметры.Вставить("Приват_абс_БизнесРегион", Справочники.Регионы.НайтиПоКоду("Б00000335")); // <Бизнес-регионы>[Онлайн-продажи 3], Справочники.Регионы.НайтиПоНаименованию("Онлайн-продажи 3");
	Запрос.Параметры.Вставить("Приват_абс_Отдел", Справочники.Регионы.НайтиПоКоду("Б00000017")); // <Бизнес-регионы>[ИНТЕРНЕТ-ПРОДАЖИ], Справочники.Регионы.НайтиПоНаименованию("ИНТЕРНЕТ-ПРОДАЖИ");
	Запрос.Параметры.Вставить("РЕЗЕРВ", Справочники.Контрагенты.НайтиПоКоду("ККК003248")); // <Контрагент>[РЕЗЕРВ], Справочники.Контрагенты.НайтиПоНаименованию("РЕЗЕРВ");
	Запрос.Параметры.Вставить("СкладАлибаба", Справочники.Склады.НайтиПоКоду("000000097")); // <Склад>[СКЛАД ЦАЙНЯО], Справочники.Склады.НайтиПоНаименованию("СКЛАД ЦАЙНЯО");
	Запрос.Параметры.Вставить("СкладМАРКЕТПЛЕЙС", Справочники.Склады.НайтиПоКоду("000000100")); // <Склад>[СКЛАД СберМегаМаркет], Справочники.Склады.НайтиПоНаименованию("СКЛАД СберМегаМаркет");
	Запрос.Параметры.Вставить("СкладПриват", Справочники.Склады.НайтиПоКоду("000000094")); // <Склад>[СКЛАД ПРИВАТ ТРЕЙД], Справочники.Склады.НайтиПоНаименованию("СКЛАД ПРИВАТ ТРЕЙД");
	Запрос.Параметры.Вставить("СкладЯндекс", Справочники.Склады.НайтиПоКоду("000000088")); // <Склад>[СКЛАД ЯНДЕКС МАРКЕТ], Справочники.Склады.НайтиПоНаименованию("СКЛАД ЯНДЕКС МАРКЕТ");
	Запрос.Параметры.Вставить("СтатусПроизводства", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000127")); // <Свойства объектов>[Статус производства], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Статус производства");
	Запрос.Параметры.Вставить("ТекЗаявкиКонецПериода", ДатаКон); // <Дата>[30.04.2025 0:00:00]
	Запрос.Параметры.Вставить("ТекЗаявкиНачалоПериода", ДатаНач); // <Дата>[01.04.2025 0:00:00]
	Запрос.Параметры.Вставить("ТипПокупателя", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Тип Покупателя")); // <Свойства объектов>[Тип Покупателя], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Тип Покупателя");
	Запрос.Параметры.Вставить("ТипЦен", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000004402")); // <Тип цен номенклатуры>[РРЦ 24 без НДС], Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("РРЦ 24 без НДС");
	Запрос.Параметры.Вставить("ТорговаяМарка", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000001")); // <Свойства объектов>[Торговая марка], ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Торговая марка");
	Запрос.Параметры.Вставить("Яндекс_абс_БизнесРегион", Справочники.Регионы.НайтиПоКоду("Б00000330")); // <Бизнес-регионы>[Онлайн-продажи 2], Справочники.Регионы.НайтиПоНаименованию("Онлайн-продажи 2");
	Запрос.Параметры.Вставить("Яндекс_абс_Отдел", Справочники.Регионы.НайтиПоКоду("Б00000017")); // <Бизнес-регионы>[ИНТЕРНЕТ-ПРОДАЖИ], Справочники.Регионы.НайтиПоНаименованию("ИНТЕРНЕТ-ПРОДАЖИ");
	Запрос.Параметры.Вставить("ЯндексООО", Справочники.Контрагенты.НайтиПоКоду("УТ0007066")); // <Контрагент>[ЯНДЕКС ООО], Справочники.Контрагенты.НайтиПоНаименованию("ЯНДЕКС ООО");
	
	ТЗ.Очистить();
	
	ДатаОстатки	=	ДатаНач;
	ТЗ		=	Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;       
	
КонецФункции

Процедура ОтслеживаниеМинОстатковПоЗапчастям() Экспорт

	Выборка	=	ПолучитьДанныеПоТребуемымМатериалам();
	
	Если Выборка.Количество()>0 Тогда
		//Создаем документ Заявка на запчасти и заполняем
		ДокОбъект	=	Документы.Лео_ЗаявкаНаЗапчасти.СоздатьДокумент();
		ДокОбъект.Дата				=	ТекущаяДата();
		ДокОбъект.Организация		=	Справочники.Организации.НайтиПоКоду("О00000003");
		ДокОбъект.ТипЦен			=	Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
		ДокОбъект.Статус			=	Перечисления.абс_СтатусыОтгрузки.Создан;
		ДокОбъект.Склад				=	Справочники.Склады.ПустаяСсылка();
		ДокОбъект.Комментарий		=	"Документ создан обработкой ОтслеживаниеМинОстатковПоЗапчастям";
		ДокОбъект.Ответственный		=	Справочники.Пользователи.ПустаяСсылка();
		ДокОбъект.СуммаДокумента	=	0;
		ДокОбъект.Контрагент		=	Справочники.Контрагенты.ПустаяСсылка();
		ДокОбъект.ПричинаСписания	=	Справочники.ПричиныСписания.ПустаяСсылка();
		ДокОбъект.Состояние			=	Перечисления.СостоянияОбъектов.Подготовлен;
		ДокОбъект.ЦФО				=	Справочники.Подразделения.НайтиПоКоду("П00000059");
		
		ДокументЗаписать= Ложь;
		Пока Выборка.Следующий() Цикл 
			ОстатокСУчетомЗаказов	=	Выборка.КоличествоОстаток+Выборка.КоличествоЗаказПоставщику+Выборка.КоличествоЗаявкаНаЗапчасти;
			Если Выборка.ЗначениеМИН_Остаток >= ОстатокСУчетомЗаказов Тогда 
			
				ТоварыСтрока	=	ДокОбъект.Товары.Добавить();
				ТоварыСтрока.Номенклатура		= 	Выборка.Номенклатура;
				ТоварыСтрока.Количество			=   Выборка.ЗначениеМАХ_Остаток - ОстатокСУчетомЗаказов;
				ТоварыСтрока.ЕдиницаИзмерения	=	Выборка.Номенклатура.ЕдиницаХраненияОстатков;
				ТоварыСтрока.Название			=   Выборка.Номенклатура.Наименование;
				
				ДокументЗаписать= Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументЗаписать Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);      
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры  

Функция ПолучитьДанныеПоТребуемымМатериалам()
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	Номенклатура.Ссылка КАК Номенклатура,
	            	 	|	ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0) КАК КоличествоОстаток,
	            	 	|	ЕСТЬNULL(ЗначениеМИН.ЗначениеМИН_Остаток, 0) КАК ЗначениеМИН_Остаток,
	            	 	|	ЕСТЬNULL(ЗначениеМАХ.ЗначениеМАХ_Остаток, 0) КАК ЗначениеМАХ_Остаток,
	            	 	|	ЕСТЬNULL(ЗаказанныйНеПоступившие.КоличествоЗаказПоставщику, 0) КАК КоличествоЗаказПоставщику,
	            	 	|	ЕСТЬNULL(ОформленныеЗаявкиНаЗапчасти.КоличествоЗЗап, 0) КАК КоличествоЗаявкаНаЗапчасти
	            	 	|ИЗ
	            	 	|	(ВЫБРАТЬ
	            	 	|		Номенклатура.Ссылка КАК Ссылка
	            	 	|	ИЗ
	            	 	|		Справочник.Номенклатура КАК Номенклатура
	            	 	|	ГДЕ
	            	 	|		Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаМатериалы)
	            	 	|		И Номенклатура.ВидНоменклатуры = &Материалы) КАК Номенклатура
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			ТоварыНаСкладахОстатки.Номенклатура КАК НоменклатураОстаток,
	            	 	|			ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	            	 	|		ИЗ
	            	 	|			РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки) КАК ОстаткиНаСкладе
	            	 	|		ПО Номенклатура.Ссылка = ОстаткиНаСкладе.НоменклатураОстаток
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	            	 	|			ЗначенияСвойствОбъектов.Значение КАК ЗначениеМИН_Остаток
	            	 	|		ИЗ
	            	 	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	            	 	|		ГДЕ
	            	 	|			ЗначенияСвойствОбъектов.Свойство = &СвойствоМИН) КАК ЗначениеМИН
	            	 	|		ПО Номенклатура.Ссылка = ЗначениеМИН.Объект
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			ЗначенияСвойствОбъектов.Объект КАК Объект,
	            	 	|			ЗначенияСвойствОбъектов.Значение КАК ЗначениеМАХ_Остаток
	            	 	|		ИЗ
	            	 	|			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	            	 	|		ГДЕ
	            	 	|			ЗначенияСвойствОбъектов.Свойство = &СвойствоМАХ) КАК ЗначениеМАХ
	            	 	|		ПО Номенклатура.Ссылка = ЗначениеМАХ.Объект
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			ЗаказыПоставщикамОстатки.Номенклатура КАК НоменклатураЗаказПоставщику,
	            	 	|			ЗаказыПоставщикамОстатки.КоличествоОстаток КАК КоличествоЗаказПоставщику
	            	 	|		ИЗ
	            	 	|			РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаРасчета, ) КАК ЗаказыПоставщикамОстатки
	            	 	|		ГДЕ
	            	 	|			ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата >= ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -1)) КАК ЗаказанныйНеПоступившие
	            	 	|		ПО Номенклатура.Ссылка = ЗаказанныйНеПоступившие.НоменклатураЗаказПоставщику
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			ЗаявкаНаЗапчасти.СсылкаЗЗап КАК СсылкаЗЗап,
	            	 	|			ЗаявкаНаЗапчасти.НоменклатураЗЗап КАК НоменклатураЗЗап,
	            	 	|			ЗаявкаНаЗапчасти.КоличествоЗЗап КАК КоличествоЗЗап,
	            	 	|			ЗаказПоставщику.КоличествоЗПост КАК КоличествоЗПост
	            	 	|		ИЗ
	            	 	|			(ВЫБРАТЬ
	            	 	|				Лео_ЗаявкаНаЗапчастиТовары.Ссылка КАК СсылкаЗЗап,
	            	 	|				Лео_ЗаявкаНаЗапчастиТовары.Номенклатура КАК НоменклатураЗЗап,
	            	 	|				Лео_ЗаявкаНаЗапчастиТовары.Количество КАК КоличествоЗЗап,
	            	 	|				Лео_ЗаявкаНаЗапчастиТовары.Название КАК Название
	            	 	|			ИЗ
	            	 	|				Документ.Лео_ЗаявкаНаЗапчасти.Товары КАК Лео_ЗаявкаНаЗапчастиТовары
	            	 	|			ГДЕ
	            	 	|				Лео_ЗаявкаНаЗапчастиТовары.Ссылка.Проведен
	            	 	|				И Лео_ЗаявкаНаЗапчастиТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -1)
	            	 	|				И НЕ Лео_ЗаявкаНаЗапчастиТовары.Номенклатура = &ПустаяСсылка
	            	 	|				И Лео_ЗаявкаНаЗапчастиТовары.Ссылка.Состояние = &СостояниеУтвержден
	            	 	|				И НЕ Лео_ЗаявкаНаЗапчастиТовары.Ссылка.Статус = &СтатусАнулирован) КАК ЗаявкаНаЗапчасти
	            	 	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|					ЗаказПоставщикуТовары.Номенклатура КАК НоменклатураЗПост,
	            	 	|					ЗаказПоставщикуТовары.Количество КАК КоличествоЗПост,
	            	 	|					ЗаказПоставщикуТовары.Заказ.Ссылка КАК ЗаказСсылка
	            	 	|				ИЗ
	            	 	|					Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	            	 	|				ГДЕ
	            	 	|					ЗаказПоставщикуТовары.Ссылка.Проведен
	            	 	|					И ЗаказПоставщикуТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -1)) КАК ЗаказПоставщику
	            	 	|				ПО ЗаявкаНаЗапчасти.НоменклатураЗЗап = ЗаказПоставщику.НоменклатураЗПост
	            	 	|					И ЗаявкаНаЗапчасти.СсылкаЗЗап = ЗаказПоставщику.ЗаказСсылка
	            	 	|		ГДЕ
	            	 	|			ЗаказПоставщику.КоличествоЗПост = 0) КАК ОформленныеЗаявкиНаЗапчасти
	            	 	|		ПО Номенклатура.Ссылка = ОформленныеЗаявкиНаЗапчасти.НоменклатураЗЗап
	            	 	|ГДЕ
	            	 	|	(ЗначениеМАХ.ЗначениеМАХ_Остаток > 0
	            	 	|			ИЛИ ЗначениеМИН.ЗначениеМИН_Остаток > 0)";
	Запрос.УстановитьПараметр("ДатаРасчета",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("СвойствоМАХ",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000318"));
	Запрос.УстановитьПараметр("СвойствоМИН",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000317"));
	Запрос.УстановитьПараметр("ПустаяСсылка",Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("СостояниеУтвержден",Перечисления.СостоянияОбъектов.Утвержден);
	Запрос.УстановитьПараметр("СтатусАнулирован",Перечисления.абс_СтатусыОтгрузки.Аннулирован);
	Запрос.УстановитьПараметр("ГруппаМатериалы",Справочники.Номенклатура.НайтиПоКоду("М0000000000"));
	Запрос.УстановитьПараметр("Материалы",Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002"));
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
КонецФункции

Процедура лео_ЗаполнитьЗаявкуНаЗапчасти() Экспорт
	// Вставить содержимое обработчика. 
	лео_РегЗадания.ОтслеживаниеМинОстатковПоЗапчастям();
КонецПроцедуры     


Процедура Лео_ЗагрузитьАктыСборки_Молком() Экспорт    
	//пока комментируем
	Лео_ЗагрузитьАктСборки();
	
	//ФормаОбработки	=	ОткрытьФорму("Обработка.Лео_ОбменМолком.Форма.Форма",,);			
	//ФормаОбработки.ИмпортАктыСборки("");
	//ФормаОбработки.Закрыть();
КонецПроцедуры

//		Перенесено из обработки обмен Молком  {  
Процедура Лео_ЗагрузитьАктСборки() Экспорт 
	
	ПараметрыПоУмолчанию	=	Справочники.абс_ПараметрыОбменаЛогистика.Молком;
	Попытка 
		Каталог = ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
		МаскаФайла = "*PickAct_*csv";	
		//+FTP	
		ПрочитатьФайлFTP(ПараметрыПоУмолчанию,МаскаФайла,Каталог,);
		//-FTP
		//Сообщить("Прошло соединение с FTP");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	КонецПопытки; 
	
	Каталог = ПараметрыПоУмолчанию.ПутьКФайлуРеализации;
	МаскаФайла = "*PickAct_*csv";	
	МассивФайлов  = НайтиФайлы(Каталог,МаскаФайла,Ложь);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещенныеФайлы = Новый Массив;
	
	Попытка
		Для каждого ФайлМассива из МассивФайлов Цикл
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлМассива.ПолноеИмя));
			//СтрокаПФ.Хранение	=	ПоместитьВоВременноеХранилище(ФайлМассива.ПолноеИмя);
		КонецЦикла;
		//Для Каждого
		//Сообщить("Файлы добавлены в массив");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	КонецПопытки;

	Попытка	
		Если ПомещаемыеФайлы.Количество()>0 Тогда 
			//ОповещениеОЗавершении = Новый ОписаниеОповещения("ПередачаФайловСервер",ЭтотОбъект );
			//НачатьПомещениеФайловНаСервер(ОповещениеОЗавершении,ПомещаемыеФайлы, ПомещенныеФайлы,,);

			//Если НачатьПеремещениеФайла(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь,) Тогда
			//Если ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,,Ложь,) Тогда
			//	//Сообщить("Файлы помещены во временное хранилище");
			//	ЗагрузитьАктыОтгрузкиЛоджикЛайн(ПомещенныеФайлы);
			//КонецЕсли;  
			// в связи с недоступностью перенести файлы при выполнении на сервере просто обрабатываем файлы
			ЗагрузитьАктыОтгрузкиЛоджикЛайн(ПомещаемыеФайлы);
		Иначе
			//Сообщить("Нет файла для загрузки.");
			Возврат;
		КонецЕсли;
		//Сообщить("Файлы получены и обработаны");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	КонецПопытки;

	//Попытка
	//	Каталог = Каталог + "\Arhiv\";
	//	Для каждого ФайлМассива из МассивФайлов Цикл
	//		ПереместитьФайл(ФайлМассива.ПолноеИмя,Каталог + ФайлМассива.Имя);
	//	КонецЦикла;
	//	//Сообщить("Файлы перенесены в архив");
	//Исключение
	//    Инфо = ИнформацияОбОшибке();
	//КонецПопытки; 
	
КонецПроцедуры  

Процедура ПередачаФайловСервер()
	Возврат;	
КонецПроцедуры

Процедура ПрочитатьФайлFTP(НастройкаОбмена,МаскаФайла,Каталог, Отказ = Ложь) 
	ИмяFTPСервера = "";
	ИмяКаталогаСервера = "";
	ДанныеПротокола = "";
	ПолучитьИмяСервераИИмяКаталогаОбмена(НастройкаОбмена.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, НастройкаОбмена, ДанныеПротокола, Истина, Неопределено);
	Если Соединение = Неопределено Тогда
		СообщитьОбОшибкеОбмена("Ошибка при подключении к серверу: " + ИмяFTPСервера);
		Возврат;
	КонецЕсли;
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, НастройкаОбмена.Входящие, ДанныеПротокола, Истина, Неопределено);
	Если Не НаличиеКаталога Тогда
		СообщитьОбОшибкеОбмена("На сервере " + ИмяFTPСервера + " отсутствует каталог: " + НастройкаОбмена.Входящие);
		Возврат;
	КонецЕсли;	
	МассивФайлов = Соединение.НайтиФайлы("/" + НастройкаОбмена.Входящие + "/", МаскаФайла);
	Если МассивФайлов.Количество() > 0 Тогда   		
		Для Каждого ФайлОбмена Из МассивФайлов Цикл 
			Если НастройкаОбмена.ТипНастройки = Перечисления.абс_ТипыОбменаEDI.ОбменЧерезFTPРесурс Тогда 		
				Соединение.Получить(ФайлОбмена.ПолноеИмя, "" + КаталогВременныхФайлов() + ФайлОбмена.Имя);
				абс_Файл = "" + КаталогВременныхФайлов() + ФайлОбмена.Имя;
				ФайлОбмена = Новый Файл(абс_Файл);
				КопироватьФайл(ФайлОбмена.ПолноеИмя, Каталог + "\" + ФайлОбмена.Имя);
			КонецЕсли;
		КонецЦикла; 
	Соединение.Удалить("/" + НастройкаОбмена.Входящие + "/",МаскаФайла);	
	КонецЕсли; 	
КонецПроцедуры 

Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено)       
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
	#КонецЕсли
	
	Попытка
		
		Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
		НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, ,НастройкиОбмена.ПассивноеFTPСоединение);						
		
	Исключение
		
		// ошибка при подключении к ftp
		ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки(), 
		ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

Процедура СообщитьОбОшибкеОбмена(ТекстСообщенияОбОшибке)
	
	//Сообщить(ТекстСообщенияОбОшибке, СтатусСообщения.ОченьВажное);
	ЗаписьЖурналаРегистрации("ОбменДаннымиEDI", УровеньЖурналаРегистрации.Ошибка);
	
КонецПроцедуры

Процедура ПолучитьИмяСервераИИмяКаталогаОбмена(Знач ПолныйFTPАдрес, ИмяСервера, ИмяКаталога)
	
	АдресОбмена = ПроцедурыОбменаДанными.НормализоватьFTPАдрес(ПолныйFTPАдрес);
	
	// принцип получения адреса такой, все что до первой черты / или \ - это имя сервера, потом каталог
	АдресОбмена = СтрЗаменить(АдресОбмена, "\", "/");
	
	ПозицияПрямогоСлеша = Найти(АдресОбмена, "/");
	
	Если ПозицияПрямогоСлеша = 0 Тогда
		ИмяСервера = АдресОбмена;
		ИмяКаталога = "";
	Иначе
		ИмяСервера = Сред(АдресОбмена, 1, ПозицияПрямогоСлеша - 1);
		ИмяКаталога = Сред(АдресОбмена, ПозицияПрямогоСлеша);
		
		// последний должен быть слеш у имени каталога
		Если Сред(ИмяКаталога, СтрДлина(ИмяКаталога)) <> "/" Тогда
			ИмяКаталога = ИмяКаталога + "/";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	Попытка
		
		МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
		
	Исключение
		
		// ошибка при подключении к ftp
		ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! " + ОписаниеОшибки(), 
		ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
		Возврат Ложь;
		
	КонецПопытки;
	
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.ПолноеИмя <> "/" + ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	// если не найден каталог для обмена
	ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Не найден FTP каталог обмена информацией: " + ИмяКаталогаСервера, 
	ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗагрузитьАктыОтгрузкиЛоджикЛайн(МассивФайлов) 
	Попытка
		ТекстЛога = ЛогированиеФайлЛога();
		//Сообщить("Начало логирования процесса");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	КонецПопытки;
	
	Попытка
		//+Обход массива файлов
		Для каждого ФайлЗаказа Из МассивФайлов Цикл
			ТекстСтроки = "" + ТекущаяДата() + " !!!Начало загрузки файла (" + ФайлЗаказа.Имя + ")" + Символы.ПС;
			ТекстЛога.Записать(ТекстСтроки);
			//Сообщить(ТекстСтроки,СтатусСообщения.Важное);
			
			ФайлEXCEL = ФайлЗаказа.Имя ;
			КолвоСтрокExcel = 1;     
			
			
			//Файл = Новый Файл(ФайлЗаказа.Имя);
			ДвоичныеДанные = Новый ДвоичныеДанные(ФайлЗаказа.Имя);

			// Сохраняем файл во временное хранилище
			//СсылкаХранилища = Новый ХранилищеЗначения(ДвоичныеДанные);
			
			//РезультатВремХран = ПоместитьВоВременноеХранилище(ФайлЗаказа.Имя);
			//ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаХранилища);  
			//ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлЗаказа.Хранение);  
			ПутьКФайлу = ПолучитьИмяВременногоФайла("csv");
			ДвоичныеДанные.Записать(ПутьКФайлу);
			
			
			Каталог = КаталогВременныхФайлов(); 
			
			ИмяФайла =СтрЗаменить(ПутьКФайлу, КаталогВременныхФайлов(),""); 

			ТабЗнач = ПрочитатьCSV(Каталог,ИмяФайла, 13);
			
			Для каждого Строка из  ТабЗнач Цикл	
				Если Строка.К_1 = "H" Тогда
					Строка.К_3	= СокрЛП(Строка.К_3); //№ акта выдачи
					Строка.К_5	= ПолучитьДатуИзСтроки(Строка.К_5); //Дата выдачи 		
					Строка.К_7	= ПолучитьДатуИзСтроки(Строка.К_7); //Дата заявки на выдачу
				ИначеЕсли Строка.К_1 = "I" Тогда
					Строка.К_2		= СокрЛП(Строка.К_2); //№ консолидированного заказа
					Строка.К_4		= СокрЛП(Строка.К_4); //№ заявки на выдачу
	                Строка.К_5		= СокрЛП(Строка.К_5); //Код товара
					Строка.К_7		= Число(Строка.К_7);  //Кол-во выданного товара
					Строка.К_8		= СокрЛП(Строка.К_8); //Партия
					Строка.К_12 	= СокрЛП(Строка.К_12);//Агрегаты коробок честного знака
					Строка.К_13 	= СокрЛП(Строка.К_13);//QR Коды честного знака
					Квалификация	= "";
	 			КонецЕсли;				
			КонецЦикла;

			
			ОтборПоШапке = Новый Структура;
			ОтборПоШапке.Вставить("К_1","H");
			
					
			ТабЗначДок = ТабЗнач.Скопировать(ОтборПоШапке,"К_3,К_5,К_7");
			ТабЗначДок.Свернуть("К_3,К_5,К_7");
			
			
			//+Сгруппированная таблица  ТабЗначДок. (список документов в файле)
			Для Каждого СтрокаДок из ТабЗначДок Цикл
				ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
				ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();   
				
				ОтборПоДокументуЗаказа = Новый Структура;
				ОтборПоДокументуЗаказа.Вставить("К_4", СтрокаДок.К_3);
				СтрокиТабЧастиДокументаИзФайла 	= ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_7,К_8"); 
				СтрокиТабЧастиДокументаИзФайла.Свернуть("К_5,К_8","К_7");
				//ЛЕО Пока временнр отключим,либо изменить и обеденить колонку К_12  
				СтрокиТабЧастиКодыЧЗ			 = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_8,К_12");	
				СтрокиТабЧастиКодыЧЗ.Свернуть("К_5,К_8,К_12");
				СтрокиТабЧастиКодыЧЗ_ТаблQR		 = ТабЗнач.Скопировать(ОтборПоДокументуЗаказа,"К_5,К_8,К_13");	
				СтрокиТабЧастиКодыЧЗ_ТаблQR.Свернуть("К_5,К_8,К_13");
				//СтрокиТабЧастиДокументаИзФайла.Колонки.Добавить("Обработано");
				
				ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.К_3,СтрокаДок.К_7);
				Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
					//если январь попробуем поискать за прошлый год
					Если Месяц(СтрокаДок.К_7)=1 Тогда	
						ДокументЗаказ = Документы.ЗаказПокупателя.НайтиПоНомеру(СтрокаДок.К_3,ДобавитьМесяц(СтрокаДок.К_7,-1));
					КонецЕсли;
				КонецЕсли;
					
				Если ДокументЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка()или ДокументЗаказ = Неопределено Тогда
					ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Заказ клиента"" по номеру заказа. Номер заказа " + СтрокаДок.К_3 + Символы.ПС ;
					ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					Продолжить;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
				|	И РеализацияТоваровУслуг.Сделка = &Заказ";
				
				Запрос.УстановитьПараметр("Заказ", ДокументЗаказ);
				Результат = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ДокументРеализация = ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла; 
				
				//если	коды заполнены то пропускаем
				Если ДокументРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка ИЛИ
					ДокументРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда
					Продолжить;	
				КонецЕсли;
				
				
				Если   ДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
					ТекстСтроки = "" + ТекущаяДата() + " Не найден документ ""Реализация товаров и услуг"" по документу ""Заказ клиента"". Номер заказа " + СтрокаДок.К_3 + Символы.ПС  ;
					ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					
					Продолжить;		
				КонецЕсли;
				
				Если ДокументЗаказ.ДатаОтгрузки<Дата("20250818") Тогда
					Продолжить;	
				КонецЕсли;
				//Проверка документа
				ОбъектЗаказ = ДокументЗаказ.ПолучитьОбъект() ;
				ОбъектРеализация = ДокументРеализация.ПолучитьОбъект(); 
				
				//Очистим табличную часть Кодов ЧЗ
				ОбъектРеализация.СписокКоробок.Очистить();
				//заполним Коды что бы не нарушать процесс
				Для каждого СтрокаИзФайла из СтрокиТабЧастиКодыЧЗ Цикл
					Строка_К12	=	СокрЛП(СтрокаИзФайла.К_12);	
					Если ЗначениеЗаполнено(Строка_К12) Тогда 
						Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
						Если НЕ Номенклатура.Пустая() Тогда
							Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
							Если Сред(Строка_К12,1,3)="146" ИЛИ Сред(Строка_К12,1,3)="346" ИЛИ Сред(Строка_К12,1,5)="00146" ИЛИ Сред(Строка_К12,1,5)="00346" Тогда
								НоваяСтр_СписокКоробок	=	ОбъектРеализация.СписокКоробок.Добавить();	
								НоваяСтр_СписокКоробок.Номенклатура			= Номенклатура.Ссылка;
								НоваяСтр_СписокКоробок.СерияНоменклатуры	= ?(Серия.Пустая(),Справочники.СерииНоменклатуры.ПустаяСсылка(),Серия);
								НоваяСтр_СписокКоробок.ШтрихКодКоробки		= НайтиСсылкаШтрихКодКоробки(Строка_К12);
							Иначе
								//Проверить возможно это QR код
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				ОбъектРеализация.ШтучныеQR_Коды.Очистить();
				Для каждого СтрокаИзФайла из СтрокиТабЧастиКодыЧЗ_ТаблQR Цикл
					Строка_К13	=	СокрЛП(СтрокаИзФайла.К_13);	
					Если ЗначениеЗаполнено(Строка_К13) Тогда 
						Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаИзФайла.К_5);
						Если НЕ Номенклатура.Пустая() Тогда
							Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(СтрокаИзФайла.К_8), Истина, , Номенклатура);
							Если Сред(Строка_К13,1,5)="01046" Тогда
								НоваяСтр_СписокQR_Код	=	ОбъектРеализация.ШтучныеQR_Коды.Добавить();	
								НоваяСтр_СписокQR_Код.Номенклатура		= Номенклатура.Ссылка;
								НоваяСтр_СписокQR_Код.СерияНоменклатуры	= ?(Серия.Пустая(),Справочники.СерииНоменклатуры.ПустаяСсылка(),Серия);
								НоваяСтр_СписокQR_Код.QR_Код_Входящий	= СокрЛП(Строка_К13); 
								НоваяСтр_СписокQR_Код.QR_Код_Сопоставлен= СопоставлениеКИЗ(НоваяСтр_СписокQR_Код.QR_Код_Входящий);
							Иначе
								//Проверить возможно это QR код
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Попытка
					Если НЕ ОбъектРеализация.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда 
						//Отгружен более высокий статус и его не надо перебивать.
						ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка;
						ОбъектРеализация.абс_Статус  = Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка; 
					КонецЕсли;
					//Сообщить("Данные по документу "+ДокументРеализация+" успешно обновлены по акту (информация по наличию кодов ЧЗ)");
					ОбъектРеализация.Записать(РежимЗаписиДокумента.Проведение);
					//ТекстСтроки = "" + ТекущаяДата() + " Проведен документ " + ДокументРеализация;
					//ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
					//СтрокаТаб = Объект.СписокЗагруженныхДокументов.добавить();
					//СтрокаТаб.СсылкаДокумент  = ОбъектРеализация.Ссылка;
					//СтрокаТаб.Расхождение = флРасхождения;   
					//Если товар подлежит Маркировки ЧЗ
					//Проверим количество знаков в документе
					ПроверкаКоличестваТовара_КоличествоМаркировкиЧЗ(ОбъектРеализация);
					
				Исключение
					ТекстСтроки = "" + ТекущаяДата() + " Ошибка проведения документа " + ДокументРеализация + "." + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;
				
				Попытка
					//ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
					//ТекстСтроки = "" + ТекущаяДата() + " Записан документ " + ОбъектЗаказ.Ссылка;
					//ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);

					////проведение заказа по регистру абс_НеотгруженныеТовары					
					//Если ОбъектЗаказ.Ссылка.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ОбъектЗаказ.Ссылка.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
					//	абс_Дистрибуция.СформироватьДвиженияПоНеотгруженнымТоварам(ОбъектЗаказ);
					//	ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
					//КонецЕсли;

					//ТекстСтроки = "" + ТекущаяДата() + " Сформированы движения для отчета: Анализ неотгруженных товаров " + ОбъектЗаказ.Ссылка;
					//ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);

				Исключение
					ТекстСтроки = "" + ТекущаяДата() + " Ошибка записи документа " + ОбъектЗаказ.Ссылка + "." + Символы.ПС + ОписаниеОшибки() ;
					ТекстЛога.Записать(ТекстСтроки);
					//Сообщить(ТекстСтроки,СтатусСообщения.ОченьВажное);
				КонецПопытки;

				////проведение заказа по регистру абс_НеотгруженныеТовары
				//Если ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ОбъектЗаказ.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
				//	абс_Дистрибуция.СформироватьДвиженияПоНеотгруженнымТоварам(ОбъектЗаказ.Ссылка);
				//КонецЕсли;
				
			КонецЦикла;
			//- Сгруппированная таблица  ТабЗначДок.
		КонецЦикла;
		Сообщить("Завершена обработка файлов");
	Исключение
	    Инфо = ИнформацияОбОшибке();
	КонецПопытки;

	//-Обход массива файлов
	ТекстЛога.Закрыть();
		
КонецПроцедуры

Функция СопоставлениеКИЗ(QR_Код_Входящий)
	//Ищем соответствие
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	Лео_СкладQRКоды_ВведеноВОборот.Код_КМ
	            	 	|ИЗ
	            	 	|	РегистрСведений.Лео_СкладQRКоды_ВведеноВОборот КАК Лео_СкладQRКоды_ВведеноВОборот
	            	 	|ГДЕ
	            	 	|	Лео_СкладQRКоды_ВведеноВОборот.Код_КМ ПОДОБНО &Код_КИЗ";
	Запрос.УстановитьПараметр("Код_КИЗ",""+Сред(QR_Код_Входящий,1,31)+"%");
    Выборка	=	Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;  
	КонецЕсли;	   
	Возврат Ложь;  
КонецФункции

Функция ЛогированиеФайлЛога()
	
	ИмяФайла = "ЛогОбмена_" + Формат(ТекущаяДата(),"ДФ=гг_ММ_д") +".txt";
	
	ПараметрыПоУмолчанию	=	Справочники.абс_ПараметрыОбменаЛогистика.Молком;
	КаталогЛога = ПараметрыПоУмолчанию.ПутьКЛогФайлу;
	Если КаталогЛога = "" Тогда
		КаталогЛога = КаталогВременныхФайлов();
	КонецЕсли;
	ТекстЛога = Новый ЗаписьТекста(КаталогЛога + "\" + ИмяФайла, КодировкаТекста.UTF16,,Истина,);
	Возврат  ТекстЛога;
	
КонецФункции   

Функция ПрочитатьCSV(Каталог,ИмяФайла, КолПолей)
	ФайлДокумента = Новый ТекстовыйДокумент ;
	//ФайлДокумента.Прочитать(Папка ,  КодировкаТекста.ANSI ,);
	//ИмяФайла =СтрЗаменить(Папка, КаталогВременныхФайлов(),""); 
	//Каталог = КаталогВременныхФайлов();
	//ФайлДокумента.Записать(Папка , КодировкаТекста.ANSI);
	
	Текст = "[" + ИмяФайла + "]
	|ColNameHeader=False
	|Format=Delimited(;)
	|TextDelimiter=none
	|CharacterSet=ANSI              
	|";

	Для ы = 1 По КолПолей Цикл
		Текст = Текст + "Col" + ы + "=Field" + ы + " Text" + Символы.ПС;
	КонецЦикла;
	
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(Текст);
	ТекстДок.Записать(Каталог + "Schema.ini",КодировкаТекста.ANSI); 
	
    objRec = Новый COMОбъект("ADODB.Recordset");
    strQuery = "SELECT * FROM [" + ИмяФайла + "]";
	//strConn = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + Каталог + ";Extended Properties=""text;""";
	strConn = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + Каталог + ";Extended Properties=""text;""";
    adOpenStatic = 3;
    adLockOptimistic = 3;
    adCmdText = 1;
	
	ТаблЗнач = Новый ТаблицаЗначений;

	НомКолонки = 1;
	Пока НомКолонки <= КолПолей Цикл
       	ТаблЗнач.Колонки.Добавить("К_"+НомКолонки,,"К_"+НомКолонки,300);
		НомКолонки = НомКолонки+1; 
	КонецЦикла;
	
	objRec.Open(strQuery, strConn, adOpenStatic, adLockOptimistic, adCmdText);
    КолСтрок = objRec.RecordCount;

    Ном = 1;

    Пока Не objRec.EOF Цикл
		//Если Ном % 500 = 0 Тогда
		//	Состояние(ИмяФайла + " " + Ном + " из " + КолСтрок);
		//  КонецЕсли;

        НовСтр = ТаблЗнач.Добавить();
        Для i=0 По objRec.Fields.Count-1 Цикл
        	НовСтр[i] = Строка(objRec.Fields(i).Value);
        КонецЦикла;
        objRec.MoveNext();
        Ном = Ном + 1;
    КонецЦикла;
    objRec.Close();

    Возврат ТаблЗнач;

КонецФункции

Функция ПолучитьДатуИзСтроки(Стр)
	Д = Дата("00010101000000");
	Если ПустаяСтрока(Стр) Тогда
		Возврат Д;
	КонецЕсли;
	
	Если Найти(Стр,".")>0 Тогда
		Если Найти(Стр,":")>0 И Найти(Стр," ")>0 Тогда 
			М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр," ");
			Возврат ПолучитьДатуИзСтроки(М[0]);
		КонецЕсли;
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,".");
	ИначеЕсли Найти(Стр,"/")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"/");
	ИначеЕсли Найти(Стр,",")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,",");
	ИначеЕсли Найти(Стр,"-")>0 Тогда
		М = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр,"-");
	КонецЕсли;
	
	Попытка
		Если М.Количество()=3 Тогда //"01.02.13" или "01.02.2013"
			Год = ?(СтрДлина(М[2])=2,2000+М[2],М[2]);
			Д = Дата(Год,М[1],М[0]);
		ИначеЕсли М.Количество()=2 Тогда //"02.13" или "02.2013";
			Год = ?(СтрДлина(М[1])=2,2000+М[1],М[1]);
			Д = Дата(Год,М[0],1);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Д;
КонецФункции

Функция НайтиСсылкаШтрихКодКоробки(ШтрихКодКоробки)
	Ссылка_ШтрихКод	=	Справочники.Лео_СправочникШтрихКодовКоробок.НайтиПоНаименованию(ШтрихКодКоробки,Истина);
	Если Ссылка_ШтрихКод=Неопределено Тогда
		Ссылка_ШтрихКод	=	Справочники.Лео_СправочникШтрихКодовКоробок.ПустаяСсылка();
	КонецЕсли;
	Возврат Ссылка_ШтрихКод;
КонецФункции

Процедура ПроверкаКоличестваТовара_КоличествоМаркировкиЧЗ(ОбъектРеализация)  

	ЛЕО_ЕстьТоварЧЗ	=	Ложь;
	Для Каждого СтрокаТовары Из ОбъектРеализация.Товары Цикл
		ЗначениеОКПД2	= лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(СтрокаТовары.Номенклатура, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
		Если ЗначениеЗаполнено(ЗначениеОКПД2) И ТипЗнч(ЗначениеОКПД2)=Тип("СправочникСсылка.Лео_КлассификаторОКПД2") Тогда 
			Если ЗначениеОКПД2.ЧестныйЗнак Тогда 
				ЛЕО_ЕстьТоварЧЗ	=	Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если ЛЕО_ЕстьТоварЧЗ Тогда
		Для Каждого СтрокаТовары Из ОбъектРеализация.Товары Цикл
			ЗначениеОКПД2	= лео_ДопФункции.Получить_ЗначенияСвойствОбъектов(СтрокаТовары.Номенклатура, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
			Если ЗначениеЗаполнено(ЗначениеОКПД2) И ТипЗнч(ЗначениеОКПД2)=Тип("СправочникСсылка.Лео_КлассификаторОКПД2") Тогда 
				Если ЗначениеОКПД2.ЧестныйЗнак Тогда 
					//Проверяем соответствие количество товара  и кодов маркирвки ЧЗ  
					КоличествоМарок_ЧЗ	=	ПолучитьКоличествоМарок(ОбъектРеализация, СтрокаТовары.Номенклатура, СтрокаТовары.СерияНоменклатуры);
					Если НЕ КоличествоМарок_ЧЗ=Неопределено Тогда 
						Если НЕ КоличествоМарок_ЧЗ.КоличествоМарок=СтрокаТовары.Количество Тогда
						ОтправитьУведомлениеПоПочтеРасхождениеКоличетваТовара_КоличестваМарок(ОбъектРеализация, СтрокаТовары.Номенклатура, "По данной позиции наблюдаются Расхождения количества товара - "+СтрокаТовары.Количество+", и количества Марок ЧЗ- "+КоличествоМарок_ЧЗ.КоличествоМарок);	
						КонецЕсли;	
					Иначе
						ОтправитьУведомлениеПоПочтеРасхождениеКоличетваТовара_КоличестваМарок(ОбъектРеализация, СтрокаТовары.Номенклатура, "Нет данных о количестве МАРОК ЧЗ");	
				    КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьКоличествоМарок(ОбъектРеализация, Номенклатура, СерияНоменклатуры)
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	ТоварыНоменклатура.Номенклатура,
	            	 	|	ТоварыНоменклатура.СерияНоменклатуры,
	            	 	|	ЕСТЬNULL(ТаблКоличествоQRкодыШтучные.КоличествоQRкодов, 0) КАК КоличествоШтучное,
	            	 	|	ТаблицаКоличествоАгрегированное.КоличествоАгрегировано,
	            	 	|	ЕСТЬNULL(ТаблКоличествоQRкодыШтучные.КоличествоQRкодов, 0) + ТаблицаКоличествоАгрегированное.КоличествоАгрегировано КАК КоличествоМарок
	            	 	|ИЗ
	            	 	|	(ВЫБРАТЬ
	            	 	|		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	            	 	|		РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры
	            	 	|	ИЗ
	            	 	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	            	 	|	ГДЕ
	            	 	|		РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
	            	 	|		И РеализацияТоваровУслугТовары.СерияНоменклатуры = &СерияНоменклатуры
	            	 	|		И РеализацияТоваровУслугТовары.Ссылка = &РеализацияТУ) КАК ТоварыНоменклатура
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура КАК Номенклатура,
	            	 	|			РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры КАК СерияНоменклатуры,
	            	 	|			СУММА(1) КАК КоличествоQRкодов
	            	 	|		ИЗ
	            	 	|			Документ.РеализацияТоваровУслуг.ШтучныеQR_Коды КАК РеализацияТоваровУслугШтучныеQR_Коды
	            	 	|		ГДЕ
	            	 	|			РеализацияТоваровУслугШтучныеQR_Коды.Ссылка = &РеализацияТУ
	            	 	|			И РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура = &Номенклатура
	            	 	|			И РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры = &СерияНоменклатуры
	            	 	|		
	            	 	|		СГРУППИРОВАТЬ ПО
	            	 	|			РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура,
	            	 	|			РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры) КАК ТаблКоличествоQRкодыШтучные
	            	 	|		ПО ТоварыНоменклатура.Номенклатура = ТаблКоличествоQRкодыШтучные.Номенклатура
	            	 	|			И ТоварыНоменклатура.СерияНоменклатуры = ТаблКоличествоQRкодыШтучные.СерияНоменклатуры
	            	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|			ТаблицаКоличествоКоробок.Номенклатура КАК Номенклатура,
	            	 	|			ТаблицаКоличествоКоробок.СерияНоменклатуры КАК СерияНоменклатуры,
	            	 	|			ТаблицаКоличествоКоробок.КоличествоКоробок КАК КоличествоКоробок,
	            	 	|			ЕдиницыКоэффициент.Коэффициент КАК Коэффициент,
	            	 	|			ЕСТЬNULL(ТаблицаКоличествоКоробок.КоличествоКоробок, 0) * ЕдиницыКоэффициент.Коэффициент КАК КоличествоАгрегировано
	            	 	|		ИЗ
	            	 	|			(ВЫБРАТЬ
	            	 	|				РеализацияТоваровУслугСписокКоробок.Номенклатура КАК Номенклатура,
	            	 	|				РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры КАК СерияНоменклатуры,
	            	 	|				СУММА(1) КАК КоличествоКоробок
	            	 	|			ИЗ
	            	 	|				Документ.РеализацияТоваровУслуг.СписокКоробок КАК РеализацияТоваровУслугСписокКоробок
	            	 	|			ГДЕ
	            	 	|				РеализацияТоваровУслугСписокКоробок.Ссылка = &РеализацияТУ
	            	 	|				И РеализацияТоваровУслугСписокКоробок.Номенклатура = &Номенклатура
	            	 	|				И РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры = &СерияНоменклатуры
	            	 	|			
	            	 	|			СГРУППИРОВАТЬ ПО
	            	 	|				РеализацияТоваровУслугСписокКоробок.Номенклатура,
	            	 	|				РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры) КАК ТаблицаКоличествоКоробок
	            	 	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	            	 	|					ЕдиницыИзмерения.Владелец КАК Владелец,
	            	 	|					ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 0) КАК Коэффициент
	            	 	|				ИЗ
	            	 	|					Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	            	 	|				ГДЕ
	            	 	|					ЕдиницыИзмерения.Владелец = &Номенклатура
	            	 	|					И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &Упаковка) КАК ЕдиницыКоэффициент
	            	 	|				ПО ТаблицаКоличествоКоробок.Номенклатура = ЕдиницыКоэффициент.Владелец) КАК ТаблицаКоличествоАгрегированное
	            	 	|		ПО ТоварыНоменклатура.Номенклатура = ТаблицаКоличествоАгрегированное.Номенклатура
	            	 	|			И ТоварыНоменклатура.СерияНоменклатуры = ТаблицаКоличествоАгрегированное.СерияНоменклатуры";
	Запрос.УстановитьПараметр("РеализацияТУ",ОбъектРеализация.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	Запрос.УстановитьПараметр("Упаковка",Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("778"));
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции   

Процедура ОтправитьУведомлениеПоПочтеРасхождениеКоличетваТовара_КоличестваМарок(ДокументРеализацияОбъект, Номенклатура, СтрокаСообщения);	
	

	МассивАдресов = Новый Массив;
	МассивАдресов.Добавить("VZarodnyuk@leovit.ru");
	МассивАдресов.Добавить("AShcherbinina@leovit.ru");
	МассивАдресов.Добавить("SGluhova@leovit.ru");
	МассивАдресов.Добавить("EBessmertnykh@leovit.ru");
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "Расхождение количества в документе и количества марок ЧЗ");
	
	ТекстПисьма = "";
	ТекстПисьма = "Добрый день, коллеги! <BR> <BR>";
    ТекстПисьма = ТекстПисьма +  "  " + "<BR>";
    ТекстПисьма = ТекстПисьма +  "По документу 			" +  ДокументРеализацияОбъект.Ссылка  + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Номенклатура артикул 	" +  Номенклатура.Артикул + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Номенклатура 		 	" +  Номенклатура.наименование + "<BR>";
    ТекстПисьма = ТекстПисьма +  "  "+ "<BR>";
    ТекстПисьма = ТекстПисьма +  СтрокаСообщения + "<BR>"; 
    ТекстПисьма = ТекстПисьма +  "  "  + "<BR>";
    СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);

	Попытка
		УстановитьПривилегированныйРежим(Истина); 
		
		СтруктураПисьма = НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
		ЭлектронныеПисьма = Новый Соответствие;
		
		ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		
		ИзмененныйСоставПисем = Новый Соответствие;	
		ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
		Для каждого Письмо Из ЭлектронныеПисьма Цикл
			Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
				ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
				
				ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
					
					ОбъектПисьмо.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			
				Попытка
					ОбъектПисьмо.Записать();
				Исключение
					Продолжить;;
				КонецПопытки;
			Иначе
				Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
					Письмо.Значение.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			КонецЕсли; 
		    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
		КонецЦикла;                                      
		
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисемБезЛогирования(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ,,
		ИзмененныйСоставПисем, Истина , , Ложь, );
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
	КонецПопытки;	
		
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;	
	
КонецПроцедуры


//  } Перенесено из обработки обмен Молком  


//// Формируются документы перепродажи ЛеовитНутрио-
Процедура ФормированиеДокументаРеализацияТУ_ПоступленияТУ() Экспорт
	
	Параметры = Новый Структура();
	СборДанныхДеньВДень	= Истина;              //меняется в зависимости от распряжений, не забыть изменить время в рег задании
	Если СборДанныхДеньВДень Тогда  
		//Время в регламентном задании 8 утра, Молком не успевает собирать до 17.00
		Параметры.Вставить("ДатаНачала", 				НачалоДня(ТекущаяДата())); 
		Параметры.Вставить("ДатаОкончания", 			КонецДня(ТекущаяДата())); 
		Параметры.Вставить("ДатаФормирования", 			ТекущаяДата());
		Параметры.Вставить("Период", 					Новый Граница(КонецДня(ТекущаяДата()),ВидГраницы.Включая)); 
	Иначе
		//Проверяем завтрашний день
		Завтра = КонецДня(ТекущаяДата()) + 1;
		Параметры.Вставить("ДатаНачала", 				НачалоДня(Завтра)); 
		Параметры.Вставить("ДатаОкончания", 			КонецДня(Завтра)); 
		Параметры.Вставить("ДатаФормирования", 			Завтра); 
		Параметры.Вставить("Период", 					Новый Граница(КонецДня(Завтра),ВидГраницы.Включая)); 
	КонецЕсли;
	Параметры.Вставить("Организация", 					Справочники.Организации.НайтиПоКоду("О00000003")); 
	Параметры.Вставить("ОрганизацияПродавец", 			Справочники.Организации.НайтиПоКоду("О00000001")); 
	Параметры.Вставить("ГрузоотправительПроизводитель", Справочники.Контрагенты.НайтиПоКоду("К00000011")); 
	Параметры.Вставить("ГрузополучательПродавец", 		Справочники.Контрагенты.НайтиПоКоду("К00001098")); 
	Параметры.Вставить("ТипЦен", 						Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000004438")); 
	Параметры.Вставить("ДоговорПокупки", 				Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000000248")); 
	Параметры.Вставить("ДоговорПродажи", 				Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000000249")); 
	Параметры.Вставить("ХозОперацияРеализация", 		Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000049")); 
	Параметры.Вставить("ХозОперацияПоступление", 		Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000012")); 
	
	
	
	Параметры.Вставить("РазделитьПоМаркировкеЧЗ", 		Истина); 
	ДанныеФормирования	=	ПолучитьДанныеДляФормированияДокумента(Параметры);
	
КонецПроцедуры

Функция ПолучитьДанныеДляФормированияДокумента(Параметры)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.СерияНоменклатуры,
	|	ВложенныйЗапрос.Качество,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Количество,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа,
	|	НоменклатураЧЗ.ЗначениеЧестныйЗнак
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.СерияНоменклатуры КАК СерияНоменклатуры,
	|		ВложенныйЗапрос.Качество КАК Качество,
	|		ВложенныйЗапрос.Склад КАК Склад,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	|			РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|			РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|			РеализацияТоваровУслугТовары.Качество КАК Качество,
	|			РеализацияТоваровУслугТовары.Ссылка.Склад КАК Склад,
	|			РеализацияТоваровУслугТовары.Количество КАК Количество,
	|			РеализацияТоваровУслугТовары.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ГДЕ
	|			РеализацияТоваровУслугТовары.Ссылка.Проведен
	|			И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И РеализацияТоваровУслугТовары.Ссылка.абс_Статус В(&СтатусыРеализаций)
	|			И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.Номенклатура,
	|			ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|			ВложенныйЗапрос.СерияНоменклатуры,
	|			ВложенныйЗапрос.Качество,
	|			ВложенныйЗапрос.Склад,
	|			ВложенныйЗапрос.Количество,
	|			ВложенныйЗапрос.НоменклатураНоменклатурнаяГруппа
	|		ИЗ
	|			(ВЫБРАТЬ
	|				КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	|				КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|				КорректировкаРеализацииТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|				КорректировкаРеализацииТовары.Качество КАК Качество,
	|				КорректировкаРеализацииТовары.Ссылка.Организация КАК Организация,
	|				КорректировкаРеализацииТовары.Ссылка.Склад КАК Склад,
	|				КорректировкаРеализацииТовары.Номенклатура.НоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа,
	|				КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоКорректировки КАК Количество
	|			ИЗ
	|				Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|			ГДЕ
	|				КорректировкаРеализацииТовары.Ссылка.Проведен = ИСТИНА
	|				И КорректировкаРеализацииТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И КорректировкаРеализацииТовары.Ссылка.Организация = &Организация
	|				И КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения <> 0) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Номенклатура,
	|		ВложенныйЗапрос.СерияНоменклатуры,
	|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|		ВложенныйЗапрос.Качество,
	|		ВложенныйЗапрос.Склад,
	|		ВложенныйЗапрос.НоменклатурнаяГруппа) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НоменклатураЧЗ.Объект КАК Номенклатура,
	|			НоменклатураЧЗ.Значение КАК Значение,
	|			ВЫБОР
	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
	|				ЗначенияСвойствОбъектов.Значение КАК Значение
	|			ИЗ
	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|			ГДЕ
	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураЧЗ
	|		ПО ВложенныйЗапрос.Номенклатура = НоменклатураЧЗ.Номенклатура
	|ГДЕ
	|	ВложенныйЗапрос.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапрос1.ДокументПоступления) КАК ДокументПоступления,
	|	ВложенныйЗапрос1.Лев_НоменклатурнаяГруппа,
	|	МАКСИМУМ(ВложенныйЗапрос1.ДокументРеализации) КАК ДокументРеализации,
	|	ВложенныйЗапрос1.Склад
	|ПОМЕСТИТЬ ВТ_ДокументыПродажимеждуОрганизациями
	|ИЗ
	|	(ВЫБРАТЬ
	|		"""" КАК ДокументПоступления,
	|		РеализацияТоваровУслуг.Лев_НоменклатурнаяГруппа КАК Лев_НоменклатурнаяГруппа,
	|		РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
	|		РеализацияТоваровУслуг.Склад КАК Склад
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|		И РеализацияТоваровУслуг.Организация = &ОрганизацияПроизводитель
	|		И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорПродажи
	|		И РеализацияТоваровУслуг.Комментарий ПОДОБНО &ТекстКомментарий
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеТоваровУслуг.Ссылка,
	|		ПоступлениеТоваровУслуг.Лев_НоменклатурнаяГруппа,
	|		"""",
	|		ПоступлениеТоваровУслуг.СкладОрдер
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|	ГДЕ
	|		ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|		И ПоступлениеТоваровУслуг.Организация = &Организация
	|		И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорПокупки
	|		И ПоступлениеТоваровУслуг.Комментарий ПОДОБНО &ТекстКомментарий) КАК ВложенныйЗапрос1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос1.Лев_НоменклатурнаяГруппа,
	|	ВложенныйЗапрос1.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Организация КАК Организация,
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
	|	ТаблицаНоменклатуры.СерияНоменклатуры,
	|	ТаблицаНоменклатуры.Качество,
	|	ТаблицаНоменклатуры.Склад КАК Склад,
	|	СУММА(ТаблицаНоменклатуры.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА &НеРазбиватьПоНоменклатурнымГруппам = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаНоменклатуры.НоменклатурнаяГруппа
	|	КОНЕЦ КАК НоменклатурнаяГруппа,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Цена,
	|	СУММА(ТаблицаНоменклатуры.Количество * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1)) КАК Сумма,
	|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументПоступления КАК ДокументПоступления,
	|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументРеализации КАК ДокументРеализации
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				(Номенклатура, ХарактеристикаНоменклатуры) В
	|						(ВЫБРАТЬ
	|							ТаблицаНоменклатуры.Номенклатура,
	|							ТаблицаНоменклатуры.ХарактеристикаНоменклатуры
	|						ИЗ
	|							ТаблицаНоменклатуры КАК ТаблицаНоменклатуры)
	|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ТаблицаНоменклатуры.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыПродажимеждуОрганизациями КАК ВТ_ДокументыПродажимеждуОрганизациями
	|		ПО ТаблицаНоменклатуры.НоменклатурнаяГруппа = ВТ_ДокументыПродажимеждуОрганизациями.Лев_НоменклатурнаяГруппа
	|			И ТаблицаНоменклатуры.Склад = ВТ_ДокументыПродажимеждуОрганизациями.Склад
	|ГДЕ
	|	ТаблицаНоменклатуры.Качество > 0
	|	//РазделитьПоМаркировкиЧЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.Организация,
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
	|	ТаблицаНоменклатуры.СерияНоменклатуры,
	|	ТаблицаНоменклатуры.Качество,
	|	ТаблицаНоменклатуры.Склад,
	|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументПоступления,
	|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументРеализации,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1),
	|	ВЫБОР
	|		КОГДА &НеРазбиватьПоНоменклатурнымГруппам = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаНоменклатуры.НоменклатурнаяГруппа
	|	КОНЕЦ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	МАКСИМУМ(ДокументПоступления),
	|	МАКСИМУМ(ДокументРеализации)
	|ПО
	|	Склад,
	|	Организация,
	|	НоменклатурнаяГруппа";  
	
	Если Параметры.РазделитьПоМаркировкеЧЗ Тогда 
		Запрос.Текст	=	СтрЗаменить(Запрос.Текст,"//РазделитьПоМаркировкиЧЗ","И ТаблицаНоменклатуры.ЗначениеЧестныйЗнак = ИСТИНА");
	Иначе
		Запрос.Текст	=	СтрЗаменить(Запрос.Текст,"//РазделитьПоМаркировкиЧЗ","И НЕ ТаблицаНоменклатуры.ЗначениеЧестныйЗнак = ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период"			, Параметры.Период);
	Запрос.УстановитьПараметр("ДатаНачала"		, Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, Параметры.ДатаОкончания);
	Запрос.УстановитьПараметр("ТипЦен"			, Параметры.ТипЦен);
	Запрос.УстановитьПараметр("Организация"		, Параметры.ОрганизацияПродавец);
	Запрос.УстановитьПараметр("НеРазбиватьПоНоменклатурнымГруппам"		, Истина);
	Запрос.УстановитьПараметр("ОрганизацияПроизводитель" 	, Параметры.Организация);
    Запрос.УстановитьПараметр("ДоговорПродажи" 	, Параметры.ДоговорПродажи);
    Запрос.УстановитьПараметр("ДоговорПокупки" 	, Параметры.ДоговорПокупки);
    Запрос.УстановитьПараметр("Свойство" 		, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
    Запрос.УстановитьПараметр("ТекстКомментарий", "#Документ сформирован автоматически"+?(Параметры.РазделитьПоМаркировкеЧЗ," #Товар маркирован ЧЗ#","#Без маркировки"));
	
	СпСтатусовРеализации = Новый Массив;
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка);
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВРаботе);
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
	СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
	
	Запрос.УстановитьПараметр("СтатусыРеализаций", СпСтатусовРеализации);
	
	Результат = Запрос.Выполнить(); 
	
	КЧ153 = Новый КвалификаторыЧисла(15,3);
	КЧ202 = Новый КвалификаторыЧисла(20,2);
	Массив = Новый Массив; 
	Массив.Добавить(Тип("Число"));
	
	Дерево	=	Новый ДеревоЗначений;  
	Дерево.Колонки.Добавить("Пометка", 						Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("Количество", 					Новый ОписаниеТипов(Массив, , ,КЧ153));
	Дерево.Колонки.Добавить("Сумма", 						Новый ОписаниеТипов(Массив, , ,КЧ202));
	Дерево.Колонки.Добавить("ДокументПоступления", 			Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Дерево.Колонки.Добавить("ДокументРеализации", 			Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	Дерево.Колонки.Добавить("Качество", 					Новый ОписаниеТипов("СправочникСсылка.Качество"));
	Дерево.Колонки.Добавить("ХарактеристикаНоменклатуры", 	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Дерево.Колонки.Добавить("СерияНоменклатуры", 			Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	Дерево.Колонки.Добавить("Склад", 						Новый ОписаниеТипов("СправочникСсылка.Склады"));   
	//описание составного типа 
	МассивСоставной = Новый Массив; 
	МассивСоставной.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивСоставной.Добавить(Тип("СправочникСсылка.НоменклатурныеГруппы"));
	МассивСоставной.Добавить(Тип("СправочникСсылка.Организации"));
	МассивСоставной.Добавить(Тип("СправочникСсылка.Склады"));
	Дерево.Колонки.Добавить("Номенклатура", 				Новый ОписаниеТипов(МассивСоставной));
	
	Если Результат.Пустой() Тогда
		//Написать письмо оботсутствии данных для выгрузки
		Возврат Неопределено;
	КонецЕсли;
		
	ВыборкаСклад=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	Пока ВыборкаСклад.Следующий() Цикл
		СтрокаСклад = Дерево.Строки.Добавить();
		СтрокаСклад.Пометка 		= Истина;
		СтрокаСклад.Номенклатура 	= ВыборкаСклад.Склад;
		
		ВыборкаОрганизация = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Организация");
		Пока ВыборкаОрганизация.Следующий() Цикл
			СтрокаОрганизация = СтрокаСклад.Строки.Добавить();
			СтрокаОрганизация.Пометка 		= Истина;
			СтрокаОрганизация.Номенклатура	= ВыборкаОрганизация.Организация;
			
			ВыборкаГруппа = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяГруппа");
			Пока ВыборкаГруппа.Следующий() Цикл
				СтрокаГруппа=СтрокаОрганизация.Строки.Добавить();
				СтрокаГруппа.Пометка 			 = Истина;
				СтрокаГруппа.Номенклатура		 = ВыборкаГруппа.НоменклатурнаяГруппа;
				СтрокаГруппа.ДокументПоступления = ВыборкаГруппа.ДокументПоступления;
				СтрокаГруппа.ДокументРеализации  = ВыборкаГруппа.ДокументРеализации;
				
				ВыборкаНоменклатура=ВыборкаГруппа.Выбрать();
				Пока ВыборкаНоменклатура.Следующий() Цикл
					СтрокаНоменклатура			= СтрокаГруппа.Строки.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаНоменклатура,ВыборкаНоменклатура);
					СтрокаНоменклатура.ДокументПоступления = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
					СтрокаНоменклатура.ДокументРеализации  = Документы.РеализацияТоваровУслуг.ПустаяСсылка();

					СтрокаНоменклатура.Пометка	= Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
	ОсновнойКонтрагент=ПолучитьКонтрагентаПоОрганизации(Параметры.Организация);
	Если Не ЗначениеЗаполнено(ОсновнойКонтрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найден контрагент по организации " + Параметры.Организация + ". Необходимо заполнить регистр сведений ""Контрагенты организаций""");
	КонецЕсли;
		
	Для Каждого СтрокаСклад Из Дерево.Строки Цикл
		Если Не СтрокаСклад.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Склад = СтрокаСклад.Номенклатура;
		
		Для каждого СтрокаОрганизация Из СтрокаСклад.Строки Цикл
			Если Не СтрокаОрганизация.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Контрагент=ПолучитьКонтрагентаПоОрганизации(СтрокаОрганизация.Номенклатура);
			
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не найден контрагент по организации " + СтрокаОрганизация.Номенклатура + ". Необходимо заполнить регистр сведений ""Контрагенты организаций""");
			КонецЕсли;
			
			Для каждого СтрокаГруппа из СтрокаОрганизация.Строки Цикл
				Если Не СтрокаГруппа.Пометка Тогда
					Продолжить;
				КонецЕсли;
				
				//НачатьТранзакцию();
				
				//+Лео Сафонов ЕА
				//формирование документа Реализация товаров и услуг
				Если  СтрокаГруппа.ДокументРеализации.Пустая() Тогда
					ДокументРеализацияОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Иначе 
					ДокументРеализацияОбъект = СтрокаГруппа.ДокументРеализации.ПолучитьОбъект();
					ДокументРеализацияОбъект.Товары.Очистить();
				КонецЕсли;
				//-Лео Сафонов ЕА

				
				//ДокументРеализацияОбъект=Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				ЗаполнитьДокументРеализации(ДокументРеализацияОбъект, Параметры.Организация, Контрагент, Склад, СтрокаГруппа, Параметры);				
				ДокументРеализацияОбъект.абс_ХозяйственнаяОперация = Параметры.ХозОперацияРеализация;
				ДокументРеализацияОбъект.ОтражатьВУправленческомУчете = Истина;
				ДокументРеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаГруппа.ДокументРеализации=ДокументРеализацияОбъект.Ссылка;
				
				//+Лео Сафонов ЕА
				ДокументСчФактураВыданный = Документы.СчетФактураВыданный.ПустаяСсылка();
				ДокументСчФактураВыданный =  УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаГруппа.ДокументРеализации, "СчетФактураВыданный");
				Если  ДокументСчФактураВыданный = Документы.СчетФактураВыданный.ПустаяСсылка() Или  ДокументСчФактураВыданный = Неопределено Тогда
					ДокументСчФактураВыданный = Документы.СчетФактураВыданный.СоздатьДокумент();	
				Иначе
					ДокументСчФактураВыданный = ДокументСчФактураВыданный.ПолучитьОбъект() ;
				КонецЕсли;
				//-Лео Сафонов ЕА

				//ДокументСчФактураВыданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
				//+ Зароднюк Владимир
				//Заполнить не очищает табличную часть документ основание, выполним это сами 
				Если ДокументСчФактураВыданный.ДокументыОснования.Количество()>0 Тогда
					ДокументСчФактураВыданный.ДокументыОснования.Очистить();
				КонецЕсли;
				//- Зароднюк Владимир 
				
				ДокументСчФактураВыданный.Заполнить(СтрокаГруппа.ДокументРеализации);
				ДокументСчФактураВыданный.Записать(РежимЗаписиДокумента.Проведение);
				
				
				//формирование документа Поступление товаров и услуг
				//ДокументПоступлениеОбъект=Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
				//+Лео Сафонов ЕА
				Если  СтрокаГруппа.ДокументПоступления.Пустая() Тогда
					ДокументПоступлениеОбъект=Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
				Иначе 
					ДокументПоступлениеОбъект = СтрокаГруппа.ДокументПоступления.ПолучитьОбъект();
					ДокументПоступлениеОбъект.Товары.Очистить();
				КонецЕсли;
				//-Лео Сафонов ЕА
				ЗаполнитьДокументПоступления(ДокументПоступлениеОбъект, СтрокаОрганизация.Номенклатура, ОсновнойКонтрагент, Склад, СтрокаГруппа, ДокументРеализацияОбъект.Ссылка, Параметры);
				ДокументПоступлениеОбъект.абс_ХозяйственнаяОперация = Параметры.ХозОперацияПоступление;
				ДокументПоступлениеОбъект.ОтражатьВУправленческомУчете = Истина;
				ДокументПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаГруппа.ДокументПоступления=ДокументПоступлениеОбъект.Ссылка;
				
				
				//+Лео Сафонов ЕА
				ДокументСчФактураПолученный = Документы.СчетФактураПолученный.ПустаяСсылка();
				ДокументСчФактураПолученный =  УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаГруппа.ДокументПоступления, "СчетФактураПолученный");
				Если  ДокументСчФактураПолученный = Документы.СчетФактураПолученный.ПустаяСсылка() Или  ДокументСчФактураПолученный = Неопределено Тогда
					ДокументСчФактураПолученный = Документы.СчетФактураПолученный.СоздатьДокумент();	
				Иначе
					ДокументСчФактураПолученный = ДокументСчФактураПолученный.ПолучитьОбъект() ;
				КонецЕсли;
				//-Лео Сафонов ЕА

				//ДокументСчФактураПолученный = Документы.СчетФактураПолученный.СоздатьДокумент();
				Если НЕ ДокументСчФактураПолученный.ДокументОснование = ДокументПоступлениеОбъект.Ссылка Тогда
					ДокументСчФактураПолученный.Заполнить(СтрокаГруппа.ДокументПоступления);
				КонецЕсли;	
				ДокументСчФактураПолученный.НомерВходящегоДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСчФактураВыданный.Ссылка);
				ДокументСчФактураПолученный.ДатаВходящегоДокумента = ДокументСчФактураВыданный.Дата;
				ДокументСчФактураПолученный.Записать(РежимЗаписиДокумента.Проведение);
				//ЗафиксироватьТранзакцию();
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
	ОтправитьУведомлениеПоПочтеОСозданииДокументов(ДокументРеализацияОбъект.Ссылка, ДокументСчФактураВыданный.Ссылка, ДокументПоступлениеОбъект.Ссылка, ДокументСчФактураПолученный.Ссылка);	
		
КонецФункции 

Процедура ОтправитьУведомлениеПоПочтеОСозданииДокументов(ДокументРеализацияОбъект, ДокументСчФактураВыданный, ДокументПоступлениеОбъект, ДокументСчФактураПолученный)	

	МассивАдресов = Новый Массив;
	МассивАдресов.Добавить("VZarodnyuk@leovit.ru");
	МассивАдресов.Добавить("AShcherbinina@leovit.ru");
	МассивАдресов.Добавить("SGluhova@leovit.ru");
	МассивАдресов.Добавить("EBessmertnykh@leovit.ru");
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", "Новые документы для подписания в Диадок");
	
	ТекстПисьма = "";
	ТекстПисьма = "Добрый день, коллеги! <BR> <BR>";
    ТекстПисьма = ТекстПисьма +  "Созданы документы перепродащи между организациями -Леовит Нутрио- и -Леотрейд-" + ДокументРеализацияОбъект + "<BR>";
    ТекстПисьма = ТекстПисьма +  "-Леовит Нутрио- 	: 	" +  ДокументРеализацияОбъект  + "<BR>";
    ТекстПисьма = ТекстПисьма +  "					 	" +  ДокументСчФактураВыданный + "<BR>";
    ТекстПисьма = ТекстПисьма +  "-Леотрейд-	  	:	" +  ДокументПоступлениеОбъект + "<BR>";
    ТекстПисьма = ТекстПисьма +  "      				" +  ДокументСчФактураПолученный + "<BR>"; 
    ТекстПисьма = ТекстПисьма +  "  "  + "<BR>";
    ТекстПисьма = ТекстПисьма +  "Данные документы необходимо подписать в системе ДИАДОК" + "<BR>";
    СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);

	Попытка
		УстановитьПривилегированныйРежим(Истина); 
		
		СтруктураПисьма = НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
		ЭлектронныеПисьма = Новый Соответствие;
		
		ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		
		ИзмененныйСоставПисем = Новый Соответствие;	
		ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
		Для каждого Письмо Из ЭлектронныеПисьма Цикл
			Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
				ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
				
				ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
					
					ОбъектПисьмо.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			
				Попытка
					ОбъектПисьмо.Записать();
				Исключение
					Продолжить;;
				КонецПопытки;
			Иначе
				Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
				Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
					Письмо.Значение.Ответственный = ТекущийПользователь;
				КонецЕсли; 
			КонецЕсли; 
		    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
		КонецЦикла;                                      
		
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисемБезЛогирования(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ,,
		ИзмененныйСоставПисем, Истина , , Ложь, );
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
	КонецПопытки;	
		
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		Возврат;
	КонецПопытки;	
	
КонецПроцедуры

Функция ПолучитьКонтрагентаПоОрганизации(Организация)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|ГДЕ
	|	КонтрагентыСвязанныеСОрганизациями.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Организация);
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Контрагент;
	КонецЕсли;
КонецФункции

//заполняет реквизиты созданного документа РеализацияТоваровУслуг
Процедура ЗаполнитьДокументРеализации(ДокументОбъект, Организация, Контрагент, Склад, СтрокаДерева, Параметры)
	ДоговорКонтрагента=Контрагент.ОсновнойДоговорКонтрагента;
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ВалютаДокумента = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	Иначе
		ВалютаДокумента = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ТипЦен) Тогда
		// Если цены выбранного типа расчетные, то флаги включения налогов надо брать из базовой цены.
		ВремТипЦен       = ?(Параметры.ТипЦен.Рассчитывается, Параметры.ТипЦен.БазовыйТипЦен, Параметры.ТипЦен);
		СуммаВключаетНДС = ВремТипЦен.ЦенаВключаетНДС;
	Иначе
		// Заполним значениями по умолчанию (не заполнен ТипЦен).
		СуммаВключаетНДС= Истина;
	КонецЕсли;
	
	ДокументОбъект.Дата							= Параметры.ДатаФормирования;
	ДокументОбъект.Организация					= Организация;
	ДокументОбъект.ВидОперации					= Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
	//ДокументОбъект.Склад						= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
	ДокументОбъект.Склад						= Склад;
	ДокументОбъект.Ответственный				= глЗначениеПеременной("глТекущийПользователь");
	ДокументОбъект.Контрагент					= Контрагент;  
	
	ДокументОбъект.Грузоотправитель				= Параметры.ГрузоотправительПроизводитель;
	ДокументОбъект.Грузополучатель				= Параметры.ГрузополучательПродавец;
	
	//+Лео Сафонов ЕА
	Если Параметры.ДоговорПродажи = Справочники.ДоговорыКонтрагентов.ПустаяСсылка()Тогда
		ДокументОбъект.ДоговорКонтрагента	= ПолучитьДоговорКонтрагента(Контрагент,Организация,Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Иначе
		ДокументОбъект.ДоговорКонтрагента 	= Параметры.ДоговорПродажи;
	КонецЕсли;
	
	Если ДокументОбъект.Лев_НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка()Тогда
		Если ТипЗнч(СтрокаДерева.Номенклатура) =  Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ДокументОбъект.Лев_НоменклатурнаяГруппа = СтрокаДерева.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	//-Лео Сафонов ЕА

	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найден договор контрагента """ + Контрагент + """ с организацией """ + Организация + """ с видом договора ""с покупателем""");
	КонецЕсли;
	ДокументОбъект.ВалютаДокумента				= ВалютаДокумента;
	СтруктураКурсаВзаиморасчетов 				= МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ОбщегоНазначения.ПолучитьРабочуюДату());
	ДокументОбъект.КурсВзаиморасчетов     	    = СтруктураКурсаВзаиморасчетов.Курс;
	ДокументОбъект.КратностьВзаиморасчетов 	    = СтруктураКурсаВзаиморасчетов.Кратность;
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.ВидПередачи					= Перечисления.ВидыПередачиТоваров.СоСклада;
	ДокументОбъект.ТипЦен						= Параметры.ТипЦен;
	ДокументОбъект.УчитыватьНДС					= Истина;
	ДокументОбъект.СуммаВключаетНДС				= СуммаВключаетНДС;
	ДокументОбъект.абс_Статус					= Перечисления.абс_СтатусыОтгрузки.Отгружен;
	ДокументОбъект.абс_СФормированАвтоматически = Истина;
	ДокументОбъект.Комментарий					= "#Документ сформирован автоматически"+?(Параметры.РазделитьПоМаркировкеЧЗ ," #Товар маркирован ЧЗ#","#Без маркировки"); 	
	//заполнение табличной части
	Для каждого СтрокаНоменклатура из СтрокаДерева.Строки Цикл
		Если Не СтрокаНоменклатура.Пометка Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока=ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНоменклатура);
		НоваяСтрока.Коэффициент =1;
		НоваяСтрока.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументОбъект, "Реализация");
		ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(НоваяСтрока, ДокументОбъект);
		//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(НоваяСтрока, ДокументОбъект, глЗначениеПеременной("ВалютаРегламентированногоУчета"));
		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры,
		Параметры.ТипЦен, ДокументОбъект.Дата, НоваяСтрока.ЕдиницаИзмерения,
		ДокументОбъект.ВалютаДокумента, ДокументОбъект.КурсВзаиморасчетов, ДокументОбъект.КратностьВзаиморасчетов, ,
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.УсловиеПродаж);
		
		// Если цену заполнили из регистра, то ее надо пересчитывать по флагам налогообложения.
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			НоваяСтрока.Цена = 0;
		Иначе
			НоваяСтрока.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
			Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
			Параметры.ТипЦен.ЦенаВключаетНДС,
			ДокументОбъект.УчитыватьНДС,
			ДокументОбъект.СуммаВключаетНДС,
			УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		КонецЕсли;
		
		// Если единица оказалась не заполненной, то заполняем ее основной единицей номеклатуры.
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(НоваяСтрока, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументОбъект);
	КонецЦикла;    
	
	//Доработка поэкземплярного учата
	// для проверки кодов номенклатуры выбираем поштучно  
	Если Параметры.РазделитьПоМаркировкеЧЗ И Организация=Справочники.Организации.НайтиПоКоду("О00000003") И Контрагент=Справочники.Контрагенты.НайтиПоКоду("К00001098") Тогда
		Запрос	=	Новый Запрос;
		Запрос.Текст	=	"ВЫБРАТЬ
		            	 	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		            	 	|	РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		            	 	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
		            	 	|ИЗ
		            	 	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		            	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		            	 	|			НоменклатураЧЗ.Объект КАК Номенклатура,
		            	 	|			НоменклатураЧЗ.Значение КАК Значение,
		            	 	|			ВЫБОР
		            	 	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		            	 	|					ТОГДА ИСТИНА
		            	 	|				ИНАЧЕ ЛОЖЬ
		            	 	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		            	 	|		ИЗ
		            	 	|			(ВЫБРАТЬ
		            	 	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		            	 	|				ЗначенияСвойствОбъектов.Значение КАК Значение
		            	 	|			ИЗ
		            	 	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		            	 	|			ГДЕ
		            	 	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураМаркировкиЧЗ
		            	 	|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураМаркировкиЧЗ.Номенклатура
		            	 	|ГДЕ
		            	 	|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		            	 	|	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		            	 	|	И РеализацияТоваровУслугТовары.Ссылка.абс_Статус В(&СтатусыРеализаций)
		            	 	|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
		            	 	|	И НоменклатураМаркировкиЧЗ.ЗначениеЧестныйЗнак
		            	 	|
		            	 	|СГРУППИРОВАТЬ ПО
		            	 	|	РеализацияТоваровУслугТовары.Номенклатура,
		            	 	|	РеализацияТоваровУслугТовары.СерияНоменклатуры";
		Запрос.УстановитьПараметр("ДатаНачала"			, НачалоДня(Параметры.ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания"		, КонецДня(Параметры.ДатаОкончания));
		Запрос.УстановитьПараметр("Организация"			, Параметры.ОрганизацияПродавец);
		Запрос.УстановитьПараметр("Свойство"			, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));

		СпСтатусовРеализации = Новый Массив;
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВРаботе);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
		
		Запрос.УстановитьПараметр("СтатусыРеализаций", СпСтатусовРеализации);
		
		ЗапросПодбораКодов	=	Новый Запрос;
		ЗапросПодбораКодов.Текст	=	"ВЫБРАТЬ
		                        	 	|	РеализацияТоваровУслугСписокКоробок.Номенклатура КАК Номенклатура,
		                        	 	|	РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры КАК СерияНоменклатуры,
		                        	 	|	РеализацияТоваровУслугСписокКоробок.ШтрихКодКоробки
		                        	 	|ИЗ
		                        	 	|	Документ.РеализацияТоваровУслуг.СписокКоробок КАК РеализацияТоваровУслугСписокКоробок
		                        	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                        	 	|			НоменклатураЧЗ.Объект КАК Номенклатура,
		                        	 	|			НоменклатураЧЗ.Значение КАК Значение,
		                        	 	|			ВЫБОР
		                        	 	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		                        	 	|					ТОГДА ИСТИНА
		                        	 	|				ИНАЧЕ ЛОЖЬ
		                        	 	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		                        	 	|		ИЗ
		                        	 	|			(ВЫБРАТЬ
		                        	 	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		                        	 	|				ЗначенияСвойствОбъектов.Значение КАК Значение
		                        	 	|			ИЗ
		                        	 	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		                        	 	|			ГДЕ
		                        	 	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураМаркировкиЧЗ
		                        	 	|		ПО РеализацияТоваровУслугСписокКоробок.Номенклатура = НоменклатураМаркировкиЧЗ.Номенклатура
		                        	 	|ГДЕ
		                        	 	|	РеализацияТоваровУслугСписокКоробок.Ссылка.Проведен
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Ссылка.абс_Статус В(&СтатусыРеализаций)
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Ссылка.Организация = &Организация
		                        	 	|	И НоменклатураМаркировкиЧЗ.ЗначениеЧестныйЗнак
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры = &СерияНоменклатуры	
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Номенклатура = &Номенклатура";	
		ЗапросПодбораКодов.УстановитьПараметр("ДатаНачала"			, Параметры.ДатаНачала);
		ЗапросПодбораКодов.УстановитьПараметр("ДатаОкончания"		, Параметры.ДатаОкончания);
		ЗапросПодбораКодов.УстановитьПараметр("Организация"			, Параметры.ОрганизацияПродавец);
		ЗапросПодбораКодов.УстановитьПараметр("Свойство"			, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
		ЗапросПодбораКодов.УстановитьПараметр("СтатусыРеализаций"	, СпСтатусовРеализации); 

		ЗапросПодбораКодовQR	=	Новый Запрос;
		ЗапросПодбораКодовQR.Текст	=	"ВЫБРАТЬ
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура КАК Номенклатура,
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры КАК СерияНоменклатуры,
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.QR_Код_Входящий КАК QR_Код
		                          	 	|ИЗ
		                          	 	|	Документ.РеализацияТоваровУслуг.ШтучныеQR_Коды КАК РеализацияТоваровУслугШтучныеQR_Коды
		                          	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                          	 	|			НоменклатураЧЗ.Объект КАК Номенклатура,
		                          	 	|			НоменклатураЧЗ.Значение КАК Значение,
		                          	 	|			ВЫБОР
		                          	 	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		                          	 	|					ТОГДА ИСТИНА
		                          	 	|				ИНАЧЕ ЛОЖЬ
		                          	 	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		                          	 	|		ИЗ
		                          	 	|			(ВЫБРАТЬ
		                          	 	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		                          	 	|				ЗначенияСвойствОбъектов.Значение КАК Значение
		                          	 	|			ИЗ
		                          	 	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		                          	 	|			ГДЕ
		                          	 	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураМаркировкиЧЗ
		                          	 	|		ПО РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура = НоменклатураМаркировкиЧЗ.Номенклатура
		                          	 	|ГДЕ
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.Проведен
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.абс_Статус В(&СтатусыРеализаций)
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.Организация = &Организация
		                          	 	|	И НоменклатураМаркировкиЧЗ.ЗначениеЧестныйЗнак
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры = &СерияНоменклатуры
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура = &Номенклатура";	
		ЗапросПодбораКодовQR.УстановитьПараметр("ДатаНачала"		, Параметры.ДатаНачала);
		ЗапросПодбораКодовQR.УстановитьПараметр("ДатаОкончания"		, Параметры.ДатаОкончания);
		ЗапросПодбораКодовQR.УстановитьПараметр("Организация"		, Параметры.ОрганизацияПродавец);
		ЗапросПодбораКодовQR.УстановитьПараметр("Свойство"			, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
		ЗапросПодбораКодовQR.УстановитьПараметр("СтатусыРеализаций"	, СпСтатусовРеализации); 

		Выборка	= Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			//Сообщить(Выборка.Номенклатура);	 
            //таблица коробок
			ЗапросПодбораКодов.УстановитьПараметр("Номенклатура"		, Выборка.Номенклатура); 
			ЗапросПодбораКодов.УстановитьПараметр("СерияНоменклатуры"	, Выборка.СерияНоменклатуры); 
			
			ВыборкаКодов	= ЗапросПодбораКодов.Выполнить().Выбрать();
			
			Пока ВыборкаКодов.Следующий() Цикл
				НовыйКодКоробки	=	ДокументОбъект.СписокКоробок.Добавить();	
			    НовыйКодКоробки.Номенклатура		=	ВыборкаКодов.Номенклатура;	
			    НовыйКодКоробки.СерияНоменклатуры	=	ВыборкаКодов.СерияНоменклатуры;	
			    НовыйКодКоробки.ШтрихКодКоробки		=	ВыборкаКодов.ШтрихКодКоробки;	
			КонецЦикла;
			
            //таблица QR кодов
			ЗапросПодбораКодовQR.УстановитьПараметр("Номенклатура"		, Выборка.Номенклатура); 
			ЗапросПодбораКодовQR.УстановитьПараметр("СерияНоменклатуры"	, Выборка.СерияНоменклатуры); 
			
			ВыборкаКодовQR	= ЗапросПодбораКодовQR.Выполнить().Выбрать();
			
			Пока ВыборкаКодовQR.Следующий() Цикл
				НовыйКодQR	=	ДокументОбъект.ШтучныеQR_Коды.Добавить();	
			    НовыйКодQR.Номенклатура			=	ВыборкаКодовQR.Номенклатура;	
			    НовыйКодQR.СерияНоменклатуры	=	ВыборкаКодовQR.СерияНоменклатуры;	
			    НовыйКодQR.QR_Код_Входящий		=	ВыборкаКодовQR.QR_Код;	
			КонецЦикла;
			
	    КонецЦикла;
	КонецЕсли;	
	ДокументОбъект.СуммаДокумента				= ДокументОбъект.Товары.Итог("Сумма");
КонецПроцедуры

//заполняет реквизиты созданного документа ПоступлениеТовароУслуг (на основании Реализации)
Процедура ЗаполнитьДокументПоступления(ДокументОбъект, Организация, Контрагент, Склад, СтрокаДерева, ДокументПоступлениеСсылка, Параметры)
	ДокументОбъект.Дата = Параметры.ДатаФормирования;
	ДокументОбъект.Заполнить(ДокументПоступлениеСсылка);
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.Контрагент = Контрагент;
	
	ДокументОбъект.Грузоотправитель				= Параметры.ГрузоотправительПроизводитель;
	ДокументОбъект.Грузополучатель				= Параметры.ГрузополучательПродавец;
	
	//+Лео Сафонов ЕА
	Если Параметры.ДоговорПокупки = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		ДокументОбъект.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(Контрагент,Организация,Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Иначе
		ДокументОбъект.ДоговорКонтрагента = Параметры.ДоговорПокупки;
	КонецЕсли;
	
	Если ДокументОбъект.Лев_НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка()Тогда
		Если ТипЗнч(СтрокаДерева.Номенклатура) =  Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ДокументОбъект.Лев_НоменклатурнаяГруппа = СтрокаДерева.Номенклатура;
		КонецЕсли;
	КонецЕсли;

	//-Лео Сафонов ЕА
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найден договор контрагента """ + Контрагент + """ с организацией """ + Организация + """ с видом договора ""с поставщиком""");
	КонецЕсли;
	ДокументОбъект.СкладОрдер = Склад;
	ДокументОбъект.абс_ДокументОснование = Неопределено;
	ДокументОбъект.Комментарий = "#Документ сформирован автоматически"+?(Параметры.РазделитьПоМаркировкеЧЗ, " #Товар маркирован ЧЗ#","#Без маркировки");
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокументОбъект);
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокументОбъект, ДокументПоступлениеСсылка.ВалютаДокумента, глЗначениеПеременной("ВалютаРегламентированногоУчета"), СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары", ДокументПоступлениеСсылка.ДоговорКонтрагента);

    //{Катанович
	Если НалоговыйУчетУСН.ПрименениеУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
		ДокументОбъект.НДСВключенВСтоимость = Истина;
	КонецЕсли;
	//Катанович}
 
КонецПроцедуры

//получает договор из справочника по контрагенту, организации и виду договора
Функция ПолучитьДоговорКонтрагента(Контрагент,Организация,ВидДоговора)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Ссылка = ДоговорыКонтрагентов.Владелец.ОсновнойДоговорКонтрагента
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Договор;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции



