
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	

	ДатаОтчета =  КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ДатаОтчета").Значение.Дата;
	ТипЦен =  КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ТипЦен").Значение;
    ДинамическиеЦены =  КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ДинамическиеЦены").Значение;
	ВыводитьКоличество =  КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ВыводитьКоличество").Значение;


	
	//Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаМесяцаПрошлогоГода = Дата(Год(ДатаОтчета)-1,Месяц(ДатаОтчета),1);
	РабочихДнейМесяц = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоМесяца(ДатаОтчета), КонецМесяца(ДатаОтчета));
	РабочихДнейКвартал = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоКвартала(ДатаОтчета), КонецКвартала(ДатаОтчета));
	РабочихДнейГод = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоГода(ДатаОтчета), КонецГода(ДатаОтчета))-1;
	РабочихДнейПрошлыйГод = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоГода(ДатаМесяцаПрошлогоГода), КонецГода(ДатаМесяцаПрошлогоГода));
	РабочихДнейМесяцПрошлогоГода = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоМесяца(ДатаМесяцаПрошлогоГода),КонецМесяца(ДатаМесяцаПрошлогоГода));
	РабочихДнейКварталПрошлогоГода = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоКвартала(ДатаМесяцаПрошлогоГода), КонецКвартала(ДатаМесяцаПрошлогоГода));
	РабочихДнейПрошлыйМесяц = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоМесяца(НачалоМесяца(ДатаОтчета)-1), КонецМесяца(НачалоМесяца(ДатаОтчета)-1));
	ПрошлоРабочихДнейМесяц = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоМесяца(ДатаОтчета), ДатаОтчета);
	ПрошлоРабочихДнейКвартал = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоКвартала(ДатаОтчета), ДатаОтчета);
	ПрошлоРабочихДнейГод = ЗаполнениеДокументов.ЧислоРабочихДней(НачалоГода(ДатаОтчета), ДатаОтчета);
	
	Если ПрошлоРабочихДнейГод>РабочихДнейПрошлыйГод Тогда
		ДатаСопоставленияГод = КонецГода(ДатаМесяцаПрошлогоГода);
		ПрошлоРабочихДнейПрошлыйГод = РабочихДнейПрошлыйГод;
	ИначеЕсли КонецГода(ДатаОтчета) = КонецДня(ДатаОтчета) Тогда
		ДатаСопоставленияГод = КонецГода(ДатаМесяцаПрошлогоГода);
		ПрошлоРабочихДнейПрошлыйГод = РабочихДнейПрошлыйГод;
	Иначе
		ДатаСопоставленияГод = ЗаполнениеДокументов.ОпределитьДату(НачалоГода(ДатаМесяцаПрошлогоГода), ПрошлоРабочихДнейГод);
		ПрошлоРабочихДнейПрошлыйГод = ПрошлоРабочихДнейГод; 
	КонецЕсли;
	
	Если ПрошлоРабочихДнейКвартал>РабочихДнейКвартал Тогда
		ДатаСопоставленияКвартал = КонецКвартала(ДатаМесяцаПрошлогоГода);
		ПрошлоРабочихДнейКварталПрошлогоГода = РабочихДнейКварталПрошлогоГода;
	ИначеЕсли КонецКвартала(ДатаОтчета) = КонецДня(ДатаОтчета) Тогда
		ДатаСопоставленияКвартал = КонецКвартала(ДатаМесяцаПрошлогоГода);
		ПрошлоРабочихДнейКварталПрошлогоГода = РабочихДнейКварталПрошлогоГода;
	Иначе
		ДатаСопоставленияКвартал = ЗаполнениеДокументов.ОпределитьДату(НачалоКвартала(ДатаМесяцаПрошлогоГода), ПрошлоРабочихДнейКвартал);
		ПрошлоРабочихДнейКварталПрошлогоГода = ПрошлоРабочихДнейКвартал;
	КонецЕсли;

	ПроцентРабочихДнейМесяцЧисло = Окр(ПрошлоРабочихДнейМесяц/РабочихДнейМесяц*100,1);
	ПроцентРабочихДнейКварталЧисло = Окр(ПрошлоРабочихДнейКвартал/РабочихДнейКвартал*100,1);
	ПроцентРабочихДнейГодЧисло = Окр(ПрошлоРабочихДнейГод/РабочихДнейГод*100,1);
	
	ПроцентРабочихДнейМесяц = "" + ?(Цел(ПроцентРабочихДнейМесяцЧисло)=ПроцентРабочихДнейМесяцЧисло,Цел(ПроцентРабочихДнейМесяцЧисло),ПроцентРабочихДнейМесяцЧисло) + "%";
	ПроцентРабочихДнейКвартал = "" + ?(Цел(ПроцентРабочихДнейКварталЧисло)=ПроцентРабочихДнейКварталЧисло,Цел(ПроцентРабочихДнейКварталЧисло),ПроцентРабочихДнейКварталЧисло) + "%";
	ПроцентРабочихДнейГод = "" + ?(Цел(ПроцентРабочихДнейГодЧисло)=ПроцентРабочихДнейГодЧисло,Цел(ПроцентРабочихДнейГодЧисло),ПроцентРабочихДнейГодЧисло) + "%";
	
	НачалоПрошлогоМесяца = НачалоМесяца(НачалоМесяца(ДатаОтчета)-1);
	НачалоПериода1 = Мин(НачалоПрошлогоМесяца, НачалоГода(ДатаОтчета));
	КонецПериодаПрошлогоГода = Макс(ДатаСопоставленияКвартал, КонецМесяца(ДатаМесяцаПрошлогоГода));
	
	ПодразделениеКУдалению = Новый Массив();	
	ПодразделениеКУдалению.Добавить(Справочники.Регионы.НайтиПоНаименованию("ВНУТРЕННИЕ"));
	ПодразделениеКУдалению.Добавить(Справочники.Регионы.НайтиПоНаименованию("ПОСТАВЩИКИ"));


   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПодразделениеКУдалению", ПодразделениеКУдалению);
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаМесяцаПрошлогоГода", ДатаМесяцаПрошлогоГода);
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаСопоставленияГод", КонецДня(ДатаСопоставленияГод));
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаСопоставленияКвартал", КонецДня(ДатаСопоставленияКвартал));
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода1", НачалоПериода1);
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериодаПрошлогоГода", КонецПериодаПрошлогоГода);
   
   
    	
	ВидНоменклатуры = Новый Массив();
	
	ВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар (б/х)"));
	ВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Конечная продукция"));
	//ВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикат"));

   //Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидНоменклатуры", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар (б/х)"));
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидНоменклатуры", ВидНоменклатуры);
   
   
   Если ТипЦен = Неопределено Тогда
   		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен", Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());
   Иначе
    	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен", ТипЦен);

   КонецЕсли;
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДинамическиеЦены", ДинамическиеЦены);	
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьКоличество", ВыводитьКоличество);
   Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОтчета", ДатаОтчета);
   
   
   КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПодразделениеКУдалению"));
	//ЗначениеПараметра.Значение = Справочники.Регионы.НайтиПоНаименованию("ВНУТРЕННИЕ");
	//ЗначениеПараметра.Использование = Истина;

	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаМесяцаПрошлогоГода"));
	//ЗначениеПараметра.Значение = ДатаМесяцаПрошлогоГода;
	//ЗначениеПараметра.Использование = Истина;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаСопоставленияГод"));
	//ЗначениеПараметра.Значение = КонецДня(ДатаСопоставленияГод);
	//ЗначениеПараметра.Использование = Истина;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаСопоставленияКвартал"));
	//ЗначениеПараметра.Значение = КонецДня(ДатаСопоставленияКвартал);
	//ЗначениеПараметра.Использование = Истина;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериодаПрошлогоГода"));
	//ЗначениеПараметра.Значение = КонецПериодаПрошлогоГода;
	//ЗначениеПараметра.Использование = Истина;

	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода1"));
	//ЗначениеПараметра.Значение = НачалоПериода1;
	//ЗначениеПараметра.Использование = Истина;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидНоменклатуры"));
	//ЗначениеПараметра.Значение = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар (б/х)");
	//ЗначениеПараметра.Использование = Истина;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипЦен"));

	//Если ТипЦен = Неопределено Тогда
	//   	ЗначениеПараметра.Значение = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
	//Иначе
	//   	ЗначениеПараметра.Значение =  ТипЦен;
	//КонецЕсли;
	//ЗначениеПараметра.Использование = Истина;

	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДинамическиеЦены"));
	//ЗначениеПараметра.Значение =ДинамическиеЦены;
	//ЗначениеПараметра.Использование = Истина;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьКоличество"));
	//ЗначениеПараметра.Значение = ВыводитьКоличество;
	//ЗначениеПараметра.Использование = Истина;

	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтчета"));
	//ЗначениеПараметра.Значение =  КонецДня(ДатаОтчета);
	//ЗначениеПараметра.Использование = Истина;

   
КонецПроцедуры

