Процедура Печать(ТабДок, Параметр) Экспорт
	
	Макет = ПолучитьМакет("УпаковочныйЛист");

	Для Каждого УпаковочныйЛист Из Параметр Цикл
				
		Если Параметр.Количество() > 1 Тогда
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(УпаковочныйЛист.Ссылка);
			Область.Параметры.Дата  = Формат(УпаковочныйЛист.Дата, "ДЛФ=DD");
			ТабДок.Вывести(Область);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	абс_УпаковочныйЛистТовары.Упаковка КАК Упаковка,
		               |	абс_УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		               |	абс_УпаковочныйЛистТовары.ЕдиницаИзмерения,
		               |	СУММА(абс_УпаковочныйЛистТовары.Количество) КАК Количество,
		               |	СУММА(абс_УпаковочныйЛистТовары.КоличествоМест) КАК КоличествоМест,
		               |	абс_УпаковочныйЛистТовары.Номенклатура.Артикул КАК Артикул
		               |ИЗ
		               |	Документ.абс_УпаковочныйЛист.Товары КАК абс_УпаковочныйЛистТовары
		               |ГДЕ
		               |	абс_УпаковочныйЛистТовары.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	абс_УпаковочныйЛистТовары.Номенклатура,
		               |	абс_УпаковочныйЛистТовары.ЕдиницаИзмерения,
		               |	абс_УпаковочныйЛистТовары.Упаковка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номенклатура
		               |ИТОГИ ПО
		               |	Упаковка";
	
		Запрос.Параметры.Вставить("Ссылка", УпаковочныйЛист.Ссылка);
		
		ВыборкаУпаковка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Упаковка");
		
		Пока ВыборкаУпаковка.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("ШапкаУпаковки");
			Область.Параметры.Заголовок = ВыборкаУпаковка.Упаковка;
			
			Если Не ТабДок.ПроверитьВывод(Область) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ТабДок.Вывести(Область);
			
			НомерСтроки = 1;
			Выборка = ВыборкаУпаковка.Выбрать();
			
			Пока Выборка.Следующий() Цикл    		
			
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.НомерСТроки = НомерСтроки;
				Область.Параметры.Товар       = Выборка.Номенклатура;
				Область.Параметры.Артикул     = Выборка.Артикул;
				Область.Параметры.Количество  = Выборка.Количество; 		
				Область.Параметры.ЕдИзм       = Выборка.ЕдиницаИзмерения;
				Область.Параметры.Упаковка    = Выборка.КоличествоМест;
			
				Если Не ТабДок.ПроверитьВывод(Область) Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			
				НомерСтроки = НомерСтроки + 1;
				ТабДок.Вывести(Область);
			
			КонецЦикла;	
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

		КонецЦикла;
		
	КонецЦикла;
		
 КонецПроцедуры


