//Перем Парам Экспорт;

Функция сбисПолучитьФорму(ИмяФормы, Объект1С = Неопределено, ПараметрыФормы = Неопределено)

	Если Объект1С = Неопределено Тогда
		Возврат ЭтотОбъект.ПолучитьФорму(ИмяФормы);
	Иначе
		Возврат Объект1С.ПолучитьФорму(ИмяФормы);
	КонецЕсли;	
КонецФункции

Функция сбисПараметрыМассыПрописью(Масса) Экспорт
	КоэффициентПересчетаВТонны     = Константы.КоэффициентПересчетаВТонны.Получить();
	МассаТонны = Масса * КоэффициентПересчетаВТонны;
	Если МассаТонны > 1 Тогда
		Коэффициент = 1;
		СтрокаФормат = "т, т, т, ж, кг, кг, кг, м, " + ?(Окр(МассаТонны) = МассаТонны, "0", "3");
	ИначеЕсли МассаТонны * 1000 > 1 Тогда
		Коэффициент = 1000;
		СтрокаФормат = "кг, кг, кг, м, г, г, г, м, " + ?(Окр(МассаТонны * Коэффициент) = МассаТонны * Коэффициент, "0", "3");
	Иначе
		Коэффициент = 1000000;
		СтрокаФормат = "г, г, г, м, г, г, г, м, 0";
	КонецЕсли;
	
	Возврат Новый Структура("Формат, Коэффициент", СтрокаФормат, Коэффициент*КоэффициентПересчетаВТонны);
	
КонецФункции

функция сбисОпределитьМассуИтогПрописью(МассаИтог) Экспорт
	Если ЗначениеЗаполнено(МассаИтог) Тогда
		ПараметрыМассыПрописью = сбисПараметрыМассыПрописью(МассаИтог);
		Возврат ЧислоПрописью(
			МассаИтог * ПараметрыМассыПрописью.Коэффициент,
			"ДП=Истина",
			ПараметрыМассыПрописью.Формат
		);
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

функция сбисОпределитьМассуИтогПрописьюНеупрПрил(МассаИтог) Экспорт
	ЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) И МассаИтог > 0 Тогда
		Возврат ЧислоПрописью(МассаИтог, ,",,,,,,,,0")+ " " +ЕдиницаИзмеренияВеса.Наименование + ".";
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции

функция сбисОпределитьМассуБруттоИтог(ТЧДок) Экспорт
	ЗаполненаЕдиницаИзмеренияВеса = ЗначениеЗаполнено(Константы.ЕдиницаИзмеренияВеса.Получить());
	Если ЗаполненаЕдиницаИзмеренияВеса Тогда
		МассаБруттоИтог = 0;
		Для Каждого СтрокаТЧ из ТЧДок Цикл
			Если СтрокаТЧ.Упаковка.Вес = 0 Тогда 
				МассаБруттоИтог = МассаБруттоИтог + СтрокаТЧ.Количество * СтрокаТЧ.Номенклатура.Вес
			Иначе 
				МассаБруттоИтог = МассаБруттоИтог +  СтрокаТЧ.КоличествоУпаковок * СтрокаТЧ.Упаковка.Вес
			КонецЕсли;		
		КонецЦикла;
		Возврат МассаБруттоИтог;
	Иначе
		Возврат 0
    КонецЕсли;		
КонецФункции	

//Процедура для вызова отправки документов по кнопке "Печать"
Функция Печать(СсылкаНаОбъект1С=Неопределено) Экспорт
	Если СсылкаНаОбъект1С<>Неопределено Тогда
		СсылкаНаОбъект=СсылкаНаОбъект1С
	КонецЕсли;
	ГлавноеОкно = сбисПолучитьФорму("ФормаГлавноеОкно");	
	
	//Дополнение для неуправляемой формы
	ГлавноеОкно.КаталогНастроек = ВосстановитьЗначение("СБИС_КаталогНастроек");	
	ОбъектыНазначения = Новый Массив();
	ОбъектыНазначения.Добавить(СсылкаНаОбъект);
	////////////////////////////////////
	
	ГлавноеОкно.КэшПодготовить();	
	ГлавноеОкно.Кэш.ВИ.Включить(ГлавноеОкно.Кэш);
	ГлавноеОкно.Кэш.Вставить("Интеграция",сбисПолучитьФорму("SDK2"));
	ГлавноеОкно.Кэш.Текущий.Раздел = "3";
	ГлавноеОкно.Кэш.Текущий.ТипДок = СсылкаНаОбъект.Метаданные().Имя;
	Если НЕ ГлавноеОкно.Кэш.Свойство("Docflow") Тогда
		Возврат "";
	КонецЕсли;
	
	ГлавноеОкно.Кэш.Парам = ВосстановитьЗначение("сбисПарам");
	
	//Подключим заплатки
	ГлавноеОкно.сбисПодключитьЗаплатки();
	////Получим дополнительные параметры фильтра
	//фрм = ГлавноеОкно.сбисНайтиФормуФункции("УстановитьДополнительныеПараметрыФильтра","ФормаГлавноеОкно", "ФормаГлавноеОкно", ГлавноеОкно.Кэш);
	//ПараметрыФильтра = Новый Структура;
	//Если фрм <> ложь Тогда
	//	ПараметрыФильтра = фрм.УстановитьДополнительныеПараметрыФильтра(ГлавноеОкно.Кэш);
	//КонецЕсли;	
	//ГлавноеОкно.Кэш.Вставить("ПараметрыФильтра", ПараметрыФильтра);
	
	ГлавноеОкно.сбисПолучитьПарам();
	
	формаАвторизации = сбисПолучитьФорму("ФормаАвторизация");
	Если ФормаАвторизации.сбисАвторизоваться(ГлавноеОкно.Кэш) = Ложь Тогда
		Возврат "";
	КонецЕсли;

	ГлавноеОкно.КаталогНастроекПриИзменении(Неопределено);
	
	Если ГлавноеОкно.Кэш.ИниВПорядке Тогда
		Для каждого Документ из ОбъектыНазначения Цикл
			ИмяДокумента = ГлавноеОкно.Кэш.ОбщиеФункции.ПолучитьРеквизитМетаданныхОбъекта(Документ, "Имя");
			
			//Получим настройки документа
			Ини="";
			Если ГлавноеОкно.Кэш.ини.Свойство(ИмяДокумента,Ини)=Ложь Тогда
				Сообщить("Выгрузка данного типа документов не поддерживается!");
				Возврат Ложь;
			КонецЕсли;
			
			//Подготовим фильтр для запроса документов
			ПараметрыФильтра = Новый Структура;
			ПараметрыФильтра.Вставить( "ФильтрДокумент", Документ); 		
			ПараметрыФильтра.Вставить( "ФильтрДатаНач", ГлавноеОкно.ФильтрДатаНач); 
			ПараметрыФильтра.Вставить( "ФильтрДатаКнц", ГлавноеОкно.ФильтрДатаКнц); 
			ПараметрыФильтра.Вставить( "ФильтрКонтрагент", ГлавноеОкно.ФильтрКонтрагент);
			ПараметрыФильтра.Вставить( "ФильтрОрганизация", ГлавноеОкно.ФильтрОрганизация);			
			ПараметрыФильтра.Вставить( "ФильтрСостояние", "Все документы");
			
			//Получим массив выгружаемых документов по запросу
			РаботаСДокументами = сбисПолучитьФорму("РаботаСДокументами1С");
			ТекстЗапроса = РаботаСДокументами.РассчитатьЗначение("ЗапросСпискаДокументов", Ини, ГлавноеОкно.Кэш);
			МассивДокументов1С = РаботаСДокументами.ЗаполнитьМассивДокументов1С(ТекстЗапроса, ПараметрыФильтра, ГлавноеОкно.КаталогНастроек);
			//Подготовим список документов
			СписокОтмеченныхДокументов = Новый СписокЗначений;
			Для каждого СтрокаТЗ из МассивДокументов1С Цикл
				СписокОтмеченныхДокументов.Добавить(СтрокаТЗ);
				ТекущаяСтрока = СтрокаТЗ;
				ТекущийРаздел = Ини.ДокументРаздел.Значение;
				//Откроем пакет документов
								
				фрм = ГлавноеОкно.сбисНайтиФормуФункции("ПоказатьДокумент","Раздел_"+СтрЗаменить(ТекущийРаздел, "'", "")+"_Шаблон",, ГлавноеОкно.Кэш);
				ГлавноеОкно.Кэш.ГлавноеОкно = ГлавноеОкно;
				фрм.ПоказатьДокумент(ГлавноеОкно.Кэш, ТекущаяСтрока);	
				
			КонецЦикла;	
						
			//Отправим документы			
			//фрм = ГлавноеОкно.сбисНайтиФормуФункции("ОтправитьДокументы","Документ_"+ИмяДокумента,"Документ_Шаблон");
			//фрм.ОтправитьДокументы(ГлавноеОкно.Кэш, СписокОтмеченныхДокументов);
			
		КонецЦикла;
	КонецЕсли;		

КонецФункции	

//Парам = Новый Структура();
//Кэш = Новый Структура();
