
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	///Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	// Вставить содержимое обработчика.
	ЗаполнитьНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	
	ТЧ = Объект.ТЧ;
	//ТЧ.Очистить();
	
	ТЧ1 = Объект.СоставБюджета7;
	ТЧ1.Очистить();
	
	ТЧпроцент = Объект.ТЧпроцент;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыПродажОбороты.Контрагент КАК Контрагент,
	|	ПланыПродажОбороты.Период как Месяц,
	|	ПланыПродажОбороты.СтоимостьОборот КАК БезНДС,
	|	ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот КАК СНДС,
	|	ПланыПродажОбороты.Контрагент.Лео_КаналБюджет КАК Канал
	|ИЗ
	|	РегистрНакопления.ПланыПродаж.Обороты(&ДатаНач, &ДатаКон, Месяц, Сценарий = &Сценарий) КАК ПланыПродажОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	//|		ПО ПланыПродажОбороты.Контрагент = ЗначенияСвойствОбъектов.Объект
	//|ГДЕ
	//|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_Канал)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("ДатаКон", КонецГода(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНач", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("Сценарий", Объект.Сценарий);
	
	Результат = Запрос.Выполнить();
	
	//ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	сс = ТЧ.Добавить();
	//	ЗаполнитьЗначенияСвойств(сс,ВыборкаДетальныеЗаписи);
	//	сс.Сценарий = Объект.Сценарий; 
	//	
	//	
	//	
	//КонецЦикла;
	
	
	ТЗданных = Результат.Выгрузить();
	ТЗконтр  = ТЗданных.Скопировать();
	ТЗконтр.Свернуть("Контрагент,Канал");
	ТЗконтр.Сортировать("Контрагент");
	
	Если Объект.ПерезаполнитьТЧпроцент тогда
		ТЧпроцент.Очистить();
		Для каждого гг из ТЗконтр цикл
			уу =  ТЧпроцент.Добавить();
			уу.Контрагент = гг.Контрагент;
		КонецЦикла;
	КонецЕсли;
	
	ПроцентБюджетЛОГ_ОПЕР = Объект.ПроцентБюджет;
	ПроцентПланЛОГ_ОПЕР   = Объект.ПроцентПлан;
	ПроцентФактЛОГ_ОПЕР   = Объект.ПроцентФакт;
	
	Для каждого кк из ТЗконтр цикл
		
		// ТО
		тт = ТЧ1.Добавить();
		тт.Контрагент                      = кк.Контрагент;
		тт.Канал                           = кк.Канал;
		тт.абс_КодБюджетнойСтатьи          = "ТО_";
		
		мДан = ТЗданных.НайтиСтроки(Новый Структура("Контрагент",кк.Контрагент));
		Для каждого ее из мДан цикл
			
			_Месяц = Месяц(ее.Месяц);
			тт["СуммаБюджет" + сокрЛП(_Месяц)] = ее.СНДС;
			тт["Сумма" + сокрЛП(_Месяц)]       = ее.СНДС;
			
		КонецЦикла;
		
		//ЛОГ_ТРАНС                                     
		тт = ТЧ1.Добавить();
		тт.Контрагент                      = кк.Контрагент;
		тт.Канал                           = кк.Канал;
		тт.абс_КодБюджетнойСтатьи          = "ЛОГ_ТРАНС";
		
		
		//ПроцентЛОГ_ТРАНС = 0;
		//мПр = ТЧпроцент.НайтиСтроки(Новый Структура("Контрагент",кк.Контрагент));
		//Если мПр.Количество() > 0 тогда 
		//ПроцентЛОГ_ТРАНС = мПр[0].Процент;
		//КонецЕсли;
		//
		//Для каждого ее из мДан цикл
		//	
		//_Месяц = Месяц(ее.Месяц);
		//тт["СуммаБюджет" + сокрЛП(_Месяц)] = (ее.СНДС/100)*ПроцентЛОГ_ТРАНС;
		//тт["Сумма" + сокрЛП(_Месяц)]       = (ее.СНДС/100)*ПроцентЛОГ_ТРАНС;
		//
		//КонецЦикла;
		
		
		//ЛОГ_ОПЕР                                     
		тт = ТЧ1.Добавить();
		тт.Контрагент                      = кк.Контрагент;
		тт.Канал                           = кк.Канал;
		тт.абс_КодБюджетнойСтатьи          = "ЛОГ_ОПЕР";
		
		
		
		Для каждого ее из мДан цикл
			
			_Месяц = Месяц(ее.Месяц);
			тт["СуммаБюджет" + сокрЛП(_Месяц)] = (ее.СНДС/100) * ПроцентБюджетЛОГ_ОПЕР;
			тт["Сумма" + сокрЛП(_Месяц)]       = ?(ПроцентПланЛОГ_ОПЕР > 0,(ее.СНДС/100) * ПроцентПланЛОГ_ОПЕР,(ее.СНДС/100) * ПроцентБюджетЛОГ_ОПЕР);
			тт["СуммаФакт" + сокрЛП(_Месяц)]   = (ее.СНДС/100) * ПроцентФактЛОГ_ОПЕР;
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	
    ЗаполнимТаблицуСервер("СоставБюджета7",Истина);
	
	
	
	
    ЗаполнитьИтоговыеСтроки();	
	
	
	
	////Итоги
	//ТЗитогов = ТЧ1.Выгрузить();
	//ТЗитогов.Свернуть("Канал,абс_КодБюджетнойСтатьи",
	//"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	//|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	//|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	//|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	////|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	//|Факт1,Факт2,Факт3
	//|");
	//
	//мМесяц = ПолучитьМесяц();
	//
	//Для каждого сс из ТЗитогов цикл
	//	Если СокрЛП(сс.Канал) = "ФАРМ" и СокрЛП(сс.абс_КодБюджетнойСтатьи) = "ТО_"  тогда
	//	иначе
	//		продолжить;
	//	КонецЕсли;	
	//	
	////Для сч = 1 по 12 цикл	
	////   
	////ПолеФормы = Элементы.Добавить("ТО_ФАРМ_Бюджет" + СокрЛП(сч), Тип("ДекорацияФормы"), Элементы.ГруппаИтогиБюджет);
	////ПолеФормы.Ширина                    = 14;
	////ПолеФормы.Вид                       = ВидДекорацииФормы.Надпись; 
	////ПолеФормы.Заголовок                 = "ТО_ФАРМ_" + мМесяц[сч] + " Бюджет: " + сокрЛП(сс["СуммаБюджет"+сокрлп(сч)]);	
	////
	////КонецЦикла;

	////Для сч = 1 по 12 цикл	
	////   
	////ПолеФормы = Элементы.Добавить("ТО_ФАРМ_План" + СокрЛП(сч), Тип("ДекорацияФормы"), Элементы.ГруппаИтогиПлан);
	////ПолеФормы.Ширина                    = 14;
	////ПолеФормы.Вид                       = ВидДекорацииФормы.Надпись; 
	////ПолеФормы.Заголовок                 = "ТО_ФАРМ_" + мМесяц[сч] + " План: " + сокрЛП(сс["Сумма"+сокрлп(сч)]);	
	////
	////КонецЦикла;
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////
	//Заполнение итогов
	
	//ЗаполнитьДекорацииИтоги("ГруппаИтогиБюджет","ТО_ФАРМ_Бюджет","ТО_ФАРМ_"," Бюджет: ","СуммаБюджет",сс,мМесяц);
	//ЗаполнитьДекорацииИтоги("ГруппаИтогиПлан"  ,"ТО_ФАРМ_План","ТО_ФАРМ_"," План: ","Сумма",сс,мМесяц);
	
//КонецЦикла;

КонецПроцедуры



&НаСервере
Процедура ЗаполнимТаблицуСервер(Таб,Исключениие)
	
	
	Таб = Объект[Таб];
	
    пМесяц = Месяц(Объект.Дата);

	Для каждого сс из Таб цикл
		
		//Если НЕ Исключениие  тогда
		//	Если ЗаполнятьОсновнуюВкладкуИРасшифровкуСервер(сс.СтатьяОборотовПоБюджетам) тогда
		//		продолжить;
		//	КонецЕсли;
		//КонецЕсли;
		
		
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		Для Н = 1 По 12 Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			//ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		
		сс.ГодовойБюджет      = Бюджет;
		сс.ГодовойПрогноз     = 0;
		сс.ГодовойОтклонение  = 0;
		сс.БюджетМесяц        = 0;
		сс.ПрогнозМесяц       = 0;
		сс.ОтклоненияМесяц    = 0;
		
	    Если Год(Объект.Дата) < Год(Объект.ДатаПланирования) тогда продолжить конецЕсли; 
		
		
		
		Для Н = 1 По пМесяц Цикл
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["СуммаПрФакт" + Н]);
		КонецЦикла;	
		
		Для Н = пМесяц + 1 По 12 Цикл
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаПрФакт" + Н] > 0,сс["СуммаПрФакт" + Н],сс["Сумма" + Н]);
		КонецЦикла;	
		
		
		
		
		сс.ГодовойПрогноз = ГодовойПрогноз;
		сс.ГодовойОтклонение = Бюджет - ГодовойПрогноз;
		
		//Отчетный период
		Бюджет = 0; План = 0; ПредФакт = 0; Факт = 0; ГодовойПрогноз = 0; 
		//пМесяц = Месяц(Объект.Дата);
		Для Н = 1 По пМесяц Цикл
			Бюджет   = Бюджет        + сс["СуммаБюджет" + Н];
			План     = План          + сс["Сумма" + Н];
			ПредФакт = ПредФакт      + сс["СуммаПрФакт" + Н];
			Факт     = Факт          + сс["СуммаФакт" + Н];
			
			ГодовойПрогноз = ГодовойПрогноз + ?(сс["СуммаФакт" + Н] > 0,сс["СуммаФакт" + Н],сс["СуммаПрФакт" + Н]);
		КонецЦикла;	
		
		сс.БюджетМесяц  = Бюджет;
		сс.ПрогнозМесяц = ГодовойПрогноз;
		сс.ОтклоненияМесяц = Бюджет - ГодовойПрогноз;
		
		
		
	КонецЦикла;
	
КонецПроцедуры	



&НаСервере
Процедура ЗаполнитьИтоговыеСтроки()
	
	
	// ТО
	ЗеленыйФон = Новый Цвет(255, 255, 190); // Светол-желтый
	_ЗеленыйФон = Новый Цвет(225, 255, 225); 
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета7");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета7.абс_КодБюджетнойСтатьи");
	ЭлементОтбора.ПравоеЗначение = "ТО_";
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета8");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета8.абс_КодБюджетнойСтатьи");
	ЭлементОтбора.ПравоеЗначение = "ТО_";
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СоставБюджета8");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставБюджета8.абс_КодБюджетнойСтатьи");
	ЭлементОтбора.ПравоеЗначение = "ИТОГИ_";
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",_ЗеленыйФон);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,, Истина));	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДекорацииИтоги(ГруппаИтоги,НаимДекорация,ЗагДекорация,ПолеДекорация,Сумма,сс,мМесяц)
	

	Для сч = 1 по 12 цикл	
	   
    ПолеФормы = Элементы.Добавить(НаимДекорация + СокрЛП(сч), Тип("ДекорацияФормы"), Элементы[ГруппаИтоги]);
	ПолеФормы.Ширина                    = 14;
	ПолеФормы.Вид                       = ВидДекорацииФормы.Надпись; 
    ПолеФормы.Заголовок                 = ЗагДекорация + мМесяц[сч] + ПолеДекорация + сокрЛП(сс[Сумма+сокрлп(сч)]);	
	
    КонецЦикла;
	
	
	

КонецПроцедуры





&НаСервере
Функция ПолучитьМесяц()
	
	мСоответствие = Новый Соответствие;
	мСоответствие.Вставить(1,"Январь");
	мСоответствие.Вставить(2,"Февраль");
	мСоответствие.Вставить(3,"Март");
	мСоответствие.Вставить(4,"Апрель");
	мСоответствие.Вставить(5,"Май");
	мСоответствие.Вставить(6,"Июнь");
	мСоответствие.Вставить(7,"Июль");
	мСоответствие.Вставить(8,"Август");
	мСоответствие.Вставить(9,"Сентябрь");
	мСоответствие.Вставить(10,"Октябрь");
	мСоответствие.Вставить(11,"Ноябрь");
	мСоответствие.Вставить(12,"Декабрь");
	
	возврат мСоответствие;
	
КонецФункции	




&НаКлиенте
Процедура ЗаполнитьПроцентЛОГ_ТРАНС(Команда)
	// Вставить содержимое обработчика.
	
	ЗаполнитьПроцентЛОГ_ТРАНССеревер();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПроцентЛОГ_ТРАНССеревер()
	
	ТЧ1 = Объект.СоставБюджета7;
	ТЧпроцент = Объект.ТЧпроцент;
	Для каждого тт из ТЧпроцент цикл
		ПроцентБюджет = 0;
		мПр  = ТЧ1.НайтиСтроки(Новый Структура("Контрагент,абс_КодБюджетнойСтатьи",тт.Контрагент,"ЛОГ_ТРАНС"));
		мТов = ТЧ1.НайтиСтроки(Новый Структура("Контрагент,абс_КодБюджетнойСтатьи",тт.Контрагент,"ТО_"));
		Если мПр.Количество() > 0 тогда 
			ПроцентБюджет = тт.ПроцентБюджет;
			ПроцентПлан   = тт.ПроцентПлан;
			ПроцентФакт   = тт.ПроцентФакт;
			
			Если ПроцентБюджет = 0 тогда продолжить КонецЕсли;
			
			мПр[0]["Процент"] = ПроцентБюджет; 
			
			Для каждого ее из мТов цикл
				
				//_Месяц = Месяц(ее.Месяц);
				Для сч = 1 по 12 цикл
				мПр[0]["СуммаБюджет" + сокрЛП(сч)] = (ее["СуммаБюджет" + сокрЛП(сч)]/100) * ПроцентБюджет;
				мПр[0]["Сумма" + сокрЛП(сч)]       = (ее["Сумма" + сокрЛП(сч)]/100)       * ПроцентПлан;
				мПр[0]["СуммаФакт" + сокрЛП(сч)]   = (ее["СуммаФакт" + сокрЛП(сч)]/100)   * ПроцентФакт;
				
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	  
	
	
	
КонецПроцедуры

&НаСервере
Функция лео_ПолучитьМесяцСервер(Номер)
	
	Если Номер = 1 тогда
		месяц = "Январь";
	ИначеЕсли Номер = 2 тогда
		месяц = "Февраль";
	ИначеЕсли Номер = 3 тогда
		месяц = "Март";
	ИначеЕсли Номер = 4 тогда
		месяц = "Апрель";
	ИначеЕсли Номер = 5 тогда
		месяц = "Май";
	ИначеЕсли Номер = 6 тогда
		месяц = "Июнь";
	ИначеЕсли Номер = 7 тогда
		месяц = "Июль";
	ИначеЕсли Номер = 8 тогда
		месяц = "Август";
	ИначеЕсли Номер = 9 тогда
		месяц = "Сентябрь";
	ИначеЕсли Номер = 10 тогда
		месяц = "Октябрь";
	ИначеЕсли Номер = 11 тогда
		месяц = "Ноябрь";
	ИначеЕсли Номер = 12 тогда
		месяц = "Декабрь";
	КонецЕсли;
	
	возврат месяц;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьЗаголовкиГод(ТЧ)
	
	Элементы[ТЧ + "ГодовойБюджет"].Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы[ТЧ + "ГодовойПрогноз"].Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт + план) ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджетаГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	Элементы.СоставБюджета7БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	
	Если Объект.Дата = Дата(1,1,1) тогда
		_ОбДата = ТекущаяДата();
	иначе
		_ОбДата = Объект.Дата;
	КонецЕсли;
	Элементы[ТЧ + "БюджетМесяцГ"].Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	
	Элементы[ТЧ + "БюджетМесяц"].Заголовок  = "БЮДЖЕТ";
	//Элементы.СоставБюджетаПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	Элементы[ТЧ + "ПрогнозМесяц"].Заголовок = "ФАКТ";
	Элементы[ТЧ + "ОтклоненияМесяц"].Заголовок = "Отклонения";

КонецПроцедуры



&НаСервере
Процедура ЗаполнитьЗаголовкиСервер()

	//Элементы.СоставБюджета7ГодовойБюджет.Заголовок  = "БЮДЖЕТ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета7ГодовойПрогноз.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт + план) ";// + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	////Элементы.СоставБюджетаГодовойФакт.Заголовок = "Годовой ФАКТ" + Формат(Год(Объект.ДатаПланирования),"ЧГ=0");
	//Элементы.СоставБюджета7БюджетГод.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ГОД";
	//
	//Если Объект.Дата = Дата(1,1,1) тогда
	//	_ОбДата = ТекущаяДата();
	//иначе
	//	_ОбДата = Объект.Дата;
	//КонецЕсли;
	//Элементы.СоставБюджета7БюджетМесяцГ.Заголовок = Формат(Год(Объект.ДатаПланирования),"ЧГ=0") + " ЯНВАРЬ - " + ВРЕГ(лео_ПолучитьМесяцСервер(Месяц(_ОбДата)));
	//
	//Элементы.СоставБюджета7БюджетМесяц.Заголовок  = "БЮДЖЕТ";
	////Элементы.СоставБюджетаПрогнозМесяц.Заголовок = "ПРОГНОЗ" +Символы.ВК +Символы.ПС + "(факт) ";
	//Элементы.СоставБюджета7ПрогнозМесяц.Заголовок = "ФАКТ";
	//Элементы.СоставБюджета7ОтклоненияМесяц.Заголовок = "Отклонения";
	
	
    ЗаполнитьЗаголовкиГод("СоставБюджета7");
	ЗаполнитьЗаголовкиГод("СоставБюджета8");
	
	
	ШиринаЗ = 10;
	
	
		Элементы["СоставБюджета7Процент"].Ширина                = ШиринаЗ;
		Элементы["СоставБюджета7абс_КодБюджетнойСтатьи"].Ширина = ШиринаЗ;
		Элементы["СоставБюджета7Канал"].Ширина                  = ШиринаЗ;
		
		Элементы["СоставБюджета7ГодовойБюджет"].Ширина          = ШиринаЗ;
		Элементы["СоставБюджета7ГодовойПрогноз"].Ширина         = ШиринаЗ;
		Элементы["СоставБюджета7ГодовойОтклонение"].Ширина      = ШиринаЗ;
		
		Элементы["СоставБюджета7БюджетМесяц"].Ширина            = ШиринаЗ;
		Элементы["СоставБюджета7ПрогнозМесяц"].Ширина           = ШиринаЗ;
		Элементы["СоставБюджета7ОтклоненияМесяц"].Ширина        = ШиринаЗ;
		
		Элементы["СоставБюджета8ГодовойБюджет"].Ширина          = ШиринаЗ;
		Элементы["СоставБюджета8ГодовойПрогноз"].Ширина         = ШиринаЗ;
		Элементы["СоставБюджета8ГодовойОтклонение"].Ширина      = ШиринаЗ;
		
		Элементы["СоставБюджета8БюджетМесяц"].Ширина            = ШиринаЗ;
		Элементы["СоставБюджета8ПрогнозМесяц"].Ширина           = ШиринаЗ;
		Элементы["СоставБюджета8ОтклоненияМесяц"].Ширина        = ШиринаЗ;
		
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета7СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета7Сумма" + н].Ширина       = ШиринаЗ;
		Элементы["СоставБюджета7СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета7СуммаФакт" + н].Ширина   = ШиринаЗ;
		
	КонецЦикла;
	
	Для н = 1 по 12 цикл
		
		Элементы["СоставБюджета8СуммаБюджет" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета8Сумма" + н].Ширина       = ШиринаЗ;
		Элементы["СоставБюджета8СуммаПрФакт" + н].Ширина = ШиринаЗ;
		Элементы["СоставБюджета8СуммаФакт" + н].Ширина   = ШиринаЗ;
		
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	
	
	
	ЗаполнитьЗаголовкиСервер();
	
	
	Объект.ПерезаполнитьТЧпроцент = Ложь;
    ЗаполнитьИтоговыеСтроки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтоги(Команда)
	// Вставить содержимое обработчика.
	ЗаполнитьИтогиНасервере();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьИтогиНасервере()
	
	ТЧитогов = Объект["СоставБюджета8"];
	ТЧ1 = Объект.СоставБюджета7;

	ТЧитогов.Очистить();
	
	//Итоги
	ТЗитогов = ТЧ1.Выгрузить();
	ТЗитогов.Свернуть("Канал,абс_КодБюджетнойСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	мМесяц = ПолучитьМесяц();
	
	Для каждого сс из ТЗитогов цикл
		
		ии = ТЧитогов.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);		
	    ии.абс_КодБюджетнойСтатьи = сс.абс_КодБюджетнойСтатьи + "_" + сс.Канал;
	
	КонецЦикла;
	
	//Итоги без каналов
	ТЗбезКаналов = ТЧ1.Выгрузить();
	ТЗбезКаналов.Свернуть("абс_КодБюджетнойСтатьи",
	"СуммаБюджет1,СуммаБюджет2,СуммаБюджет3,СуммаБюджет4,СуммаБюджет5,СуммаБюджет6,СуммаБюджет7,СуммаБюджет8,СуммаБюджет9,СуммаБюджет10,СуммаБюджет11,СуммаБюджет12,
	|Сумма1,Сумма2,Сумма3,Сумма4,Сумма5,Сумма6,Сумма7,Сумма8,Сумма9,Сумма10,Сумма11,Сумма12,
	|СуммаПрФакт1,СуммаПрФакт2,СуммаПрФакт3,СуммаПрФакт4,СуммаПрФакт5,СуммаПрФакт6,СуммаПрФакт7,СуммаПрФакт8,СуммаПрФакт9,СуммаПрФакт10,СуммаПрФакт11,СуммаПрФакт12,
	|СуммаФакт1,СуммаФакт2,СуммаФакт3,СуммаФакт4,СуммаФакт5,СуммаФакт6,СуммаФакт7,СуммаФакт8,СуммаФакт9,СуммаФакт10,СуммаФакт11,СуммаФакт12,
	//|СуммаБезНДС1,СуммаБезНДС2,СуммаБезНДС3,СуммаБезНДС4,СуммаБезНДС5,СуммаБезНДС6,СуммаБезНДС7,СуммаБезНДС8,СуммаБезНДС9,СуммаБезНДС10,СуммаБезНДС11,СуммаБезНДС12
	|Факт1,Факт2,Факт3
	|");
	
	мМесяц = ПолучитьМесяц();
	
	Для каждого сс из ТЗбезКаналов цикл
		
		ии = ТЧитогов.Добавить();
		ЗаполнитьЗначенияСвойств(ии,сс);		
	    ии.абс_КодБюджетнойСтатьи = "ИТОГИ_" + сс.абс_КодБюджетнойСтатьи;
	
	КонецЦикла;
	
	
	
    ЗаполнимТаблицуСервер("СоставБюджета8",Истина);

	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
		УправлениеПланированием.ВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования, Перечисления.Периодичность.Год);

		ЗаполнитьЗаголовкиСервер();
		
	
КонецПроцедуры


