// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Контрагенты

// Возвращают реквизиты юридического лица по данным ЕГРЮЛ (наименование, адрес, коды и т.д.).
//
// Параметры:
//	ИНН - Строка - ИНН юридического лица, реквизиты которого надо получить.
//
// Возвращаемое значение:
//	Структура - реквизиты юридического лица.
//		* ИНН - Строка - ИНН юридического лица.
//		* КПП - Строка - КПП юридического лица.
//		* Наименование - Строка - представление юридического лица в учетной программе.
//		* НаименованиеПолное - Строка - полное наименование юридического лица.
//		* НаименованиеСокращенное - Строка - сокращенное наименование юридического лица.
//		* РегистрационныйНомер - Строка - ОГРН юридического лица.
//		* ПравоваяФорма - Строка, Неопределено - правовая форма юридического лица.
//		* Статус - Структура - текущий статус юридического лица.
//			Поля:
//			** Код - Строка - код статуса;
//			** Наименование - Строка - наименование статуса;
//		* РегистрирующийОрган - Структура - орган, зарегистрировавший юридическое лицо.
//			Поля:
//			** Код - Строка - код органа;
//			** Наименование - Строка - наименование органа;
//		* ЮридическийАдрес - Структура, Неопределено - данные о юридическом адресе.
//			** КонтактнаяИнформация - Строка - данные в формате JSON для заполнения реквизита
//				"Значение" контактной информации в табличной части КонтактнаяИнформация объекта
//				(см. описание подсистемы "Контактная информация" Библиотеки стандартных подсистем).
//			** Представление - Строка - представление адреса.
//			** Комментарий - Строка - произвольный комментарий.
//			** Корректный - Булево - адрес является корректным по данным ФИАС;
//		* Телефон - Структура, Неопределено - данные о телефоне.
//			** КонтактнаяИнформация - Строка - данные в формате JSON для заполнения реквизита
//				"Значение" контактной информации в табличной части КонтактнаяИнформация объекта
//				(см. описание подсистемы "Контактная информация" Библиотеки стандартных подсистем).
//			** Представление - Строка - представление телефона.
//			** Комментарий - Строка - произвольный комментарий.
//		* Руководитель - Структура, Неопределено - данные о руководителе.
//			** Должность - Строка - должность руководителя.
//			** Фамилия - Строка - фамилия руководителя.
//			** Имя - Строка - имя руководителя.
//			** Отчество - Строка - отчество руководителя.
//			** Представление - Строка - ФИО руководителя.
//			** ИНН - Строка - ИНН руководителя.
//			** ДатаЗаписи - Дата - дата записи о руководителе.
//		* РегистрацияВНалоговомОргане - Структура, Неопределено - данные о регистрации в ИФНС.
//			** Код - Строка - код налогового органа.
//			** Наименование - Строка - наименование налогового органа.
//			** ОКТМО - Строка - код ОКТМО налогового органа.
//			** ОКАТО - Строка - код ОКАТО налогового органа.
//			** ДатаРегистрации - Дата - дата постановки на учет в налоговом органе.
//		* ДатаРегистрации - Дата - дата регистрации юридического лица.
//		* РегистрацияВПенсионномФонде - Структура, Неопределено - данные о регистрации в ПФР.
//			** РегистрационныйНомерПФР - Строка - регистрационный номер юридического лица в ПФР.
//			** КодОрганаПФР - Строка - код органа ПФР.
//			** НаименованиеОрганаПФР - Строка - наименование органа ПФР.
//			** ДатаРегистрации - Дата - дата постановки на учет в ПФР.
//		* РегистрацияВФСС - Структура, Неопределено - данные о регистрации в ФСС.
//			** РегистрационныйНомерФСС - Строка - регистрационный номер юридического лица в ФСС.
//			** КодПодчиненности - Строка - код подчиненности органа ФСС.
//			** КодОрганаФСС - Строка - код органа ФСС.
//			** НаименованиеОрганаФСС - Строка - наименование органа ФСС.
//			** ДатаРегистрации - Дата - дата постановки на учет в ФСС.
//		* КодОКВЭД - Строка - основной код по классификатору ОКВЭД.
//		* ЭтоОКВЭД2 - Булево - основной код приведен по классификатору редакции 2 или редакции 1.
//		* ИсторияРеквизитов - Структура - история изменения реквизитов юридического лица.
//			** КПП - ТаблицаЗначений - история изменения значения реквизита КПП;
//				Колонки:
//				*** Дата - Дата - дата изменения КПП;
//				*** Значение - Строка - значение реквизита КПП;
//			** Наименование - ТаблицаЗначений - история изменения наименования;
//				Колонки:
//				*** Дата - Дата - дата изменения наименования;
//				*** НаименованиеПолное - Строка - полное наименование юридического лица;
//				*** НаименованиеСокращенное - Строка - сокращенное наименование юридического лица;
//			** Адрес - ТаблицаЗначений - история изменения адреса;
//				Колонки:
//				*** Дата - Дата - дата изменения адреса;
//				*** КонтактнаяИнформация - Строка - данные в формате JSON для заполнения реквизита
//					"Значение" контактной информации в табличной части КонтактнаяИнформация объекта
//					(см. описание подсистемы "Контактная информация" Библиотеки стандартных подсистем).
//				*** Представление - Строка - представление адреса;
//				*** Комментарий - Строка - произвольный комментарий;
//			** Статус - ТаблицаЗначений - история изменения статуса;
//				Колонки:
//				*** Дата - Дата - дата изменения наименования;
//				*** Код - Строка - код статуса;
//				*** Наименование - Строка - наименование статуса;
//			** РеквизитыДиректора - ТаблицаЗначений - история изменения реквизитов директора;
//				Колонки:
//				*** Дата - Дата - дата изменения реквизитов директора;
//				*** ДатаОкончания - Дата - дата окончания действия реквизитов.
//					Пустая дата, если директор действующий;
//				*** ИНН - Строка - ИНН;
//				*** Фамилия - Строка - фамилия директора;
//				*** Имя - Строка - имя;
//				*** Отчество - Строка - отчество;
//				*** ВидДолжности - Строка - вид должности;
//				*** НаименованиеДолжности - Строка - наименование должности;
//		* ОписаниеОшибки - Строка - описание возникшей ошибки.
//			Для обработки ошибки на клиентской части необходимо использовать метод
//			РаботаСКонтрагентамиКлиент.ОбработатьОшибку.
//
Функция РеквизитыЮридическогоЛицаПоИНН(Знач ИНН) Экспорт
	
	РеквизитыОрганизации = СервисДанныхЕдиныхГосРеестров.НовыеРеквизитыЮридическогоЛица();
	РеквизитыОрганизации.ИНН = ИНН;
	
	ОписаниеОшибки = "";
	
	// Проверка наличия услуги.
	ИдентификаторУслуги = ИдентификаторУслугиЗаполнениеРеквизитовКонтрагентов();
	Если Не УслугаПодключена(ИдентификаторУслуги) Тогда
		ОписаниеОшибки = "УслугаНеПодключена";
	КонецЕсли;
	
	ПроверитьДоступностьСервисаКонтрагент(ОписаниеОшибки);
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ПараметрыСервиса = ПараметрыСервисаЮридическиеЛица();
		ИмяМетода        = "findCorporationByInn";
		Если ПустаяСтрока(ОписаниеОшибки) Тогда
			ОбъектXDTO = Неопределено;
			Прокси = ПроксиСервиса(
				ПараметрыСервиса.URL,
				ПараметрыСервиса.URIПространстваИмен,
				ПараметрыСервиса.Имя,
				ПараметрыСервиса.ИмяТочкиПодключения,
				ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		ЗаполнитьТикетАутентификации(Прокси, ПараметрыСервиса.URL, ИмяМетода, ОписаниеОшибки);
	КонецЕсли;
	
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		
		ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(
			Прокси.ФабрикаXDTO.Тип(ПараметрыСервиса.URIПространстваИмен, "findCorporationByInn"));
		ВходныеПараметры.inn = ИНН;
		
		ВходныеПараметры.additionalParameters =
			ДополнительныеПараметрыВызоваОперацииСервиса(
				Прокси.ФабрикаXDTO,
				"http://company1c.com/orgregister/base");
		
		Попытка
			Ответ      = Прокси.findCorporationByInn(ВходныеПараметры);
			ОбъектXDTO = Ответ.РеквизитыЮрЛица;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки     = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='ИНН %1:'"), ИНН)
				+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
		
	КонецЕсли;
	
	ОбработатьОшибкуСервиса(
		ОбъектXDTO,
		ОписаниеОшибки,
		"Контрагент",
		ИмяМетода,
		ИдентификаторУслуги,
		РеквизитыОрганизации);
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ОписаниеОшибки) Тогда
		Возврат РеквизитыОрганизации;
	КонецЕсли;
	
	ЗаполнитьНаименованияЮридическогоЛица(ОбъектXDTO, РеквизитыОрганизации);
	
	РеквизитыОрганизации.РегистрационныйНомер = ОбъектXDTO.ОГРН;
	РеквизитыОрганизации.КПП = ОбъектXDTO.КПП;
	
	РеквизитыОрганизации.ДатаРегистрации = ОбъектXDTO.СвНаимЮЛ.ДатаОбрЮЛ;
	
	АдресныеСокращения = Неопределено;
	
	СервисДанныхЕдиныхГосРеестров.ЗаполнитьКодОКВЭД(ОбъектXDTO, РеквизитыОрганизации);
	СервисДанныхЕдиныхГосРеестров.ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, РеквизитыОрганизации);
	СервисДанныхЕдиныхГосРеестров.ЗаполнитьРеквизитыПенсионногоФонда(ОбъектXDTO, РеквизитыОрганизации);
	СервисДанныхЕдиныхГосРеестров.ЗаполнитьРеквизитыФондаСоциальногоСтрахования(ОбъектXDTO, РеквизитыОрганизации);
	ЗаполнитьЮридическийАдрес(ОбъектXDTO, РеквизитыОрганизации, Прокси.ФабрикаXDTO, АдресныеСокращения);
	СервисДанныхЕдиныхГосРеестров.ЗаполнитьРуководителяИНомерТелефона(ОбъектXDTO, РеквизитыОрганизации);
////	СервисДанныхЕдиныхГосРеестров.ЗаполнитьИсториюРеквизитовЮридическогоЛица(ОбъектXDTO, РеквизитыОрганизации, Прокси.ФабрикаXDTO, АдресныеСокращения);
////	ЗаполнитьИнформациюОСтатусеСтруктура(ОбъектXDTO, РеквизитыОрганизации);
////	ЗаполнитьИнформациюОРегистрирующемОргане(ОбъектXDTO, РеквизитыОрганизации);
//	
//	ЗаписатьИнформациюВЖурналРегистрации(
//		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru = 'Успешно завершено получение реквизитов юридического лица для ИНН %1'"),
//			ИНН),
//		"Контрагент",
//		ДополнительноеСобытиеПолучениеДанных());
	
	Возврат РеквизитыОрганизации;
	
КонецФункции

#КонецОбласти

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения  

Процедура ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, Сервис, ИмяМетода, ИдентификаторУслуги, Результат)
	
	Если ОбъектXDTO <> Неопределено И Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	КодОсновногоЯзыка  = ОбщегоНазначения.КодОсновногоЯзыка(); // Для записи события в журнал регистрации.
	ОписаниеОшибкиВРег = ВРег(ОписаниеОшибки);
	
	Если ОписаниеОшибкиВРег = ВРег("НеУказаныПараметрыАутентификации")
		Или ОписаниеОшибкиВРег = ВРег("НеУказанПароль") Тогда
		
		Результат.ОписаниеОшибки = "НеУказаныПараметрыАутентификации";
		ЗаписатьИнформациюВЖурналРегистрации(
			НСтр("ru = 'Интернет-поддержка пользователей не подключена.'"),
			Сервис,
			НСтр("ru='Аутентификация'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибкиВРег, """STATUS"":401") > 0
		Или СтрНайти(ОписаниеОшибкиВРег, "SERVER-9:") > 0 Тогда
		
		Если ОбщегоНазначения.РазделениеВключено() Тогда
			Результат.ОписаниеОшибки = НСтр("ru = 'Ошибка аутентификации в сервисе. Обратитесь к администратору.'");
			ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка аутентификации в сервисе.
						|%1'"),
						ОписаниеОшибки),
				Сервис,
				НСтр("ru='Аутентификация'", КодОсновногоЯзыка));
		Иначе
			Результат.ОписаниеОшибки = "НеУказаныПараметрыАутентификации";
			ЗаписатьИнформациюВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Интернет-поддержка пользователей не подключена.
						|%1'"),
						ОписаниеОшибки),
				Сервис,
				НСтр("ru='Аутентификация'", КодОсновногоЯзыка));
		КонецЕсли;
		
	ИначеЕсли ОписаниеОшибкиВРег = ВРег("УслугаНеПодключена") Тогда
		
		Результат.ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен";
		ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Услуга с идентификатором ""%1"" не подключена.'"),
				ИдентификаторУслуги),
			Сервис,
			НСтр("ru='Доступ'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибкиВРег, "SERVER-11:") > 0 
		Или СтрНайти(ОписаниеОшибкиВРег, "SERVER-12:") > 0 Тогда
		
		Результат.ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен";
		ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сервис 1С:Контрагент не подключен.
					|%1'"),
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Доступ'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибкиВРег, "SERVER-1:") > 0 Тогда
		
		Если ИмяМетода = "findCorporationByInn"
			ИЛИ ИмяМетода = "findCorpTrustability" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='Не указан ИНН юридического лица.'");
		ИначеЕсли ИмяМетода = "findEntrepreneurByInn" 
			ИЛИ ИмяМетода = "findEntrTrustabilityByInn" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='Не указан ИНН предпринимателя.'");
		ИначеЕсли ИмяМетода = "findCorporationsByName" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='Не указано наименование юридического лица.'");
		ИначеЕсли ИмяМетода = "findInspectionsByInnList" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='Не указан ИНН проверяемого лица.'");
		ИначеЕсли ИмяМетода = "findPfrByCode"
			Или ИмяМетода = "findFssByCode"
			Или ИмяМетода = "findIfnsByCode" Тогда
			Результат.ОписаниеОшибки  = НСтр("ru='Не указан код государственного органа.'");
		Иначе
			Результат.ОписаниеОшибки = ОписаниеОшибки;
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|%2'"),
					Результат.ОписаниеОшибки,
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Получение данных'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибкиВРег, "SERVER-2:") > 0 Тогда
		
		Если ИмяМетода = "findCorporationByInn" 
			ИЛИ ИмяМетода = "findCorpTrustability" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='ИНН юридического лица должен состоять из 10 цифр.'");
		ИначеЕсли ИмяМетода = "findEntrepreneurByInn" 
			ИЛИ ИмяМетода = "findEntrTrustabilityByInn" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='ИНН предпринимателя должен состоять из 12 цифр.'");
		ИначеЕсли ИмяМетода = "findInspectionsByInnList" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='ИНН проверяемого лица должен состоять из 10 или 12 цифр.'");
		Иначе
			Результат.ОписаниеОшибки = ОписаниеОшибки;
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|%2'"),
					Результат.ОписаниеОшибки,
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Получение данных'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибкиВРег, "SERVER-3:") > 0 Тогда
		
		Если ИмяМетода = "findCorporationByInn" 
			ИЛИ ИмяМетода = "findCorpTrustability" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='ИНН юридического лица должен содержать только цифры.'");
		ИначеЕсли ИмяМетода = "findEntrepreneurByInn" 
			ИЛИ ИмяМетода = "findEntrTrustabilityByInn" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='ИНН предпринимателя должен содержать только цифры.'");
		ИначеЕсли ИмяМетода = "findInspectionsByInnList" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='ИНН проверяемого лица должен содержать только цифры.'");
		ИначеЕсли ИмяМетода = "findPfrByCode"
			Или ИмяМетода = "findFssByCode"
			Или ИмяМетода = "findIfnsByCode" Тогда
			Результат.ОписаниеОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Данные о государственном органе с кодом %1 не найдены.'"),
				Результат.Код);
		Иначе
			Результат.ОписаниеОшибки = ОписаниеОшибки;
		КонецЕсли;
		
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|%2'"),
					Результат.ОписаниеОшибки,
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Получение данных'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибкиВРег, "SERVER-4:") > 0 Тогда
		
		Результат.ОписаниеОшибки = НСтр("ru = 'Превышено количество попыток. Повторите попытку позже.'");
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Превышено количество попыток. Повторите попытку позже.
					|%1'"),
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Вызов операций'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибки, "SERVER-7:") > 0 Тогда
		
		Результат.ОписаниеОшибки = НСтр("ru='Превышен лимит количества вызовов сервиса за один день'");
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|%2'"),
					Результат.ОписаниеОшибки,
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Доступ'", КодОсновногоЯзыка));
		
	ИначеЕсли СтрНайти(ОписаниеОшибки, "SERVER-8:") > 0 Тогда
		
		Результат.ОписаниеОшибки = НСтр("ru='Отсутствует действующий договор ИТС'");
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|%2'"),
					Результат.ОписаниеОшибки,
					ОписаниеОшибки),
			Сервис,
			НСтр("ru='Доступ'", КодОсновногоЯзыка));
		
	ИначеЕсли Не ЗначениеЗаполнено(ОписаниеОшибки) И ОбъектXDTO = Неопределено Тогда
		
		Если ИмяМетода = "findCorporationByInn"
			ИЛИ ИмяМетода = "findEntrepreneurByInn" Тогда
			Результат.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось найти данные для заполнения реквизитов по ИНН %1.'"),
				Результат.ИНН);
		ИначеЕсли ИмяМетода = "findCorporationsByName" Тогда
			Результат.ОписаниеОшибки = НСтр("ru='Не удалось выполнить поиск по наименованию.'");
		ИначеЕсли ИмяМетода = "findInspectionsByInnList" Тогда
			Результат.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось найти данные о проверках по ИНН %1.'"),
				Результат.ИНН);
		ИначеЕсли ИмяМетода = "findCorpTrustability" Тогда
			Результат.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось найти данные о юридическом лице с ИНН %1.'"),
				Результат.ИНН);
		ИначеЕсли ИмяМетода = "findEntrTrustabilityByInn" Тогда
			Результат.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось найти данные о предпринимателе с ИНН %1.'"),
				Результат.ИНН);
		ИначеЕсли ИмяМетода = "findPfrByCode"
			Или ИмяМетода = "findFssByCode"
			Или ИмяМетода = "findIfnsByCode" Тогда
			Результат.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Данные о государственном органе с кодом %1 не найдены.'"),
				Результат.Код);
		КонецЕсли;
		
		ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
					|Получен пустой ответ сервиса.'"),
				Результат.ОписаниеОшибки,
				ОписаниеОшибки),
			Сервис,
			НСтр("ru='Получение данных'", КодОсновногоЯзыка));
		
	Иначе
		
		Результат.ОписаниеОшибки = НСтр("ru='Ошибка при работе с сервисом (подробнее см. Журнал регистрации)'");
		ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при работе с сервисом.
					|%1.'"),
				ОписаниеОшибки),
			Сервис,
			НСтр("ru='Ошибка'", КодОсновногоЯзыка));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДоступностьСервисаКонтрагент(ОписаниеОшибки)
	
	ПараметрыСервиса = ПараметрыСервисаДоступность();
	ПараметрыПодключения = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();
	ПараметрыПодключения.АдресWSDL              = ПараметрыСервиса.URL;
	ПараметрыПодключения.URIПространстваИмен    = ПараметрыСервиса.URIПространстваИмен;
	ПараметрыПодключения.ИмяСервиса             = ПараметрыСервиса.Имя;
	ПараметрыПодключения.ИмяТочкиПодключения    = ПараметрыСервиса.ИмяТочкиПодключения;
	ПараметрыПодключения.ДелатьКонтрольныйВызов = Ложь;
	ПараметрыПодключения.Таймаут                = 15;
	
	Попытка
		Прокси = ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);
	Исключение
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось проверить доступность сервиса. Не удалось получить описание сервиса. %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Попытка
		Прокси.ping();
	Исключение
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось проверить доступность сервиса. Ошибка при вызове операции ping(). %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Функция УслугаПодключена(ИдентификаторУслуги)
	
	Возврат ИнтернетПоддержкаПользователей.УслугаПодключена(ИдентификаторУслуги);
	
КонецФункции   

Процедура ЗаписатьОшибкуВЖурналРегистрации(
	Сообщение,
	ИдентификаторСервиса = Неопределено,
	ДополнительноеСобытие = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(ИдентификаторСервиса)
			+ ?(ДополнительноеСобытие = Неопределено, "", "." + ДополнительноеСобытие),
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		Сообщение);
	
КонецПроцедуры

Процедура ЗаписатьИнформациюВЖурналРегистрации(
	Сообщение,
	ИдентификаторСервиса,
	ДополнительноеСобытие = Неопределено)
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(ИдентификаторСервиса)
			+ ?(ДополнительноеСобытие = Неопределено, "", "." + ДополнительноеСобытие),
		УровеньЖурналаРегистрации.Информация,
		,
		,
		Сообщение);
	
КонецПроцедуры

Функция ИмяСобытияЖурналаРегистрации(ИдентификаторСервиса)
	
	Если ИдентификаторСервиса = "Контрагент" Тогда
		Возврат НСтр("ru = 'Сервис данных единых гос_реестров'", ОбщегоНазначения.КодОсновногоЯзыка());
	ИначеЕсли ИдентификаторСервиса = "ГосОрганы" Тогда
		Возврат НСтр("ru = 'Сервис данных гос_органов'", ОбщегоНазначения.КодОсновногоЯзыка());
	ИначеЕсли ИдентификаторСервиса = "ПроверкаКонтрагентов" Тогда
		Возврат НСтр("ru = 'Проверка контрагентов'", ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		Возврат НСтр("ru = 'Работа с контрагентами'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
КонецФункции

Функция ПространствоИменКИ()
	Возврат Метаданные.ПакетыXDTO.КонтактнаяИнформация.ПространствоИмен;
КонецФункции

#КонецОбласти

#Область Тарификация

Функция ИдентификаторУслугиЗаполнениеРеквизитовКонтрагентов()
	
	Возврат "1c-counteragent-autocomplete-contractor-details";
	
КонецФункции

#КонецОбласти    

#Область СервисыЗаполненияРеквизитов

#Область ОбщегоНазначения

Функция ПроксиСервиса(URLМестоположенияWSDL, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения, ОписаниеОшибки)
	
	Прокси = Неопределено;
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		
		// Создание WSПрокси с аутентификацией по тикету аутентификации.
		ПараметрыПодключения = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();
		ПараметрыПодключения.АдресWSDL           = URLМестоположенияWSDL;
		ПараметрыПодключения.URIПространстваИмен = URIПространстваИмен;
		ПараметрыПодключения.ИмяСервиса          = ИмяСервиса;
		ПараметрыПодключения.ИмяТочкиПодключения = ИмяТочкиПодключения;
		ПараметрыПодключения.Таймаут             = 60;
		
		ОшибкаАутентификации = Ложь;
		
		// Попытка создания объекта без аутентификации (по данным Кэш).
		Попытка
			Прокси = ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ОписаниеОшибкиВРег = ВРег(ОписаниеОшибки);
			ОшибкаАутентификации = (СтрНайти(ОписаниеОшибкиВРег, """STATUS"":401") > 0
				Или СтрНайти(ОписаниеОшибкиВРег, "SERVER-9:") > 0);
		КонецЕсли;
		
		Если ОшибкаАутентификации Тогда
			
			// Нет описания WSDL в кэше программных интерфейсов.
			// Получить новое описание с использованием тикета, новое описание
			// будет сохранено в кэше программных интерфейсов.
			ОписаниеОшибки = "";
			УстановитьПривилегированныйРежим(Истина);
			
			// Работа в модели сервиса.
			МодульИнтернетПоддержкаПользователейВМоделиСервиса =
				ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователейВМоделиСервиса");
			РезультатПолученияТикета = МодульИнтернетПоддержкаПользователейВМоделиСервиса.ТикетАутентификацииНаПорталеПоддержки(
				URLМестоположенияWSDL);
			
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Не ПустаяСтрока(РезультатПолученияТикета.КодОшибки) Тогда
				//ЗаписатьИнформациюВЖурналРегистрации(
				//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				//		НСтр("ru = 'Не удалось получить тикет аутентификации для создания описания сервиса %1.
				//			|Код ошибки: %2.
				//			|Для аутентификации использован логин ""fresh"".'"),
				//		URLМестоположенияWSDL,
				//		РезультатПолученияТикета.КодОшибки),
				//	"РаботаСКонтрагентами");
				ПараметрыПодключения.ИмяПользователя = "fresh";
				ПараметрыПодключения.Пароль          = "fresh";
			Иначе
				ПараметрыПодключения.ИмяПользователя = "AUTH_TOKEN";
				ПараметрыПодключения.Пароль          = РезультатПолученияТикета.Тикет;
			КонецЕсли;
			
			Попытка
				Прокси = ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);
			Исключение
				ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		// Создание WSПрокси в обычном режиме с аутентификацией по логину и паролю.
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		УстановитьПривилегированныйРежим(Ложь);
		Если ДанныеАутентификации = Неопределено Тогда
			ОписаниеОшибки = "НеУказаныПараметрыАутентификации";
			Возврат Неопределено;
		КонецЕсли;
		
		ПараметрыПодключения = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();
		ПараметрыПодключения.АдресWSDL           = URLМестоположенияWSDL;
		ПараметрыПодключения.URIПространстваИмен = URIПространстваИмен;
		ПараметрыПодключения.ИмяСервиса          = ИмяСервиса;
		ПараметрыПодключения.ИмяТочкиПодключения = ИмяТочкиПодключения;
		ПараметрыПодключения.ИмяПользователя     = ДанныеАутентификации.Логин;
		ПараметрыПодключения.Пароль              = ДанныеАутентификации.Пароль;
		ПараметрыПодключения.Таймаут             = 60;
		
		Попытка
			Прокси = ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

Процедура ЗаполнитьТикетАутентификации(ПроксиСервиса, АдресСервиса, ИмяМетода, ОписаниеОшибки)
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	// Получение тикета.
	УстановитьПривилегированныйРежим(Истина);
	
	// Работа в модели сервиса.
	МодульИнтернетПоддержкаПользователейВМоделиСервиса =
		ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователейВМоделиСервиса");
	РезультатПолученияТикета = МодульИнтернетПоддержкаПользователейВМоделиСервиса.ТикетАутентификацииНаПорталеПоддержки(
		АдресСервиса + "#" + ИмяМетода);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ПустаяСтрока(РезультатПолученияТикета.КодОшибки) Тогда
		//ЗаписатьИнформациюВЖурналРегистрации(
		//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//		НСтр("ru = 'Не удалось получить тикет аутентификации для вызова операции %1 сервиса %2.
		//			|Код ошибки: %3.
		//			|Для аутентификации использован логин ""fresh"".'"),
		//		ИмяМетода,
		//		АдресСервиса,
		//		РезультатПолученияТикета.КодОшибки),
		//	"РаботаСКонтрагентами");
		ПроксиСервиса.Пользователь = "fresh";
		ПроксиСервиса.Пароль       = "fresh";
	Иначе
		ПроксиСервиса.Пользователь = "AUTH_TOKEN";
		ПроксиСервиса.Пароль       = РезультатПолученияТикета.Тикет;
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнительныеПараметрыВызоваОперацииСервиса(ФабрикаXDTOСервиса, URIПространстваИмен)
	
	ИмяКонфигурации = ИнтернетПоддержкаПользователей.ИмяКонфигурации();
	ТипДополнительныеПараметрыXDTO = ФабрикаXDTOСервиса.Тип(URIПространстваИмен, "AdditionalParameters");
	ТипДополнительныйПараметрXDTO = ФабрикаXDTOСервиса.Тип(URIПространстваИмен, "AdditionalParameter");
	
	Результат = ФабрикаXDTOСервиса.Создать(ТипДополнительныеПараметрыXDTO);
	
	ДополнительныйПараметрXDTO = ФабрикаXDTOСервиса.Создать(ТипДополнительныйПараметрXDTO);
	ДополнительныйПараметрXDTO.name  = "ConfigurationName";
	ДополнительныйПараметрXDTO.value = ИмяКонфигурации;
	Результат.Parameter.Добавить(ДополнительныйПараметрXDTO);
	
	ДополнительныйПараметрXDTO = ФабрикаXDTOСервиса.Создать(ТипДополнительныйПараметрXDTO);
	ДополнительныйПараметрXDTO.name  = "SupportsCustomAddressElements";
	ДополнительныйПараметрXDTO.value = "true";
	Результат.Parameter.Добавить(ДополнительныйПараметрXDTO);
	
	ДополнительныйПараметрXDTO = ФабрикаXDTOСервиса.Создать(ТипДополнительныйПараметрXDTO);
	ДополнительныйПараметрXDTO.name  = "SupportsAddressFormatV2";
	ДополнительныйПараметрXDTO.value = "true";
	Результат.Parameter.Добавить(ДополнительныйПараметрXDTO);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Контрагенты 

Функция БазовыйURLСервиса()
	
	Возврат "https://api.orgregister.1c.ru";
	
КонецФункции   

Функция ПараметрыСервисаЮридическиеЛица()
	
	Результат = Новый Структура;
	Результат.Вставить("URL", БазовыйURLСервиса() + "/ws/corporation/v1?wsdl");
	Результат.Вставить("Имя"                , "CorpWsImplService");
	Результат.Вставить("URIПространстваИмен", "http://ws.corporation.company1c.com/");
	Результат.Вставить("ИмяТочкиПодключения", "CorpWsImplPort");
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСервисаИндивидуальныеПредприниматели()
	
	Результат = Новый Структура;
	Результат.Вставить("URL", БазовыйURLСервиса() + "/ws/entrepreneur/v1?wsdl");
	Результат.Вставить("Имя"                , "EntrWsImplService");
	Результат.Вставить("URIПространстваИмен", "http://ws.entrepreneur.company1c.com/");
	Результат.Вставить("ИмяТочкиПодключения", "EntrWsImplPort");
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСервисаДоступность()
	
	Результат = Новый Структура;
	Результат.Вставить("URL", БазовыйURLСервиса() + "/ws/availability/v1?wsdl");
	Результат.Вставить("Имя"                , "AvailabilityWsImplService");
	Результат.Вставить("URIПространстваИмен", "http://ws.availability.company1c.com/");
	Результат.Вставить("ИмяТочкиПодключения", "AvailabilityWsImplPort");
	
	Возврат Результат;
	
КонецФункции 

#Область ОписанияРеквизитов

Функция НоваяКонтактнаяИнформация()

	Результат = Новый Структура;
	Результат.Вставить("КонтактнаяИнформация");
	Результат.Вставить("Представление");
	Результат.Вставить("Комментарий");
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеРеквизитов

Процедура ЗаполнитьНаименованияЮридическогоЛица(ОбъектXDTO, Реквизиты)
	
	СервисДанныхЕдиныхГосРеестров.ЗаполнитьНаименованияЮрЛица(ОбъектXDTO, Реквизиты); 
	
КонецПроцедуры    

Процедура ЗаполнитьОбъектXDTOКонтактнойИнформации(
	Фабрика,
	Объект,
	ИсходныйОбъект,
	ПутьРодительскогоСвойства = "<Корень>",
	ОтключитьПреобразование = Ложь)
	
	Для каждого СвойствоИсходногоОбъекта Из ИсходныйОбъект.Свойства() Цикл
		
		ПутьТекущегоСвойства = ПутьРодительскогоСвойства + "." + СвойствоИсходногоОбъекта.Имя;
		
		СвойствоОбъекта = Объект.Свойства().Получить(СвойствоИсходногоОбъекта.Имя);
		Если СвойствоОбъекта <> Неопределено Тогда
			
			ЗначениеСвойства = ИсходныйОбъект[СвойствоИсходногоОбъекта.Имя];
			Если ЗначениеСвойства = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
				
				ОтключитьПреобразованиеВложенныхЗначений =
					(ПутьТекущегоСвойства = "<Корень>.ДопАдрЭл[].Номер"
						И (ЗначениеСвойства.Тип = "1080"
						Или ЗначениеСвойства.Тип = "1090"
						Или ЗначениеСвойства.Тип = "Другое"));
				
				Объект[СвойствоОбъекта.Имя] = Фабрика.Создать(СвойствоОбъекта.Тип);
				ЗаполнитьОбъектXDTOКонтактнойИнформации(
					Фабрика,
					Объект[СвойствоОбъекта.Имя],
					ИсходныйОбъект[СвойствоИсходногоОбъекта.Имя],
					ПутьТекущегоСвойства,
					ОтключитьПреобразованиеВложенныхЗначений);
				
			ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
				
				Для Каждого ИсходныйЭлемент Из ЗначениеСвойства Цикл
					
					Элемент = Фабрика.Создать(СвойствоОбъекта.Тип);
					ЗаполнитьОбъектXDTOКонтактнойИнформации(Фабрика, Элемент, ИсходныйЭлемент, ПутьТекущегоСвойства + "[]", Ложь);
					Объект[СвойствоОбъекта.Имя].Добавить(Элемент);
					
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
				
				Если ОтключитьПреобразование Тогда
					Объект[СвойствоОбъекта.Имя] = ЗначениеСвойства;
				Иначе
					МассивСлов      = СтрРазделить(ЗначениеСвойства, " ", Ложь);
					МаксИндексСлова = ?(МассивСлов.Количество() = 1, 0, МассивСлов.Количество() - 2);
					Для ИндексСлова = 0 По МаксИндексСлова Цикл
						Если ЭтоЗаписьЧисловогоЭлементаАдреса(МассивСлов[ИндексСлова]) Тогда
							МассивСлов[ИндексСлова] = ВРег(МассивСлов[ИндексСлова]);
						Иначе
							МассивЧастейСлова = СтрРазделить(МассивСлов[ИндексСлова], ".", Истина);
							Для ИндексЧастиСлова = 0 По МассивЧастейСлова.Количество() - 1 Цикл
								МассивЧастейСлова[ИндексЧастиСлова] = ТРег(МассивЧастейСлова[ИндексЧастиСлова]);
							КонецЦикла;
							МассивСлов[ИндексСлова] = СтрСоединить(МассивЧастейСлова, ".");
						КонецЕсли;
					КонецЦикла;
					Объект[СвойствоОбъекта.Имя] = СтрСоединить(МассивСлов, " ");
				КонецЕсли;
				
			Иначе
				
				Объект[СвойствоОбъекта.Имя] = ЗначениеСвойства;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоЗаписьЧисловогоЭлементаАдреса(Знач ПроверяемаяСтрока)

	ЧастиРимскихЧисел = "IVXLCDM-(),0123456789";
	ДлинаСтроки = СтрДлина(ПроверяемаяСтрока);
	ПроверяемаяСтрока = ВРег(ПроверяемаяСтрока);
	
	Для НомерЗнака = 1 По ДлинаСтроки Цикл
		Если СтрНайти(ЧастиРимскихЧисел, Сред(ПроверяемаяСтрока, НомерЗнака, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Процедура ЗаменитьПолныеНаименованияАдресныхОбъектовСокращенными(Объект, АдресныеСокращения = Неопределено)
	
	Если АдресныеСокращения = Неопределено Тогда
		
		АдресныеСокращенияСоответствие = АдресныйКлассификатор.СокращенияАдресныхОбъектов(Новый Массив);
		ТипСтрока = Новый ОписаниеТипов("Строка");
		АдресныеСокращения = Новый ТаблицаЗначений;
		АдресныеСокращения.Колонки.Добавить("АдресныйОбъект", ТипСтрока);
		АдресныеСокращения.Колонки.Добавить("СокращениеОбъекта", ТипСтрока);
		АдресныеСокращения.Колонки.Добавить("ДлинаПредставленияОбъекта",
			Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
		Для Каждого КлючЗначение Из АдресныеСокращенияСоответствие Цикл
			СтрокаСокращение = АдресныеСокращения.Добавить();
			СтрокаСокращение.АдресныйОбъект    = ВРег(КлючЗначение.Ключ);
			СтрокаСокращение.СокращениеОбъекта = КлючЗначение.Значение;
			СтрокаСокращение.ДлинаПредставленияОбъекта = СтрДлина(КлючЗначение.Ключ);
		КонецЦикла;
		
		// Сортировка по убыванию длины для исключения
		// включения адресных объектов друг в друга.
		АдресныеСокращения.Сортировать("ДлинаПредставленияОбъекта Убыв");
		
	КонецЕсли;
	
	Для Каждого СвойствоОбъекта Из Объект.Свойства() Цикл
		
		ЗначениеСвойства = Объект[СвойствоОбъекта.Имя];
		Если ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
			
			ЗначениеСвойства = СокрЛП(ЗначениеСвойства);                    
			ДваПробела = "  ";
			Пока СтрНайти(ЗначениеСвойства, ДваПробела) > 0 Цикл
				// Удаление лишних разделителей.
				ЗначениеСвойства = СтрЗаменить(ЗначениеСвойства, ДваПробела, " ");
			КонецЦикла;
			
			ЗначениеВРег = ВРег(ЗначениеСвойства);
			ДлинаЗначения = СтрДлина(ЗначениеСвойства);
			Для Итератор = 0 По АдресныеСокращения.Количество() - 1 Цикл
				СтрокаСокращение = АдресныеСокращения[Итератор];
				Если (ДлинаЗначения > СтрокаСокращение.ДлинаПредставленияОбъекта
					И Сред(ЗначениеСвойства, ДлинаЗначения - СтрокаСокращение.ДлинаПредставленияОбъекта, 1) = " " // Должен быть пробел перед адресным объектом.
					Или ДлинаЗначения = СтрокаСокращение.ДлинаПредставленияОбъекта)
					И Прав(ЗначениеВРег, СтрокаСокращение.ДлинаПредставленияОбъекта) = СтрокаСокращение.АдресныйОбъект Тогда
					Объект[СвойствоОбъекта.Имя] = Лев(ЗначениеСвойства, ДлинаЗначения - СтрокаСокращение.ДлинаПредставленияОбъекта)
							+ СтрокаСокращение.СокращениеОбъекта;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
			
			ЗаменитьПолныеНаименованияАдресныхОбъектовСокращенными(ЗначениеСвойства, АдресныеСокращения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЮридическийАдрес(ОбъектXDTO, Реквизиты, Фабрика, АдресныеСокращения)
	
	Если ОбъектXDTO.СвАдрес <> Неопределено 
		И ОбъектXDTO.СвАдрес.Адрес <> Неопределено Тогда
		
		Реквизиты.ЮридическийАдрес = АдресКИ(ОбъектXDTO.СвАдрес.Адрес, Фабрика, АдресныеСокращения);
		Реквизиты.ЮридическийАдрес.Вставить("Корректный", ОбъектXDTO.СвАдрес.validAddress);
		
	КонецЕсли;
	
КонецПроцедуры

Функция АдресКИ(АдресXDTO, Фабрика, АдресныеСокращения)
	
	Если АдресXDTO.Состав.Тип() = Фабрика.Тип("http://company1c.com/orgregister/base", "АдресРФ") Тогда
		Возврат АдресРФВерсия1(АдресXDTO, Фабрика, АдресныеСокращения);
	Иначе
		Возврат АдресРФВерсия2(АдресXDTO);
	КонецЕсли;
	
КонецФункции

Функция АдресРФВерсия1(АдресXDTO, Фабрика, АдресныеСокращения)
	
	ПространствоИменКИ      = ПространствоИменКИ();
	ПространствоИменАдресов = ПространствоИмен();
	
	АдресРФ_КИ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменАдресов, "АдресРФ"));
	
	ЗаменитьПолныеНаименованияАдресныхОбъектовСокращенными(АдресXDTO.Состав, АдресныеСокращения);
	ЗаполнитьОбъектXDTOКонтактнойИнформации(ФабрикаXDTO, АдресРФ_КИ, АдресXDTO.Состав);
	
	КИ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменКИ, "КонтактнаяИнформация"));
	КИ.Состав        = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменКИ, "Адрес"));
	КИ.Состав.Страна = АдресXDTO.Страна;
	КИ.Состав.Состав = АдресРФ_КИ;
	КИ.Представление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(
		КИ,
		Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
	
	Результат = НоваяКонтактнаяИнформация();
	Результат.КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(
		КИ,
		Перечисления.ТипыКонтактнойИнформации.Адрес);
	Результат.Представление = КИ.Представление;
	
	Возврат Результат;
	
КонецФункции

Функция АдресРФВерсия2(АдресXDTO)
	
	АдресСтруктура = РаботаСАдресамиКлиентСервер.ПоляАдреса();
	АдресСостав = АдресXDTO.Состав;
	
	АдресСтруктура.ТипАдреса = "Административно-территориальный";
	Если ЗначениеЗаполнено(АдресСостав.ТипАдреса) Тогда
		АдресСтруктура.ТипАдреса = АдресСостав.ТипАдреса;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Страна) Тогда
		АдресСтруктура.Страна = АдресСостав.Страна;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.КодСтраны) Тогда
		АдресСтруктура.КодСтраны = АдресСостав.КодСтраны;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Представление) Тогда
		АдресСтруктура.Представление = АдресСостав.Представление;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.МуниципальноеПредставление) Тогда
		АдресСтруктура.МуниципальноеПредставление = АдресСостав.МуниципальноеПредставление;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Индекс) Тогда
		АдресСтруктура.Индекс = АдресСостав.Индекс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.КодРегиона) Тогда
		АдресСтруктура.КодРегиона = АдресСостав.КодРегиона;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Регион) Тогда
		АдресСтруктура.Регион = АдресСостав.Регион;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.РегионСокращение) Тогда
		АдресСтруктура.РегионСокращение = АдресСостав.РегионСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Район) Тогда
		АдресСтруктура.Район = АдресСостав.Район;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.РайонСокращение) Тогда
		АдресСтруктура.РайонСокращение = АдресСостав.РайонСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.МуниципальныйРайон) Тогда
		АдресСтруктура.МуниципальныйРайон = АдресСостав.МуниципальныйРайон;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.МуниципальныйРайонСокращение) Тогда
		АдресСтруктура.МуниципальныйРайонСокращение = АдресСостав.МуниципальныйРайонСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Город) Тогда
		АдресСтруктура.Город = АдресСостав.Город;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ГородСокращение) Тогда
		АдресСтруктура.ГородСокращение = АдресСостав.ГородСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Поселение) Тогда
		АдресСтруктура.Поселение = АдресСостав.Поселение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ПоселениеСокращение) Тогда
		АдресСтруктура.ПоселениеСокращение = АдресСостав.ПоселениеСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ВнутригородскойРайон) Тогда
		АдресСтруктура.ВнутригородскойРайон = АдресСостав.ВнутригородскойРайон;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ВнутригородскойРайонСокращение) Тогда
		АдресСтруктура.ВнутригородскойРайонСокращение = АдресСостав.ВнутригородскойРайонСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.НаселенныйПункт) Тогда
		АдресСтруктура.НаселенныйПункт = АдресСостав.НаселенныйПункт;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.НаселенныйПунктСокращение) Тогда
		АдресСтруктура.НаселенныйПунктСокращение = АдресСостав.НаселенныйПунктСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Территория) Тогда
		АдресСтруктура.Территория = АдресСостав.Территория;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ТерриторияСокращение) Тогда
		АдресСтруктура.ТерриторияСокращение = АдресСостав.ТерриторияСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Улица) Тогда
		АдресСтруктура.Улица = АдресСостав.Улица;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.УлицаСокращение) Тогда
		АдресСтруктура.УлицаСокращение = АдресСостав.УлицаСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Здание) Тогда
		АдресСтруктура.Здание.Номер = АдресСостав.Здание;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ЗданиеСокращение) Тогда
		АдресСтруктура.Здание.ТипЗдания = АдресСостав.ЗданиеСокращение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.Участок) И АдресСтруктура.Свойство("НомерЗемельногоУчастка") Тогда
		АдресСтруктура.НомерЗемельногоУчастка = АдресСостав.Участок;
	КонецЕсли;
	
	Если ТипЗнч(АдресСостав.Корпуса) = Тип("ОбъектXDTO") И ТипЗнч(АдресСостав.Корпуса.Корпус) = Тип("СписокXDTO") Тогда
		Для Каждого ТекущийКорпус Из АдресСостав.Корпуса.Корпус Цикл
			АдресСтруктура.Корпуса.Добавить(Новый Структура("ТипКорпуса, Тип, Номер", ТекущийКорпус.Тип, ТекущийКорпус.Тип, ТекущийКорпус.Номер));
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(АдресСостав.Помещения) = Тип("ОбъектXDTO") И ТипЗнч(АдресСостав.Помещения.Помещение) = Тип("СписокXDTO") Тогда
		Для Каждого ТекущееПомещение Из АдресСостав.Помещения.Помещение Цикл
			АдресСтруктура.Помещения.Добавить(Новый Структура("ТипПомещения, Тип, Номер", ТекущееПомещение.Тип, ТекущееПомещение.Тип, ТекущееПомещение.Номер));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ИдентификаторАдресногоОбъекта) Тогда
		АдресСтруктура.ИдентификаторАдресногоОбъекта = Новый УникальныйИдентификатор(АдресСостав.ИдентификаторАдресногоОбъекта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ЗданиеИдентификатор) Тогда
		АдресСтруктура.ИдентификаторДома = Новый УникальныйИдентификатор(АдресСостав.ЗданиеИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.УчастокИдентификатор) И АдресСтруктура.Свойство("ИдентификаторЗемельногоУчастка") Тогда
		АдресСтруктура.ИдентификаторЗемельногоУчастка = Новый УникальныйИдентификатор(АдресСостав.УчастокИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.РегионИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.РегионИдентификатор = Новый УникальныйИдентификатор(АдресСостав.РегионИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.РайонИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.РайонИдентификатор = Новый УникальныйИдентификатор(АдресСостав.РайонИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.МуниципальныйРайонИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.МуниципальныйРайонИдентификатор = Новый УникальныйИдентификатор(АдресСостав.МуниципальныйРайонИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ГородИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.ГородИдентификатор = Новый УникальныйИдентификатор(АдресСостав.ГородИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ПоселениеИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.ПоселениеИдентификатор = Новый УникальныйИдентификатор(АдресСостав.ПоселениеИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ВнутригородскойРайонИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.ВнутригородскойРайонИдентификатор = Новый УникальныйИдентификатор(АдресСостав.ВнутригородскойРайонИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.НаселенныйПунктИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.НаселенныйПунктИдентификатор = Новый УникальныйИдентификатор(АдресСостав.НаселенныйПунктИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ТерриторияИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.ТерриторияИдентификатор = Новый УникальныйИдентификатор(АдресСостав.ТерриторияИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.УлицаИдентификатор) Тогда
		АдресСтруктура.Идентификаторы.УлицаИдентификатор = Новый УникальныйИдентификатор(АдресСостав.УлицаИдентификатор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ОКТМО) Тогда
		АдресСтруктура.ДополнительныеКоды.ОКТМО = АдресСостав.ОКТМО;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.ОКАТО) Тогда
		АдресСтруктура.ДополнительныеКоды.ОКАТО = АдресСостав.ОКАТО;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.КодИФНСФЛ) Тогда
		АдресСтруктура.ДополнительныеКоды.КодИФНСФЛ = АдресСостав.КодИФНСФЛ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.КодИФНСЮЛ) Тогда
		АдресСтруктура.ДополнительныеКоды.КодИФНСЮЛ = АдресСостав.КодИФНСЮЛ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.КодУчасткаИФНСФЛ) Тогда
		АдресСтруктура.ДополнительныеКоды.КодУчасткаИФНСФЛ = АдресСостав.КодУчасткаИФНСФЛ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСостав.КодУчасткаИФНСЮЛ) Тогда
		АдресСтруктура.ДополнительныеКоды.КодУчасткаИФНСЮЛ = АдресСостав.КодУчасткаИФНСЮЛ;
	КонецЕсли;
	
	Результат = НоваяКонтактнаяИнформация();
	Результат.КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(
		АдресСтруктура,
		Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Если АдресСтруктура.ТипАдреса = "Административно-территориальный" Тогда
		Результат.Представление = АдресСтруктура.Представление;
	Иначе
		Результат.Представление = АдресСтруктура.МуниципальноеПредставление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПространствоИмен()
	Возврат "http://www.v8.1c.ru/ssl/contactinfo_ru";
КонецФункции

#КонецОбласти



