&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("абс_СтратегическиеЦелиПродаж_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	дПериодПланирования = обОбъект.ДатаПланирования;
	
	Макет = Документы.абс_СтратегическиеЦелиПродаж.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаРегион 	= Макет.ПолучитьОбласть("Шапка|Регион");
	ОбластьШапкаПериод 	= Макет.ПолучитьОбласть("Шапка|Период");
	ОбластьСтрокаРегион = Макет.ПолучитьОбласть("Строка|Регион");
	ОбластьСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");
	
	//нарисуем шапку
	ТабДок.Вывести(ОбластьШапкаРегион);
	
	ТекМесяц = НачалоГода(дПериодПланирования);
	Пока ТекМесяц <= КонецГода(дПериодПланирования) Цикл
		ОбластьШапкаПериод.Параметры.Период = ТекМесяц;		
		ТабДок.Присоединить(ОбластьШапкаПериод);		
		ТекМесяц = ДобавитьМесяц(ТекМесяц, 1);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(абс_СтратегическиеЦелиПродажСоставПлана.Период, МЕСЯЦ) КАК Период,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Регион КАК Регион,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Территория КАК Территория,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Город КАК Город,
		|	абс_СтратегическиеЦелиПродажСоставПлана.Канал КАК Канал,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоЧисленнойДистрибуции КАК ЦельПоЧисленнойДистрибуции,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА1 КАК ЦельПоДистрибуцииФА1,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА2 КАК ЦельПоДистрибуцииФА2,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА3 КАК ЦельПоДистрибуцииФА3,
		|	абс_СтратегическиеЦелиПродажСоставПлана.ЦельПоДистрибуцииФА4 КАК ЦельПоДистрибуцииФА4
		|ИЗ
		|	Документ.абс_СтратегическиеЦелиПродаж.СоставПлана КАК абс_СтратегическиеЦелиПродажСоставПлана
		|ГДЕ
		|	абс_СтратегическиеЦелиПродажСоставПлана.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регион,
		|	Период
		|ИТОГИ
		|	СУММА(ЦельПоЧисленнойДистрибуции),
		|	СУММА(ЦельПоДистрибуцииФА1),
		|	СУММА(ЦельПоДистрибуцииФА2),
		|	СУММА(ЦельПоДистрибуцииФА3),
		|	СУММА(ЦельПоДистрибуцииФА4)
		|ПО
		|	Регион,
		|	Период ПЕРИОДАМИ(МЕСЯЦ, &НачПериода, &КонПериода),
		|	Территория,
		|	Город,
		|	Канал";

	Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
	Запрос.УстановитьПараметр("НачПериода", НачалоГода(дПериодПланирования));
	Запрос.УстановитьПараметр("КонПериода", КонецГода(дПериодПланирования));

	Результат = Запрос.Выполнить();

	ВыборкаРегион = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаРегион.Следующий() Цикл
		// Вставить обработку выборки ВыборкаРегион
		ОбластьСтрокаРегион.Параметры.Регион 		= ВыборкаРегион.Регион;
		ОбластьСтрокаРегион.Параметры.Территория 	= ВыборкаРегион.Территория;
		ОбластьСтрокаРегион.Параметры.Город 		= ВыборкаРегион.Город;
		ОбластьСтрокаРегион.Параметры.Канал			= ВыборкаРегион.Канал;
		
 		ТабДок.Вывести(ОбластьСтрокаРегион);

		ВыборкаПериод = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

		Пока ВыборкаПериод.Следующий() Цикл
			ОбластьСтрокаПериод.Параметры.Заполнить(ВыборкаПериод);
	 		ТабДок.Присоединить(ОбластьСтрокаПериод);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

