
#Область ПрограммныйИнтерфейс

Функция ЗагрузитьОтчетОПродажах(ПараметрыОтчета) Экспорт
	Перем КодОтветаСервера, СообщениеОбОшибке;
	ДанныеОтчета = Новый Структура("Маркетплейс, ДанныеДокумента, ТекстОшибки, КодОтветаСервера");
	
	Обработчик = ОбработчикМаркетплейса(ПараметрыОтчета.ВидМаркетплейс);
	
	Если Обработчик <> Неопределено Тогда
		ДанныеОтчета.ДанныеДокумента = Обработчик.ПолучитьДанныеДокумента(ПараметрыОтчета, КодОтветаСервера, СообщениеОбОшибке);
		ДанныеОтчета.Маркетплейс     = ПараметрыОтчета.ВидМаркетплейс;
		ДанныеОтчета.КодОтветаСервера = КодОтветаСервера;
	Иначе
		СообщениеОбОшибке = НСтр("ru = 'Неизвестный маркетплейс'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ДанныеОтчета.ТекстОшибки = СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат ДанныеОтчета;
	
КонецФункции

Функция КонтрагентМаркетплейсаПоУмолчанию(ВидМаркетплейса) Экспорт
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.WILDBERRIES Тогда
		Инн = "9714053621";
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON Тогда
		Инн = "7704217370";
	Иначе
		Возврат Контрагент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН", Инн);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Контрагент = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

Функция ПолучитьОстаткиТоваров(НастройкаИнтеграции) Экспорт
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ВидМаркетплейса");
	МодульИнтеграции = ОбработчикМаркетплейса(ВидМаркетплейса);
	
	Если МодульИнтеграции = Неопределено Тогда
		Возврат НовыйТаблицаОстатковТоваров();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаИнтеграции", НастройкаИнтеграции);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураМаркетплейсов.ИдентификаторТовара КАК ИдентификаторТовара,
	|	НоменклатураМаркетплейсов.Штрихкод КАК Штрихкод
	|ИЗ
	|	Справочник.НастройкиИнтеграцииМаркетплейс КАК НастройкиИнтеграцииМаркетплейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураМаркетплейсов КАК НоменклатураМаркетплейсов
	|		ПО НастройкиИнтеграцииМаркетплейс.ВидМаркетплейса = НоменклатураМаркетплейсов.Маркетплейс
	|			И НастройкиИнтеграцииМаркетплейс.Владелец = НоменклатураМаркетплейсов.Организация
	|ГДЕ
	|	НастройкиИнтеграцииМаркетплейс.Ссылка = &НастройкаИнтеграции
	|	И НЕ НоменклатураМаркетплейсов.ИдентификаторТовара ЕСТЬ NULL";
	
	Отбор = Запрос.Выполнить().Выгрузить();
	
	Отказ = Ложь;
	ТаблицаОстатки = МодульИнтеграции.ПолучитьОстаткиТоваров(НастройкаИнтеграции, Отбор, Отказ); 
	Если Отказ Тогда
		Возврат НовыйТаблицаОстатковТоваров();
	КонецЕсли;
	
	Возврат ТаблицаОстатки;
КонецФункции

Функция ПодготовитьФайлОстатков(НастройкаИнтеграции, ТаблицаОстатки) Экспорт
	МодульИнтеграции = ОбработчикМаркетплейса(НастройкаИнтеграции.ВидМаркетплейса);
	Возврат МодульИнтеграции.ПодготовитьФайлОстатков(НастройкаИнтеграции, ТаблицаОстатки);
КонецФункции

Функция ПередатьОстаткиТоваров(НастройкаИнтеграции) Экспорт
	Перем СообщениеОбОшибке;
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ВидМаркетплейса");
	МодульИнтеграции = ОбработчикМаркетплейса(ВидМаркетплейса);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаИнтеграции", НастройкаИнтеграции);
	Запрос.УстановитьПараметр("ПустаяДата",          '00010101');
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровМаркетплейсов.ИдентификаторСклада КАК ИдентификаторСклада,
	|	ОстаткиТоваровМаркетплейсов.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ОстаткиТоваровМаркетплейсов.Штрихкод КАК Штрихкод,
	|	ОстаткиТоваровМаркетплейсов.Остаток КАК Остаток
	|ИЗ
	|	РегистрСведений.ОстаткиТоваровМаркетплейсов КАК ОстаткиТоваровМаркетплейсов
	|ГДЕ
	|	ОстаткиТоваровМаркетплейсов.НастройкаИнтеграции = &НастройкаИнтеграции
	|	И ОстаткиТоваровМаркетплейсов.ДатаВыгрузкиОстатков = &ПустаяДата";
	
	ТаблицаТоваров = НовыйТаблицаОстатковТоваров();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаТоваров);
	
	Отказ = Ложь;
	КодОтветаСервера = 0;
	МодульИнтеграции.ПередатьОстаткиТоваров(НастройкаИнтеграции, ТаблицаТоваров, СообщениеОбОшибке, Отказ, КодОтветаСервера);
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",           НЕ Отказ);
	Результат.Вставить("СообщениеОбОшибке",   СообщениеОбОшибке);
	Результат.Вставить("КодОтветаСервера",    КодОтветаСервера);
	
	Возврат Результат;
	
КонецФункции

Функция СписокТоваровМаркетплейс(НастройкаИнтеграции) Экспорт
	
	Перем СообщениеОбОшибке;
	
	Отказ = Ложь;
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ВидМаркетплейса");
	МодульИнтеграции = ОбработчикМаркетплейса(ВидМаркетплейса);
	СписокТоваров = МодульИнтеграции.СписокТоваровМаркетплейс(НастройкаИнтеграции, СообщениеОбОшибке, Отказ);
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",           	НЕ Отказ);
	Результат.Вставить("НастройкаИнтеграции", 	НастройкаИнтеграции);
	Результат.Вставить("СообщениеОбОшибке",   	СообщениеОбОшибке);
	Результат.Вставить("СписокТоваров",       	СписокТоваров);
	
	Возврат Результат;
	
КонецФункции

Функция СписокСкладовМаркетплейс(НастройкаИнтеграции) Экспорт
	Если НЕ ЗначениеЗаполнено(НастройкаИнтеграции) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ВидМаркетплейса");
	МодульИнтеграции = ОбработчикМаркетплейса(ВидМаркетплейса);
	
	Отказ = Ложь;
	СписокСкладов = МодульИнтеграции.СписокСкладов(НастройкаИнтеграции, Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СписокСкладов;
КонецФункции 

Функция ИнтеграцияНастроена(НастройкаИнтеграции) Экспорт
	Если НЕ ЗначениеЗаполнено(НастройкаИнтеграции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидМаркетплейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ВидМаркетплейса");
	МодульИнтеграции = ОбработчикМаркетплейса(ВидМаркетплейса);
	
	Возврат МодульИнтеграции.ИнтеграцияНастроена(НастройкаИнтеграции);
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СобытиеЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Обмен с маркетплейс'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

Функция ЗарегистрироватьОшибкуОбмена(ТекстОшибки, ВидМаркетплейса) Экспорт
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка, , ВидМаркетплейса, ТекстОшибки);
	
КонецФункции

Функция ОбработчикМаркетплейса(ВидМаркетплейса)
	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияOZON");
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияWildberries");
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.ЯндексМаркет Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияЯндексМаркет");
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Неизвестный маркетплейс'");
КонецФункции

// Преобразует данные в строку JSON.
//
// Параметры:
//   Значение - Произвольный - объект записи JSON. Представляет собой значение произвольного типа. Ограничения см. в описании функции 
//                глобального контекста ЗаписатьJSON.
//
// Возвращаемое значение:
//   Строка - строка JSON.
//
Функция ВJSON(Значение) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Преобразует строку, содержащую текст JSON, в структуру данных.
//
// Параметры:
//   СтрокаJSON                   - Строка - строка, содержащая текст в формате JSON.
//   ИменаСвойствСоЗначениямиДата - Массив Из Строка, Строка - массив, элементы которого содержат имена свойств JSON, для 
//                                    которых нужно вызывать восстановление даты из строки.
//   ПрочитатьВСоответствие       - Булево - если установлено Истина, чтение объекта JSON будет выполнено в Соответствие. Если установлено
//                                    Ложь, объекты будут считываться в объект типа Структура. Значение по умолчанию: Ложь.
//
// Возвращаемое значение:
//   Произвольный - результат преобразования строки JSON.
//
Функция ИзJSON(СтрокаJSON, ИменаСвойствСоЗначениямиДата = "", ПрочитатьВСоответствие = Ложь) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеОтвета(РезультатЗапроса, ПрочитатьВСоответствие = Ложь) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(РезультатЗапроса.ПолучитьТелоКакПоток());
	РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	ЧтениеJSON.Закрыть();
	Возврат РезультатЧтения;
КонецФункции

Функция РазобратьДанныеОтвета(ДанныеОтвета, АтрибутыРезультата) Экспорт
	РезультатЗапроса = Новый Структура;
	
	Для каждого АтрибутРезультата Из АтрибутыРезультата Цикл
		ЗначениеАтрибута = ДанныеОтвета;
		КлючиРезультата  = СтрРазделить(АтрибутРезультата.Значение, ".");

		Для Каждого КлючРезультата Из КлючиРезультата Цикл
			Если ТипЗнч(ЗначениеАтрибута) = Тип("Структура") Тогда
				Если НЕ ЗначениеАтрибута.Свойство(КлючРезультата, ЗначениеАтрибута) Тогда
					ЗначениеАтрибута = Неопределено;
					Прервать;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЗначениеАтрибута) = Тип("Соответствие") Тогда
				Если ЗначениеАтрибута.Получить(КлючРезультата) <> Неопределено Тогда
					ЗначениеАтрибута = ЗначениеАтрибута.Получить(КлючРезультата);
				Иначе
					ЗначениеАтрибута = Неопределено;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеАтрибута = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатЗапроса.Вставить(АтрибутРезультата.Ключ, ЗначениеАтрибута);
	КонецЦикла;
	
	Возврат РезультатЗапроса;
КонецФункции

Процедура ОбновитьДанныеОбОстатках(НастройкаИнтеграции, ОстаткиТоваров) Экспорт
	
	Для Каждого СтрокаТаблицыЗначений Из ОстаткиТоваров Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицыЗначений.ИдентификаторСклада) Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОстаткиТоваровМаркетплейсов");
			ЭлементБлокировкиДанных.УстановитьЗначение("НастройкаИнтеграции", НастройкаИнтеграции);
			ЭлементБлокировкиДанных.УстановитьЗначение("ИдентификаторТовара", СтрокаТаблицыЗначений.ИдентификаторТовара);
			ЭлементБлокировкиДанных.УстановитьЗначение("Штрихкод",            СтрокаТаблицыЗначений.Штрихкод);
			БлокировкаДанных.Заблокировать();

			НаборЗаписей = РегистрыСведений.ОстаткиТоваровМаркетплейсов.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.НастройкаИнтеграции.Установить(НастройкаИнтеграции);
			НаборЗаписей.Отбор.ИдентификаторТовара.Установить(СтрокаТаблицыЗначений.ИдентификаторТовара);
			НаборЗаписей.Отбор.Штрихкод.Установить(СтрокаТаблицыЗначений.Штрихкод);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				Запись                      = НаборЗаписей[0];
				Запись.Остаток              = СтрокаТаблицыЗначений.Остаток; 
				Запись.ДатаВыгрузкиОстатков = ТекущаяДатаСеанса();
				
			Иначе
				Запись                      = НаборЗаписей.Добавить();  
				Запись.НастройкаИнтеграции  = НастройкаИнтеграции; 
				Запись.ИдентификаторСклада  = СтрокаТаблицыЗначений.ИдентификаторСклада;
				Запись.ИдентификаторТовара  = СтрокаТаблицыЗначений.ИдентификаторТовара;  
				Запись.Штрихкод             = СтрокаТаблицыЗначений.Штрихкод;  
				Запись.Остаток              = СтрокаТаблицыЗначений.Остаток;
				Запись.ДатаВыгрузкиОстатков = ТекущаяДатаСеанса();
			КонецЕсли;
			
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
							
		Исключение
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция НовыйТаблицаОстатковТоваров() Экспорт
	
	МетаданныеРегистр = Метаданные.РегистрыСведений.ОстаткиТоваровМаркетплейсов;

	ТаблицаТовары = Новый ТаблицаЗначений;
	ТаблицаТовары.Колонки.Добавить("ИдентификаторСклада", МетаданныеРегистр.Реквизиты.ИдентификаторСклада.Тип);
	ТаблицаТовары.Колонки.Добавить("ИдентификаторТовара", МетаданныеРегистр.Измерения.ИдентификаторТовара.Тип);
	ТаблицаТовары.Колонки.Добавить("Штрихкод",            МетаданныеРегистр.Измерения.Штрихкод.Тип);
	ТаблицаТовары.Колонки.Добавить("Остаток",             МетаданныеРегистр.Ресурсы.Остаток.Тип);
	
	Возврат ТаблицаТовары;
КонецФункции

Функция НовыйНоменклатураМаркетплейса(ВидМаркетплейса, Владелец) Экспорт
	НоменклатураМаркетплейса = Новый Структура;
	НоменклатураМаркетплейса.Вставить("ВидМаркетплейса", ВидМаркетплейса);
	НоменклатураМаркетплейса.Вставить("Владелец",        Владелец);
	НоменклатураМаркетплейса.Вставить("КодМагазина");
	НоменклатураМаркетплейса.Вставить("Наименование");
	НоменклатураМаркетплейса.Вставить("Артикул");
	НоменклатураМаркетплейса.Вставить("Штрихкоды",       Новый Массив);

	Возврат НоменклатураМаркетплейса;
КонецФункции 

Процедура ДобавитьНоменклатуруВСписок(СписокНоменклатурыМаркетплейса, НоменклатураМаркетплейса) Экспорт
	//НоменклатураКонтрагента              = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента(НоменклатураМаркетплейса.Владелец,);
	НоменклатураКонтрагента              = НоменклатураМаркетплейса.Владелец;
	НоменклатураКонтрагента.Наименование = НоменклатураМаркетплейса.Наименование;
	НоменклатураКонтрагента.Артикул      = НоменклатураМаркетплейса.Артикул;
	
	Штрихкод = "";
	Если НоменклатураМаркетплейса.Штрихкоды.Количество() = 1 Тогда
		Штрихкод = НоменклатураМаркетплейса.Штрихкоды[0];
	КонецЕсли;
	
	ЭтоWildberries = НоменклатураМаркетплейса.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries;
	
	//Если Не ЗначениеЗаполнено(НоменклатураКонтрагента.Наименование)
	//	И Не ЗначениеЗаполнено(НоменклатураКонтрагента.Артикул)
	//	И ЗначениеЗаполнено(Штрихкод) Тогда
	//	
	//	НатуральныйИД = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(ВРег(СтрЗаменить(НоменклатураКонтрагента.Наименование, " ", ""))
	//																		+ "#" + ВРег(СтрЗаменить(НоменклатураКонтрагента.Артикул, " ", ""))
	//																		+ "#" + ВРег(СтрЗаменить(Штрихкод, " ", "")));
	//Иначе
	//	
	//	НатуральныйИД = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(ВРег(СтрЗаменить(НоменклатураКонтрагента.Наименование, " ", ""))
	//																		+ "#" + ВРег(СтрЗаменить(НоменклатураКонтрагента.Артикул, " ", "") + "#"));
	//КонецЕсли;
	
	//Если ЗначениеЗаполнено(НоменклатураМаркетплейса.КодМагазина) Тогда
	//	Если ЭтоWildberries И ЗначениеЗаполнено(Штрихкод) Тогда
	//		НоменклатураКонтрагента.Идентификатор = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(НоменклатураМаркетплейса.КодМагазина + "#" + Штрихкод);
	//	Иначе
	//		НоменклатураКонтрагента.Идентификатор = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(НоменклатураМаркетплейса.КодМагазина);
	//	КонецЕсли;
	//	НоменклатураКонтрагента.ИсторияИдентификаторов.Добавить(НатуральныйИД);
	//Иначе
	//	НоменклатураКонтрагента.Идентификатор = НатуральныйИД;
	//КонецЕсли;
	
	НоменклатураКонтрагента.ШтрихкодКомбинации        = Штрихкод;
	НоменклатураКонтрагента.ШтрихкодыНоменклатуры     = СтрСоединить(НоменклатураМаркетплейса.Штрихкоды, ",");
	НоменклатураКонтрагента.ИдентификаторНоменклатуры = НоменклатураКонтрагента.Идентификатор;
	
	СписокНоменклатурыМаркетплейса.Добавить(НоменклатураКонтрагента);
КонецПроцедуры

Функция ПодготовитьПорцииДляОбмена(ТаблицаТовары, РазмерПорции) Экспорт
	ПакетыВыгрузки = Новый Массив;
	
	ТекущийПакет = -1;
	Для каждого СтрокаТаблицыТовары Из ТаблицаТовары Цикл
		Если ТекущийПакет = -1 
			ИЛИ ПакетыВыгрузки[ТекущийПакет].Количество() = РазмерПорции Тогда
			
			ПакетыВыгрузки.Добавить(Новый Массив);
			ТекущийПакет = ТекущийПакет + 1;
		КонецЕсли;
		ПакетыВыгрузки[ТекущийПакет].Добавить(СтрокаТаблицыТовары);
	КонецЦикла;

	Возврат ПакетыВыгрузки;
КонецФункции 

Процедура ОбработатьРезультатыСопоставления(РезультатыСопоставления, НастройкаИнтеграции) Экспорт
	Если ТипЗнч(НастройкаИнтеграции) = Тип("СправочникСсылка.НастройкиИнтеграцииМаркетплейс") Тогда
		НастройкаИнтеграцииСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаИнтеграции, "Владелец, ВидМаркетплейса");
	Иначе
		НастройкаИнтеграцииСвойства = НастройкаИнтеграции;
	КонецЕсли;
	
	Для каждого РезультатСопоставления Из РезультатыСопоставления Цикл
		РегистрыСведений.НоменклатураМаркетплейсов.ЗаписатьИдентификаторМаркетплейса(
			РезультатСопоставления.НоменклатураИБ.Номенклатура, 
			НастройкаИнтеграцииСвойства.ВидМаркетплейса, 
			РезультатСопоставления.НоменклатураКонтрагента.ИдентификаторНоменклатуры, 
			РезультатСопоставления.НоменклатураКонтрагента.ШтрихкодыНоменклатуры, 
			НастройкаИнтеграцииСвойства.Владелец);
	КонецЦикла;
КонецПроцедуры 

#КонецОбласти

// Получает файл из Интернета по протоколу http(s), либо ftp и сохраняет его по указанному пути на клиенте.
// Недоступно при работе в веб-клиенте. При работе в веб-клиенте необходимо пользоваться аналогичными
// серверными процедурами для скачивания файлов.
//
// Параметры:
//   URL                - Строка - url файла в формате [Протокол://]<Сервер>/<Путь к файлу на сервере>.
//   ПараметрыПолучения - см. ПолучениеФайловИзИнтернетаКлиентСервер.ПараметрыПолученияФайла.
//   ЗаписыватьОшибку   - Булево - признак необходимости записи ошибки в журнал регистрации при получении файла.
//
// Возвращаемое значение:
//   Структура - сведения о полученном файле:
//      * Статус            - Булево - Истина, если файл получен успешно.
//      * Путь              - Строка - путь к файлу на клиенте, ключ используется только если статус Истина.
//      * СообщениеОбОшибке - Строка - сообщение об ошибке, если статус Ложь.
//      * Заголовки         - Соответствие - см. в синтакс-помощнике описание параметра Заголовки объекта HTTPОтвет.
//      * КодСостояния      - Число - добавляется при возникновении ошибки.
//                                    См. в синтакс-помощнике описание параметра КодСостояния объекта HTTPОтвет.
//
Функция СкачатьФайлНаКлиенте(Знач URL, Знач ПараметрыПолучения = Неопределено, Знач ЗаписыватьОшибку = Истина) Экспорт
	
#Если ВебКлиент Тогда
	ВызватьИсключение НСтр("ru = 'Скачивание файлов на клиент недоступно при работе в веб-клиенте.'");
#Иначе
	
	Результат = ПолучениеФайловИзИнтернетаСлужебныйВызовСервера.СкачатьФайл(URL, ПараметрыПолучения, ЗаписыватьОшибку);
	
	Если ПараметрыПолучения <> Неопределено
		И ПараметрыПолучения.ПутьДляСохранения <> Неопределено Тогда
		
		ПутьДляСохранения = ПараметрыПолучения.ПутьДляСохранения;
	Иначе
		ПутьДляСохранения = ПолучитьИмяВременногоФайла(); // АПК:441 Временный файл должен удаляться вызывающим кодом.
	КонецЕсли;
	
	Если Результат.Статус Тогда
		// АПК:1348-выкл ФайловаяСистемаКлиент.СохранитьФайл не используется для совместимости (синхронный вызов).
		ПолучитьФайл(Результат.Путь, ПутьДляСохранения, Ложь); 
		// АПК:1348-вкл
		Результат.Путь = ПутьДляСохранения;
	КонецЕсли;
	
	Возврат Результат;
	
#КонецЕсли
	
КонецФункции

Функция РазобратьДанныеОтчетаВСтруктуру(СсылкаНаФайл, СообщениеОбОшибке, Логирование = Неопределено) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
//	ДлительныеОперации.СообщитьПрогресс(,НСтр("ru = 'Получаем данные отчета'"));
	
	ПараметрыПолучения = ПолучениеФайловИзИнтернетаКлиентСервер.ПараметрыПолученияФайла();
	ПараметрыПолучения.ПутьДляСохранения = ИмяВременногоФайла;
	//РезультатПолучения = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(СсылкаНаФайл, ПараметрыПолучения, Ложь);	
	РезультатПолучения = СкачатьФайлНаКлиенте(СсылкаНаФайл, ПараметрыПолучения);
	//РезультатПолучения = СкачатьФайлНаСервере(СсылкаНаФайл, ПараметрыПолучения);
	//РезультатПолучения = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(СсылкаНаФайл, ПараметрыПолучения);
	//Скачать и разобрать
	
	Если НЕ РезультатПолучения.Статус Тогда
		СообщениеОбОшибке = НСтр("ru = 'Не удалось загрузить файл отчета о продажах. Подробности в журнале регистрации.'");
		
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(
			СтрШаблон("Не удалось загрузить файл отчета о продажах по причине: %1", СообщениеОбОшибке), 
			//Перечисления.ВидыМаркетплейсов.ЯндексМаркет
		);
			
		Возврат Неопределено;
	//Логирование
	Иначе
		//Если ТипЗнч(Логирование) = Тип("Структура") Тогда
		//	Логирование.ИмяФайла = РезультатПолучения.Путь;
		//	РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
		//	Логирование = Неопределено;
		//КонецЕсли;
	//Логирование конец	
	КонецЕсли;
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("ВременныйФайл",   ИмяВременногоФайла);
	ОписаниеФайла.Вставить("ИмяФайла",        "report.xlsx");
	ОписаниеФайла.Вставить("ПолноеИмяФайла",  "report.xlsx");
	ОписаниеФайла.Вставить("РасширениеФайла", "xlsx");
	
	ЗагруженныеФайлы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеФайла);
	
	Возврат ЭлектронноеВзаимодействиеБП.ПолучитьДанныеФайлов(ЗагруженныеФайлы);
	
КонецФункции    

Функция СкачатьФайлНаСервере(Знач URL, ПараметрыПолучения = Неопределено, Знач ЗаписыватьОшибку = Истина) Экспорт
	
	НастройкаСохранения = Новый Соответствие;
	НастройкаСохранения.Вставить("МестоХранения", "Сервер");
	
	Возврат СкачатьФайл(URL,
		ПараметрыПолучения, НастройкаСохранения, ЗаписыватьОшибку);
	//Возврат ПолучениеФайловИзИнтернетаСлужебный.СкачатьФайл(URL,
	//	ПараметрыПолучения, НастройкаСохранения, ЗаписыватьОшибку);
	
КонецФункции
	
// Функция для получения файла из сети Интернет.
//
// Параметры:
//   URL           - Строка - url файла.
//   ПараметрыПолучения   - Структура:
//    * ПутьДляСохранения            - Строка - путь на сервере (включая имя файла), для сохранения скачанного файла.
//    * Пользователь                 - Строка - пользователь от имени которого установлено соединение.
//    * Пароль                       - Строка - пароль пользователя от которого установлено соединение.
//    * Порт                         - Число  - порт сервера с которым установлено соединение.
//    * Таймаут                      - Число  - таймаут на получение файла, в секундах.
//    * ЗащищенноеСоединение         - Булево - для случая http загрузки флаг указывает,
//                                             что соединение должно производиться через https.
//    * ПассивноеСоединение          - Булево - для случая ftp загрузки флаг указывает,
//                                             что соединение должно пассивным (или активным).
//    * Заголовки                    - Соответствие - см. описание параметра Заголовки объекта HTTPЗапрос.
//    * ИспользоватьАутентификациюОС - Булево - см. описание параметра ИспользоватьАутентификациюОС объекта HTTPСоединение.
//    * ПроверятьДоставкуПакетовПриОшибке - см. ПолучениеФайловИзИнтернета.ДиагностикаСоединения.ПроверятьДоставкуПакетов.
//    
//
//   НастройкаСохранения - Соответствие - содержит параметры для сохранения скачанного файла. Ключи:
//                 МестоХранения - Строка - может содержать
//                        "Сервер" - сервер,
//                        "ВременноеХранилище" - временное хранилище.
//                 Путь - строка (необязательный параметр) -
//                        путь к каталогу на клиенте либо на сервере либо адрес во временном хранилище
//                        если не задано будет сгенерировано автоматически.
//   ЗаписыватьОшибку - Булево                     
//
// Возвращаемое значение:
//   Структура:
//      * Статус - Булево
//      * Путь   - Строка
//      * СообщениеОбОшибке - Строка
//      * Заголовки         - Соответствие
//      * КодСостояния      - Число
//
Функция СкачатьФайл(Знач URL, Знач ПараметрыПолучения, Знач НастройкаСохранения, Знач ЗаписыватьОшибку = Истина) Экспорт
	
	НастройкиПолучения = ПолучениеФайловИзИнтернетаКлиентСервер.ПараметрыПолученияФайла();
	Если ПараметрыПолучения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПолучения, ПараметрыПолучения);
	КонецЕсли;
	
	Если НастройкаСохранения.Получить("МестоХранения") <> "ВременноеХранилище" Тогда
		НастройкаСохранения.Вставить("Путь", НастройкиПолучения.ПутьДляСохранения);
	КонецЕсли;
	
	//НастройкаПроксиСервера = ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере();
	НастройкаПроксиСервера = Неопределено;
	
	Перенаправления = Новый Массив;
	
	Возврат ПолучитьФайлИзИнтернет(URL, НастройкаСохранения, НастройкиПолучения,
		НастройкаПроксиСервера, ЗаписыватьОшибку, Перенаправления);
	
КонецФункции

// Функция для получения файла из сети Интернет.
//
// Параметры:
//   URL - Строка - url файла в формате: [Протокол://]<Сервер>/<Путь к файлу на сервере>.
//   
// НастройкаСохранения - соответствие - содержит параметры для сохранения скачанного файла.
//		МестоХранения - строка - может содержать
//			"Сервер" - сервер,
//			"ВременноеХранилище" - временное хранилище.
//		Путь - строка (необязательный параметр) - путь к каталогу на клиенте либо на сервере,
//			либо адрес во временном хранилище,  если не задано будет сгенерировано автоматически.
//
// НастройкаСоединения - Соответствие -
//		ЗащищенноеСоединение* - булево - соединение защищенное.
//		ПассивноеСоединение*  - булево - соединение защищенное.
//		Пользователь - строка - пользователь от имени которого установлено соединение.
//		Пароль       - строка - пароль пользователя от которого установлено соединение.
//		Порт         - число  - порт сервера с которым установлено соединение.
//		ПроверятьДоставкуПакетовПриОшибке - см. ПолучениеФайловИзИнтернета.ДиагностикаСоединения.ПроверятьДоставкуПакетов
//		* - взаимоисключающие ключи.
//
// НастройкиПрокси - Соответствие из КлючИЗначение:
//     * Ключ - Строка
//     * Значение - Произвольный
//    Ключи:
//		# ИспользоватьПрокси - Булево - использовать ли прокси-сервер.
//		# НеИспользоватьПроксиДляЛокальныхАдресов - Булево - использовать ли прокси-сервер для локальных адресов.
//		# ИспользоватьСистемныеНастройки - Булево - использовать ли системные настройки прокси-сервера.
//		# Сервер       - Строка - адрес прокси-сервера.
//		# Порт         - Булево - порт прокси-сервера.
//		# Пользователь - Строка - имя пользователя для авторизации на прокси-сервере.
//		# Пароль       - Строка - пароль пользователя.
//		# ИспользоватьАутентификациюОС - Булево - признак использования аутентификации средствами операционной системы.
//
//
// Возвращаемое значение:
//   Структура:
//      * Статус - Булево
//      * Путь   - Строка
//      * СообщениеОбОшибке - Строка
//      * Заголовки         - Соответствие
//      * КодСостояния      - Число
//
Функция ПолучитьФайлИзИнтернет(Знач URL, Знач НастройкаСохранения, Знач НастройкаСоединения,
	Знач НастройкиПрокси, Знач ЗаписыватьОшибку, Перенаправления = Неопределено)
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	
	Сервер        = СтруктураURI.Хост;
	ПутьНаСервере = СтруктураURI.ПутьНаСервере;
	Протокол      = СтруктураURI.Схема;
	
	Если ПустаяСтрока(Протокол) Тогда 
		Протокол = "http";
	КонецЕсли;
	
	ЗащищенноеСоединение = НастройкаСоединения.ЗащищенноеСоединение;
	ИмяПользователя      = НастройкаСоединения.Пользователь;
	ПарольПользователя   = НастройкаСоединения.Пароль;
	Порт                 = НастройкаСоединения.Порт;
	Таймаут              = НастройкаСоединения.Таймаут;
	ПроверятьДоставкуПакетовПриОшибке = НастройкаСоединения.ПроверятьДоставкуПакетовПриОшибке;
	
	Если (Протокол = "https" Или Протокол = "ftps") И ЗащищенноеСоединение = Неопределено Тогда
		ЗащищенноеСоединение = Истина;
	КонецЕсли;
	
	Если ЗащищенноеСоединение = Истина Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	ИначеЕсли ЗащищенноеСоединение = Ложь Тогда
		ЗащищенноеСоединение = Неопределено;
		// Иначе параметр ЗащищенноеСоединение был задан в явном виде.
	КонецЕсли;
	
	Если Порт = Неопределено Тогда
		Порт = СтруктураURI.Порт;
	КонецЕсли;
	
	Если НастройкиПрокси = Неопределено Тогда 
		Прокси = Неопределено;
	Иначе 
		//Прокси = НовыйИнтернетПрокси(НастройкиПрокси, Протокол);
	КонецЕсли;
	
	Если НастройкаСохранения["Путь"] <> Неопределено Тогда
		ПутьДляСохранения = НастройкаСохранения["Путь"];
	Иначе
		ПутьДляСохранения = ПолучитьИмяВременногоФайла(); // АПК:441 Временный файл должен удаляться вызывающим кодом.
	КонецЕсли;
	
	Если Таймаут = Неопределено Тогда 
		Таймаут = ПолучениеФайловИзИнтернетаКлиентСервер.АвтоматическоеОпределениеТаймаута();
	КонецЕсли;
	
	ИспользуетсяFTPПротокол = (Протокол = "ftp" Или Протокол = "ftps");
	
	Если ИспользуетсяFTPПротокол Тогда
		
		ПассивноеСоединение                       = НастройкаСоединения.ПассивноеСоединение;
		УровеньИспользованияЗащищенногоСоединения = НастройкаСоединения.УровеньИспользованияЗащищенногоСоединения;
		
		Попытка
			
			Если Таймаут = ПолучениеФайловИзИнтернетаКлиентСервер.АвтоматическоеОпределениеТаймаута() Тогда
				
				Соединение = Новый FTPСоединение(
					Сервер, 
					Порт, 
					ИмяПользователя, 
					ПарольПользователя,
					Прокси, 
					ПассивноеСоединение, 
					7, 
					ЗащищенноеСоединение, 
					УровеньИспользованияЗащищенногоСоединения);
				
				РазмерФайла = РазмерФайлаFTP(Соединение, ПутьНаСервере);
				Таймаут = ПолучениеФайловИзИнтернета.ТаймаутЗагрузкиФайла(РазмерФайла);
				
			КонецЕсли;
			
			Соединение = Новый FTPСоединение(
				Сервер, 
				Порт, 
				ИмяПользователя, 
				ПарольПользователя,
				Прокси, 
				ПассивноеСоединение, 
				Таймаут, 
				ЗащищенноеСоединение, 
				УровеньИспользованияЗащищенногоСоединения);
			
			Сервер = Соединение.Сервер;
			Порт   = Соединение.Порт;
			
			Соединение.Получить(ПутьНаСервере, ПутьДляСохранения);
			
		Исключение
			
			РезультатДиагностики = ПолучениеФайловИзИнтернета.ДиагностикаСоединения(URL, ЗаписыватьОшибку, 
				ПроверятьДоставкуПакетовПриОшибке);
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось получить файл %1 с сервера %2:%3
				           |по причине:
				           |%4
				           |Результат диагностики:
				           |%5'"),
				URL, Сервер, Формат(Порт, "ЧГ="),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
				РезультатДиагностики.ОписаниеОшибки);
				
			Если ЗаписыватьОшибку Тогда
				СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1
					           |
					           |Трассировка:
					           |Защищенное соединение: %2
					           |Таймаут: %3'"),
					ТекстОшибки,
					Формат(Соединение.ЗащищенноеСоединение <> Неопределено, НСтр("ru = 'БЛ=Нет; БИ=Да'")),
					Формат(Соединение.Таймаут, "ЧГ=0"));
					
				//ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);
			КонецЕсли;
			
			Возврат РезультатПолученияФайла(Ложь, ТекстОшибки);
			
		КонецПопытки;
		
	Иначе // Используется HTTP протокол.
		
		Заголовки                    = НастройкаСоединения.Заголовки;
		ИспользоватьАутентификациюОС = НастройкаСоединения.ИспользоватьАутентификациюОС;
		
		Попытка
			
			Если Таймаут = ПолучениеФайловИзИнтернетаКлиентСервер.АвтоматическоеОпределениеТаймаута() Тогда
				
				Соединение = Новый HTTPСоединение(
					Сервер, 
					Порт, 
					ИмяПользователя, 
					ПарольПользователя,
					Прокси, 
					7, 
					ЗащищенноеСоединение, 
					ИспользоватьАутентификациюОС);
				
				РазмерФайла = РазмерФайлаHTTP(Соединение, ПутьНаСервере, Заголовки);
				Таймаут = ПолучениеФайловИзИнтернета.ТаймаутЗагрузкиФайла(РазмерФайла);
				
			КонецЕсли;
			
			Соединение = Новый HTTPСоединение(
				Сервер, 
				Порт, 
				ИмяПользователя, 
				ПарольПользователя,
				Прокси, 
				Таймаут, 
				ЗащищенноеСоединение, 
				ИспользоватьАутентификациюОС);
			
			Сервер = Соединение.Сервер;
			Порт   = Соединение.Порт;
			
			ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
			ЗапросHTTP.Заголовки.Вставить("Accept-Charset", "UTF-8");
			ЗапросHTTP.Заголовки.Вставить("X-1C-Request-UID", Строка(Новый УникальныйИдентификатор));
			ОтветHTTP = Соединение.Получить(ЗапросHTTP, ПутьДляСохранения);
			
		Исключение
			
			КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			РезультатДиагностики = ДиагностикаСоединения(URL, ЗаписыватьОшибку,
				ПроверятьДоставкуПакетовПриОшибке, КраткоеПредставлениеОшибки);
			//РезультатДиагностики = ПолучениеФайловИзИнтернета.ДиагностикаСоединения(URL, ЗаписыватьОшибку,
			//	ПроверятьДоставкуПакетовПриОшибке, КраткоеПредставлениеОшибки);
			
			ШаблонОшибки = НСтр("ru = 'Не удалось установить HTTP-соединение с сервером %1:%2
				|по причине:
				|%3
				|
				|Результат диагностики:
				|%4'");
			
			ПредставленияПеренаправлений = ПредставленияПеренаправлений(Перенаправления);
			Если Не ПустаяСтрока(ПредставленияПеренаправлений) Тогда
				ШаблонОшибки = ШаблонОшибки + Символы.ПС + Символы.ПС + ПредставленияПеренаправлений;
			КонецЕсли;
			
			Если ЗаписыватьОшибку Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки,
					Сервер, Формат(Порт, "ЧГ="),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
					РезультатДиагностики.ОписаниеОшибки);
				//ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
			КонецЕсли;
				
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки,
				Сервер, Формат(Порт, "ЧГ="),
				КраткоеПредставлениеОшибки,
				РезультатДиагностики.ОписаниеОшибки);
			Возврат РезультатПолученияФайла(Ложь, ТекстОшибки);
			
		КонецПопытки;
		
		Попытка
			
			Если ОтветHTTP.КодСостояния = 301 // 301 Moved Permanently
				Или ОтветHTTP.КодСостояния = 302 // 302 Found, 302 Moved Temporarily
				Или ОтветHTTP.КодСостояния = 303 // 303 See Other by GET
				Или ОтветHTTP.КодСостояния = 307 // 307 Temporary Redirect
				Или ОтветHTTP.КодСостояния = 308 Тогда // 308 Permanent Redirect
				
				Если Перенаправления.Количество() > 7 Тогда
					ВызватьИсключение(НСтр("ru = 'Превышено количество перенаправлений.'"), КатегорияОшибки.ОшибкаСети);
				КонецЕсли;
					
				НовыйURL = СтандартныеПодсистемыСервер.HTTPЗаголовкиВНижнийРегистр(ОтветHTTP.Заголовки)["location"];
				Если НовыйURL = Неопределено Тогда 
					ВызватьИсключение(НСтр("ru = 'Некорректное перенаправление, отсутствует HTTP-заголовок ответа ""Location"".'"),
						КатегорияОшибки.ОшибкаСети);
				КонецЕсли;
				
				НовыйURL = СокрЛП(НовыйURL);
				Если ПустаяСтрока(НовыйURL) Тогда
					ВызватьИсключение(НСтр("ru = 'Некорректное перенаправление, пустой HTTP-заголовок ответа ""Location"".'"),
						КатегорияОшибки.ОшибкаСети);
				КонецЕсли;
				
				Если Перенаправления.Найти(НовыйURL) <> Неопределено Тогда
					ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Циклическое перенаправление.
									|Попытка перейти на %1 уже выполнялась ранее.'"),
						НовыйURL),
						КатегорияОшибки.ОшибкаСети);
				КонецЕсли;
				
				Перенаправления.Добавить(URL);
				Если Не СтрНачинаетсяС(НовыйURL, "http") Тогда
					// <схема>://<хост>:<порт>/<путь>
					НовыйURL = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"%1://%2:%3/%4", Протокол, Сервер, Формат(Порт, "ЧГ="), НовыйURL);
				КонецЕсли;
				
				Возврат ПолучитьФайлИзИнтернет(НовыйURL, НастройкаСохранения, НастройкаСоединения,
					НастройкиПрокси, ЗаписыватьОшибку, Перенаправления);
				
			КонецЕсли;
			
			Если ОтветHTTP.КодСостояния < 200 Или ОтветHTTP.КодСостояния >= 300 Тогда
				
				Если ОтветHTTP.КодСостояния = 304 Тогда
					
					HTTPЗаголовки = СтандартныеПодсистемыСервер.HTTPЗаголовкиВНижнийРегистр(ЗапросHTTP.Заголовки);
					Если (HTTPЗаголовки["if-modified-since"] <> Неопределено Или HTTPЗаголовки["if-none-match"] <> Неопределено) Тогда
						ЗаписыватьОшибку = Ложь;
					КонецЕсли;
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Интернет-сервер убежден, что с вашего последнего запроса его ответ не изменился:
						           |%1'"),
						РасшифровкаКодаСостоянияHTTP(ОтветHTTP.КодСостояния));
					
					ДописатьТелоОтветаСервера(ПутьДляСохранения, ТекстОшибки);
					ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаСети);
					
				ИначеЕсли ОтветHTTP.КодСостояния < 200
					Или ОтветHTTP.КодСостояния >= 300 И ОтветHTTP.КодСостояния < 400 Тогда
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Неподдерживаемый ответ интернет-сервера:
						           |%1'"),
						РасшифровкаКодаСостоянияHTTP(ОтветHTTP.КодСостояния));
					
					ДописатьТелоОтветаСервера(ПутьДляСохранения, ТекстОшибки);
					ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаСети);
					
				ИначеЕсли ОтветHTTP.КодСостояния >= 400 И ОтветHTTP.КодСостояния < 500 Тогда 
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Интернет-сервер не смог выполнить запрос:
						           |%1'"),
						РасшифровкаКодаСостоянияHTTP(ОтветHTTP.КодСостояния));
					
					ДописатьТелоОтветаСервера(ПутьДляСохранения, ТекстОшибки);
					ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаСети);
					
				Иначе 
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Интернет-сервер перегружен, временно отключен или находится на техобслуживании:
						           |%1'"),
						РасшифровкаКодаСостоянияHTTP(ОтветHTTP.КодСостояния));
					
					ДописатьТелоОтветаСервера(ПутьДляСохранения, ТекстОшибки);
					ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаСети);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			
			ШаблонОшибки = НСтр("ru = 'Не удалось получить файл %1 с сервера %2:%3
				|по причине:
				|%4'");
			
			ПредставленияПеренаправлений = ПредставленияПеренаправлений(Перенаправления);
			Если Не ПустаяСтрока(ПредставленияПеренаправлений) Тогда
				ШаблонОшибки = ШаблонОшибки + Символы.ПС + Символы.ПС + ПредставленияПеренаправлений;
			КонецЕсли;
				
			Если ЗаписыватьОшибку Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки,
					URL, Сервер, Формат(Порт, "ЧГ="),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1
					           |
					           |Трассировка:
					           |Защищенное соединение: %2
					           |Таймаут: %3
					           |Аутентификация ОС: %4'"),
					ТекстОшибки,
					Формат(Соединение.ЗащищенноеСоединение <> Неопределено, НСтр("ru = 'БЛ=Нет; БИ=Да'")),
					Формат(Соединение.Таймаут, "ЧГ=0"),
					Формат(Соединение.ИспользоватьАутентификациюОС, НСтр("ru = 'БЛ=Нет; БИ=Да'")));
				
				ДописатьЗаголовкиHTTP(ЗапросHTTP, СообщениеОбОшибке);
				ДописатьЗаголовкиHTTP(ОтветHTTP, СообщениеОбОшибке);
				
				//ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);
			КонецЕсли;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки,
				URL, Сервер, Формат(Порт, "ЧГ="),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Возврат РезультатПолученияФайла(Ложь, ТекстОшибки, ОтветHTTP);
			
		КонецПопытки;
		
	КонецЕсли;
	
	// Если сохраняем файл в соответствии с настройкой.
	Если НастройкаСохранения["МестоХранения"] = "ВременноеХранилище" Тогда
		КлючУникальности = Новый УникальныйИдентификатор;
		Адрес = ПоместитьВоВременноеХранилище (Новый ДвоичныеДанные(ПутьДляСохранения), КлючУникальности);
		Возврат РезультатПолученияФайла(Истина, Адрес, ОтветHTTP);
	ИначеЕсли НастройкаСохранения["МестоХранения"] = "Сервер" Тогда
		Возврат РезультатПолученияФайла(Истина, ПутьДляСохранения, ОтветHTTP);
	Иначе
		ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не указано место для сохранения файла при вызове %1.'"), "ПолучитьФайлИзИнтернет"),
			КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
КонецФункции

// Параметры:
//   Статус - Булево - успех или неуспех операции.
//   СообщениеПуть - Строка
//   HTTPОтвет - HTTPОтвет
//
// Возвращаемое значение:
//   Структура:
//      * Статус - Булево
//      * Путь   - Строка
//      * СообщениеОбОшибке - Строка
//      * Заголовки         - Соответствие
//      * КодСостояния      - Число
//
Функция РезультатПолученияФайла(Знач Статус, Знач СообщениеПуть, HTTPОтвет = Неопределено)
	
	Результат = Новый Структура("Статус", Статус);
	
	Если Статус Тогда
		Результат.Вставить("Путь", СообщениеПуть);
	Иначе
		Результат.Вставить("СообщениеОбОшибке", СообщениеПуть);
		Результат.Вставить("КодСостояния", 1);
	КонецЕсли;
	
	Если HTTPОтвет <> Неопределено Тогда
		ЗаголовкиОтвета = HTTPОтвет.Заголовки;
		Если ЗаголовкиОтвета <> Неопределено Тогда
			Результат.Вставить("Заголовки", ЗаголовкиОтвета);
		КонецЕсли;
		
		Результат.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазмерФайлаHTTP(СоединениеHTTP, Знач ПутьНаСервере, Знач Заголовки = Неопределено)
	
	ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	Попытка
		ПолученныеЗаголовки = СоединениеHTTP.ПолучитьЗаголовки(ЗапросHTTP);// HEAD
	Исключение
		Возврат 0;
	КонецПопытки;
	РазмерСтрокой = СтандартныеПодсистемыСервер.HTTPЗаголовкиВНижнийРегистр(ПолученныеЗаголовки.Заголовки)["content-length"];
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	РазмерФайла = ТипЧисло.ПривестиЗначение(РазмерСтрокой);
	
	Возврат РазмерФайла;
	
КонецФункции

Функция РазмерФайлаFTP(СоединениеFTP, Знач ПутьНаСервере)
	
	РазмерФайла = 0;
	
	Попытка
		НайденныеФайлы = СоединениеFTP.НайтиФайлы(ПутьНаСервере);
		Если НайденныеФайлы.Количество() > 0 Тогда
			РазмерФайла = НайденныеФайлы[0].Размер();
		КонецЕсли;
	Исключение
		РазмерФайла = 0;
	КонецПопытки;
	
	Возврат РазмерФайла;
	
КонецФункции

Функция ПредставленияПеренаправлений(Перенаправления)
	
	Если Перенаправления.Количество() = 0 Тогда 
		Возврат "";
	КонецЕсли;

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выполненные перенаправления (%1):
					|%2'"),
		Перенаправления.Количество(),
		СтрСоединить(Перенаправления, Символы.ПС));

КонецФункции

Процедура ДописатьТелоОтветаСервера(ПутьКФайлу, ТекстОшибки)
	
	ТелоОтветаСервера = ТекстИзHTMLИзФайла(ПутьКФайлу);
	
	Если Не ПустаяСтрока(ТелоОтветаСервера) Тогда 
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			           |
			           |Сообщение от интернет-сервера:
			           |%2'"),
			ТекстОшибки,
			ТелоОтветаСервера);
	КонецЕсли;
	
КонецПроцедуры

Функция РасшифровкаКодаСостоянияHTTP(КодСостояния)
	
	Если КодСостояния = 304 Тогда // Not Modified
		Расшифровка = НСтр("ru = 'Нет необходимости повторно передавать запрошенные ресурсы.'");
	ИначеЕсли КодСостояния = 400 Тогда // Bad Request
		Расшифровка = НСтр("ru = 'Запрос не может быть исполнен.'");
	ИначеЕсли КодСостояния = 401 Тогда // Unauthorized
		Расшифровка = НСтр("ru = 'Попытка авторизации на сервере была отклонена.'");
	ИначеЕсли КодСостояния = 402 Тогда // Payment Required
		Расшифровка = НСтр("ru = 'Требуется оплата.'");
	ИначеЕсли КодСостояния = 403 Тогда // Forbidden
		Расшифровка = НСтр("ru = 'К запрашиваемому ресурсу нет доступа.'");
	ИначеЕсли КодСостояния = 404 Тогда // Not Found
		Расшифровка = НСтр("ru = 'Запрашиваемый ресурс не существует на сервере.'");
	ИначеЕсли КодСостояния = 405 Тогда // Method Not Allowed
		Расшифровка = НСтр("ru = 'Метод запроса не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 406 Тогда // Not Acceptable
		Расшифровка = НСтр("ru = 'Запрошенный формат данных не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 407 Тогда // Proxy Authentication Required
		Расшифровка = НСтр("ru = 'Ошибка аутентификации на прокси-сервере'");
	ИначеЕсли КодСостояния = 408 Тогда // Request Timeout
		Расшифровка = НСтр("ru = 'Время ожидания сервером передачи от клиента истекло.'");
	ИначеЕсли КодСостояния = 409 Тогда // Conflict
		Расшифровка = НСтр("ru = 'Запрос не может быть выполнен из-за конфликтного обращения к ресурсу.'");
	ИначеЕсли КодСостояния = 410 Тогда // Gone
		Расшифровка = НСтр("ru = 'Ресурс на сервере был перемещен.'");
	ИначеЕсли КодСостояния = 411 Тогда // Length Required
		Расшифровка = НСтр("ru = 'Сервер требует указание ""Content-length."" в заголовке запроса.'");
	ИначеЕсли КодСостояния = 412 Тогда // Precondition Failed
		Расшифровка = НСтр("ru = 'Запрос не применим к ресурсу'");
	ИначеЕсли КодСостояния = 413 Тогда // Request Entity Too Large
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком большой объем передаваемых данных.'");
	ИначеЕсли КодСостояния = 414 Тогда // Request-URL Too Long
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком длинный URL.'");
	ИначеЕсли КодСостояния = 415 Тогда // Unsupported Media-Type
		Расшифровка = НСтр("ru = 'Сервер заметил, что часть запроса была сделана в неподдерживаемом формат'");
	ИначеЕсли КодСостояния = 416 Тогда // Requested Range Not Satisfiable
		Расшифровка = НСтр("ru = 'Часть запрашиваемого ресурса не может быть предоставлена'");
	ИначеЕсли КодСостояния = 417 Тогда // Expectation Failed
		Расшифровка = НСтр("ru = 'Сервер не может предоставить ответ на указанный запрос.'");
	ИначеЕсли КодСостояния = 429 Тогда // Too Many Requests
		Расшифровка = НСтр("ru = 'Слишком много запросов за короткое время.'");
	ИначеЕсли КодСостояния = 500 Тогда // Internal Server Error
		Расшифровка = НСтр("ru = 'Внутренняя ошибка интернет-сервера.'");
	ИначеЕсли КодСостояния = 501 Тогда // Not Implemented
		Расшифровка = НСтр("ru = 'Сервер не поддерживает метод запроса.'");
	ИначеЕсли КодСостояния = 502 Тогда // Bad Gateway
		Расшифровка = НСтр("ru = 'Сервер, выступая в роли шлюза или прокси-сервера, 
		                         |получил недействительное ответное сообщение от вышестоящего сервера.'");
	ИначеЕсли КодСостояния = 503 Тогда // Server Unavailable
		Расшифровка = НСтр("ru = 'Сервер временно недоступен.'");
	ИначеЕсли КодСостояния = 504 Тогда // Gateway Timeout
		Расшифровка = НСтр("ru = 'Сервер в роли шлюза или прокси-сервера 
		                         |не дождался ответа от вышестоящего сервера для завершения текущего запроса.'");
	ИначеЕсли КодСостояния = 505 Тогда // HTTP Version Not Supported
		Расшифровка = НСтр("ru = 'Сервер не поддерживает указанную в запросе версию протокола HTTP'");
	ИначеЕсли КодСостояния = 506 Тогда // Variant Also Negotiates
		Расшифровка = НСтр("ru = 'Сервер настроен некорректно, и не способен обработать запрос.'");
	ИначеЕсли КодСостояния = 507 Тогда // Insufficient Storage
		Расшифровка = НСтр("ru = 'На сервере недостаточно места для выполнения запроса.'");
	ИначеЕсли КодСостояния = 509 Тогда // Bandwidth Limit Exceeded
		Расшифровка = НСтр("ru = 'Сервер превысил отведенное ограничение на потребление трафика.'");
	ИначеЕсли КодСостояния = 510 Тогда // Not Extended
		Расшифровка = НСтр("ru = 'Сервер требует больше информации о совершаемом запросе.'");
	ИначеЕсли КодСостояния = 511 Тогда // Network Authentication Required
		Расшифровка = НСтр("ru = 'Требуется авторизация на сервере.'");
	Иначе 
		Расшифровка = НСтр("ru = '<Неизвестный код состояния>.'");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '[%1] %2'"), 
		КодСостояния, 
		Расшифровка);
	
КонецФункции

Процедура ДописатьЗаголовкиHTTP(Объект, ТекстОшибки)
	
	Если ТипЗнч(Объект) = Тип("HTTPЗапрос") Тогда 
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			           |
			           |HTTP запрос:
			           |Адрес ресурса: %2
			           |Заголовки: %3'"),
			ТекстОшибки,
			Объект.АдресРесурса,
			ПредставлениеЗаголовковHTTP(Объект.Заголовки));
	ИначеЕсли ТипЗнч(Объект) = Тип("HTTPОтвет") Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			           |
			           |HTTP ответ:
			           |Код ответа: %2
			           |Заголовки: %3'"),
			ТекстОшибки,
			Объект.КодСостояния,
			ПредставлениеЗаголовковHTTP(Объект.Заголовки));
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстИзHTMLИзФайла(ПутьКФайлу)
	
	ФайлОтвета = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ИсходныйТекст = ФайлОтвета.Прочитать(1024 * 15);
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ИсходныйТекст);
	ФайлОтвета.Закрыть();
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПредставлениеЗаголовковHTTP(Заголовки)
	
	ПредставлениеЗаголовков = "";
	
	Для каждого Заголовок Из Заголовки Цикл 
		ПредставлениеЗаголовков = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			           |%2: %3'"), 
			ПредставлениеЗаголовков,
			Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;
		
	Возврат ПредставлениеЗаголовков;
	
КонецФункции

// Запускает диагностику сетевого ресурса.
// В модели сервиса возвращается только описание ошибки.
//
// Параметры:
//  URL - Строка - адрес URL ресурса, диагностику которого надо выполнить.
//  ЗаписыватьОшибку - Булево - признак необходимости записи ошибок в журнал регистрации.
//  ПроверятьДоставкуПакетов - Булево - включать в диагностику команду PING к требуемому ресурсу URL.
//  ТекстОшибки - Строка - исходный текст исключения.
//
// Возвращаемое значение:
//  Структура:
//    *  ОписаниеОшибки    - Строка - краткое описание ошибки.
//    *  ЖурналДиагностики - Строка - подробный журнал диагностики с техническими подробностями.
//
// Пример:
//	// Диагностика веб-сервиса адресного классификатора.
//	Результат = ПолучениеФайловИзИнтернета.ДиагностикаСоединения("https://api.orgaddress.1c.com/orgaddress/v1?wsdl");
//	
//	ОписаниеОшибки    = Результат.ОписаниеОшибки;
//	ЖурналДиагностики = Результат.ЖурналДиагностики;
//
Функция ДиагностикаСоединения(URL, ЗаписыватьОшибку = Истина, ПроверятьДоставкуПакетов = Истина, ТекстОшибки = "") Экспорт
	
	Описание = Новый Массив;
	Описание.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'При обращении по URL: %1'"), 
		URL));
	Описание.Добавить(ПолучениеФайловИзИнтернетаСлужебный.ПредставлениеМестаДиагностики());
	
	СтруктураСсылки = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	
	Если Не ПустаяСтрока(ТекстОшибки)
		И СтрНайти(ВРег(ТекстОшибки), ВРег("Удаленный узел не прошел проверку")) > 0 Тогда // АПК:1297 Нелокализуемый фрагмент информации об ошибке в исключении.
		
		Описание.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Необходимо установить корневой и промежуточные сертификаты к %1 на компьютере <%2>.'"),
			СтруктураСсылки.ИмяСервера,
			ИмяКомпьютера()));
		
		ПолучениеФайловИзИнтернетаЛокализация.ПриФормированииСообщенияОбИзвестнойПроблеме(Описание, ТекстОшибки);
		
		ОписаниеОшибки = СтрСоединить(Описание, Символы.ПС);
		
		Результат = Новый Структура;
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		Результат.Вставить("ЖурналДиагностики", "");
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Описание.Добавить(НСтр("ru = 'Обратитесь к администратору.'"));
		
		ПолучениеФайловИзИнтернетаЛокализация.ПриФормированииСообщенияОбИзвестнойПроблеме(Описание, ТекстОшибки);
		
		ОписаниеОшибки = СтрСоединить(Описание, Символы.ПС);
		
		Результат = Новый Структура;
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		Результат.Вставить("ЖурналДиагностики", "");
		
		Возврат Результат;
	КонецЕсли;
	
	Журнал = Новый Массив;
	Если ПроверятьДоставкуПакетов Тогда
		Журнал.Добавить(
			НСтр("ru = 'Журнал диагностики:
			           |Выполняется проверка доступности сервера.
			           |Описание диагностируемой ошибки см. в следующем сообщении журнала.'"));
	Иначе
		Журнал.Добавить(
			НСтр("ru = 'Журнал диагностики:
			           |Выполняется проверка доступности контрольного сервера.
			           |Описание диагностируемой ошибки см. в следующем сообщении журнала.'"));
	КонецЕсли;
	Журнал.Добавить();
	
	СостояниеНастроекПрокси = ПолучениеФайловИзИнтернетаСлужебный.СостояниеНастроекПрокси(СтруктураСсылки.Схема);
	СоединениеЧерезПрокси = СостояниеНастроекПрокси.СоединениеЧерезПрокси;
	Журнал.Добавить(СостояниеНастроекПрокси.Представление);
	
	Если СоединениеЧерезПрокси И Не СостояниеНастроекПрокси.ИспользуютсяСистемныеНастройкиПрокси Тогда 
		
		Описание.Добавить(
			НСтр("ru = 'Диагностика соединения не выполнена, т.к. настроен прокси-сервер.
			           |Обратитесь к администратору.'"));
		
	Иначе 
		
		АдресСервераРесурса = СтруктураСсылки.Хост;
		АдресСервераКонтрольнойПроверки = "google.com";
		
		Если Метаданные.ОбщиеМодули.Найти("ПолучениеФайловИзИнтернетаСлужебныйЛокализация") <> Неопределено Тогда
			МодульПолучениеФайловИзИнтернетаСлужебныйЛокализация = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернетаСлужебныйЛокализация");
			АдресСервераКонтрольнойПроверки = МодульПолучениеФайловИзИнтернетаСлужебныйЛокализация.АдресСервераКонтрольнойПроверки();
		КонецЕсли;
		
		Если ПроверятьДоставкуПакетов Тогда
			РезультатДоступностиРесурса = ПолучениеФайловИзИнтернетаСлужебный.ПроверитьДоступностьСервера(АдресСервераРесурса);
			
			Журнал.Добавить();
			Журнал.Добавить("1) " + РезультатДоступностиРесурса.ЖурналДиагностики);
		
			Если РезультатДоступностиРесурса.Доступен Тогда 
				
				Описание.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Выполнено обращение к несуществующему ресурсу на сервере %1
					           |или возникли неполадки на удаленном сервере.'"),
					АдресСервераРесурса));
				
			Иначе 
				
				РезультатКонтрольнойПроверки = ПолучениеФайловИзИнтернетаСлужебный.ПроверитьДоступностьСервера(АдресСервераКонтрольнойПроверки);
				Журнал.Добавить("2) " + РезультатКонтрольнойПроверки.ЖурналДиагностики);
				
				Если Не РезультатКонтрольнойПроверки.Доступен Тогда
					
					Описание.Добавить(
						НСтр("ru = 'Отсутствует доступ в сеть интернет по причине:
						           |- компьютер не подключен к интернету;
						           |- неполадки у интернет-провайдера;
						           |- подключение к интернету блокирует межсетевой экран, 
						           |  антивирус или другое программное обеспечение.'"));
					
				Иначе 
					
					Описание.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Сервер %1 недоступен по причине:
						           |- неполадки у интернет-провайдера;
						           |- подключение к серверу блокирует межсетевой экран, 
						           |  антивирус или другое программное обеспечение;
						           |- сервер отключен или на техническом обслуживании.'"),
						АдресСервераРесурса));
					
					ЖурналТрассировки = ПолучениеФайловИзИнтернетаСлужебный.ЖурналТрассировкиМаршрутаСервера(АдресСервераРесурса);
					Журнал.Добавить("3) " + ЖурналТрассировки);
					
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			РезультатКонтрольнойПроверки = ПолучениеФайловИзИнтернетаСлужебный.ПроверитьДоступностьСервера(АдресСервераКонтрольнойПроверки);
				Журнал.Добавить("1) " + РезультатКонтрольнойПроверки.ЖурналДиагностики);
				
				Если Не РезультатКонтрольнойПроверки.Доступен Тогда
					
					Описание.Добавить(
						НСтр("ru = 'Отсутствует доступ в сеть интернет по причине:
						           |- компьютер не подключен к интернету;
						           |- неполадки у интернет-провайдера;
						           |- подключение к интернету блокирует межсетевой экран, 
						           |  антивирус или другое программное обеспечение.'"));
					
				Иначе 
					
					Описание.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Сервер %1 недоступен по причине:
						           |- неполадки у интернет-провайдера;
						           |- подключение к серверу блокирует межсетевой экран, 
						           |  антивирус или другое программное обеспечение;
						           |- сервер отключен или на техническом обслуживании.'"),
						АдресСервераРесурса));
					
					ЖурналТрассировки = ПолучениеФайловИзИнтернетаСлужебный.ЖурналТрассировкиМаршрутаСервера(АдресСервераРесурса);
					Журнал.Добавить("2) " + ЖурналТрассировки);
					
				КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПолучениеФайловИзИнтернетаЛокализация.ПриФормированииСообщенияОбИзвестнойПроблеме(Описание, ТекстОшибки);
	
	ОписаниеОшибки = СтрСоединить(Описание, Символы.ПС);
	
	Журнал.Вставить(0);
	Журнал.Вставить(0, ОписаниеОшибки);
	
	ЖурналДиагностики = СтрСоединить(Журнал, Символы.ПС);
	
	Если ЗаписыватьОшибку Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Диагностика соединения'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ЖурналДиагностики);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	Результат.Вставить("ЖурналДиагностики", ЖурналДиагностики);
	
	Возврат Результат;
	
КонецФункции

