&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция"));
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(ДокументОбъект, ЭтаФорма);
	Иначе
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект);
	КонецЕсли;
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

////////(1) Процедуры и функции ТЧ Заказы///////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаказыНомерЗаданияПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Заказы.ТекущиеДанные;
	Данные = ПолучитьДанныеСтрокиПоЗаявке(ДанныеСтроки.НомерЗадания);
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, Данные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтрокиПоЗаявке(Заявка)
	
	Данные = Новый Структура("Контрагент, СуммаДокумента, ТранспортныйМаршрут", Справочники.Контрагенты.ПустаяСсылка(), 0, Документы.абс_ТранспортныйМаршрут.ПустаяСсылка());
	Если НЕ Заявка.Пустая() Тогда
		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ
                       |	абс_ЗаявкаНаТранспорт.Ссылка
                       |ПОМЕСТИТЬ ВТЗаявка
                       |ИЗ
                       |	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
                       |ГДЕ
                       |	абс_ЗаявкаНаТранспорт.Ссылка = &Ссылка
                       |;
                       |
                       |////////////////////////////////////////////////////////////////////////////////
                       |ВЫБРАТЬ ПЕРВЫЕ 1
                       |	абс_ТранспортныйМаршрутЗадания.Ссылка
                       |ПОМЕСТИТЬ ТранспортныйМаршрут
                       |ИЗ
                       |	ВТЗаявка КАК ВТЗаявка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
                       |		ПО ВТЗаявка.Ссылка = абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт
                       |
                       |УПОРЯДОЧИТЬ ПО
                       |	абс_ТранспортныйМаршрутЗадания.Ссылка.МоментВремени УБЫВ
                       |;
                       |
                       |////////////////////////////////////////////////////////////////////////////////
                       |ВЫБРАТЬ
                       |	ВТЗаявка.Ссылка.Контрагент КАК Контрагент,
                       |	СУММА(ЕСТЬNULL(абс_ЗаявкаНаТранспортТовары.Сумма, 0)) КАК СуммаДокумента,
                       |	ТранспортныйМаршрут.Ссылка КАК ТранспортныйМаршрут
                       |ИЗ
                       |	ВТЗаявка КАК ВТЗаявка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗаявкаНаТранспорт.Товары КАК абс_ЗаявкаНаТранспортТовары
                       |		ПО ВТЗаявка.Ссылка = абс_ЗаявкаНаТранспортТовары.Ссылка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныйМаршрут КАК ТранспортныйМаршрут
                       |		ПО (ИСТИНА)
                       |
                       |СГРУППИРОВАТЬ ПО
                       |	ВТЗаявка.Ссылка.Контрагент,
                       |	ТранспортныйМаршрут.Ссылка";
		
		Запрос.Параметры.Вставить("Ссылка", Заявка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура РаспределитьРасходы(Команда)
	
	РаспределитьРасходыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьРасходыНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция"));
	ДокументОбъект.РаспределитьРасходы();	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТранспортномуМаршруту(Команда)
	абс_Транспортныймаршрут = ОткрытьФормуМодально("Документ.абс_ТранспортныйМаршрут.ФормаВыбора");
	Если Не абс_Транспортныймаршрут = Неопределено Тогда
		ЗаполнитьПоМаршрутуНаСервере(абс_Транспортныймаршрут);
	КонецЕСлИ;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоМаршрутуНаСервере(ТранспортныйМаршрут)
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт
	//	|ИЗ
	//	|	Документ.абс_СводнаяЗаявкаНаТранспорт.Маршруты КАК абс_СводнаяЗаявкаНаТранспортМаршруты
	//	|ГДЕ
	//	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = &ТранспортныйМаршрут";  
	//Запрос.УстановитьПараметр("ТранспортныйМаршрут", ТранспортныйМаршрут); 
	//Результат = Запрос.Выполнить();     
	//ВыборкаДетальныеЗаписи = Результат.Выбрать(); 
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	СтрокиСМаршрутом = Объект.Заказы.НайтиСтроки(Новый Структура("НомерЗадания", ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт));
	//	Если СтрокиСМаршрутом.Количество() = 0 Тогда
	//		НоваяСтрока = Объект.Заказы.Добавить();
	//		НоваяСтрока.НомерЗадания = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт;
	//		НоваяСтрока.Контрагент = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт.Контрагент;
	//		НоваяСтрока.СуммаДокумента = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт.СуммаДокумента;
	//		НоваяСтрока.ТранспортныйМаршрут = ТранспортныйМаршрут;
	//	КонецЕСлИ;	
	//КонецЦикла;
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.Заполнить(ТранспортныйМаршрут);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

// << Горбунов, пересчитаем процент
&НаКлиенте
Процедура ЗаказыРасходыПриИзменении(Элемент)
	Элементы.Заказы.ТекущиеДанные.Доля = Окр(Элементы.Заказы.ТекущиеДанные.Расходы/Объект.СуммаСчетаТК*100);
КонецПроцедуры
// >> Горбунов

//\\\\\\\\\КОНЕЦ (1)\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
