Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб=Истина;
	
    
	
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	Макет = Документы.Лео_РасчетСебестоимостиПродукции.ПолучитьМакет("Макет");
	
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Обл_Производственные = Макет.ПолучитьОбласть("Обл_Производственные");
	
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	ТабДокумент.Вывести(Обл_Производственные);

	
	////вывод реквизитов шапки
	//ЗапросПоШапке = Новый Запрос;
	//ЗапросПоШапке.Текст = 
	//"ВЫБРАТЬ
	//|	абс_ТранспортныйМаршрут.Номер КАК НомерМаршрута,
	//|	абс_ТранспортныйМаршрут.Дата КАК ДатаМаршрута,
	//|	абс_ТранспортныйМаршрут.ВодительЭкспедитор КАК Водитель,
	//|	абс_ТранспортныйМаршрут.ТранспортноеСредство.Марка КАК МаркаТС,
	//|	абс_ТранспортныйМаршрут.ТранспортноеСредство.ГосНомер КАК ГосНомер,
	//|	абс_ТранспортныйМаршрут.ТКПеревозчик КАК ТранспортнаяКомпания
	//|ИЗ
	//|	Документ.абс_ТранспортныйМаршрут КАК абс_ТранспортныйМаршрут
	//|ГДЕ
	//|	абс_ТранспортныйМаршрут.Ссылка = &Ссылка";
	//ЗапросПоШапке.УстановитьПараметр("Ссылка",МаршрутСсылка);
	//
	//Шапка = ЗапросПоШапке.Выполнить().Выбрать();
	//
	//ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	//
	//Если Шапка.Следующий() Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Шапка);
	//	ТабДокумент.Вывести(ОбластьШапка);
	//	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	//Иначе 
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//вывод табличной части
	//ОбластьСтрокаТабЧасти = Макет.ПолучитьОбласть("СтрокаТабЧасти");
	//
	//ЗапросПоТабЧасти = Новый Запрос;
	//ЗапросПоТабЧасти.Текст =
    //{Лео Катанович}
	// БЫЛО
	//"ВЫБРАТЬ
	//|	Задания.ЗаявкаНаТранспорт.СуммаДокумента КАК СуммаДокумента,
	//|	Задания.ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
	//|	Задания.ЗаявкаНаТранспорт.АдресКонтрагента КАК АдресКонтрагента,
	//|	Задания.ЗаявкаНаТранспорт.ЗаказПокупателя.Номер КАК НомерЗаявки,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоВес КАК ВесБрутто,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоОбъем КАК Объем,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК КоличествоПалет,
	//|	Задания.ЗаявкаНаТранспорт.Склад КАК Склад,
	//|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.СпособДоставки КАК СпособДоставки,
	//|	Задания.ЗаявкаНаТранспорт.ОтветственныйМенеджер КАК Менеджер,
	//|	Задания.ЗаявкаНаТранспорт.КонтактыОтветственногоМенеджера КАК КонтактыМенеджера,
	//|	ВЫРАЗИТЬ(Задания.ЗаявкаНаТранспорт.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	//|	Задания.ЗаявкаНаТранспорт.ТКНазначения КАК ТКНазначения,
	//|	Задания.ЗаявкаНаТранспорт.АдресПромежуточный КАК АдресДоставки,
	//|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.УсловиеДоставки КАК УсловияДоставки,
	//|	Задания.ЗаявкаНаТранспорт.Контрагент,
	//|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Телефон
	//|ИЗ
	//|	Документ.абс_ТранспортныйМаршрут.Задания КАК Задания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|		ПО Задания.ЗаявкаНаТранспорт.Контрагент = КонтактнаяИнформация.Объект
	//|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	//|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	//|ГДЕ
	//|	Задания.Ссылка = &Ссылка
	//|ИТОГИ
	//|	СУММА(СуммаДокумента),
	//|	СУММА(ВесБрутто),
	//|	СУММА(Объем),
	//|	СУММА(КоличествоПалет)
	//|ПО
	//|	ОБЩИЕ";
	
	// Изменено	
	
	//"ВЫБРАТЬ
	//|	Задания.ЗаявкаНаТранспорт.СуммаДокумента КАК СуммаДокумента,
	//|	Задания.ЗаявкаНаТранспорт.Контрагент КАК Контрагент,
	//|	Задания.ЗаявкаНаТранспорт.АдресКонтрагента КАК АдресКонтрагента,
	//|	Задания.ЗаявкаНаТранспорт.ЗаказПокупателя.Номер КАК НомерЗаявки,
	//
	//|	Задания.ЗаявкаНаТранспорт.ДокументОснование КАК _ДокументОснование,
	//
	//
	//|	Задания.ЗаявкаНаТранспорт.ВсегоВес КАК ВесБрутто,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоОбъем КАК Объем,
	//|	Задания.ЗаявкаНаТранспорт.ВсегоКоличествоПалет КАК КоличествоПалет,
	//|	Задания.ЗаявкаНаТранспорт.Склад КАК Склад,
	//|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.СпособДоставки КАК СпособДоставки,
	//|	Задания.ЗаявкаНаТранспорт.ОтветственныйМенеджер КАК Менеджер,
	//|	Задания.ЗаявкаНаТранспорт.КонтактыОтветственногоМенеджера КАК КонтактыМенеджера,
	//|	ВЫРАЗИТЬ(Задания.ЗаявкаНаТранспорт.Комментарий КАК СТРОКА(300)) КАК Комментарий,
	//|	Задания.ЗаявкаНаТранспорт.ТКНазначения КАК ТКНазначения,
	//|	Задания.ЗаявкаНаТранспорт.АдресПромежуточный КАК АдресДоставки,
	//|	Задания.ЗаявкаНаТранспорт.СпособДоставкиКонтрагента.УсловиеДоставки КАК УсловияДоставки,
	//|	Задания.ЗаявкаНаТранспорт.Контрагент,
	//|	ЕСТЬNULL(ВложенныйЗапрос.Представление, """") КАК Телефон
	//|ИЗ
	//|	Документ.абс_ТранспортныйМаршрут.Задания КАК Задания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			КонтактнаяИнформация.Объект КАК Объект,
	//|			МАКСИМУМ(ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100))) КАК Представление,
	//|			МАКСИМУМ(КонтактнаяИнформация.абс_ДатаАктуальностиКИ) КАК абс_ДатаАктуальностиКИ
	//|		ИЗ
	//|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|		ГДЕ
	//|			КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	//|			И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			КонтактнаяИнформация.Объект) КАК ВложенныйЗапрос
	//|		ПО Задания.ЗаявкаНаТранспорт.Контрагент = ВложенныйЗапрос.Объект
	//|ГДЕ
	//|	Задания.Ссылка = &Ссылка
	//|ИТОГИ
	//|	СУММА(СуммаДокумента),
	//|	СУММА(ВесБрутто),
	//|	СУММА(Объем),
	//|	СУММА(КоличествоПалет)
	//|ПО
	//|	ОБЩИЕ";
	////Лео Катанович} 
	//ЗапросПоТабЧасти.УстановитьПараметр("Ссылка",МаршрутСсылка);
	//
	//ВыборкаИтоги = ЗапросПоТабЧасти.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаИтоги.Следующий();
	//
	//НомерСтроки = 0;
	//ВыборкаСтроки = ВыборкаИтоги.Выбрать();
	//Пока ВыборкаСтроки.Следующий() Цикл
	//	
	//	НомерСтроки = НомерСтроки + 1;
	//	
	//	ЗаполнитьЗначенияСвойств(ОбластьСтрокаТабЧасти.Параметры, ВыборкаСтроки);
	//	ОбластьСтрокаТабЧасти.Параметры.Контрагент = ВыборкаСтроки.Контрагент.НаименованиеПолное;
	//	ОбластьСтрокаТабЧасти.Параметры.НомерСтроки = НомерСтроки;
	//	//ОбластьСтрокаТабЧасти.Параметры.КонтактыМенеджера = ВыборкаСтроки.Телефон + ?(ЗначениеЗаполнено(ВыборкаСтроки.КонтактыМенеджера),"; " + ВыборкаСтроки.КонтактыМенеджера ,"");
	//	
	//	// zhiga {
	//	// Перемещение (Щербинина)
	//	Если НЕ ЗначениеЗаполнено(ВыборкаСтроки.АдресДоставки) и ЗначениеЗаполнено(ВыборкаСтроки._ДокументОснование) 
	//		И ТипЗнч(ВыборкаСтроки._ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
	//		_ДокОсн = ВыборкаСтроки._ДокументОснование;
	//		ОбластьСтрокаТабЧасти.Параметры.АдресДоставки =	?(ТипЗнч(_ДокОсн.абс_ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"),_ДокОсн.абс_ДокументОснование.АдресДоставки,"");
	//	КонецЕсли;
	//	// zhiga }
	//	
	//	
	//	
	//	ТабДокумент.Вывести(ОбластьСтрокаТабЧасти);
	//КонецЦикла;
	//
	////итоги
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//ОбластьПодвал.Параметры.ИтогоСуммаДокумента  = ВыборкаИтоги.СуммаДокумента;
	//ОбластьПодвал.Параметры.ИтогоВесБрутто       = ВыборкаИтоги.ВесБрутто;
	//ОбластьПодвал.Параметры.ИтогоОбъем           = ВыборкаИтоги.Объем;
	//ОбластьПодвал.Параметры.ИтогоКоличествоПалет = ВыборкаИтоги.КоличествоПалет;
	//
	//ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции
