
&НаКлиенте
Процедура ПоказатьВыгрузку(Команда)
	Запрос = ПолучитьЗапрос ();
	Результат = Запрос.Выполнить();
    ТабДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Результат);       
	Построитель.Вывести(ТабДокумент);
    ТабДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрос ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ВЫРАЗИТЬ(Контрагенты.Код КАК СТРОКА(15)) КАК Код_клиента,
	 |	ВЫРАЗИТЬ(КонтактнаяИнформация.Поле4 КАК СТРОКА(100)) КАК Город,
	 |	ВЫРАЗИТЬ(КонтактнаяИнформация.Поле2 КАК СТРОКА(100)) КАК Область,
	 |	ЕСТЬNULL(Контрагенты.абс_БизнесРегион, """") КАК БизнесРегион,
	 |	Контрагенты.Наименование КАК НаименованиеКлиента,
	 |	Канал.Значение КАК Канал,
	 |	ЕСТЬNULL(Контрагенты.абс_Отдел, """") КАК Отдел,
	 |	КонтрагентыМенеджерыПокупателя.МенеджерПокупателя,
	 |	Контрагенты.НаименованиеПолное КАК СводныйКлиент
	 |ИЗ
	 |	Справочник.Контрагенты КАК Контрагенты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |		ПО (КонтактнаяИнформация.Объект = Контрагенты.Ссылка)
	 |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	 |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.МенеджерыПокупателя КАК КонтрагентыМенеджерыПокупателя
	 |		ПО (КонтрагентыМенеджерыПокупателя.Ссылка = Контрагенты.Ссылка)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 |			ЗначенияСвойствОбъектов.Значение КАК Значение,
	 |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	 |			ЗначенияСвойствОбъектов.Свойство КАК Свойство
	 |		ИЗ
	 |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	 |		ГДЕ
	 |			ЗначенияСвойствОбъектов.Свойство = &Канал) КАК Канал
	 |		ПО Контрагенты.Ссылка = Канал.Объект";
	
	Запрос.УстановитьПараметр("Канал", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Канал);
	
	Возврат Запрос;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	Попытка
		
		Запрос = ПолучитьЗапрос ();
		Результат = Запрос.Выполнить();
	    ТабДокумент = Новый ТабличныйДокумент;
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Результат);       
		Построитель.Вывести(ТабДокумент);

		
		ИмяДокумента = "Kontragent_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабДокумент.Записать(Объект.ПутьКФайлу+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		Сообщить("Файл " + ИмяДокумента + " сформирован." )
	Исключение
		Сообщить("Не удалось сформировать файл." )
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Если Диалог.Выбрать() Тогда
        Объект.ПутьКФайлу = Диалог.Каталог + "\";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ПутьКФайлу =  "\\air\Sales\Cube\1С\"  ;
КонецПроцедуры
