
//Процедура ПриЗаписи(Отказ)
//	// Вставить содержимое обработчика.
//	перваянеделя=НеделяГода(ДатаПланирования);
//	
//	Для каждого с из  СоставПлана Цикл
//	
//	 с.Дата1= НачалоНедели(ДатаПланирования);
//	 с.Дата2=с.Дата1+86400*7; 
//	 с.Дата3=с.Дата2+86400*7; 
//	 с.Дата4=с.Дата3+86400*7; 
//	 с.Дата5=с.Дата4+86400*7; 
//	 с.Дата6=с.Дата5+86400*7; 
//	 с.Дата7=с.Дата6+86400*7; 
//	 с.Дата8=с.Дата7+86400*7; 
//	 с.Дата9=с.Дата8+86400*7; 
//	 с.Дата10=с.Дата9+86400*7;
//	 с.Дата11=с.Дата10+86400*7; 
//	 с.Дата12=с.Дата11+86400*7; 
//	 с.Дата13=с.Дата12+86400*7; 
//	 с.Дата14=с.Дата13+86400*7; 
//	 
//	КонецЦикла;
//	
//КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Лео_планыЗакупок
	Движения.Лео_планыЗакупок.Записывать = Истина;
	Движения.Лео_планыЗакупок.Очистить();
	Для Каждого ТекСтрокаСоставПлана Из СоставПлана Цикл
	    Для с=1 по 14 Цикл
			
		план		  = ТекСтрокаСоставПлана["Кзаказу"+с+"Неделя"];
        Заказ		  = ТекСтрокаСоставПлана["Заказ"+с+"Неделя"];
		
		Если план > 0 или Заказ > 0 тогда
			
		Движение = Движения.Лео_планыЗакупок.Добавить();
		Движение.Период    	      = Дата;
		Движение.ДатаПланирования = ТекСтрокаСоставПлана["Дата"+с];
		Движение.Номенклатура  	  = ТекСтрокаСоставПлана.номенклатура;
		Движение.Контрагент       = ТекСтрокаСоставПлана.Контрагент;
		Движение.Менеджер         = ТекСтрокаСоставПлана.Менеджер;
		Движение.план		      = план;
        Движение.Заказ		      = Заказ;
       
		Конецесли;
		
		
	КонеЦЦикла;
			
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	// Вставить содержимое обработчика.
	перваянеделя=НеделяГода(ДатаПланирования);
	
	Для каждого с из  СоставПлана Цикл
	
	 с.Дата1= НачалоНедели(ДатаПланирования);
	 с.Дата2=с.Дата1+86400*7; 
	 с.Дата3=с.Дата2+86400*7; 
	 с.Дата4=с.Дата3+86400*7; 
	 с.Дата5=с.Дата4+86400*7; 
	 с.Дата6=с.Дата5+86400*7; 
	 с.Дата7=с.Дата6+86400*7; 
	 с.Дата8=с.Дата7+86400*7; 
	 с.Дата9=с.Дата8+86400*7; 
	 с.Дата10=с.Дата9+86400*7;
	 с.Дата11=с.Дата10+86400*7; 
	 с.Дата12=с.Дата11+86400*7; 
	 с.Дата13=с.Дата12+86400*7; 
	 с.Дата14=с.Дата13+86400*7; 
	 
	КонецЦикла;

КонецПроцедуры
