
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипДокументаДляСогласования=Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета;
	УстановитьОтборПоТипуДокумента();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТипуДокумента()
	Если Список.Отбор.Элементы.Количество()>0 Тогда
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;
	ЭлементОтбора=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ТипДокументаДляСогласования");
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=ТипДокументаДляСогласования;
	ЭлементОтбора.Использование=Истина;
	ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаДляСогласованияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаДляСогласованияПриИзменении(Элемент)
	УстановитьОтборПоТипуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование Тогда
		Отказ=Истина;
		ОткрытьФорму("Справочник.абс_МаршрутыСогласованияДокументов.Форма.ФормаЭлементаУправляемая",Новый Структура("ТипДокументаДляСогласования",ТипДокументаДляСогласования));
	КонецЕсли;
КонецПроцедуры

