////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ЗаполнитьБюджетНаГод(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ ВТ_СтатьиПоЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ОборотыБюджетовОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -ОборотыБюджетовОбороты.КоличествоОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|	КОНЕЦ КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|				И Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И СтатьяОборотов В
	|					(ВЫБРАТЬ
	|						ВТ_СтатьиПоЦФО.СтатьяОборотовПоБюджетам
	|					ИЗ
	|						ВТ_СтатьиПоЦФО КАК ВТ_СтатьиПоЦФО)) КАК ОборотыБюджетовОбороты
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	Период";
	
	Запрос.УстановитьПараметр("Период", ДатаПланирования);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитика.Следующий() Цикл
				
				ВыборкаКонтрагент = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
								
					//СтрокаТЧ=Объект.СоставБюджета.Добавить();
					СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
					
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
					
					ВыборкаПериод=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПериод.Следующий() Цикл
						
						СтрокаТЧ["ПланСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
						СтрокаТЧ["ПланКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
						СтрокаТЧ["ПланСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);
	
КонецПроцедуры

Процедура ОбновитьПланБюджетаНаТекущийМесяц(Объект) Экспорт
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		СтрокаТЧ["ПланСумма" + ИндексТекМесяца] 		= 0;
		СтрокаТЧ["ПланКоличество"+ИндексТекМесяца]		= 0;
		СтрокаТЧ["ПланСуммаБезНДС"+ИндексТекМесяца]		= 0;		
	КонецЦикла;	
	
	// Заполним данные по данным плана
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ ВТ_СтатьиПоЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыБюджетовОбороты.Период КАК Период,
	|	ОборотыБюджетовОбороты.ЦФО КАК ЦФО,
	|	ОборотыБюджетовОбороты.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	ОборотыБюджетовОбороты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -ОборотыБюджетовОбороты.КоличествоОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.КоличествоОборот
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -ОборотыБюджетовОбороты.СуммаУпрОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрОборот
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ОборотыБюджетовОбороты.СтатьяОборотов.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|		ИНАЧЕ ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот
	|	КОНЕЦ КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|			Месяц,
	|			Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.План)
	|				И Организация = &Организация
	|				И абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И СтатьяОборотов В
	|					(ВЫБРАТЬ
	|						ВТ_СтатьиПоЦФО.СтатьяОборотовПоБюджетам
	|					ИЗ
	|						ВТ_СтатьиПоЦФО КАК ВТ_СтатьиПоЦФО)) КАК ОборотыБюджетовОбороты
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	Период";
	
	Запрос.УстановитьПараметр("Период"		, ТекМесяц);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитика.Следующий() Цикл
				
				ВыборкаКонтрагент = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					// Попробуем найти строку в табличной части, если строки нет - создадим новую
					//  если есть, заполним существующую
					СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент");
					ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаКонтрагент);
					
					СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
					
					Если СтрокиТЧ.Количество() = 0 Тогда
						
						//СтрокаТЧ = Объект.СоставБюджета.Добавить();
						СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
						
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
					Иначе
						СтрокаТЧ = СтрокиТЧ[0];
					КонецЕсли;
						
					ВыборкаПериод = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПериод.Следующий() Цикл
						
						СтрокаТЧ["ПланСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
						СтрокаТЧ["ПланКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
						СтрокаТЧ["ПланСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);
	
КонецПроцедуры

Процедура ОбновитьОперФактНаТекущийМесяц(Объект) Экспорт
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		Если СтрокаТЧ["Подтверждено" + ИндексТекМесяца] Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
		СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
		СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;
		
	КонецЦикла;
	
	СтрокиЗРСТекМесяца = ЗаявкиНаРасходованиеСредств.НайтиСтроки(Новый Структура("НомерМесяца", Месяц(Объект.ТекущийПериод)));
	
	Для Каждого СтрЗРС Из СтрокиЗРСТекМесяца Цикл
		
		Если СтрЗРС.Подтверждено Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.ЗаявкиНаРасходованиеСредств.Удалить(СтрЗРС);	
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ЦФО КАК ЦФО,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.СтатьяОборотов КАК СтатьяОборотовПоБюджетам,
	|	ЗаявкиНаРасходованиеСредствОбороты.Контрагент КАК Контрагент,
	|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование КАК ЗаявкаНаРасходованиеСредств,
	|	ЗаявкиНаРасходованиеСредствОбороты.СуммаУпрПриход КАК СуммаЗРС,
	|	ЗаявкиНаРасходованиеСредствОбороты.СуммаУпрПриход - ЗаявкиНаРасходованиеСредствОбороты.абс_СуммаНДСУпрПриход КАК СуммаЗРСБезНДС
	|ИЗ
	|	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|			,
	|			Организация = &Организация
	|				И ЗаявкаНаРасходование.ЦФО = &ЦФО) КАК ЗаявкиНаРасходованиеСредствОбороты
	|ИТОГИ
	|	СУММА(СуммаЗРС),
	|	СУММА(СуммаЗРСБезНДС)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	Контрагент,
	|	ЗаявкаНаРасходованиеСредств");	
	
	Запрос.УстановитьПараметр("Период"		, ТекМесяц);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	
	ВыборкаЦФО = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
					
			ВыборкаКонтрагент = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл
		
				// Попробуем найти строку в табличной части, если строки нет - создадим новую
				//  если есть, заполним существующую
				СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент");
				ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаКонтрагент);
				
				СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
				
				Если СтрокиТЧ.Количество() = 0 Тогда
					
					//СтрокаТЧ = Объект.СоставБюджета.Добавить();
					СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
					
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
				Иначе
					СтрокаТЧ = СтрокиТЧ[0];
				КонецЕсли;
				
				Если НЕ СтрокаТЧ["Подтверждено" + ИндексТекМесяца] Тогда
					
					СтрокаТЧ["ОперФактСуммаБезНДС" + ИндексТекМесяца] 	= СтрокаТЧ["ОперФактСуммаБезНДС" + ИндексТекМесяца] + ВыборкаКонтрагент.СуммаЗРСБезНДС;
					СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] + ВыборкаКонтрагент.СуммаЗРС;
				КонецЕсли;
									
				ВыборкаЗРС = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаЗРС.Следующий() Цикл
					
					СтрокаЗРС = Объект.ЗаявкиНаРасходованиеСредств.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаЗРС, ВыборкаЗРС);
					
					СтрокаЗРС.ИдентификаторСтрокиБюджета = СтрокаТЧ.ИдентификаторСтрокиБюджета;
					СтрокаЗРС.НомерМесяца = ИндексТекМесяца;
				
				КонецЦикла;								
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//Процерим строки с признаком "Подтверждено"
	
	СтрокиПодтверждено = Объект.СоставБюджета.НайтиСтроки(Новый Структура("Подтверждено" + ИндексТекМесяца, Истина));
	
	Для Каждого СтрПодтверждено Из СтрокиПодтверждено Цикл
		
		//СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент");
		СтруктураАналитик = Новый Структура("ИдентификаторСтрокиБюджета");
		
		ЗаполнитьЗначенияСвойств(СтруктураАналитик, СтрПодтверждено);
		
		СтрокиЗРС = Объект.ЗаявкиНаРасходованиеСредств.НайтиСтроки(СтруктураАналитик);
		
		ВсегоСуммаЗРСПоАналитике 		= 0;
		ВсегоСуммаЗРСБезНДСПоАналитике 	= 0;
		
		Для Каждого СтрЗРС Из СтрокиЗРС Цикл
			
			ВсегоСуммаЗРСПоАналитике 		= ВсегоСуммаЗРСПоАналитике 			+ СтрЗРС.СуммаЗРС;
			ВсегоСуммаЗРСБезНДСПоАналитике 	= ВсегоСуммаЗРСБезНДСПоАналитике 	+ СтрЗРС.СуммаЗРСБезНДС;
			
		КонецЦикла;
		
		Если ВсегоСуммаЗРСПоАналитике >= СтрПодтверждено["ОперФактСумма" + ИндексТекМесяца] Тогда
			
			СтрПодтверждено["Подтверждено" + ИндексТекМесяца] = Ложь;
			
			СтрПодтверждено["ОперФактСумма" + ИндексТекМесяца] 			= ВсегоСуммаЗРСПоАналитике;
			СтрПодтверждено["ОперФактСуммаБезНДС" + ИндексТекМесяца]	= ВсегоСуммаЗРСБезНДСПоАналитике;
		КонецЕсли;
		
	КонецЦикла;
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);
	
КонецПроцедуры

//заполняет статьи выручки в зависимости от выбранной организации
//если организация - Леовит, то заполняет статьи выручки на основании заполненных бюджетов по себестоимости по всем остальным организациям
//если организация не Леовит, то заполняет суммы плана продаж по статьям выручки по всем ЦФО - центрам дохода
Процедура ЗаполнитьСтатьиВыручки(Объект) Экспорт
	
	Если Организация = Константы.абс_ОрганизацияЛеовит.Получить() Тогда		
		ЗаполнитьСтатьиВыручкиПоПлануПродаж(Объект);
		ЗаполнитьСтатьиВыручкиПоСебестоимости(Объект, Ложь);
	Иначе
		ЗаполнитьСтатьиВыручкиПоПлануПродаж(Объект);
	КонецЕсли;
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);
	
КонецПроцедуры

//заполняет суммы плана продаж по статьям выручки по всем ЦФО - центрам дохода. 
//У статьи оборотов по бюджетам должен быть заполнен реквизит абс_ВидЗаполнения
Процедура ЗаполнитьСтатьиВыручкиПоПлануПродаж(Объект)
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу по выручке
	
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		Если СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка Тогда
			СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
			СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
			СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;				
		КонецЕсли;	
	КонецЦикла;	
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиВыручкиЦФО.ЦФО КАК ЦФО,
	|	ПланыПродажОбороты.Номенклатура КАК Номенклатура,
	|	ПланыПродажОбороты.Контрагент КАК Контрагент,
	|	ПланыПродажОбороты.Период КАК Период,
	|	ПланыПродажОбороты.КоличествоОборот КАК Количество,
	|	ПланыПродажОбороты.СтоимостьОборот КАК СуммаБезНДС,
	|	ПланыПродажОбороты.СтоимостьОборот + ПланыПродажОбороты.НДСОборот КАК Сумма,
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка) КАК АналитикаБюджета
	|ИЗ
	|	СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ГОД),
	|				КОНЕЦПЕРИОДА(&Период, ГОД),
	|				Месяц,
	|				Организация = &Организация
	|					И Контрагент.Регион.абс_ЦФО В
	|						(ВЫБРАТЬ
	|							СтатьиВыручкиЦФО.ЦФО
	|						ИЗ
	|							СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО)) КАК ПланыПродажОбороты
	|		ПО СтатьиВыручкиЦФО.ЦФО = ПланыПродажОбороты.Контрагент.Регион.абс_ЦФО
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СуммаБезНДС),
	|	СУММА(Сумма)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Период",ДатаПланирования);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ЦФО",ЦФО);
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитика=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитика.Следующий() Цикл
			
				ВыборкаКонтрагент=ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
									
					ВыборкаНоменклатура=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл
																	
						// Попробуем найти строку в табличной части, если строки нет - создадим новую
						//  если есть, заполним существующую
						СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,АналитикаБюджета,Номенклатура");
						ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура);
						
						СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
						
						Если СтрокиТЧ.Количество() = 0 Тогда
							
							//СтрокаТЧ = Объект.СоставБюджета.Добавить();
							СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
							
							ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
						Иначе
							СтрокаТЧ = СтрокиТЧ[0];
						КонецЕсли;
							
						ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПериод.Следующий() Цикл
							
							СтрокаТЧ["ОперФактСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
							СтрокаТЧ["ОперФактКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
							СтрокаТЧ["ОперФактСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
							
							СтрокаТЧ["Подтверждено"+Месяц(ВыборкаПериод.Период)]			= Истина;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

//заполняет статьи выручки на основании заполненных бюджетов по себестоимости по всем организациям, кроме выбранной в шапке документа
Процедура ЗаполнитьСтатьиВыручкиПоСебестоимости(Объект, Очищать = Истина)
		
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу по выручке
	Если Очищать Тогда
		Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
			
			Если СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка Тогда
				СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
				СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
				СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;				
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	//Заполнение
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыСвязанныеСОрганизациями.Организация,
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ПОМЕСТИТЬ ВТ_КонтрагентыСвязанныеСОрганизациями
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	&ЦФО КАК ЦФО,
	|	ЕСТЬNULL(ВТ_КонтрагентыСвязанныеСОрганизациями.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ОборотыБюджетовОбороты.Номенклатура КАК Номенклатура,
	|	ОборотыБюджетовОбороты.абс_АналитикаБюджета КАК АналитикаБюджета,
	|	-ОборотыБюджетовОбороты.КоличествоОборот КАК Количество,
	|	-ОборотыБюджетовОбороты.СуммаУпрОборот КАК Сумма,
	|	-ОборотыБюджетовОбороты.СуммаУпрБезНДСОборот КАК СуммаБезНДС,
	|	ОборотыБюджетовОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ОборотыБюджетов.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, ГОД),
	|			КОНЕЦПЕРИОДА(&Период, ГОД),
	|			Месяц,
	|			абс_Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.СводныйБДР)
	|				И СтатьяОборотов.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
	|				И НЕ Организация = &Организация
	|				И ЦФО = &ЦФО
	|				И Сценарий = &Сценарий) КАК ОборотыБюджетовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ПО ОборотыБюджетовОбороты.ЦФО = СтатьиВыручкиЦФО.ЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтрагентыСвязанныеСОрганизациями КАК ВТ_КонтрагентыСвязанныеСОрганизациями
	|		ПО ОборотыБюджетовОбороты.Организация = ВТ_КонтрагентыСвязанныеСОрганизациями.Организация
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	Номенклатура,
	|	Период";
	
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("Период"		, ДатаПланирования);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	Запрос.УстановитьПараметр("Сценарий"	, абс_Бюджетирование.ПолучитьСценарийПоВидуОперации(Перечисления.абс_ВидыОперацийВводБюджета.ОперативныйФакт));
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья=ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитика=ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитика.Следующий() Цикл
			
				ВыборкаКонтрагент=ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
									
					ВыборкаНоменклатура=ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНоменклатура.Следующий() Цикл

								
						// Попробуем найти строку в табличной части, если строки нет - создадим новую
						//  если есть, заполним существующую
						СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,АналитикаБюджета,Номенклатура");
						ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаНоменклатура);
						
						СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
						
						Если СтрокиТЧ.Количество() = 0 Тогда
							
							//СтрокаТЧ = Объект.СоставБюджета.Добавить();
							СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
							
							ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
						Иначе
							СтрокаТЧ = СтрокиТЧ[0];
						КонецЕсли;
							
						ВыборкаПериод = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПериод.Следующий() Цикл
							
							СтрокаТЧ["ОперФактСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
							СтрокаТЧ["ОперФактКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
							СтрокаТЧ["ОперФактСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
							
							СтрокаТЧ["Подтверждено"+Месяц(ВыборкаПериод.Период)]			= Истина;
						КонецЦикла;

					КонецЦикла
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьВыручкуНаТекущийМесяц(Объект) Экспорт
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу по выручке
	
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		Если СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка Тогда
			СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
			СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
			СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;				
		КонецЕсли;	
	КонецЦикла;	
	
	// Заполним данные по данным плана
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиВыручкиЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыДохода)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Выручка)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяДоходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Период КАК Период,
	|	ПродажиОбороты.Контрагент.абс_БизнесРегион.абс_ЦФО КАК ЦФО,
	|	СтатьиВыручкиЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка) КАК АналитикаБюджета,
	|	ПродажиОбороты.Контрагент КАК Контрагент,
	|	ПродажиОбороты.СтоимостьОборот КАК Сумма,
	|	ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК СуммаБезНДС,
	|	ПродажиОбороты.КоличествоОборот КАК Количество
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|			Месяц,
	|			Контрагент.Регион.абс_ЦФО = &ЦФО
	|				И Организация = &организация) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиВыручкиЦФО КАК СтатьиВыручкиЦФО
	|		ПО ПродажиОбороты.Контрагент.Регион.абс_ЦФО = СтатьиВыручкиЦФО.ЦФО
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС),
	|	СУММА(Количество)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	Период";
	
	Запрос.УстановитьПараметр("Период"		, ТекМесяц);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитика.Следующий() Цикл			
			
				ВыборкаКонтрагент = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					// Попробуем найти строку в табличной части, если строки нет - создадим новую
					//  если есть, заполним существующую
					СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,АналитикаБюджета");
					ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаКонтрагент);
					
					СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
					
					Если СтрокиТЧ.Количество() = 0 Тогда
						
						//СтрокаТЧ = Объект.СоставБюджета.Добавить();
						СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
						
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
					Иначе
						СтрокаТЧ = СтрокиТЧ[0];
					КонецЕсли;
						
					ВыборкаПериод = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПериод.Следующий() Цикл
						
						СтрокаТЧ["ОперФактСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
						СтрокаТЧ["ОперФактКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
						СтрокаТЧ["ОперФактСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
						
						СтрокаТЧ["Подтверждено"+Месяц(ВыборкаПериод.Период)]			= Истина;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);
	
КонецПроцедуры

Процедура ЗаполнитьУслугиРетроНаТекущийМесяц(Объект) Экспорт
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу по услугам/ретро
	
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		Если СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Ретро Тогда
			СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
			СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
			СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;				
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.Период КАК ТекПериодУслугиРетро,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_АналитикаСтатьиПоБюджету КАК АналитикаБюджета,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Организация КАК Организация,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ПериодичностьНачисления,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_БазаНачисления,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ВидОплаты,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ОплатаФиксированнойСуммой,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_Процент,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_Сумма,
	|	абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ЦФО КАК ЦФО,
	|	ЕСТЬNULL(Продажи.СтоимостьОборот, 0) КАК СуммаУпрОборот,
	|	ЕСТЬNULL(Продажи.СтоимостьОборот, 0) - ЕСТЬNULL(Продажи.НДСОборот, 0) КАК СуммаУпрБезНДСОборот
	|ИЗ
	|	РегистрСведений.абс_ДействияУслугРетроПоДоговорам.СрезПоследних(
	|			КОНЕЦПЕРИОДА(&ТекПериод, МЕСЯЦ),
	|			абс_ЦФО = &ЦФО
	|				И ДоговорКонтрагента.Организация = &Организация
	|				И (Лео_ДатаОкончанияПериода >= &ТекПериод
	|					ИЛИ Лео_ДатаОкончанияПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК абс_ДействияУслугРетроПоДоговорамСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	|				НАЧАЛОПЕРИОДА(&ТекПериод, МЕСЯЦ),
	|				КОНЕЦПЕРИОДА(&ТекПериод, МЕСЯЦ),
	|				,
	|				Организация = &Организация
	|					И Контрагент.Регион.абс_ЦФО = &ЦФО) КАК Продажи
	|		ПО абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Организация = Продажи.Организация
	|			И абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента.Владелец = Продажи.Контрагент
	|			И абс_ДействияУслугРетроПоДоговорамСрезПоследних.абс_ЦФО = Продажи.Контрагент.Регион.абс_ЦФО
	|			И (ВЫБОР
	|				КОГДА Продажи.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента = Продажи.Контрагент.ОсновнойДоговорКонтрагента
	|				ИНАЧЕ абс_ДействияУслугРетроПоДоговорамСрезПоследних.ДоговорКонтрагента = Продажи.ДоговорКонтрагента
	|			КОНЕЦ)");

	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ТекПериод"	, ТекМесяц);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураСтрокиБюджета = Новый Структура("СтатьяОборотовПоБюджетам,Сумма,СуммаБезНДС", Выборка.СтатьяОборотовПоБюджетам, 0, 0);		
		
		РассчитатьСуммуУслугРетро(СтруктураСтрокиБюджета, ИндексТекМесяца, Выборка);
		
		// Попробуем найти строку в табличной части, если строки нет - создадим новую
		//  если есть, заполним существующую
		СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент,АналитикаБюджета");
		ЗаполнитьЗначенияСвойств(СтруктураАналитик, Выборка, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,АналитикаБюджета");
		
		СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
		
		Если СтрокиТЧ.Количество() = 0 Тогда
			
			//СтрокаТЧ = Объект.СоставБюджета.Добавить();
			СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка, "ЦФО,СтатьяОборотовПоБюджетам,Контрагент,АналитикаБюджета");
		Иначе
			СтрокаТЧ = СтрокиТЧ[0];
		КонецЕсли;
						
		СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца]			= СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		+ СтруктураСтрокиБюджета.Сумма;
		СтрокаТЧ["ОперФактСуммаБезНДС" + ИндексТекМесяца]	= СтрокаТЧ["ОперФактСуммаБезНДС" + ИндексТекМесяца] + СтруктураСтрокиБюджета.СуммаБезНДС;		
		
		СтрокаТЧ["Подтверждено" + ИндексТекМесяца] 			= Истина;
		
	КонецЦикла;		
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);
	
КонецПроцедуры

Процедура РассчитатьСуммуУслугРетро(СтрокаБюджета, ИндексПериода, СтруктураПараметровУслугРетро)
	
	КоэффициентПериодаНачисления = 0;
		
	Если СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Год Тогда
		КоэффициентПериодаНачисления = 12;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Полугодие Тогда
		КоэффициентПериодаНачисления = 6;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Квартал Тогда
		КоэффициентПериодаНачисления = 3;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.Месяц Тогда
		КоэффициентПериодаНачисления = 1;
	ИначеЕсли СтруктураПараметровУслугРетро.абс_ПериодичностьНачисления = Перечисления.абс_ПериодичностьНачисленияПремийКонтрагентов.РазовоеНачисление Тогда
		КоэффициентПериодаНачисления = 0;		
	КонецЕсли;
	
	Если СтруктураПараметровУслугРетро.абс_ОплатаФиксированнойСуммой Тогда
		
		Если КоэффициентПериодаНачисления = 0 И Месяц(СтруктураПараметровУслугРетро.ТекПериодУслугиРетро) = ИндексПериода Тогда
			СтрокаБюджета["Сумма"] = СтруктураПараметровУслугРетро.абс_Сумма;
		Иначе
			СтрокаБюджета["Сумма"] = СтруктураПараметровУслугРетро.абс_Сумма / КоэффициентПериодаНачисления;
		КонецЕсли;
		
		СтрокаБюджета["СуммаБезНДС"] = СтрокаБюджета["Сумма"] - УчетНДС.РассчитатьСуммуНДС(СтрокаБюджета["Сумма"], Истина, Истина, ?(СтруктураПараметровУслугРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Наличная, 0, УчетНДС.ПолучитьСтавкуНДС(СтрокаБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС)));
		
	Иначе
		
		Если СтруктураПараметровУслугРетро.абс_БазаНачисления = Перечисления.абс_БазаНачисленияУслугКонтрагента.ВыручкаБезНДС Тогда
			
			СтрокаБюджета["СуммаБезНДС"] 	= СтруктураПараметровУслугРетро.СуммаУпрБезНДСОборот * СтруктураПараметровУслугРетро.абс_Процент / 100;
			СтрокаБюджета["Сумма"] 			= СтрокаБюджета["СуммаБезНДС"] + УчетНДС.РассчитатьСуммуНДС(СтрокаБюджета["СуммаБезНДС"], Истина, Ложь, ?(СтруктураПараметровУслугРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Наличная, 0, УчетНДС.ПолучитьСтавкуНДС(СтрокаБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС)));
			
		ИначеЕсли СтруктураПараметровУслугРетро.абс_БазаНачисления = Перечисления.абс_БазаНачисленияУслугКонтрагента.ВыручкаСНДС Тогда
			
			СтрокаБюджета["Сумма"] 			= СтруктураПараметровУслугРетро.СуммаУпрБезНДСОборот * СтруктураПараметровУслугРетро.абс_Процент / 100;
			СтрокаБюджета["СуммаБезНДС"] 	= СтрокаБюджета["Сумма"] - УчетНДС.РассчитатьСуммуНДС(СтрокаБюджета["Сумма"], Истина, Истина, ?(СтруктураПараметровУслугРетро.абс_ВидОплаты = Перечисления.абс_ВидыОплатУслугКонтрагентов.Наличная, 0, УчетНДС.ПолучитьСтавкуНДС(СтрокаБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС)));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСебестоимостьНаТекущийМесяц(Объект) Экспорт
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу по себестоимости
	
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		Если СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость Тогда
			СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
			СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
			СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;				
		КонецЕсли;	
	КонецЦикла;	
	
	
	// Заполение статей себестоимости:
	// По организации Леовит заполнение производим по статьям себестоимости с указанным типом цен
	// По остальным организациям заполнение производим по нормам себестоимости
	
	Если Организация = Константы.абс_ОрганизацияЛеовит.Получить() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ КАК ТипЦенСебестоимости
		|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		|ИЗ
		|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
		|ГДЕ
		|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
		|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Себестоимость)
		|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
		|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
		|
		|СГРУППИРОВАТЬ ПО
		|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Бюджет)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимости
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.план)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПлан
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ОперативныйФакт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиПредварительныйФакт
		|		КОГДА &Сценарий = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Факт)
		|			ТОГДА абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипЦенОпределенияСебестоимостиФакт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Продажи.Период,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	Продажи.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(Продажи.КоличествоОборот, 0) КАК Количество,
		|	СтатьиСебестоимостиПоЦФО.ЦФО КАК ЦФО,
		|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5		
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости.ЦенаВключаетНДС, ЛОЖЬ) КАК ЦенаВключаетНДС,
		|	СтатьиСебестоимостиПоЦФО.ТипЦенСебестоимости КАК ТипЦен,
		|	ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка) КАК абс_Регион
		|ПОМЕСТИТЬ БюджетПродаж
		|ИЗ
		|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), Месяц, Организация = &Организация) КАК Продажи
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Продажи.КоличествоОборот > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Период,
		|	БюджетПродаж.Номенклатура,
		|	БюджетПродаж.ТипЦен
		|ПОМЕСТИТЬ ВТ_ТипЦенНоменклатураПериод
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПродаж.Период,
		|	БюджетПродаж.Номенклатура,
		|	БюджетПродаж.ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыЦен.ТипЦен,
		|	ПериодыЦен.Номенклатура,
		|	ПериодыЦен.Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатурыПоПериодам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
		|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|		МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, &ПустаяДата)) КАК ПериодЦены,
		|		ВТ_ТипЦенНоменклатураПериод.Период КАК Период
		|	ИЗ
		|		ВТ_ТипЦенНоменклатураПериод КАК ВТ_ТипЦенНоменклатураПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|			ПО ВТ_ТипЦенНоменклатураПериод.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|				И ВТ_ТипЦенНоменклатураПериод.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|				И ВТ_ТипЦенНоменклатураПериод.Период >= ЦеныНоменклатуры.Период
		|				И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЦеныНоменклатуры.ТипЦен,
		|		ЦеныНоменклатуры.Номенклатура,
		|		ВТ_ТипЦенНоменклатураПериод.Период) КАК ПериодыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ПериодыЦен.ТипЦен = ЦеныНоменклатуры.ТипЦен
		|			И ПериодыЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ПериодыЦен.ПериодЦены = ЦеныНоменклатуры.Период
		|			И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.Контрагент КАК Контрагент,
		|	БюджетПродаж.Количество КАК Количество,
		|	БюджетПродаж.ЦФО КАК ЦФО,
		|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ЗНАЧЕНИЕ(Справочник.абс_аналитикиБюджета.ПустаяССылка) КАК АналитикаБюджета,
		|	БюджетПродаж.СтавкаНДС КАК СтавкаНДС,
		|	БюджетПродаж.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатурыПоПериодам.Цена, 0) КАК Цена,
		|	БюджетПродаж.Номенклатура КАК Номенклатура
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатурыПоПериодам КАК ВТ_ЦеныНоменклатурыПоПериодам
		|		ПО БюджетПродаж.Номенклатура = ВТ_ЦеныНоменклатурыПоПериодам.Номенклатура
		|			И БюджетПродаж.ТипЦен = ВТ_ЦеныНоменклатурыПоПериодам.ТипЦен
		|			И БюджетПродаж.Период = ВТ_ЦеныНоменклатурыПоПериодам.Период
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(СтавкаНДС),
		|	МАКСИМУМ(ЦенаВключаетНДС),
		|	МАКСИМУМ(Цена)
		|ПО
		|	ЦФО,
		|	Контрагент,
		|	Номенклатура,
		|	СтатьяОборотовПоБюджетам,
		|	АналитикаБюджета");
		
		Запрос.УстановитьПараметр("Период"		, ТекМесяц);
		Запрос.УстановитьПараметр("Организация"	, Организация);
		Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
		Запрос.УстановитьПараметр("ПустаяДата"	, Дата(1, 1, 1));		
		
		Запрос.УстановитьПараметр("Сценарий"	, Справочники.СценарииПланирования.ОперативныйФакт);
		
		ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦФО.Следующий() Цикл
											
			ВыборкаКонтрагент = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагент.Следующий() Цикл

				ВыборкаНоменклатура = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					ВыборкаСтатья = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСтатья.Следующий() Цикл

						ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаАналитика.Следующий() Цикл
						
							// Попробуем найти строку в табличной части, если строки нет - создадим новую
							//  если есть, заполним существующую
							СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент");
							ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаАналитика);
							
							СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
							
							Если СтрокиТЧ.Количество() = 0 Тогда
								
								//СтрокаТЧ = Объект.СоставБюджета.Добавить();
								СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
								
								ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаАналитика);
							Иначе
								СтрокаТЧ = СтрокиТЧ[0];
							КонецЕсли;
															
							//СтрокаТЧ["ОперФактКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
							
							Если ВыборкаАналитика.ЦенаВключаетНДС Тогда
								Сумма			= ВыборкаАналитика.Цена*ВыборкаАналитика.Количество;
								СуммаБезНДС		= Сумма/(1+ВыборкаАналитика.СтавкаНДС/100);
							Иначе
								СуммаБезНДС 	= ВыборкаАналитика.Цена*ВыборкаАналитика.Количество;
								Сумма			= СуммаБезНДС+СуммаБезНДС*ВыборкаАналитика.СтавкаНДС/100;
							КонецЕсли;
							
							СтрокаТЧ["ОперФактСумма"		+ ИндексТекМесяца]		= СтрокаТЧ["ОперФактСумма"		+ ИндексТекМесяца] 	+ Сумма;
							СтрокаТЧ["ОперФактСуммаБезНДС"	+ ИндексТекМесяца]		= СтрокаТЧ["ОперФактСуммаБезНДС"+ ИндексТекМесяца] 	+ СуммаБезНДС;
													
							СтрокаТЧ["Подтверждено"			+ ИндексТекМесяца]				= Истина;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(абс_НормаСебестоимостиДляБюджетирования.ЦФО) КАК ЦФО,
		|	абс_НормаСебестоимостиДляБюджетирования.СтатьяОборотовПоБюджетам,
		|	абс_НормаСебестоимостиДляБюджетирования.НормаСебестоимости
		|ПОМЕСТИТЬ СтатьиСебестоимостиПоЦФО
		|ИЗ
		|	РегистрСведений.абс_НормаСебестоимостиДляБюджетирования КАК абс_НормаСебестоимостиДляБюджетирования
		|ГДЕ
		|	абс_НормаСебестоимостиДляБюджетирования.Организация = &Организация
		|	И абс_НормаСебестоимостиДляБюджетирования.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	абс_НормаСебестоимостиДляБюджетирования.СтатьяОборотовПоБюджетам,
		|	абс_НормаСебестоимостиДляБюджетирования.НормаСебестоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Продажи.Период,
		|	Продажи.Контрагент КАК Контрагент,
		|	Продажи.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(Продажи.КоличествоОборот, 0) КАК Количество,
		|	Продажи.Контрагент.Регион.абс_ЦФО КАК ЦФО,
		|	СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ВЫБОР
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ Продажи.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДС,
		|	Продажи.Контрагент.Регион КАК абс_Регион,
		|	ЕСТЬNULL(СтатьиСебестоимостиПоЦФО.НормаСебестоимости, 0) КАК НормаСебестоимости,
		|	ЕСТЬNULL(Продажи.СтоимостьОборот, 0) КАК СуммаУпрОборот,
		|	ЕСТЬNULL(Продажи.СтоимостьОборот, 0) - ЕСТЬNULL(Продажи.НДСОборот, 0) КАК СуммаУпрБезНДСОборот,
		|	ВЫБОР
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
		|			ТОГДА 20
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
		|			ТОГДА 18
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
		|			ТОГДА 10  
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		|			ТОГДА 5
		|		КОГДА СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|				ИЛИ СтатьиСебестоимостиПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		|			ТОГДА 7
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПроцентНДС
		|ПОМЕСТИТЬ БюджетПродаж
		|ИЗ
		|	СтатьиСебестоимостиПоЦФО КАК СтатьиСебестоимостиПоЦФО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		|				НАЧАЛОПЕРИОДА(&Период, ГОД),
		|				КОНЕЦПЕРИОДА(&Период, ГОД),
		|				Месяц,
		|				Организация = &Организация
		|					И Контрагент.Регион.абс_ЦФО = &ЦФО) КАК Продажи
		|		ПО (ИСТИНА)
		|			И (Продажи.КоличествоОборот > 0)
		|ГДЕ
		|	Продажи.КоличествоОборот > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетПродаж.ЦФО КАК ЦФО,
		|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
		|	ЗНАЧЕНИЕ(Справочник.абс_АналитикиБюджета.ПустаяСсылка) КАК АналитикиБюджета,
		|	БюджетПродаж.Контрагент КАК Контрагент,
		|	БюджетПродаж.Период КАК Период,
		|	БюджетПродаж.Количество КАК Количество,
		|	БюджетПродаж.СуммаУпрБезНДСОборот * БюджетПродаж.НормаСебестоимости КАК СуммаБезНДС,
		|	БюджетПродаж.СуммаУпрБезНДСОборот * БюджетПродаж.НормаСебестоимости * (100 + БюджетПродаж.ПроцентНДС) / 100 КАК Сумма
		|ИЗ
		|	БюджетПродаж КАК БюджетПродаж
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(СуммаБезНДС),
		|	СУММА(Сумма)
		|ПО
		|	ЦФО,
		|	СтатьяОборотовПоБюджетам,
		|	АналитикиБюджета,
		|	Контрагент,
		|	Период");
		
		Запрос.УстановитьПараметр("Период"			, ДатаПланирования);
		Запрос.УстановитьПараметр("Организация"		, Организация);
		Запрос.УстановитьПараметр("ЦФО"				, ЦФО);	
		
		ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦФО.Следующий() Цикл
			
			ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСтатья.Следующий() Цикл
									
				ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаАналитика.Следующий() Цикл				
				
					ВыборкаКонтрагент = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагент.Следующий() Цикл
						
						// Попробуем найти строку в табличной части, если строки нет - создадим новую
						//  если есть, заполним существующую
						СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент");
						ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаКонтрагент);
						
						СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
						
						Если СтрокиТЧ.Количество() = 0 Тогда
							
							//СтрокаТЧ = Объект.СоставБюджета.Добавить();
							СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
							
							ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
						Иначе
							СтрокаТЧ = СтрокиТЧ[0];
						КонецЕсли;
							
						ВыборкаПериод = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПериод.Следующий() Цикл
							
							СтрокаТЧ["ОперФактСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
							СтрокаТЧ["ОперФактКоличество"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.Количество;
							СтрокаТЧ["ОперФактСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
							
							СтрокаТЧ["Подтверждено"+Месяц(ВыборкаПериод.Период)]			= Истина;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);	
	
КонецПроцедуры

Процедура ЗаполнитьТранспортныеРасходыНаТекущийМесяц(Объект) Экспорт
	
	ТекМесяц 		= НачалоМесяца(Объект.ТекущийПериод);
	ИндексТекМесяца = Месяц(ТекМесяц);
	
	// Очистим данные по текущему месяцу по выручке
	
	Для Каждого СтрокаТЧ Из Объект.СоставБюджета Цикл
		
		Если СтрокаТЧ.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Транспорт Тогда
			СтрокаТЧ["ОперФактСумма" + ИндексТекМесяца] 		= 0;
			СтрокаТЧ["ОперФактКоличество"+ИндексТекМесяца]		= 0;
			СтрокаТЧ["ОперФактСуммаБезНДС"+ИндексТекМесяца]		= 0;				
		КонецЕсли;	
	КонецЦикла;
	
	// Заполним статьи транспорта
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(абс_СтатьиБюджетаПоЦФО.ЦФО) КАК ЦФО,
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|ПОМЕСТИТЬ СтатьиТранспортаПоЦФО
	|ИЗ
	|	РегистрСведений.абс_СтатьиБюджетаПоЦФО КАК абс_СтатьиБюджетаПоЦФО
	|ГДЕ
	|	абс_СтатьиБюджетаПоЦФО.ЦФО.ВидЦФО = ЗНАЧЕНИЕ(Справочник.ВидыЦФО.ЦентрыЗатрат)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Транспорт)
	|	И абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|	И абс_СтатьиБюджетаПоЦФО.ЦФО = &ЦФО
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_СтатьиБюджетаПоЦФО.СтатьяОборотовПоБюджетам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Период,
	|	ЕСТЬNULL(Продажи.КоличествоОборот, 0) * ЕСТЬNULL(Продажи.Номенклатура.ЕдиницаХраненияОстатков.Вес, 0) КАК Вес,
	|	СтатьиТранспортаПоЦФО.ЦФО КАК ЦФО,
	|	СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ВЫБОР
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ СтатьиТранспортаПоЦФО.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	Продажи.Контрагент.Регион КАК Регион
	|ПОМЕСТИТЬ БюджетПродаж
	|ИЗ
	|	СтатьиТранспортаПоЦФО КАК СтатьиТранспортаПоЦФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	|				КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|				Месяц,
	|				Контрагент.Регион.абс_ЦФО = &ЦФО
	|					И Организация = &Организация) КАК Продажи
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Продажи.КоличествоОборот > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БюджетПродаж.ЦФО КАК ЦФО,
	|	БюджетПродаж.СтатьяОборотовПоБюджетам КАК СтатьяОборотовПоБюджетам,
	|	ЗНАЧЕНИЕ(Справочник.абс_аналитикиБюджета.пустаяСсылка) КАК АналитикаБюджета,
	|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка) КАК Контрагент,
	|	БюджетПродаж.Период КАК Период,
	|	ЕСТЬNULL(абс_НормыРасходовНаТранспортСрезПоследних.Сумма, 0) * БюджетПродаж.Вес КАК Сумма,
	|	ЕСТЬNULL(абс_НормыРасходовНаТранспортСрезПоследних.Сумма, 0) * БюджетПродаж.Вес / (1 + БюджетПродаж.СтавкаНДС / 100) КАК СуммаБезНДС
	|ИЗ
	|	БюджетПродаж КАК БюджетПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_НормыРасходовНаТранспорт.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	|				Регион В
	|					(ВЫБРАТЬ
	|						БюджетПродаж.Регион
	|					ИЗ
	|						БюджетПродаж КАК БюджетПродаж)) КАК абс_НормыРасходовНаТранспортСрезПоследних
	|		ПО БюджетПродаж.Регион = абс_НормыРасходовНаТранспортСрезПоследних.Регион
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ЦФО,
	|	СтатьяОборотовПоБюджетам,
	|	АналитикаБюджета,
	|	Контрагент,
	|	Период");
	
	Запрос.УстановитьПараметр("Период"		,	ТекМесяц);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ЦФО"			, ЦФО);
	
	ВыборкаЦФО=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЦФО.Следующий() Цикл
		
		ВыборкаСтатья = ВыборкаЦФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатья.Следующий() Цикл
			
			ВыборкаАналитика = ВыборкаСтатья.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАналитика.Следующий() Цикл			
			
				ВыборкаКонтрагент = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					// Попробуем найти строку в табличной части, если строки нет - создадим новую
					//  если есть, заполним существующую
					СтруктураАналитик = Новый Структура("ЦФО,СтатьяОборотовПоБюджетам,Контрагент");
					ЗаполнитьЗначенияСвойств(СтруктураАналитик, ВыборкаКонтрагент);
					
					СтрокиТЧ = Объект.СоставБюджета.НайтиСтроки(СтруктураАналитик);
					
					Если СтрокиТЧ.Количество() = 0 Тогда
						
						//СтрокаТЧ = Объект.СоставБюджета.Добавить();
						СтрокаТЧ = ДобавитьНовуюСтрокуСоставБюджета(Объект);
						
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКонтрагент);
					Иначе
						СтрокаТЧ = СтрокиТЧ[0];
					КонецЕсли;
						
					ВыборкаПериод = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПериод.Следующий() Цикл
						
						СтрокаТЧ["ОперФактСумма"+Месяц(ВыборкаПериод.Период)]			= ВыборкаПериод.Сумма;
						СтрокаТЧ["ОперФактСуммаБезНДС"+Месяц(ВыборкаПериод.Период)]		= ВыборкаПериод.СуммаБезНДС;
						
						СтрокаТЧ["Подтверждено"+Месяц(ВыборкаПериод.Период)]			= Истина;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПересчитатьИтогиТЧСоставБюджета(Объект);	
	
КонецПроцедуры

Процедура СортироватьСоставБюджетаПоСтатье(Объект) Экспорт
	
	Объект.СоставБюджета.Сортировать("СтатьяОборотовПоБюджетам Возр, Контрагент Возр");
	
КонецПроцедуры

Процедура СортироватьСоставБюджетаПоКонтрагенту(Объект) Экспорт
	
	Объект.СоставБюджета.Сортировать("Контрагент Возр, СтатьяОборотовПоБюджетам Возр");
	
КонецПроцедуры

Процедура ПересчитатьИтогиТЧСоставБюджета(Объект) Экспорт
	
	Для Каждого ТекСтр Из Объект.СоставБюджета Цикл
		
		ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекСтр);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьИтогПоСтрокеТЧСоставБюджета(ТекДанные)
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПланСуммаБезНДСИтог 	= 0;
	ПланСуммаИтог 			= 0;
	ПланКоличествоИтог 		= 0;
	
	ОперФактСуммаБезНДСИтог = 0;
	ОперФактСуммаИтог 		= 0;
	ОперФактКоличествоИтог 	= 0;
	
	Для Н = 1 По 12 Цикл
		
		ПланСуммаБезНДСИтог 	= ПланСуммаБезНДСИтог 		+ ТекДанные["ПланСуммаБезНДС" 		+ Н];
		ПланСуммаИтог 			= ПланСуммаИтог 			+ ТекДанные["ПланСумма" 			+ Н];
		ПланКоличествоИтог 		= ПланКоличествоИтог 		+ ТекДанные["ПланКоличество" 		+ Н];
		
		ОперФактСуммаБезНДСИтог = ОперФактСуммаБезНДСИтог 	+ ТекДанные["ОперФактСуммаБезНДС" 	+ Н];
		ОперФактСуммаИтог 		= ОперФактСуммаИтог 		+ ТекДанные["ОперФактСумма" 		+ Н];
		ОперФактКоличествоИтог 	= ОперФактКоличествоИтог 	+ ТекДанные["ОперФактКоличество" 	+ Н];
		
	КонецЦикла;
	
	ТекДанные.ПланСуммаБезНДСИтог 		= ПланСуммаБезНДСИтог;
	ТекДанные.ПланСуммаИтог 			= ПланСуммаИтог;
	ТекДанные.ПланКоличествоИтог 		= ПланКоличествоИтог;
	
	ТекДанные.ОперФактСуммаБезНДСИтог 	= ОперФактСуммаБезНДСИтог;
	ТекДанные.ОперФактСуммаИтог 		= ОперФактСуммаИтог;
	ТекДанные.ОперФактКоличествоИтог 	= ОперФактКоличествоИтог;
		
КонецПроцедуры

Функция ДобавитьНовуюСтрокуСоставБюджета(Объект)
	
	НовыйИдентификаторСтроки = ПолучитьНовыйИдентификаторСтрокиСоставБюджета(Объект);
	
	НоваяСтрока = Объект.СоставБюджета.Добавить();
	
	НоваяСтрока.ИдентификаторСтрокиБюджета = НовыйИдентификаторСтроки;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ПолучитьНовыйИдентификаторСтрокиСоставБюджета(Объект)
	
	ТекИдентификатор = 0;
	
	МассивИдентификаторов = Объект.СоставБюджета.ВыгрузитьКолонку("ИдентификаторСтрокиБюджета");
	
	Для Каждого ИдентификаторСтроки Из МассивИдентификаторов Цикл
		
		ТекИдентификатор = Макс(ТекИдентификатор, ИдентификаторСтроки);
		
	КонецЦикла;
	
	ТекИдентификатор = ТекИдентификатор + 1;
	
	Возврат ТекИдентификатор;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполения)
	
	Ответственный 		= ПараметрыСеанса.ТекущийПользователь;
	ДатаПланирования 	= НачалоГода(ТекущаяДата());
	
	ТекущийПериод		= ДатаПланирования
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОборотыБюджетов.Записывать = Истина;
	Движения.ОборотыБюджетов.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_ОперативныйБюджетСоставБюджета.Ссылка,
	|	абс_ОперативныйБюджетСоставБюджета.ЦФО,
	|	абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам КАК СтатьяОборотов,
	|	абс_ОперативныйБюджетСоставБюджета.АналитикаБюджета КАК абс_АналитикаБюджета,
	|	абс_ОперативныйБюджетСоставБюджета.Номенклатура,
	|	абс_ОперативныйБюджетСоставБюджета.Контрагент,
	|	абс_ОперативныйБюджетСоставБюджета.ДоговорКонтрагента КАК абс_ДоговорКонтрагента,
	|	абс_ОперативныйБюджетСоставБюджета.Регион КАК абс_Регион,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС1,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС2,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС3,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС4,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС5,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС6,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС7,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС8,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС9,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС10,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС11,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСуммаБезНДС12,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма1,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма2,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма3,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма4,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма5,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма6,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма7,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма8,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма9,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма10,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма11,
	|	абс_ОперативныйБюджетСоставБюджета.ПланСумма12,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество1,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество2,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество3,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество4,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество5,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество6,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество7,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество8,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество9,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество10,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество11,
	|	абс_ОперативныйБюджетСоставБюджета.ПланКоличество12,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС1,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС2,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС3,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС4,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС5,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС6,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС7,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС8,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС9,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС10,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС11,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСуммаБезНДС12,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма1,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма2,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма3,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма4,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма5,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма6,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма7,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма8,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма9,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма10,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма11,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактСумма12,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество1,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество2,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество3,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество4,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество5,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество6,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество7,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество8,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество9,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество10,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество11,
	|	абс_ОперативныйБюджетСоставБюджета.ОперФактКоличество12,
	|	ВЫБОР
	|		КОГДА абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|				ИЛИ абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			ТОГДА 20
	|		КОГДА абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|				ИЛИ абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			ТОГДА 10
	|		КОГДА абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				ИЛИ абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|			ТОГДА 18 
	|		КОГДА абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|				ИЛИ абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
	|			ТОГДА 5
	|		КОГДА абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|				ИЛИ абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
	|			ТОГДА 7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаНДС,
	|	абс_ОперативныйБюджетСоставБюджета.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА абс_ОперативныйБюджетСоставБюджета.СтатьяОборотовПоБюджетам.абс_ТипСтатьи = ЗНАЧЕНИЕ(Перечисление.абс_ТипыСтатейОборотовПоБюджетам.СтатьяРасходов)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент
	|ИЗ
	|	Документ.абс_ОперативныйБюджет.СоставБюджета КАК абс_ОперативныйБюджетСоставБюджета
	|ГДЕ
	|	абс_ОперативныйБюджетСоставБюджета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для сч = 1 по 12 Цикл
			
			Если НЕ Выборка.СтатьяОборотов.абс_ВидЗаполнения = Перечисления.абс_ВидыЗаполненияСтатейОборотовПоБюджетам.Вручную Тогда
				Продолжить;
			КонецЕсли;

			////движения по сценарию План
			//ПланСумма		= Выборка["ПланСумма"+СокрЛП(Сч)];
			//ПланСуммаБезНДС	= Выборка["ПланСуммаБезНДС"+СокрЛП(Сч)];
			//ПланКоличество	= Выборка["ПланКоличество"+СокрЛП(Сч)];
			//
			//Если ПланСуммаБезНДС <> 0 Тогда
			//	
			//	Движение = Движения.ОборотыБюджетов.Добавить();
			//	
			//	ЗаполнитьЗначенияСвойств(Движение,Выборка);
			//	
			//	Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
			//	Движение.СуммаУпр		= ?(ПланСумма=0,ПланСуммаБезНДС+ПланСуммаБезНДС*Выборка.СтавкаНДС/100,ПланСумма)*Выборка.Коэффициент;
			//	Движение.СуммаУпрБезНДС	= ПланСуммаБезНДС*Выборка.Коэффициент;
			//	Движение.Количество		= ПланКоличество*Выборка.Коэффициент;
			//	Движение.абс_Бюджет		= Справочники.Бюджеты.СводныйБДР;
			//	Движение.Сценарий		= Справочники.СценарииПланирования.План;
			//КонецЕсли;
			
			//движения по сценарию Предварительный факт
			ОперФактСумма		= Выборка["ОперФактСумма"+СокрЛП(Сч)];
			ОперФактСуммаБезНДС	= Выборка["ОперФактСуммаБезНДС"+СокрЛП(Сч)];
			ОперФактКоличество	= Выборка["ОперФактКоличество"+СокрЛП(Сч)];
			
			Если ОперФактСумма<>0 ИЛИ ОперФактСуммаБезНДС<>0 ИЛИ ОперФактКоличество<>0 Тогда
				
				Движение = Движения.ОборотыБюджетов.Добавить();
				
				ЗаполнитьЗначенияСвойств(Движение,Выборка);
				
				Движение.ЦФО 			= ?(Движение.СтатьяОборотов.абс_ПрямаяЗатрата, Выборка.ЦФО, Движение.СтатьяОборотов.ОсновноеЦФО);
				Движение.Период 		= ДобавитьМесяц(ДатаПланирования,Сч-1);
				Движение.СуммаУпр		= ?(ОперФактСумма=0,ОперФактСуммаБезНДС+ОперФактСуммаБезНДС*Выборка.СтавкаНДС/100,ОперФактСумма)*Выборка.Коэффициент;
				Движение.СуммаУпрБезНДС	= ОперФактСуммаБезНДС	* Выборка.Коэффициент;
				Движение.Количество		= ОперФактКоличество	* Выборка.Коэффициент;
				Движение.абс_Бюджет		= Справочники.Бюджеты.СводныйБДР;
				Движение.Сценарий		= Справочники.СценарииПланирования.ОперативныйФакт;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого СтрБюджет Из СоставБюджета Цикл
		
		СтрБюджет.ЦФО = ЦФО;
		
	КонецЦикла;
	
КонецПроцедуры
