
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.  
	Перем ДоговорКонтрагента;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ДоговорКонтрагента = Владелец;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец") Тогда
		ДоговорКонтрагента = ДанныеЗаполнения.Владелец;
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда 
		Владелец						=	ДоговорКонтрагента;
		Лео_ЧислоДнейПредоплаты			=	Владелец.Лео_ЧислоДнейПредоплаты;
		ДопустимоеЧислоДнейЗадолженности=	Владелец.ДопустимоеЧислоДнейЗадолженности;
		Лео_ПроцентПредоплатыПоставщик	=	Владелец.Лео_ПроцентПредоплатыПоставщик;	
	КонецЕсли;
КонецПроцедуры
