
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяОбменСоСбербанком = Ложь;
	ЭлектронныеДокументыПереопределяемый.ПроверитьИспользованиеПодсистемыСбербанк(ИспользуетсяОбменСоСбербанком);
	
	ИспользуетсяОбменЭДСБанками = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции(
																					"ИспользоватьОбменЭДСБанками");
	
	Если НЕ (ИспользуетсяОбменСоСбербанком И ИспользуетсяОбменЭДСБанками) Тогда
		Элементы.ЗагрузитьСертификатСТокена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
