
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	//Если используется механизм согласования заявок, и заявка еще не прошла по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	//+Лео Сафонов ЕА
	//НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаявок.СоздатьНаборЗаписей();
	//НаборЗаписейСостояниеСогласования.Отбор.Заявка.Установить(Ссылка);
	//НаборЗаписейСостояниеСогласования.Прочитать();
	//Если УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(Организация, Дата) Тогда
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ЗаявкаНаОбразцы,Дата) Тогда

		//абс вставка 38760
		Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних");
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
					
					МаршрутСогласования = абс_СогласованиеДокументов.Лео_ОпределитьМаршрутСогласованияЗаявкаНаОбразцы(ЭтотОбъект);
					
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						//Пока заблокирую и подумаю 13122023
						//Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						//ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период 					= ТекущаяДата();
					НоваяЗапись.Активность 				= Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь 			= Ответственный;
					НоваяЗапись.Этап 					= МаршрутСогласования;
					НоваяЗапись.ТекущийЭтап             = "Начальный";
					НоваяЗапись.Уровень 				= МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние 				= Перечисления.СостоянияОбъектов.Подготовлен;
					
					НаборЗаписейСостояниеСогласования.Записать();
					ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
					ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования,НоваяЗапись.Состояние);

					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//абс вставка 38760 конец

		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования
			Возврат;
		КонецЕсли;
		///+абс вставка 38760 конец
		МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Подразделение,Перечисления.абс_ТипыДокументовДляСогласования.Лео_ЗаявкаНаОбразцы);
		
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			//Пока заблокирую и подумаю 13122023
			//ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования заявки", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		НаборЗаписейСостояниеСогласования.Очистить();
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		//НоваяЗапись.Заявка = Ссылка;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь = Ответственный;
		НоваяЗапись.Этап = МаршрутСогласования;
		НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		
		НаборЗаписейСостояниеСогласования.Записать();
		
		ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
		ОбработкаСогласования.СформироватьЗадачуСотруднику(Ссылка, МаршрутСогласования, НоваяЗапись.Состояние);
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Удаление движений по регистру СостоянияСогласованияЗаявок, если заявка была подготовлена
	//+Лео Сафонов ЕА
	//НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаявок.СоздатьНаборЗаписей();
	//НаборЗаписейСостояниеСогласования.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	//-Лео Сафонов ЕА
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если НаборЗаписейСостояниеСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	//+Лео Сафонов ЕА
	//Если УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(Организация, Дата) Тогда
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств,Дата) Тогда
	//-Лео Сафонов ЕА
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Заявка уже пошла по маршруту согласования, не следует ничего менять
			Возврат;
		КонецЕсли;
		//Если в наборе записей только одна запись - значит заявка только подготовлена.
		//Очистим набор записей
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этой заявке, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры

