
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерсоналПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
	
	ДокументОснование = Объект.ДокументОснование;
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		Если НоваяСтрока и НЕ Копирование тогда
			
			Элемент.ТекущиеДанные.Смена = Справочники.Лео_сменыПереработчиков.НайтиПоКоду("000000002"); //8 часов
			Элемент.ТекущиеДанные.Подразделение = ДокументОснование.Подразделение;
			Элемент.ТекущиеДанные.ВидОборудования = ДокументОснование.Лео_оборудование;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерсоналПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	// Вставить содержимое обработчика.
	
	ФизЛицо = Элемент.ТекущиеДанные.ФизЛицо;
	Если ЗначениеЗаполнено(ФизЛицо) и НоваяСтрока тогда
		Элемент.ТекущиеДанные.Должность = ФизЛицо.Лео_Должность;
		
		Если ФизЛицо.Родитель.Код = "БП00002643" тогда
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0010883"); //Группа линейного персонала ООО	
			//переработчики	
		ИначеЕсли ФизЛицо.Родитель.Код = "БП00000960" тогда
			
			//Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0007666"); //ПРОФЕССИОНАЛ СТАФФ ООО
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ0011911"); //ЦЕНТР МЕДИА ОО
			
		иначе
			
			Элемент.ТекущиеДанные.Контрагент = Справочники.Контрагенты.НайтиПоКоду("К00000011"); //ЛЕОВИТ нутрио
			
		КонецЕсли; 
		
		Элемент.ТекущиеДанные.Смена = СменаФизЛица(ФизЛицо, ФизЛицо.Лео_Должность, ЭтаФорма.Объект.Дата);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция СменаФизЛица(ФизЛицо,Должность, ДатаДок)

		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(Лео_ТабельУчетаВремениВыработка.Количество) КАК Количество,
		               |	Лео_ТабельУчетаВремениВыработка.ФизЛицо,
		               |	Лео_ТабельУчетаВремениВыработка.Должность
		               |ПОМЕСТИТЬ Основа
		               |ИЗ
		               |	Документ.Лео_ТабельУчетаВремени.Выработка КАК Лео_ТабельУчетаВремениВыработка
		               |ГДЕ
		               |	Лео_ТабельУчетаВремениВыработка.Ссылка.Дата МЕЖДУ &ДатаС И &ДатаПо
		               |	И Лео_ТабельУчетаВремениВыработка.ФизЛицо = &ФизЛицо
		               |	И Лео_ТабельУчетаВремениВыработка.Должность = &Должность
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Лео_ТабельУчетаВремениВыработка.ФизЛицо,
		               |	Лео_ТабельУчетаВремениВыработка.Должность
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Основа.Количество,
		               |	Основа.ФизЛицо,
		               |	Основа.Должность,
		               |	ВЫБОР
		               |		КОГДА Основа.Количество <= 8
		               |			ТОГДА 8
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА Основа.Количество > 8
		               |						И Основа.Количество <= 12
		               |					ТОГДА 12
		               |				ИНАЧЕ 24
		               |			КОНЕЦ
		               |	КОНЕЦ КАК Смена
		               |ИЗ
		               |	Основа КАК Основа";
		
		Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо);
		Запрос.УстановитьПараметр("Должность",Должность);
		Запрос.УстановитьПараметр("ДатаС",НачалоДня(ДатаДок));
		Запрос.УстановитьПараметр("ДатаПо",КонецДня(ДатаДок));
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество()> 0 тогда
			
			Если Результат[0].Смена = 8 тогда 
			
			    Возврат Справочники.Лео_сменыПереработчиков.НайтиПоКоду("000000002");
				
			ИначеЕсли Результат[0].Смена = 12 тогда 	
				
				Возврат Справочники.Лео_сменыПереработчиков.НайтиПоКоду("000000001");
				
			ИначеЕсли Результат[0].Смена = 24 тогда 	
				
				Возврат Справочники.Лео_сменыПереработчиков.НайтиПоКоду("000000003");
				
			КонецЕсли;	
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если РольДоступна("МастерСмены") и НЕ РольДоступна("ПолныеПрава") тогда
		Отказ = Истина;
	КонецЕсли;	
		
КонецПроцедуры
