
Процедура ЗаполнитьТабЧастьНеотгруженныеТовары(СтруктураПараметров, ДокументОбъект, СтрокаТабЧастиТовары, ИзменятьКоличество = Истина) Экспорт
	
	НеотгруженноеКоличество =  СтруктураПараметров.НеотгруженноеКоличество;
	Если НеотгруженноеКоличество > 0 Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура",СтрокаТабЧастиТовары.Номенклатура);
		ПараметрыОтбора.Вставить("СерияНоменклатуры",СтрокаТабЧастиТовары.СерияНоменклатуры);
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")Тогда
			ПараметрыОтбора.Вставить("Качество",СтрокаТабЧастиТовары.Качество);			
			ПараметрыОтбора.Вставить("СпособСписанияОстаткаТоваров",СтрокаТабЧастиТовары.СпособСписанияОстаткаТоваров);
		КонецЕсли;
		ПараметрыОтбора.Вставить("ПричинаНеотгрузки",СтруктураПараметров.ПричинаНеотгрузки);
		ПараметрыОтбора.Вставить("СкладПретензий",СтруктураПараметров.СкладПретензий);
		ПараметрыОтбора.Вставить("НомерПретензии",СтруктураПараметров.НомерПретензии);
		ПараметрыОтбора.Вставить("ДатаПретензии",СтруктураПараметров.ДатаПретензии);
		
		МассивСтрок = ДокументОбъект.абс_Неотгружено.НайтиСтроки(ПараметрыОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаНеотгруженныхТоваров = ДокументОбъект.абс_Неотгружено.Добавить();
		Иначе
			СтрокаНеотгруженныхТоваров = МассивСтрок[0];
		КонецЕсли;
		
		СтрокаНеотгруженныхТоваров.Номенклатура      = СтрокаТабЧастиТовары.Номенклатура;
		СтрокаНеотгруженныхТоваров.СерияНоменклатуры = СтрокаТабЧастиТовары.СерияНоменклатуры;
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")Тогда
			СтрокаНеотгруженныхТоваров.Качество     	 = СтрокаТабЧастиТовары.Качество;
			СтрокаНеотгруженныхТоваров.СпособСписанияОстаткаТоваров	 = СтрокаТабЧастиТовары.СпособСписанияОстаткаТоваров;
		КонецЕсли;
		СтрокаНеотгруженныхТоваров.Количество        = СтрокаНеотгруженныхТоваров.Количество + НеотгруженноеКоличество;
		СтрокаНеотгруженныхТоваров.ЕдиницаИзмерения  = СтрокаТабЧастиТовары.ЕдиницаИзмерения;
		СтрокаНеотгруженныхТоваров.ПричинаНеотгрузки = СтруктураПараметров.ПричинаНеотгрузки;
		СтрокаНеотгруженныхТоваров.НомерПретензии	 = СтруктураПараметров.НомерПретензии;
		СтрокаНеотгруженныхТоваров.ДатаПретензии	 = СтруктураПараметров.ДатаПретензии;
		СтрокаНеотгруженныхТоваров.СкладПретензий	 = СтруктураПараметров.СкладПретензий;
		
		
		Сумма = ?(ДокументОбъект.СуммаВключаетНДС,СтрокаТабЧастиТовары.Сумма,СтрокаТабЧастиТовары.Сумма+СтрокаТабЧастиТовары.СуммаНДС); 
		
		Если СтрокаТабЧастиТовары.Количество = НеотгруженноеКоличество Тогда
			//+Сафонов ЕА
			//СтрокаНеотгруженныхТоваров.Сумма = Сумма;
			//СтрокаНеотгруженныхТоваров.СуммаНДС =  СтрокаТабЧастиТовары.СуммаНДС;
			СтрокаНеотгруженныхТоваров.Сумма  = НеотгруженноеКоличество * СтрокаТабЧастиТовары.Цена;
            СтрокаНеотгруженныхТоваров.СуммаНДС  = УчетНДС.РассчитатьСуммуНДС(СтрокаНеотгруженныхТоваров.Сумма,ДокументОбъект.УчитыватьНДС, ДокументОбъект.СуммаВключаетНДС,УчетНДС.ПолучитьСтавкуНДС(СтрокаТабЧастиТовары.СтавкаНДС));
			СтрокаНеотгруженныхТоваров.СтавкаНДС =  СтрокаТабЧастиТовары.СтавкаНДС;
			СтрокаНеотгруженныхТоваров.Цена = СтрокаТабЧастиТовары.Цена;
			//-Сафонов ЕА
			//удалим строку в таб. части Товары, кол-во полностью перенесено в Неотгруженные
			ДокументОбъект.Товары.Удалить(СтрокаТабЧастиТовары);
		Иначе
			//+Сафонов ЕА
			//СтрокаНеотгруженныхТоваров.Сумма = Сумма * НеотгруженноеКоличество / СтрокаТабЧастиТовары.Количество;
					
			СтрокаНеотгруженныхТоваров.Сумма  = НеотгруженноеКоличество * СтрокаТабЧастиТовары.Цена;
			СтрокаНеотгруженныхТоваров.СтавкаНДС  = СтрокаТабЧастиТовары.СтавкаНДС;
			СтрокаНеотгруженныхТоваров.СуммаНДС  = УчетНДС.РассчитатьСуммуНДС(СтрокаНеотгруженныхТоваров.Сумма,ДокументОбъект.УчитыватьНДС, ДокументОбъект.СуммаВключаетНДС,УчетНДС.ПолучитьСтавкуНДС(СтрокаТабЧастиТовары.СтавкаНДС));
			СтрокаНеотгруженныхТоваров.Цена = СтрокаТабЧастиТовары.Цена;
			//-Сафонов ЕА
			
			// АБС ИЗМЕНЕНО Фролов Не уменьшаем количество в документе, оно уже было изменено вручную
			Если ИзменятьКоличество Тогда
				СтрокаТабЧастиТовары.Количество = СтрокаТабЧастиТовары.Количество - НеотгруженноеКоличество;
			КонецЕсли;
			
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);
		КонецЕсли;
		
		//+Сафонов ЕА
		//СтрокаНеотгруженныхТоваров.Цена = ?(СтрокаНеотгруженныхТоваров.Количество=0,0,СтрокаНеотгруженныхТоваров.Сумма/СтрокаНеотгруженныхТоваров.Количество);
		//-Сафонов ЕА
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьИзПринятоВТовары(Количество,ДокументОбъект, СтрокаТабЧастиПринято) Экспорт
	
	Если Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", СтрокаТабЧастиПринято.Номенклатура);
	ПараметрыОтбора.Вставить("СерияНоменклатуры",СтрокаТабЧастиПринято.СерияНоменклатуры);
	ПараметрыОтбора.Вставить("ЕдиницаИзмерения",СтрокаТабЧастиПринято.ЕдиницаИзмерения);
		
	МассивСтрок = ДокументОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
		
	Если МассивСтрок.Количество() = 0 Тогда
		мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		СтрокаТабЧастиТовары = ДокументОбъект.Товары.Добавить();
		СтрокаТабЧастиТовары.Номенклатура = СтрокаТабЧастиПринято.Номенклатура;
		СтрокаТабЧастиТовары.Количество = Количество;
		СтрокаТабЧастиТовары.СерияНоменклатуры = СтрокаТабЧастиПринято.СерияНоменклатуры;
		СтрокаТабЧастиТовары.Качество = Справочники.Качество.Новый;
		СтрокаТабЧастиТовары.ЕдиницаИзмерения = СтрокаТабЧастиПринято.ЕдиницаИзмерения;
		СтрокаТабЧастиТовары.ЕдиницаИзмеренияМест = СтрокаТабЧастиПринято.Номенклатура.ЕдиницаИзмеренияМест;
		СтрокаТабЧастиТовары.Коэффициент = СтрокаТабЧастиТовары.ЕдиницаИзмерения.Коэффициент;
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект, "Реализация");
		ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект, мВалютаРегламентированногоУчета); 
	Иначе
		СтрокаТабЧастиТовары = МассивСтрок[0];
		СтрокаТабЧастиТовары.Количество = СтрокаТабЧастиТовары.Количество + Количество;
	КонецЕсли;
		
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабЧастиТовары, ДокументОбъект);

КонецПроцедуры

Процедура абс_ПередЗаписьюЗаказПокупателяПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Источник.абс_Статус) Тогда
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Создан;
	КонецЕсли;
	
	//АБС ВСТАВКА   31.03.2014 14:02:05  Балашенко
	абс_НомерЗаказаEDI = "";	
	Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
		Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.абс_СообщениеEDI") Тогда
			Источник.абс_НомерЗаказаEDI = Источник.ДокументОснование.НомерДокументаEDIЗаказа;
		КонецЕсли;
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	Если Источник.ПометкаУдаления ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
	//	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	//КонецЕсли;
	
	//АБС ВСТАВКА   07.05.2014 17:23:00  Балашенко
	//проверка заполнения реквизита "Дата отгрузки"
	//если переводим в статус "К отгрузке" и выше - должен быть заполнен
	Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке ИЛИ
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.ВПути ИЛИ
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Доставлен ИЛИ
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт ИЛИ
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда
		
		Если Не ЗначениеЗаполнено(Источник.ДатаОтгрузки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнена дата отгрузки!", Отказ);
		КонецЕсли;
		
		//Если Не ЗначениеЗаполнено(Источник.Грузоотправитель) Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("Не выбран грузоотправитель!", Отказ);
		//КонецЕсли;		
				
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	//АБС ВСТАВКА   04.04.2014 9:36:52  Балашенко
	ЗаполнитьРазмещение(Источник);
	//АБС ВСТАВКА  КОНЕЦ	
	 
	//размещаем проверку здесь, а не в подписке-обработчике проведения, чтобы лишний раз не срабатывала штатная обработка проведения
	Если Источник.абс_Статус <> Перечисления.абс_СтатусыОтгрузки.НеСогласован И Источник.абс_Статус <> Перечисления.абс_СтатусыОтгрузки.Создан И Источник.абс_Статус <> Перечисления.абс_СтатусыОтгрузки.Аннулирован Тогда
		Для Каждого СтрокаТаб Из Источник.Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаб.Размещение) Тогда
				Отказ = Истина;
				Сообщить("В строке " + Строка(СтрокаТаб.НомерСтроки) + " не указано размещение!",СтатусСообщения.Важное);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//АБС ВСТАВКА 38839  11.02.2014 16:15:59  Манжела
	//Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке Тогда
	//	//абс_Дистрибуция.ПроверитьПоСтопЛисту(Источник, Отказ, "Проведение документа """ + Источник +""": ");
	//КонецЕсли;	
	//АБС ВСТАВКА 38839 КОНЕЦ
	
	//АБС ВСТАВКА   11.04.2014 15:59:06  Балашенко
	//Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Согласован
	//	ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке Тогда
	//	ЕстьОшибки = Ложь;
	//	абс_Дистрибуция.ПроверитьПоСтопЛисту(Источник, ЕстьОшибки, "Проведение документа """ + Источник +""": ");
	//КонецЕсли;	
	//АБС ВСТАВКА  КОНЕЦ
	
	
	 //АБС ВСТАВКА   03.04.2014 16:19:25  Балашенко
	 Обработки.абс_ЗаполнитьСертификаты.ЗаполнитьСертификаты(Источник);
	 //АБС ВСТАВКА  КОНЕЦ
	 
 КонецПроцедуры
 
Процедура ЗаполнитьРазмещение(Источник) Экспорт
	
	Для каждого СтрокаТЧ из Источник.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Размещение) Тогда
			Если ТипЗнч(Источник.СкладГруппа) = Тип("СправочникСсылка.Склады") Тогда
				СтрокаТЧ.Размещение = Источник.СкладГруппа;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	 
Процедура абс_ОбработкаПроведенияЗаказПокупателяОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//+Лео Сафонов Исключаем заказы внутренним контрагентам	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыСвязанныеСОрганизациямиСрезПоследних.Период,
		|	КонтрагентыСвязанныеСОрганизациямиСрезПоследних.Организация,
		|	КонтрагентыСвязанныеСОрганизациямиСрезПоследних.Контрагент,
		|	КонтрагентыСвязанныеСОрганизациямиСрезПоследних.ВидСобственнойОрганизации
		|ИЗ
		|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями.СрезПоследних КАК КонтрагентыСвязанныеСОрганизациямиСрезПоследних
		|ГДЕ
		|	КонтрагентыСвязанныеСОрганизациямиСрезПоследних.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Источник.Контрагент);

	Результат = Запрос.Выполнить();
    Если Результат.Пустой()Тогда
	//-Лео Сафонов Исключаем заказы внутренним контрагентам
	
		//проведение заказа по регистру абс_НеотгруженныеТовары
		Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт  Тогда
			СформироватьДвиженияПоНеотгруженнымТоварам(Источник);
		КонецЕсли;
		
		//+Лео Сафонов ЕА Движение по регистру Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта
		Если Не Отказ Тогда
			//Только для  ДИСТРИБЬЮЦИЯ и Прочие проекты
			Если  Источник.Контрагент.абс_Отдел = Справочники.Регионы.НайтиПоКоду("Б00000004") Или
				  Источник.Контрагент.абс_Отдел = Справочники.Регионы.НайтиПоКоду("Б00000017") Или
			      Источник.Контрагент.абс_Отдел = Справочники.Регионы.НайтиПоКоду("Б00000329") Или
			      Источник.Контрагент.абс_Отдел = Справочники.Регионы.НайтиПоКоду("Б00000359") Или
			      Источник.Контрагент.абс_Отдел = Справочники.Регионы.НайтиПоКоду("Б00000009") Тогда
				  лео_ОбработкаОповещения.ЗаказПокупателяДвижениеПоРегиструЛео_ОчередьПочтовогоОповещенияПриИзменениОбъекта(Источник.Ссылка,ТекущаяДата());	
			КонецЕсли;
					
			Если Источник.абс_Неотгружено.Количество() > 0  Тогда
				лео_ОбработкаОповещения.ЗаказПокупателяДвижениеПоРегиструЛео_ОчередьПочтовогоОповещенияПриПереносеВНеотгружено(Источник.Ссылка,ТекущаяДата());	
			КонецЕсли;

		КонецЕсли;
		//-Лео Сафонов ЕА Движение по регистру Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта
     КонецЕсли;
КонецПроцедуры

Процедура абс_ОбработкаПроведенияРеализацияТоваровУслугОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Создан 
		ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Аннулирован Тогда
		Возврат;
	КонецЕсли;
	//проведение заказа по регистру абс_НеотгруженныеТовары
	СформироватьДвиженияПоНеотгруженнымТоварам(Источник);
	
	СформироватьДвиженияПоСкладуПретензий(Источник);
	
	_ЗаполнитьДокументОтгрузкиВЗаявкеНаТранспорт(Источник); // ZAA
	_СформироватьДвиженияПоРН_Лео_Продажи(Источник);
	
КонецПроцедуры


Процедура _ЗаполнитьДокументОтгрузкиВЗаявкеНаТранспорт(Реализация)

	ЗаказПокупателя = Реализация.Сделка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ЗаявкаНаТранспорт.Ссылка как ЗаявкаНаТранспорт,
	|	абс_ЗаявкаНаТранспорт.ЗаказПокупателя,
	|	абс_ЗаявкаНаТранспорт.ДокументОтгрузки
	|ИЗ
	|	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ЗаявкаНаТранспорт.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		ЗаявкаНаТранспорт = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт;
		Если НЕ ЗаявкаНаТранспорт.Пустая() и НЕ ЗначениеЗаполнено(ЗаявкаНаТранспорт.ДокументОтгрузки) тогда
			ЗаявкаНаТранспортОбъект = ЗаявкаНаТранспорт.ПолучитьОбъект();
			Если НЕ ЗначениеЗаполнено(ЗаявкаНаТранспортОбъект.ДокументОтгрузки) тогда
				ЗаполнитьДокументОтгрузкиВЗаявкеНаТранспорт(ЗаявкаНаТранспортОбъект,ЗаказПокупателя);
				ЗаявкаНаТранспортОбъект.Записать();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнен документ отгрузки в док " + сокрлп(ЗаявкаНаТранспорт));	 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры	

Процедура абс_ОбработкаПроведенияКорректировкаРеализацииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//проведение заказа по регистру абс_НеотгруженныеТовары
	Если ТипЗнч(Источник.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		СформироватьДвиженияПоНеотгруженнымТоварам(Источник);		
	КонецЕсли;
	
	_СформироватьДвиженияПоРН_Лео_Продажи(Источник);
	
КонецПроцедуры

Процедура абс_ОбработкаПроведенияВозвратТоваровОтПокупателяОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//проведение заказа по регистру абс_НеотгруженныеТовары
	СформироватьДвиженияПоНеотгруженнымТоварам(Источник);
	
КонецПроцедуры

Процедура СформироватьДвиженияПоСкладуПретензий(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугабс_Неотгружено.Номенклатура,
	|	СУММА(РеализацияТоваровУслугабс_Неотгружено.Количество * РеализацияТоваровУслугабс_Неотгружено.ЕдиницаИзмерения.Коэффициент / РеализацияТоваровУслугабс_Неотгружено.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК Количество,
	|	РеализацияТоваровУслугабс_Неотгружено.СерияНоменклатуры,
	|	РеализацияТоваровУслугабс_Неотгружено.Качество,
	|	РеализацияТоваровУслугабс_Неотгружено.СкладПретензий,
	|	РеализацияТоваровУслугабс_Неотгружено.СпособСписанияОстаткаТоваров,
	|	РеализацияТоваровУслугабс_Неотгружено.ПричинаНеотгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.абс_Неотгружено КАК РеализацияТоваровУслугабс_Неотгружено
	|ГДЕ
	|	НЕ РеализацияТоваровУслугабс_Неотгружено.СкладПретензий = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	И РеализацияТоваровУслугабс_Неотгружено.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугабс_Неотгружено.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугабс_Неотгружено.Номенклатура,
	|	РеализацияТоваровУслугабс_Неотгружено.СерияНоменклатуры,
	|	РеализацияТоваровУслугабс_Неотгружено.Качество,
	|	РеализацияТоваровУслугабс_Неотгружено.СкладПретензий,
	|	РеализацияТоваровУслугабс_Неотгружено.СпособСписанияОстаткаТоваров,
	|	РеализацияТоваровУслугабс_Неотгружено.ПричинаНеотгрузки";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРезерв = Источник.Движения.ТоварыВРезервеНаСкладах;
	ДвиженияТоварыНаСкладах =  Источник.Движения.ТоварыНаСкладах;
	//+Лео Сафонов 02.09.2014
	ДвиженияТоварыОрганизаций =  Источник.Движения.ТоварыОрганизаций;
	//+Лео Сафонов 02.09.2014
	
	ТаблицаСоответствияСкладов = ПолучитьТаблицуСоответствияРеальныхВиртуальныхСкладов();
	РеальныйСклад = Источник.Склад;
	ВиртуальныйСклад = Неопределено;
	СтрокаСоответствия = ТаблицаСоответствияСкладов.Найти(РеальныйСклад,"РеальныйСклад");
	Если СтрокаСоответствия<>Неопределено Тогда
		ВиртуальныйСклад=СтрокаСоответствия.ВиртуальныйСклад; 
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва Тогда
		
			//Движения по регистру ТоварыВРезервеНаСкладах
			Движение = ДвиженияРезерв.Добавить();
			Движение.Период				= Источник.Дата;
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			Движение.Склад 		 		= ?(ВиртуальныйСклад = Неопределено, РеальныйСклад, ВиртуальныйСклад);
			Движение.Номенклатура		= Выборка.Номенклатура;
			Движение.ДокументРезерва	= Источник.Сделка;
			Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
			Движение.Количество 		= Выборка.Количество;
			
		КонецЕсли;
			
		//Движения по регистру ТоварыНаСкладах
		
		//по виртуальному складу
		Если Не ВиртуальныйСклад = Неопределено Тогда
			Движение = ДвиженияТоварыНаСкладах.Добавить();
			Движение.Период				= Источник.Дата;
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			Движение.Склад 		 		= ВиртуальныйСклад;
			Движение.Номенклатура		= Выборка.Номенклатура;
			Движение.Качество			= Выборка.Качество;
			Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
			Движение.Количество 		= Выборка.Количество;
			
			//+Лео Сафонов 02.09.2014
			Движение = ДвиженияТоварыОрганизаций.Добавить();
			Движение.Организация		= Источник.Организация;
			Движение.Период				= Источник.Дата;
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			Движение.Склад 		 		= ВиртуальныйСклад;
			Движение.Номенклатура		= Выборка.Номенклатура;
			Движение.Качество			= Выборка.Качество;
			Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
			Движение.Количество 		= Выборка.Количество;
			//-Лео Сафонов 02.09.2014

		КонецЕсли;
		
		//по реальному складу
		Движение = ДвиженияТоварыНаСкладах.Добавить();
		Движение.Период				= Источник.Дата;
		Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
		Движение.Склад 		 		= РеальныйСклад;
		Движение.Номенклатура		= Выборка.Номенклатура;
		Движение.Качество			= Выборка.Качество;
		Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
		Движение.Количество 		= Выборка.Количество;
		
		
		Движение = ДвиженияТоварыНаСкладах.Добавить();
		Движение.Период				= Источник.Дата;
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		Движение.Склад 		 		= Выборка.СкладПретензий;
		Движение.Номенклатура		= Выборка.Номенклатура;
		Движение.Качество			= Выборка.Качество;
		Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
		Движение.Количество 		= Выборка.Количество;
		
	    //+Лео Сафонов 02.09.2014
		Если Источник.Дата >= Дата("20150101000000")Тогда	
			Леовит = Справочники.Организации.НайтиПоКоду("О00000003");
			Движение = ДвиженияТоварыОрганизаций.Добавить();
			Движение.Организация		= Леовит;
			Движение.Период				= Источник.Дата;
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			Движение.Склад 		 		= РеальныйСклад;
			Движение.Номенклатура		= Выборка.Номенклатура;
			Движение.Качество			= Выборка.Качество;
			Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
			Движение.Количество 		= Выборка.Количество;
			
			
			Движение = ДвиженияТоварыОрганизаций.Добавить();
			Движение.Организация		= Леовит;
			Движение.Период				= Источник.Дата;
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			Движение.Склад 		 		= Выборка.СкладПретензий;
			Движение.Номенклатура		= Выборка.Номенклатура;
			Движение.Качество			= Выборка.Качество;
			Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
			Движение.Количество 		= Выборка.Количество;
	
		Иначе
			  Если   Выборка.ПричинаНеотгрузки = Справочники.абс_ПричиныНеотгрузки.НайтиПоНаименованию("Недопоставка (Склад)") Тогда
					Леовит = Справочники.Организации.НайтиПоКоду("О00000003");
					Движение = ДвиженияТоварыОрганизаций.Добавить();
					Движение.Организация		= Леовит;
					Движение.Период				= Источник.Дата;
					Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
					Движение.Склад 		 		= РеальныйСклад;
					Движение.Номенклатура		= Выборка.Номенклатура;
					Движение.Качество			= Выборка.Качество;
					Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
					Движение.Количество 		= Выборка.Количество;
					
					
					Движение = ДвиженияТоварыОрганизаций.Добавить();
					Движение.Организация		= Леовит;
					Движение.Период				= Источник.Дата;
					Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
					Движение.Склад 		 		= Выборка.СкладПретензий;
					Движение.Номенклатура		= Выборка.Номенклатура;
					Движение.Качество			= Выборка.Качество;
					Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
					Движение.Количество 		= Выборка.Количество;
				Иначе
					Движение = ДвиженияТоварыОрганизаций.Добавить();
					Движение.Организация		= Источник.Организация;
					Движение.Период				= Источник.Дата;
					Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
					Движение.Склад 		 		= РеальныйСклад;
					Движение.Номенклатура		= Выборка.Номенклатура;
					Движение.Качество			= Выборка.Качество;
					Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
					Движение.Количество 		= Выборка.Количество;
					
					
					Движение = ДвиженияТоварыОрганизаций.Добавить();
					Движение.Организация		= Источник.Организация;
					Движение.Период				= Источник.Дата;
					Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
					Движение.Склад 		 		= Выборка.СкладПретензий;
					Движение.Номенклатура		= Выборка.Номенклатура;
					Движение.Качество			= Выборка.Качество;
					Движение.СерияНоменклатуры  = Выборка.СерияНоменклатуры;
					Движение.Количество 		= Выборка.Количество;
				КонецЕсли;
			КонецЕсли;
        //-Лео Сафонов 02.09.2014

	КонецЦикла;
	
	ДвиженияРезерв.Записывать = Истина;
	ДвиженияТоварыНаСкладах.Записывать = Истина;
	
КонецПроцедуры

//+Лаврухин  31,10,2014
Функция ПолучитьПодчиненныеДокументы(ДокументСсылка, СписокСвязанныхДокументов = Неопределено, мУжеВСписке = Неопределено) Экспорт
    
    Если СписокСвязанныхДокументов = Неопределено Тогда 
        СписокСвязанныхДокументов = Новый СписокЗначений;
    КонецЕсли;
    Если мУжеВСписке = Неопределено Тогда 
        мУжеВСписке = Новый Соответствие;
    КонецЕсли;
    
    Таблица = ПолныеПрава.ПолучитьВыборкуПоКритериюОтбора("СвязанныеДокументы", ДокументСсылка);    
    КэшПоТипамДокументов = Новый Соответствие;
    
    Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
        МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
        Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
            Продолжить;
        КонецЕсли;            
        ИмяДокумента = МетаданныеДокумента.Имя;
        СинонимДокумента = МетаданныеДокумента.Синоним;
        
        СтруктураТипа = КэшПоТипамДокументов[ИмяДокумента];
        Если СтруктураТипа = Неопределено Тогда
            СтруктураТипа = Новый Структура("Синоним, МассивСсылок", СинонимДокумента, Новый Массив);
            КэшПоТипамДокументов.Вставить(ИмяДокумента, СтруктураТипа);
        КонецЕсли;
        СтруктураТипа.МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);        
    КонецЦикла;
    
    ЕСли КэшПоТипамДокументов.Количество() = 0 Тогда 
        Возврат СписокСвязанныхДокументов;
    КонецЕсли;
    
    ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
    ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы ";
    Запрос = Новый Запрос;
    Для Каждого КлючИЗначение ИЗ КэшПоТипамДокументов Цикл
        Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "
                    |ВЫБРАТЬ ", "
                    |ОБЪЕДИНИТЬ ВСЕ
                    |ВЫБРАТЬ") + "
                    |Ссылка
                    |ИЗ Документ." + КлючИЗначение.Ключ + "
                    |ГДЕ Ссылка В (&" + КлючИЗначение.Ключ + ")";
                    
        Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение.МассивСсылок);        
    КонецЦикла;
    
    Запрос.Текст = ТекстЗапросаНачало + Запрос.Текст + ТекстЗапросаКонец;
    
    Выборка = Запрос.Выполнить().Выбрать();    
    Пока Выборка.Следующий() Цикл
        Если мУжеВСписке[Выборка.Ссылка] = Неопределено Тогда
            СписокСвязанныхДокументов.Добавить(Выборка.Ссылка);
            мУжеВСписке.Вставить(Выборка.Ссылка, Истина);
            СписокСвязанныхДокументов = ПолучитьПодчиненныеДокументы(Выборка.Ссылка, СписокСвязанныхДокументов, мУжеВСписке);
        КонецЕсли;
    КонецЦикла;
    
    Возврат СписокСвязанныхДокументов;
    
КонецФункции
//-Лаврухин

Процедура СформироватьДвиженияПоНеотгруженнымТоварам(Источник) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		ВидДокумента = "ЗаказПокупателя";
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		ВидДокумента = "РеализацияТоваровУслуг";
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		ВидДокумента = "КорректировкаРеализации";
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
		ВидДокумента = "ВозвратТоваровОтПокупателя";
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		ВидДокумента = "ПоступлениеТоваровУслуг";
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ВидДокумента);
	
	Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
	
	Движения = Источник.Движения.абс_НеотгруженныеТовары;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение =  Источник.Движения.абс_НеотгруженныеТовары.Добавить();
		Движение.Период                = Источник.Дата;
		
		Если ТипИсточника = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
			Движение.ЗаказПокупателя = Источник.Ссылка;
			
			//+Лаврухин 31,10,2014
			СписокПодчиненныеДокументы = ПолучитьПодчиненныеДокументы(Источник.Ссылка);
			Если СписокПодчиненныеДокументы.Количество()> 0 Тогда 
				ДокументРеализации = ПолучитьПодчиненныеДокументы(Источник.Ссылка)[0].Значение;
				Движение.ДокументОтгрузки = ДокументРеализации;
			Иначе
				Движение.ДокументОтгрузки = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			КонецЕсли;
            //-Лаврухин 
			
		ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			Если ТипЗнч(Источник.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Движение.ЗаказПокупателя = Источник.Сделка;
			КонецЕсли;
			Движение.ДокументОтгрузки = Источник.Ссылка;
		ИначеЕсли ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
			Если ТипЗнч(Источник.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Движение.ЗаказПокупателя = Источник.Сделка;
			КонецЕсли;
			Движение.ДокументОтгрузки = Источник.ДокументРеализации;						
		ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВозвратТоваровОтПокупателя") Тогда
			Если ТипЗнч(Источник.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Движение.ЗаказПокупателя = Источник.Сделка;
			КонецЕсли;
			Если ТипЗнч(Выборка.ДокументПартии) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда			
				Движение.ДокументОтгрузки = Выборка.ДокументПартии;
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
			Если ТипЗнч(Выборка.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Движение.ЗаказПокупателя = Выборка.Сделка;
			КонецЕсли;
			Движение.ДокументОтгрузки = Выборка.ДокументОтгрузки;						
		Иначе 		
			Возврат;
		КонецЕсли;		
		
		Движение.Номенклатура          	= Выборка.Номенклатура;
		Движение.ПричинаНеотгрузки     	= Выборка.ПричинаНеотгрузки;
		Движение.РасшифровкаПричиныНеотгрузки     	= Выборка.РасшифровкаПричиныНеотгрузки;
		Движение.КоличествоНеотгружено 	= Выборка.КоличествоНеотгружено;
		Движение.СтоимостьНеОтгружено 	= Выборка.СтоимостьНеОтгружено;
		Движение.ЕдиницаИзмерения	 	= Выборка.ЕдиницаИзмерения;
		
	КонецЦикла;
	
	Движения.Записывать = Истина;
	
КонецПроцедуры
	
Функция ПолучитьТекстЗапроса(ВидДокумента)
	
	Если ВидДокумента = "ЗаказПокупателя" Тогда	
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНеотгружено.Номенклатура КАК Номенклатура,
		|	ТоварыНеотгружено.ПричинаНеотгрузки КАК ПричинаНеотгрузки,
		|	СУММА(ТоварыНеотгружено.Количество) КАК КоличествоНеотгружено,
		|	СУММА(ТоварыНеотгружено.Сумма) КАК СтоимостьНеотгружено,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки КАК РасшифровкаПричиныНеотгрузки
		|ИЗ
		|	Документ.ЗаказПокупателя.абс_Неотгружено КАК ТоварыНеотгружено
		|ГДЕ
		|	ТоварыНеотгружено.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНеотгружено.Номенклатура,
		|	ТоварыНеотгружено.ПричинаНеотгрузки,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки";
		
	ИначеЕсли ВидДокумента = "РеализацияТоваровУслуг" Тогда	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНеотгружено.Номенклатура КАК Номенклатура,
		|	ТоварыНеотгружено.ПричинаНеотгрузки КАК ПричинаНеотгрузки,
		|	СУММА(ТоварыНеотгружено.Количество) КАК КоличествоНеотгружено,
		|	СУММА(ТоварыНеотгружено.Сумма) КАК СтоимостьНеотгружено,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки КАК РасшифровкаПричиныНеотгрузки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.абс_Неотгружено КАК ТоварыНеотгружено
		|ГДЕ
		|	ТоварыНеотгружено.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНеотгружено.Номенклатура,
		|	ТоварыНеотгружено.ПричинаНеотгрузки,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки";
		
	ИначеЕсли ВидДокумента = "КорректировкаРеализации" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНеотгружено.Номенклатура КАК Номенклатура,
		|	ТоварыНеотгружено.абс_ПричинаНеотгрузки КАК ПричинаНеотгрузки,
		|	СУММА(ТоварыНеотгружено.КоличествоДоИзменения - ТоварыНеотгружено.Количество) КАК КоличествоНеотгружено,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыНеотгружено.Ссылка.СуммаВключаетНДС = ИСТИНА
		|				ТОГДА ТоварыНеотгружено.СуммаДоИзменения - ТоварыНеотгружено.Сумма
		|			ИНАЧЕ ТоварыНеотгружено.СуммаДоИзменения - ТоварыНеотгружено.Сумма + (ТоварыНеотгружено.СуммаНДСДоИзменения - ТоварыНеотгружено.СуммаНДС)
		|		КОНЕЦ) КАК СтоимостьНеотгружено,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки КАК РасшифровкаПричиныНеотгрузки
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК ТоварыНеотгружено
		|ГДЕ
		|	ТоварыНеотгружено.Ссылка = &Ссылка
		|	И ТоварыНеотгружено.КоличествоДоИзменения > ТоварыНеотгружено.Количество
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНеотгружено.Номенклатура,
		|	ТоварыНеотгружено.абс_ПричинаНеотгрузки,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки";
		
	ИначеЕсли ВидДокумента = "ВозвратТоваровОтПокупателя" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНеотгружено.Номенклатура КАК Номенклатура,
		|	ТоварыНеотгружено.абс_ПричинаНеотгрузки КАК ПричинаНеотгрузки,
		|	СУММА(ТоварыНеотгружено.Количество) КАК КоличествоНеотгружено,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыНеотгружено.Ссылка.СуммаВключаетНДС = ИСТИНА
		|				ТОГДА ТоварыНеотгружено.Сумма
		|			ИНАЧЕ ТоварыНеотгружено.Сумма + ТоварыНеотгружено.СуммаНДС
		|		КОНЕЦ) КАК СтоимостьНеотгружено,
		|	ТоварыНеотгружено.ДокументПартии,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки КАК РасшифровкаПричиныНеотгрузки
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТоварыНеотгружено
		|ГДЕ
		|	ТоварыНеотгружено.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНеотгружено.Номенклатура,
		|	ТоварыНеотгружено.абс_ПричинаНеотгрузки,
		|	ТоварыНеотгружено.ДокументПартии,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки";
		
	ИначеЕсли ВидДокумента = "ПоступлениеТоваровУслуг" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНеотгружено.Номенклатура КАК Номенклатура,
		|	ТоварыНеотгружено.абс_ПричинаНеотгрузки КАК ПричинаНеотгрузки,
		|	СУММА(ТоварыНеотгружено.Количество) КАК КоличествоНеотгружено,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыНеотгружено.Ссылка.СуммаВключаетНДС = ИСТИНА
		|				ТОГДА ТоварыНеотгружено.Сумма
		|			ИНАЧЕ ТоварыНеотгружено.Сумма + ТоварыНеотгружено.СуммаНДС
		|		КОНЕЦ) КАК СтоимостьНеотгружено,
		|	ТоварыНеотгружено.Ссылка.абс_ДокументОснование КАК ДокументОтгрузки,
		|	ТоварыНеотгружено.Ссылка.абс_ДокументОснование.Сделка КАК Сделка,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки КАК РасшифровкаПричиныНеотгрузки
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ТоварыНеотгружено
		|ГДЕ
		|	ТоварыНеотгружено.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНеотгружено.Номенклатура,
		|	ТоварыНеотгружено.абс_ПричинаНеотгрузки,
		|	ТоварыНеотгружено.Ссылка.абс_ДокументОснование,
		|	ТоварыНеотгружено.Ссылка.абс_ДокументОснование.Сделка,
		|	ТоварыНеотгружено.ЕдиницаИзмерения,
		|	ТоварыНеотгружено.Лео_РасшифровкаПричиныНеотгрузки";
	КонецЕсли;	
	Возврат ТекстЗапроса;
КонецФункции

Процедура СформироватьЗаявкуНаТранспорт(ЗаказПокупателя)
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_ЗаявкаНаТранспорт.Ссылка,
	|	абс_ЗаявкаНаТранспорт.ДокументОтгрузки
	|ИЗ
	|	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ЗаявкаНаТранспорт.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	Результат=Запрос.Выполнить();
	
	//если заявка уже создана, то новую создавать не нужно
	Если Не Результат.Пустой() Тогда
		
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		
		//заполним документ отгрузки в найденной заявке
		Если Выборка.ДокументОтгрузки.Пустая() Тогда
			
			ЗаявкаНаТранспортОбъект=Выборка.Ссылка.ПолучитьОбъект();
			ЗаполнитьДокументОтгрузкиВЗаявкеНаТранспорт(ЗаявкаНаТранспортОбъект,ЗаказПокупателя);
			Если Не ЗаявкаНаТранспортОбъект.ДокументОтгрузки.Пустая() Тогда
				ЗаявкаНаТранспортОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ДокументЗаявка=Документы.абс_ЗаявкаНаТранспорт.СоздатьДокумент();
	ДокументЗаявка.Заполнить(ЗаказПокупателя);
	ДокументЗаявка.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры

Процедура ЗаполнитьДокументОтгрузкиВЗаявкеНаТранспорт(ЗаявкаНаТранспортОбъект,ЗаказПокупателя) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Сделка = &Сделка
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваровУслуг.МоментВремени УБЫВ";
	
	Запрос.УстановитьПараметр("Сделка",ЗаказПокупателя);
	Результат=Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		
		ЗаявкаНаТранспортОбъект.ДокументОтгрузки=Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиЗаявкуПоЗаказуПокупателя(ЗаказПокупателя, ЗаявкаНаТранспорт) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	абс_ЗаявкаНаТранспорт.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(абс_ЗаявкаНаТранспорт.Ссылка) КАК ПредставлениеЗаявки
	|ИЗ
	|	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_ЗаявкаНаТранспорт.ЗаказПокупателя = &ЗаказПокупателя
	|	И НЕ абс_ЗаявкаНаТранспорт.ПометкаУдаления");
	
	Если ЗначениеЗаполнено(ЗаявкаНаТранспорт) Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",ЗаявкаНаТранспорт);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.абс_ЗаявкаНаТранспорт.ПустаяСсылка();	
	
КонецФункции

Функция НайтиЗаявкуПоПеремещению(ПеремещениеТоваров, ЗаявкаНаТранспорт) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	абс_ЗаявкаНаТранспорт.Ссылка
	|ИЗ
	|	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
	|ГДЕ
	|	НЕ абс_ЗаявкаНаТранспорт.ПометкаУдаления
	|	И абс_ЗаявкаНаТранспорт.ДокументОснование = &ДокументОснование");
	
	Если ЗначениеЗаполнено(ЗаявкаНаТранспорт) Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",ЗаявкаНаТранспорт);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОснование", ПеремещениеТоваров);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.абс_ЗаявкаНаТранспорт.ПустаяСсылка();	
	
КонецФункции

Процедура абс_ПередЗаписьюРеализацияТоваровУслугПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.абс_Статус) Тогда
		Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке;
	КонецЕсли;
	
	Если Не Источник.абс_ПолученоУведомлениеОПриемке Тогда
		Источник.абс_Принято.Очистить();
		ТабТовары = Источник.Товары.Выгрузить(,"Номенклатура,Количество,ЕдиницаИзмерения,СерияНоменклатуры");
		Источник.абс_Принято.Загрузить(ТабТовары);
		
		// Вычтем неотгруженное количество из принятого
		Для Каждого СтрПринято Из Источник.абс_Принято Цикл
			СтруктураПоискаНеотгружено = Новый Структура("Номенклатура,СерияНоменклатуры,ЕдиницаИзмерения", СтрПринято.Номенклатура, СтрПринято.СерияНоменклатуры, СтрПринято.ЕдиницаИзмерения);
			
			СтрокиНеотгружено = Источник.абс_Неотгружено.НайтиСтроки(СтруктураПоискаНеотгружено);
			
			Для Каждого СтрокаНеотгружено Из СтрокиНеотгружено Цикл
				
				СтрПринято.Количество = СтрПринято.Количество - СтрокаНеотгружено.Количество;
				
			КонецЦикла;			
				
		КонецЦикла;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.абс_НомерУведомленияОбОтгрузке) Тогда
		Источник.абс_НомерУведомленияОбОтгрузке = СтрЗаменить(ОбщегоНазначения.ПолучитьНомерНаПечать(Источник), Символы.НПП, "");
		//Источник.абс_НомерУведомленияОбОтгрузке = СтрЗаменить(СокрЛП(Источник.Номер),СокрЛП(Источник.Организация.Префикс),"");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.абс_ДатаУведомленияОбОтгрузке) Тогда
		Источник.абс_ДатаУведомленияОбОтгрузке = Источник.Дата;
	КонецЕсли;
	
	//АБС ВСТАВКА   07.05.2014 17:23:00  Балашенко
	//проверка заполнения реквизита "Дата отгрузки"
	//если переводим в статус "К отгрузке" и выше - должен быть заполнен
	//Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке ИЛИ
	//	Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ
	//	Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.ВПути ИЛИ
	//	Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Доставлен ИЛИ
	//	Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт ИЛИ
	//	Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда
	//			
	//	Если Не ЗначениеЗаполнено(Источник.Грузоотправитель) Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Не выбран грузоотправитель!", Отказ);
	//	КонецЕсли;		
	//			
	//КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	ДатаДок = Источник.Дата;
  // Лаврухин  
  //  Если ДатаДок <= КонецДня(ТекущаяДата()) Тогда  // ZAA дата не зависит от периода
    
        //Если КонецДня(ДатаДок) = КонецМесяца(КонецДня(ДатаДок)) и РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			Источник.Дата = Дата(Формат(источник.Дата, "ДФ=dd.MM.yyyy") +" 23:57:00");
			//  никитин
			Если Источник.Дата >= Дата("20201101000000")Тогда
		Источник.Дата = Дата(Формат(источник.Дата, "ДФ=dd.MM.yyyy") +" 20:00:00");
			
        КонецЕсли; 
        //КонецЕсли;    
        
    
  //  КонецЕсли;
  // Лаврухин
	
КонецПроцедуры
//никитин
Процедура Лео_ПередЗаписьюДокументыОплаты(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	 ДатаДок = Источник.Дата;
  // Лаврухин  
  //  Если ДатаДок <= КонецДня(ТекущаяДата()) Тогда  // ZAA дата не зависит от периода
    
        //Если КонецДня(ДатаДок) = КонецМесяца(КонецДня(ДатаДок)) и РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		Если Источник.Дата >= Дата("20201101000000")Тогда
		Источник.Дата = Дата(Формат(источник.Дата, "ДФ=dd.MM.yyyy") +" 21:00:00");
			
        КонецЕсли;    
        

	
	КонецПроцедуры

// Лаврухин
Процедура Лео_ПередЗаписьюПоступлениеТоваровУслугПередЗаписью (Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДатаДок = Источник.Дата;
	
	Если не  Источник.УстановитьвремяДокументаВручную Тогда
	Если ДатаДок <= КонецДня(ТекущаяДата()) Тогда
	
		//Если КонецДня(ДатаДок) = КонецМесяца(КонецДня(ДатаДок)) и РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			Источник.Дата = Дата(Формат(источник.Дата, "ДФ=dd.MM.yyyy") +" 8:00:00");
	
		//КонецЕсли;    
		
	
	КонецЕсли;
	   	КонецЕсли;

	//////////////////////
	// {ZAA 
	// Проверка заполненности документа основания при вхождении номенклатуры в определенную папку
	
	зап = Новый Запрос;
	зап.Текст = "ВЫБРАТЬ
	|	Лео_Настройки._Ссылка как Об
	|ИЗ
	|	Справочник.Лео_Настройки КАК Лео_Настройки
	|ГДЕ
	|	Лео_Настройки.Родитель = &Родитель
	|	И Лео_Настройки.Использовать";
	зап.УстановитьПараметр("Родитель", Справочники.Лео_Настройки.НайтиПоНаименованию("Папки Номенклатуры ПТУ"));
	Рез = зап.Выполнить();
	Если НЕ Рез.Пустой() тогда
		Выборка = Рез.Выбрать();
		Пока Выборка.Следующий() цикл
			Если НЕ ЗначениеЗаполнено(Источник.Сделка) тогда
				Для каждого сс из Источник.Товары цикл
					Если сс.Номенклатура.ПринадлежитЭлементу(Выборка.Об) тогда
						Отказ = Истина;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не записан, Заполните Заказ поставщику !!!");
						прервать;	
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	// ZAA}
	
	
    
КонецПроцедуры 

Процедура Лео_ПередЗаписьюКорректировкаДолгаПередЗаписью (Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДатаДок = Источник.Дата;
	
	Если ДатаДок <= КонецДня(ТекущаяДата()) Тогда
	
		//Если КонецДня(ДатаДок) = КонецМесяца(КонецДня(ДатаДок)) и РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			Источник.Дата = Дата(Формат(источник.Дата, "ДФ=dd.MM.yyyy") +" 23:59:59");
	
		//КонецЕсли;    
		
	
	КонецЕсли;
    
КонецПроцедуры 
// Лаврухин

Функция ПолучитьТипЦеныПоДоговору(Дата, Контрагент, ДоговорКонтрагента) Экспорт
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕСлИ;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних.ТипЦен
		|ИЗ
		|	РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей.СрезПоследних(
		|			&Дата,
		|			Контрагент = &Контрагент
		|				И абс_ДоговорКонтрагента = &абс_ДоговорКонтрагента
		|				И (НоменклатурнаяЦеноваяГруппа = НЕОПРЕДЕЛЕНО
		|					ИЛИ НоменклатурнаяЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
		|					ИЛИ НоменклатурнаяЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка))) КАК ТипыЦенПоГруппамНоменклатурыДляПокупателейСрезПоследних";
	Запрос.УстановитьПараметр("абс_ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Результат = Запрос.Выполнить();   
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТипЦен;
	КонецЦикла; 
    Возврат Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
КонецФункции	

Функция ПолучитьДоступнуюРольИсполнителя(Роль) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Исполнитель
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Исполнитель = &Исполнитель
		|	И РолиИИсполнители.Роль = &Роль";
	Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Роль", Роль);  
	Результат = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = Результат.Выбрать();  
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
    Возврат Ложь;
КонецФункции	

Процедура абс_ПроверкаДокументаНаКорректностьТипаЦен(Источник) Экспорт
	Если ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.абс_ПроведениеЗаказаБезКонтроляТипаЦен) Тогда
		Возврат;
	КонецЕСлИ;	
	ТипЦенПоДоговору = ПолучитьТипЦеныПоДоговору(Источник.Дата, Источник.Контрагент, Источник.ДоговорКонтрагента);
	Если Не Источник.ТипЦен = ТипЦенПоДоговору Тогда
		Сообщить("Тип цен в документе не соответсвует типу цен: """ + ТипЦенПоДоговору + """!");
	КонецЕСли;	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСерий(Источник, Отказ)
	
	МассивСерий = Источник.Товары.ВыгрузитьКолонку("СерияНоменклатуры");
	ЕстьСерии = Ложь;
	Для каждого СтрокаТЧ из Источник.Товары Цикл
		Если Не СтрокаТЧ.СерияНоменклатуры.Пустая() Тогда
			ЕстьСерии = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьСерии Тогда
		Если Не МассивСерий.Найти(Справочники.СерииНоменклатуры.ПустаяСсылка())=Неопределено Тогда
			Сообщить("Не заполнены серии в табличной части");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура абс_ПриЗаписиЗаказПокупателя(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не ПолучитьДоступнуюРольИсполнителя(Справочники.РолиИсполнителей.абс_ЗаписьЗаказБезКонтроляПоСериям) Тогда
	//	ПроверитьЗаполнениеСерий(Источник,Отказ);
	//Конецесли;
	
	Если Не Отказ Тогда
		
		//установим статус в Реализации товаров и услуг равный статусу в Заказе покупателя
		УстановитьСтатусУРеализаций(Источник);
		
		//если статус заказа покупателя - "Отгружен", сформируем заявку на транспорт
		Если Источник.абс_Статус=Перечисления.абс_СтатусыОтгрузки.КОтгрузке ИЛИ Источник.абс_Статус=Перечисления.абс_СтатусыОтгрузки.Закрыт Тогда
			СформироватьЗаявкуНаТранспорт(Источник.Ссылка);
		КонецЕсли;
	КонецЕСлИ;
		
	//АБС ВСТАВКА   12.05.2014 16:06:34  Балашенко
	//если статус заказа - "согласован" или выше, выгрузим подтверждение заказа
	
	//Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.абс_СообщениеEDI") Тогда
	//	
	//	Если Источник.ДокументОснование.НастройкаОбмена = Справочники.абс_НастройкиEDIОбмена.edi_su Тогда
	//		Если Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.ВПути
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Доставлен
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Подобран
	//			ИЛИ Источник.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Согласован Тогда
	//			
	//			СообщениеEDI = Неопределено;
	//			
	//			//проверим, было ли выгружено подтверждение заказа ранее
	//			СообщениеEDI = абс_ОбменДаннымиСервер.ПолучитьПодтверждениеЗаказа(Источник.Ссылка);
	//			
	//			//если подтверждение заказа не выгружалось, выгрузим его
	//			Если СообщениеEDI = Неопределено Тогда
	//				абс_ОбменДаннымиСервер.ВыгрузитьПодтверждениеЗаказа(Источник.Ссылка);
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	//АБС ВСТАВКА  КОНЕЦ
		
КонецПроцедуры

Процедура УстановитьСтатусУРеализаций(ЗаказПокупателя) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Сделка = &Сделка"; 
	Запрос.УстановитьПараметр("Сделка", ЗаказПокупателя.Ссылка);  
	Результат = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = Результат.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.Ссылка.абс_Статус = ЗаказПокупателя.абс_Статус Тогда
			ДокументРТИУ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокументРТИУ.абс_Статус = ЗаказПокупателя.абс_Статус;
			ДокументРТИУ.Записать();
		КонецЕСли;	
	КонецЦикла; 
КонецПроцедуры	

Процедура УстановитьСписокСтатусовЗаказаПокупателя(СписокСтатусов, Ссылка, Статус) Экспорт
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Создан); 		
	Иначе
		ТекСтатус = Статус;
		Если Не ЗначениеЗаполнено(ТекСтатус) Тогда
			ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Создан;
		КонецЕсли;		
		СписокСтатусов.Добавить(ТекСтатус);
		Если ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Создан ИЛИ ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Аннулирован Тогда 		
			Если Не ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Создан Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Создан);
			КонецЕсли;
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.НеСогласован);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Ошибка);
		ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыОтгрузки.НеСогласован Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Создан);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Согласован);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Ошибка);
		ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Согласован Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Создан);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.НеСогласован);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.КОтгрузке);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Ошибка);
		ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке Тогда 
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.НеСогласован);
		ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.НеСогласован);	
		//+Лео Сафонов ЕА
		ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Ошибка Тогда
        	СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
			//СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Ошибка);
		//-Лео Сафонов ЕА
		КонецЕсли;
		Если Не ТекСтатус = Перечисления.абс_СтатусыОтгрузки.Аннулирован Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыОтгрузки.Аннулирован);
		КонецЕсли;
	КонецЕСли;	
КонецПроцедуры

//проверяет Заказ по регистру
Процедура ПроверитьПоСтопЛисту(ЗаказПокупателя, Отказ, Заголовок="") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.Ссылка,
		|	абс_СтопЛистПоКонтрагентамСрезПоследних.Контрагент,
		|	абс_СтопЛистПоКонтрагентамСрезПоследних.СтатусЗадолженности КАК СтатусСтопа,
		|	абс_СтопЛистПоКонтрагентамСрезПоследних.Период КАК ПериодСтопа,
		|	абс_КонтрольДЗПоЗаказамСрезПоследних.СтатусДЗ,
		|	абс_КонтрольДЗПоЗаказамСрезПоследних.Период КАК ПериодДЗ,
		|	абс_КонтрольДЗПоЗаказамСрезПоследних.Ответственный КАК ОтветственныйДЗ,
		|	абс_СтопЛистПоКонтрагентамСрезПоследних.СуммаОбщейЗадолженности,
		|	абс_СтопЛистПоКонтрагентамСрезПоследних.СуммаПросроченнойЗадолженности,
		|	абс_СтопЛистПоКонтрагентамСрезПоследних.КоличествоДнейПросроченнойЗадолженности
		|ИЗ
		|	Документ.ЗаказПокупателя КАК Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_КонтрольДЗПоЗаказам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК абс_КонтрольДЗПоЗаказамСрезПоследних
		|		ПО (абс_КонтрольДЗПоЗаказамСрезПоследних.ЗаказПокупателя = Заказ.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СтопЛистПоКонтрагентам.СрезПоследних(, Контрагент = &Контрагент) КАК абс_СтопЛистПоКонтрагентамСрезПоследних
		|		ПО Заказ.Контрагент = абс_СтопЛистПоКонтрагентамСрезПоследних.Контрагент
		|ГДЕ
		|	Заказ.Ссылка = &ЗаказПокупателя";

	//Запрос.УстановитьПараметр("Дата", ЗаказПокупателя.Дата);
	Запрос.УстановитьПараметр("Контрагент", ЗаказПокупателя.Контрагент);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя.Ссылка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		////1 заблокирован заказ
		//Если Выборка.СтатусДЗ = Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован Тогда 
		//	Отказ = Истина;
		//	ОбщегоНазначения.СообщитьОбОшибке("Отгрузка этого заказа запрещена. Ответственный: "+	Строка(Выборка.ОтветственныйДЗ)+", дата запрета: "+Формат(Выборка.ПериодДЗ, "ДФ=dd.MM.yyyy"), Отказ, Заголовок);
		//	ОтправитьПочтовоеУведомление("ПопыткаОтгрузкиЗаблокированного", ЗаказПокупателя.Ссылка, ЗаказПокупателя.Контрагент);
		//ИначеЕсли Выборка.СтатусДЗ = Перечисления.абс_СтатусыДЗПоЗаказам.Разблокирован Тогда //2 Разблокирован заказ вручную	
		//	//проверить если до этого был заблокирован то уведомление
		//	ОтправитьПочтовоеУведомление("ОтгрузкаРазблокированного", ЗаказПокупателя.Ссылка, ЗаказПокупателя.Контрагент);
		//ИначеЕсли Выборка.СтатусСтопа = Неопределено Тогда
		//	//не был никогда в стопе
		//ИначеЕсли ЗначениеЗаполнено(Выборка.СтатусСтопа) И Выборка.СтатусСтопа <> Перечисления.абс_СтатусыЗадолженности.Разблокирован Тогда  //3 заблокирован по стоп листу
		//	Отказ = Истина;
		//	ОбщегоНазначения.СообщитьОбОшибке("Отгрузка контрагенту "+ Строка(ЗаказПокупателя.Контрагент) +" запрещена стоп-листом ("+Строка(Выборка.СтатусСтопа)+")! Дата запрета: "+Формат(Выборка.ПериодСтопа, "ДФ=dd.MM.yyyy"), Отказ, Заголовок);
		//	ОтправитьПочтовоеУведомление("ПопыткаОтгрузкиСтопа", ЗаказПокупателя, ЗаказПокупателя.Контрагент);
		//ИначеЕсли Выборка.СтатусСтопа = Перечисления.абс_СтатусыЗадолженности.Разблокирован Тогда
		//	//проверить если до этого был в стопе то уведомление
		//	ОтправитьПочтовоеУведомление("ОтгрузкаБывшемуСтопу", ЗаказПокупателя, ЗаказПокупателя.Контрагент);
		//КонецЕсли;
		
		Если Выборка.СтатусДЗ = Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован 
			ИЛИ ( Выборка.СтатусСтопа <> Перечисления.абс_СтатусыЗадолженности.Разблокирован И ЗначениеЗаполнено(Выборка.СтатусСтопа) И  Выборка.СтатусДЗ <> Перечисления.абс_СтатусыДЗПоЗаказам.Разблокирован) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьОбОшибке("Отгрузка данного заказа запрещена. Контрагент находится в стоп-листе");
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Контрагент", Выборка.Контрагент);
			СтруктураПараметров.Вставить("СуммаОбщейЗадолженности", Выборка.СуммаОбщейЗадолженности);
			СтруктураПараметров.Вставить("СуммаПросроченнойЗадолженности", Выборка.СуммаПросроченнойЗадолженности);
			СтруктураПараметров.Вставить("КоличествоДнейПросроченнойЗадолженности", Выборка.КоличествоДнейПросроченнойЗадолженности);
			СтруктураПараметров.Вставить("РазделСтопЛиста", Выборка.СтатусСтопа);
			СтруктураПараметров.Вставить("ПроцентПДЗ", ?(Выборка.СуммаОбщейЗадолженности = 0,0, Окр(Выборка.СуммаПросроченнойЗадолженности/Выборка.СуммаОбщейЗадолженности*100,2)));
			СтруктураПараметров.Вставить("ДопустимаяСуммаЗадолженности", Выборка.Контрагент.ОсновнойДоговорКонтрагента.ДопустимаяСуммаЗадолженности);
			СтруктураПараметров.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			
			абс_ОбменДаннымиСервер.ВыполнитьРассылкуБлокировкиЗаказа(СтруктураПараметров);
			
		КонецЕсли;
		
	КонецЕсли;
 	
КонецПроцедуры

//создает письмо и отправляет его
//ПричиныУведомления:
//	ПопыткаОтгрузкиЗаблокированного
//	ОтгрузкаРазблокированного
//	ПопыткаОтгрузкиСтопа
//	ОтгрузкаБывшемуСтопу
//	ДобавлениеВСтопЛист
Процедура ОтправитьПочтовоеУведомление(ПричинаУведомления, Заказ=Неопределено, Контрагент = Неопределено) Экспорт
	ТекстОшибок = "";
	Если ПричинаУведомления="ОтгрузкаРазблокированного" ИЛИ ПричинаУведомления="ОтгрузкаБывшемуСтопу" Тогда 
		//проверим статус по журналу отправок 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_ЖурналОтправкиПочтыСрезПоследних.Отправлено
		|ИЗ
		|	РегистрСведений.абс_ЖурналОтправкиПочты.СрезПоследних(
		|			,
		|			Объект = &Заказ
		|				И СтатусОтправки = ЗНАЧЕНИЕ(Перечисление.абс_СтатусыДЗПоЗаказам.Разблокирован)) КАК абс_ЖурналОтправкиПочтыСрезПоследних";
		
		Запрос.УстановитьПараметр("Заказ", Заказ);
		
		Результат = Запрос.Выполнить();		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			УжеОтправлено = Выборка.Отправлено;
		Иначе 
			УжеОтправлено = Ложь;
		КонецЕсли; 
		СтатусОтправки = Перечисления.абс_СтатусыДЗПоЗаказам.Разблокирован;
	ИначеЕсли ПричинаУведомления="ПопыткаОтгрузкиЗаблокированного" ИЛИ ПричинаУведомления="ПопыткаОтгрузкиСтопа" Тогда
		СтатусОтправки = Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован;
	КонецЕсли;
	
	Отправлять = Истина;
	ПисатьВЖурнал = Истина;
	Если ПричинаУведомления = "ПопыткаОтгрузкиЗаблокированного" Тогда 
		ТекстПисьма = "Попытка отгрузки заблокированного заказа: "+Строка(Заказ)+" пользователем: "+строка(ПараметрыСеанса.ТекущийПользователь);
		Тема = "Попытка отгрузки заблокированного заказа";
		
	ИначеЕсли ПричинаУведомления = "ОтгрузкаРазблокированного" Тогда
		//проверим отправлялось ли уже: повторная отправка не нужна
		Отправлять = НЕ УжеОтправлено;
		ТекстПисьма = "Успешная отгрузка разблокированного заказа: "+Строка(Заказ)+" пользователем: "+строка(ПараметрыСеанса.ТекущийПользователь);
		Тема = "Успешная отгрузка разблокированного заказа";
		
	ИначеЕсли ПричинаУведомления = "ПопыткаОтгрузкиСтопа" Тогда
        ТекстПисьма = "Попытка отгрузки контрагенту ("+Строка(Контрагент)+") из стоп-листа: "+Строка(Заказ)+" пользователем: "+строка(ПараметрыСеанса.ТекущийПользователь);
		Тема = "Попытка отгрузки контрагенту из стоп-листа";
		
	ИначеЕсли ПричинаУведомления = "ОтгрузкаБывшемуСтопу" Тогда
		//проверим отправлялось ли уже: повторная отправка не нужна
		Отправлять = НЕ УжеОтправлено;
        ТекстПисьма = "Успешная отгрузка заказа: "+Строка(Заказ)+" пользователем: "+строка(ПараметрыСеанса.ТекущийПользователь)+" по разблокированному контрагенту: "+Строка(Контрагент);
		Тема = "Успешная отгрузка заказа по разблокированному контрагенту";
	ИначеЕсли ПричинаУведомления = "ДобавлениеВСтопЛист" Тогда
		ПисатьВЖурнал = Ложь;
		ТекстПисьма = "Контрагент """+Строка(Контрагент)+""" добавлен в стоп-лист пользователем: "+строка(ПараметрыСеанса.ТекущийПользователь);
		Тема = "Контрагент добавлен в стоп-лист";
	КонецЕсли;
	
	
	
	Если Не Отправлять Тогда 
		Возврат;
	КонецЕсли;
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", Тема);
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.Добавить(Контрагент.ОсновнойМенеджерПокупателя);
	
	Кому = Новый СписокЗначений;
	Кому.ЗагрузитьЗначения(ПолучитьСписокМэйлов(СписокОбъектов));
	СтруктураПараметров.Вставить("Кому", Кому);
	Если Кому.количество()=0 Тогда 
		ТекстОшибок = "Не указаны получатели";
	КонецЕсли;
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	НачатьТранзакцию();
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	Если ТипЗнч(СтруктураПисьма) <> Тип("Структура") Тогда
		ОтменитьТранзакцию();
		Если ТипЗнч(СтруктураПисьма) = Тип("Строка") Тогда
			//если есть текст ошибки, тогда запишем неудачную попытку отправки
			СтруктураЗаписиВРегистр = Новый Структура;
			СтруктураЗаписиВРегистр.Вставить("Отправлено", Ложь);
			СтруктураЗаписиВРегистр.Вставить("Описание", СтруктураПисьма);
		КонецЕсли; 
	Иначе
		ЗафиксироватьТранзакцию();
		ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		//запишем удачную попытку отправки
		СтруктураЗаписиВРегистр = Новый Структура;		
		СтруктураЗаписиВРегистр.Вставить("Отправлено", Истина);
		СтруктураЗаписиВРегистр.Вставить("Описание", "");
	КонецЕсли;
	СтруктураЗаписиВРегистр.Вставить("Объект", Заказ);
	СтруктураЗаписиВРегистр.Вставить("Период", ТекущаяДата());
	СтруктураЗаписиВРегистр.Вставить("СтатусОтправки", СтатусОтправки);
	
	//вместо типовой процедуры используем след код тобы не отображать сообщения
	//УправлениеЭлектроннойПочтой.ОтправитьПисьма(ЭлектронныеПисьма, глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"));
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		
			Попытка
				ОбъектПисьмо.Записать();
			Исключение
				//ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, (СокрЛП(Письмо) + " исключено из списка отправки."));
				Продолжить;;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
	    ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;

	Если ТекстОшибок="" Тогда 
		УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ТекущийПользователь,,
									ИзмененныйСоставПисем, Истина , , Ложь, ТекстОшибок);
	КонецЕсли;
	
	Если ТекстОшибок<>"" Тогда //ошибки отправки 
		СтруктураЗаписиВРегистр.Описание = СокрЛП(ТекстОшибок);
		СтруктураЗаписиВРегистр.Отправлено = Ложь;
	КонецЕсли;
	
	
	Если ПисатьВЖурнал Тогда 
		//запись производится через фоновое задание тк при отказе транзакции записи документа регистр очищался бы тоже
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(СтруктураЗаписиВРегистр);
		ФоновыеЗадания.Выполнить("абс_Дистрибуция.ЗаписатьЖурналПочтыФоновымЗаданием", МассивПараметров);
	КонецЕсли;
	
	
		
КонецПроцедуры

Функция ПолучитьСписокМэйлов(Объекты) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 100) КАК Мэйл
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Объект В(&Объекты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 100)";
		
	Запрос.УстановитьПараметр("Объекты", Объекты);

	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Мэйл");

	Возврат Результат;
КонецФункции

Процедура абс_ПроверитьКонтрагентаНаСтопЛистОТКЛОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ЗаписатьЖурналПочтыФоновымЗаданием(СтруктураПараметров) Экспорт
	МЗЖурнал = РегистрыСведений.абс_ЖурналОтправкиПочты.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗЖурнал, СтруктураПараметров);
	
	МЗЖурнал.Записать();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//
//Процедуры, обеспечивающие контроль резервов по виртуальным складам
//
//
Функция ПолучитьТаблицуСоответствияРеальныхВиртуальныхСкладов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК РеальныйСклад,
		|	ЗначенияСвойствОбъектов.Значение КАК ВиртуальныйСклад
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ВиртуальныйСкладДляРасчетаРезерва)";

	Результат = Запрос.Выполнить();
	тзСоответствия = Результат.Выгрузить();
	тзСоответствия.Индексы.Добавить("РеальныйСклад");
	тзСоответствия.Индексы.Добавить("ВиртуальныйСклад");
	
	Возврат тзСоответствия;	
	
КонецФункции

Функция ПодменитьРеальныеВиртуальныеСклады(ДокументОбъект, сМеняемЧто, сМеняемНа) Экспорт

	бВыполненаПодмена = ЛОЖЬ;
	ТипЗначенияСклад = Тип("СправочникСсылка.Склады");
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	тзСоответствияСкладов = ПолучитьТаблицуСоответствияРеальныхВиртуальныхСкладов();
	
	Запрос = Новый Запрос();
	//собираем пакетный запрос по метаданным
	//шапка
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Шапка.* ИЗ Документ." + МетаданныеДокумента.Имя + " КАК Шапка ГДЕ Шапка.Ссылка = &ДокументСсылка;";
	//табличные части
	Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗРЕШЕННЫЕ ТЧ.* ИЗ Документ." + МетаданныеДокумента.Имя + "." + ТабличнаяЧасть.Имя + " КАК ТЧ ГДЕ ТЧ.Ссылка = &ДокументСсылка;";
	КонецЦикла;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументОбъект.Ссылка);
	Результаты = Запрос.ВыполнитьПакет();
	
	//обойдем реквизиты и ТЧ документа по метаданным
	СтрокаТЗ = Результаты[0].Выгрузить()[0];
	Для каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
		//получаем значение из выгруженной ТЗ (одна строка - это шапка)
		ЗначениеРеквизита = СтрокаТЗ[Реквизит.Имя];
		//анализируем тип
		Если ТипЗнч(ЗначениеРеквизита) = ТипЗначенияСклад Тогда
			//ищем в таблице соответствия
			СтрокаСоответствия = тзСоответствияСкладов.Найти(ЗначениеРеквизита, сМеняемЧто);
			//нашли
			Если СтрокаСоответствия <> Неопределено Тогда
				//меняем значение в объекте
				ДокументОбъект[Реквизит.Имя] = СтрокаСоответствия[сМеняемНа];		
				бВыполненаПодмена = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//обойдем табличные части
	Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		//получим результат запроса, соответствующий табличной части
		ТекущийРезультат = Результаты[МетаданныеДокумента.ТабличныеЧасти.Индекс(ТабличнаяЧасть)+1];
		//для каждой строки таблицы значений (выгружаем результат запроса по ТЧ)
		Для Каждого СтрокаТЗ Из ТекущийРезультат.Выгрузить() Цикл
			//для каждого реквизита ТЧ
			Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
				//получаем значение из выгруженной ТЗ (одна строка - это шапка)
				ЗначениеРеквизита = СтрокаТЗ[Реквизит.Имя];
				//анализируем тип
				Если ТипЗнч(ЗначениеРеквизита) = ТипЗначенияСклад Тогда
					//ищем в таблице соответствия
					СтрокаСоответствия = тзСоответствияСкладов.Найти(ЗначениеРеквизита, сМеняемЧто);
					//нашли
					Если СтрокаСоответствия <> Неопределено Тогда
						//меняем значение в объекте
						ДокументОбъект[ТабличнаяЧасть.Имя][СтрокаТЗ.НомерСтроки-1][Реквизит.Имя] = СтрокаСоответствия[сМеняемНа];		
						бВыполненаПодмена = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если бВыполненаПодмена Тогда
		ТекОбменДанными = ДокументОбъект.ОбменДанными.Загрузка;
		Если НЕ ТекОбменДанными Тогда 
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
		КонецЕсли;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДокументОбъект.ОбменДанными.Загрузка = ТекОбменДанными;
	КонецЕсли;
	
	Возврат бВыполненаПодмена;	
	
КонецФункции

//проверяет доступность пользователю редактирование справочников НСИ
//у пользователя должна быть установлена роль, соответствующая имени справочника или роль НСИ
//роли в конфигураторе должны называться: абс_НазваниеСправочникаИзКонфигуратораБезАБС
Процедура абс_ПередЗаписьюСправочниковНСИПередЗаписью(Источник, Отказ) Экспорт
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСправочника=Источник.Метаданные().имя;
	Ном=Найти(ИмяСправочника,"абс_");
	Если Ном>0 Тогда
		ИмяСправочника=Сред(ИмяСправочника,Ном+4,СтрДлина(ИмяСправочника));
	КонецЕсли;
	РольНСИ=Справочники.РолиИсполнителей.абс_НСИ;
	РольСпр=Справочники.РолиИсполнителей.ПустаяСсылка();
	Попытка
		РольСпр=ПредопределенноеЗначение("Справочник.РолиИсполнителей.абс_"+ИмяСправочника);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("В справочинке Роли исполнителей не найдена роль абс_"+ИмяСправочника);	
	КонецПопытки;
	
	Если Не РольСпр.Пустая() Тогда
		Если Не ПолучитьДоступнуюРольИсполнителя(РольСпр) Тогда
			Если Не ПолучитьДоступнуюРольИсполнителя(РольНСИ) Тогда
				//{Лео Катанович
				Если НЕ РольДоступна("РедактированиеПланаПродажВнеПериода") Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для работы с НСИ!", Отказ);
				КонецЕсли;	
				//Лео Катанович}
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Не ПолучитьДоступнуюРольИсполнителя(РольНСИ) Тогда
				//{Лео Катанович
				Если НЕ РольДоступна("РедактированиеПланаПродажВнеПериода") Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для работы с НСИ!", Отказ);
				КонецЕсли;	
				//Лео Катанович}
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура абс_ПроверитьЗаполнениеСвойствОбъектов(СсылкаНаОбъект, НазначениеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение,
	|	СвойстваОбъектов.Представление
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО (ЗначенияСвойствОбъектов.Свойство = СвойстваОбъектов.Ссылка)
	|ГДЕ
	|	СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства
	|	И СвойстваОбъектов.ОбязательноКЗаполнению = ИСТИНА";
	
	Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСвойства="";
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Значение) Тогда
			ТекстСвойства = ТекстСвойства + Выборка.Представление + " ,";
		КонецЕсли;
	КонецЦикла;
	
	Если Не ТекстСвойства="" Тогда
		ТекстСвойства = Лев(ТекстСвойства,СтрДлина(ТекстСвойства)-2);
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнены обязательные свойства объекта " + СсылкаНаОбъект + ": " + ТекстСвойства);
	КонецЕсли;
	
КонецПроцедуры

//заполнляет единицу измерения мест по значению свойства Основная единица отгрузки
//если свойство не заполнено, то берет единицу из номенклатуры
Процедура ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДатаДок = ДокументОбъект.Дата;
	Иначе
		ДатаДок = ТекущаяДата();
	КонецЕсли;
	
	ЕдиницаМест = Неопределено;
	
	Если ЗначениеЗаполнено(ДокументОбъект.Грузополучатель) Тогда
		ЕдиницаМест = ПолучитьЕдиницуМестНоменклатурыПоКонтрагенту(СтрокаТабличнойЧасти.Номенклатура, ДокументОбъект.Грузополучатель, ДатаДок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаМест) Тогда
		ЕдиницаМест = ПолучитьЕдиницуМестНоменклатурыПоКонтрагенту(СтрокаТабличнойЧасти.Номенклатура, ДокументОбъект.Контрагент, ДатаДок);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЕдиницаМест) Тогда
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = ЕдиницаМест;
	Иначе
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест 	 = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмеренияМест;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЕдиницуМестНоменклатурыПоКонтрагенту(Номенклатура, Контрагент, ДатаДок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(
	|			&ДатаДок,
	|			Номенклатура = &Номенклатура
	|				И Контрагент = &Контрагент
	|				И Свойство = &Свойство) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ОсновнаяЕдиницаОтгрузки);
	Запрос.УстановитьПараметр("ДатаДок",ДатаДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕдиницаМест = Неопределено;
	
	Если Выборка.Следующий() Тогда
		ЕдиницаМест = Выборка.ЗначениеСвойства;
	КонецЕсли;

	Возврат ЕдиницаМест;
	
КонецФункции

Функция ПолучитьСвойствоНоменклатурыКонтрагента(Номенклатура, Контрагент, Свойство, ДатаДок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних.ЗначениеСвойства
	|ИЗ
	|	РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов.СрезПоследних(
	|			&ДатаДок,
	|			Номенклатура = &Номенклатура
	|				И Контрагент = &Контрагент
	|				И Свойство = &Свойство) КАК абс_ЗначенияСвойствНоменклатурыКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура);
	Запрос.УстановитьПараметр("Контрагент"		, Контрагент);
	Запрос.УстановитьПараметр("Свойство"		, Свойство);
	Запрос.УстановитьПараметр("ДатаДок"			, ДатаДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеСвойства = Неопределено;
	
	Если Выборка.Следующий() Тогда
		ЗначениеСвойства = Выборка.ЗначениеСвойства;
	КонецЕсли;

	Возврат ЗначениеСвойства;
	
КонецФункции

Процедура УстановитьДатуОтгрузкиПоДиспоСхеме(ДокОбъект, РежимВызова = "", мСтароеЗначениеГрузополучателя = Неопределено) Экспорт
	
	ДатаДокумента = ДокОбъект.Дата;
	Грузополучатель = ДокОбъект.Грузополучатель;
	Контрагент = ДокОбъект.Контрагент;
	
	ДеньНеделиОтгрузки = ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиОтгрузки);
	ДеньНеделиДоставки = ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиДоставки);
	ЭтоСложнаяДиспоСхема = ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_СложнаяДиспоСхема);
	ДнейДоставкиДоТЦ = ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДнейДоставкиДоТЦ);
	
	Если ДеньНеделиОтгрузки = Неопределено Тогда
		Если ЗначениеЗаполнено(Контрагент) Тогда
			ДеньНеделиОтгрузки = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиОтгрузки);
			ЭтоСложнаяДиспоСхема = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_СложнаяДиспоСхема);
			ДеньНеделиДоставки = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиДоставки);
			ДнейДоставкиДоТЦ = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДнейДоставкиДоТЦ);
			Если ДеньНеделиОтгрузки = Неопределено Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НомерДняНеделиОтгрузки = Перечисления.ДниНедели.Индекс(ДеньНеделиОтгрузки)+1;
	
	//рассчитаем дате отгрузки по диспо-схеме
	
	//дата документа + 2 дня
	ДатаВозможнойОтгрузки = ДатаДокумента +  60*60*24*2;
	
	Если ДеньНедели(ДатаВозможнойОтгрузки) > НомерДняНеделиОтгрузки Тогда
		ДатаОтгрузкиНовая = КонецНедели(ДатаВозможнойОтгрузки) + 1 + 60*60*24*(НомерДняНеделиОтгрузки-1);
	Иначе
		ДатаОтгрузкиНовая = НачалоНедели(ДатаВозможнойОтгрузки) + 60*60*24*(НомерДняНеделиОтгрузки-1);
	КонецЕсли;
	
	ДатаПоставкиНовая = РассчитатьДатуПоставкиПоДиспоСхеме(ДатаОтгрузкиНовая, ЭтоСложнаяДиспоСхема, ДнейДоставкиДоТЦ, ДеньНеделиДоставки);
	
	Если ДокОбъект.ДатаОтгрузки <> ДатаОтгрузкиНовая ИЛИ ДокОбъект.абс_ДатаПоставкиВТЦ <> ДатаПоставкиНовая Тогда
		
		#Если Клиент Тогда
			
			// Проверка режима вызова процедуры
			Если НЕ ПустаяСтрока(РежимВызова) Тогда
				ТекстВопроса = "";
				Если РежимВызова = "ДатаДокумента" Тогда
					ТекстВопроса = "Изменилась дата документа.";
				ИначеЕсли РежимВызова = "Грузополучатель" Тогда
					Если мСтароеЗначениеГрузополучателя<>Справочники.Контрагенты.ПустаяСсылка() И 
						мСтароеЗначениеГрузополучателя <> Грузополучатель Тогда
						ТекстВопроса = "Изменился грузополучатель.";
					КонецЕсли;
				КонецЕсли;
				Если ТекстВопроса<>"" Тогда
					Если Вопрос(ТекстВопроса + " Пересчитать даты отгрузки и поставки по диспо-схеме?", 
						РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
						Возврат;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
		#КонецЕсли
		ДокОбъект.ДатаОтгрузки 	  = ДатаОтгрузкиНовая;
		ДокОбъект.абс_ДатаПоставкиВТЦ = ДатаПоставкиНовая;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуПоставкиПоДиспоСхеме(ДокОбъект, РежимВызова = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ДокОбъект.ДатаОтгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаДокумента 			= ДокОбъект.Дата;
	Грузополучатель 		= ДокОбъект.Грузополучатель;
	Контрагент 				= ДокОбъект.Контрагент;
	
	ДеньНеделиОтгрузки 		= ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиОтгрузки);
	ДеньНеделиДоставки 		= ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиДоставки);
	
	ЭтоСложнаяДиспоСхема 	= ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_СложнаяДиспоСхема);
	
	ДнейДоставкиДоТЦ 		= ПолучитьЗначениеСвойстваОбъекта(Грузополучатель, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДнейДоставкиДоТЦ);
		
	Если ЭтоСложнаяДиспоСхема = Неопределено И ДеньНеделиДоставки = Неопределено И ДеньНеделиОтгрузки = Неопределено Тогда
		ДеньНеделиДоставки = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДеньНеделиДоставки);
		ЭтоСложнаяДиспоСхема = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_СложнаяДиспоСхема);
		ДнейДоставкиДоТЦ = ПолучитьЗначениеСвойстваОбъекта(Контрагент, ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДнейДоставкиДоТЦ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДеньНеделиОтгрузки) Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаПоставкиНовая = РассчитатьДатуПоставкиПоДиспоСхеме(ДокОбъект.ДатаОтгрузки, ЭтоСложнаяДиспоСхема, ДнейДоставкиДоТЦ, ДеньНеделиДоставки);
	
	Если ДокОбъект.абс_ДатаПоставкиВТЦ <> ДатаПоставкиНовая Тогда
		
		#Если Клиент Тогда
			
			// Проверка режима вызова процедуры
			Если НЕ ПустаяСтрока(РежимВызова) Тогда
				Если РежимВызова = "ДатаОтгрузки" Тогда
					ТекстВопроса = "Изменилась дата отгрузки.";
				КонецЕсли;
				Если ТекстВопроса<>"" Тогда
					Если Вопрос(ТекстВопроса + " Пересчитать дату поставки в ТЦ по диспо-схеме?", 
						РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
						Возврат;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
		#КонецЕсли
		ДокОбъект.абс_ДатаПоставкиВТЦ = ДатаПоставкиНовая;
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьДатуПоставкиПоДиспоСхеме(ДатаОтгрузки, ЭтоСложнаяДиспоСхема, ДнейДоставкиДоТЦ, ДеньНеделиДоставки)
	
	Если ЭтоСложнаяДиспоСхема = Истина Тогда
		
		ДнейДоставкиДоТЦ = ?(ДнейДоставкиДоТЦ = Неопределено, 0, ДнейДоставкиДоТЦ);
		
		ДатаПоставки = ДатаОтгрузки + 60*60*24*ДнейДоставкиДоТЦ;
		
	Иначе
		
		Если ДеньНеделиДоставки = Неопределено Тогда
			ДатаПоставки = ДатаОтгрузки;
		Иначе
			НомерДняНеделиДоставки = Перечисления.ДниНедели.Индекс(ДеньНеделиДоставки)+1;
			
			Если ДеньНедели(ДатаОтгрузки) <= НомерДняНеделиДоставки Тогда
				ДатаПоставки = НачалоНедели(ДатаОтгрузки) + 60*60*24*(НомерДняНеделиДоставки-1);
			Иначе
				ДатаПоставки = КонецНедели(ДатаОтгрузки) + 1 + 60*60*24*(НомерДняНеделиДоставки-1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаПоставки;
	
КонецФункции

Функция ПолучитьЗначениеСвойстваОбъекта(ТекОбъект, ТекСвойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", ТекОбъект);
	Запрос.УстановитьПараметр("Свойство", ТекСвойство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура абс_ОбработкаПроведенияПоступленияТоваровУслуг(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ЗначениеЗаполнено(Источник.абс_ДокументОснование) Тогда	
		//проведение поступления по регистру абс_НеотгруженныеТовары
		СформироватьДвиженияПоНеотгруженнымТоварам(Источник);
	КонецЕсли;
	
    Лео_СформироватьЗаписи_Лео_ПартияНоменклатуры(Источник,Отказ);
	
КонецПроцедуры

Процедура ЗаполнитьАртикулыПокупателяПоЗаписиРегистра(МассивНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ЗначенияСвойствНоменклатурыКонтрагентов.Контрагент,
	|	ЕСТЬNULL(абс_ЗначенияСвойствНоменклатурыКонтрагентов.ЗначениеСвойства, """") КАК АртикулПокупателя,
	|	ТабНоменклатуры.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК ТабНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ЗначенияСвойствНоменклатурыКонтрагентов КАК абс_ЗначенияСвойствНоменклатурыКонтрагентов
	|		ПО (абс_ЗначенияСвойствНоменклатурыКонтрагентов.Номенклатура = ТабНоменклатуры.Ссылка)
	|			И (абс_ЗначенияСвойствНоменклатурыКонтрагентов.Свойство = &СвойствоАртикулПокупателя)
	|ГДЕ
	|	ТабНоменклатуры.Ссылка В(&МассивНоменклатуры)
	|ИТОГИ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("СвойствоАртикулПокупателя", ПланыВидовХарактеристик.СвойстваОбъектов.абс_АртикулПокупателя);
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		Выборка = ВыборкаНоменклатуры.Выбрать();
		НоменклатураОбъект = ВыборкаНоменклатуры.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.абс_АртикулыПокупателя.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = НоменклатураОбъект.абс_АртикулыПокупателя.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		Попытка
			НоменклатураОбъект.Записать();
		Исключение
			Сообщить("Не удалось заполнить табличную часть ""Артикулы покупателя"" для номенклатуры " + ВыборкаНоменклатуры.Номенклатура); 
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

функция ПолучитьАвтоматическиеСкидкиПоДокументу(Док) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СкидкиНаценкиСрезПоследних.Регистратор КАК ДокументСкидки
	|ИЗ
	|	РегистрСведений.абс_СкидкиНаценки.СрезПоследних(
	|			&ДатаДок,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Контрагент В (&МассивКонтрагентов)
	|				И НЕ НазначаетсяВручную) КАК абс_СкидкиНаценкиСрезПоследних
	|ГДЕ
	|	(абс_СкидкиНаценкиСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ абс_СкидкиНаценкиСрезПоследних.ДатаОкончания >= &ДатаДок)";
	
	МассивНоменклатуры = Док.Товары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	
	МассивКонтрагентов = Новый Массив;
	МассивКонтрагентов.Добавить(Док.Контрагент);
	МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ДатаДок", Док.Дата);
	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивКонтрагентов",МассивКонтрагентов);
	
	//МассивСкидок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументСкидки");
	
	//
	//
	
	 // Катанович СКИДКИ НАЦЕНКИ
	МассивСкидок = Новый Массив;
	 
	// Катанович СКИДКИ и НАЦЕНКИ   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Получатель) Тогда  // Скидка по грузополучателю
			 Если Выборка.Получатель = Док.Грузополучатель Тогда
				  МассивСкидок. Добавить(Выборка.ДокументСкидки);
			 КонецЕсли;	 
	    Иначе
			 МассивСкидок.Добавить(Выборка.ДокументСкидки);

		КонецЕсли;
		
	КонецЦикла;	
	
	//Возврат МассивСкидок;

	
	
	
	МассивСкидокСНевыполненнымиУсловиями = ПолучитьМассивСкидокСНевыполненнымиУсловиями(МассивСкидок,Док);
	
	Для Каждого ЭлементСкидка из МассивСкидокСНевыполненнымиУсловиями Цикл
		Индекс = МассивСкидок.Найти(ЭлементСкидка);
		Если Не Индекс = Неопределено Тогда
			МассивСкидок.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСкидок;
	
КонецФункции

функция ПолучитьВсеСкидкиПоДокументу(Док) Экспорт
//Катанович	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	абс_СкидкиНаценкиСрезПоследних.Регистратор КАК ДокументСкидки,
	|	абс_СкидкиНаценкиСрезПоследних.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.абс_СкидкиНаценки.СрезПоследних(
	|			&ДатаДок,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Контрагент В (&МассивКонтрагентов)) КАК абс_СкидкиНаценкиСрезПоследних
	|ГДЕ
	|	(абс_СкидкиНаценкиСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ абс_СкидкиНаценкиСрезПоследних.ДатаОкончания >= &ДатаДок)";
	
	МассивНоменклатуры = Док.Товары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	
	МассивКонтрагентов = Новый Массив;
	МассивКонтрагентов.Добавить(Док.Контрагент);
	МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивКонтрагентов",МассивКонтрагентов);
	//+лео Сафонов ЕА
	//Запрос.УстановитьПараметр("ДатаДок", Док.Дата);
	Если Док.ДатаПоДаннымПокупателя = Дата("0001","01","01","00","00","00") Тогда
		ДатаРасчетаСкидок = Док.Дата;
	Иначе
		ДатаРасчетаСкидок = Док.ДатаПоДаннымПокупателя;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаДок",ДатаРасчетаСкидок);
	//-лео Сафонов ЕА

	 МассивСкидок = Новый Массив;
	 
	// Катанович СКИДКИ и НАЦЕНКИ   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Получатель) Тогда  // Скидка по грузополучателю
			 Если Выборка.Получатель = Док.Грузополучатель Тогда
				  МассивСкидок. Добавить(Выборка.ДокументСкидки);
			 КонецЕсли;	 
	    Иначе
			 МассивСкидок.Добавить(Выборка.ДокументСкидки);

		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивСкидок;
	
КонецФункции

Процедура РассчитатьСкидкиДокумента(Док, МассивСкидок) Экспорт
	
	Товары = Док.Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Сумма,
	|	Товары.НомерСтроки,
	|	Товары.Количество,
	|	Товары.Цена
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТаблицаТоваров.Количество * ТаблицаТоваров.Цена) КАК ОбщаяСумма
	|ПОМЕСТИТЬ ВсеТовары
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановкаСкидокНоменклатуры.Ссылка,
	|	УстановкаСкидокНоменклатуры.Условие,
	|	УстановкаСкидокНоменклатуры.ПроцентСкидкиНаценки,
	|	УстановкаСкидокНоменклатуры.ОграничениеСкидкиНаценки,
	|	УстановкаСкидокНоменклатуры.абс_ПрименятьСкидкуДоОграничения,
	|	УстановкаСкидокНоменклатуры.абс_УсловиеДляСкидкиКоличеством,
	|	УстановкаСкидокНоменклатуры.абс_СкидкаКоличеством,
	|	УстановкаСкидокНоменклатуры.абс_СкидкаСуммой,
	|	УстановкаСкидокНоменклатуры.абс_ТипЦен,
	|	УстановкаСкидокНоменклатуры.Валюта
	|ПОМЕСТИТЬ ТаблицаСкидок
	|ИЗ
	|	Документ.УстановкаСкидокНоменклатуры КАК УстановкаСкидокНоменклатуры
	|ГДЕ
	|	УстановкаСкидокНоменклатуры.Ссылка В(&МассивСкидок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСкидок.Ссылка,
	|	ТаблицаСкидок.Условие,
	|	ВЫБОР
	|		КОГДА УстановкаСкидокНоменклатурыТовары.ПроцентСкидкиНаценки <> 0
	|			ТОГДА УстановкаСкидокНоменклатурыТовары.ПроцентСкидкиНаценки
	|		ИНАЧЕ ТаблицаСкидок.ПроцентСкидкиНаценки
	|	КОНЕЦ КАК ПроцентСкидкиНаценки,
	|	ТаблицаСкидок.ОграничениеСкидкиНаценки,
	|	ТаблицаСкидок.абс_ПрименятьСкидкуДоОграничения КАК ПрименятьСкидкуДоОграничения,
	|	ТаблицаСкидок.абс_УсловиеДляСкидкиКоличеством КАК УсловиеДляСкидкиКоличеством,
	|	ТаблицаСкидок.абс_СкидкаКоличеством КАК СкидкаКоличеством,
	|	ТаблицаСкидок.абс_СкидкаСуммой КАК СкидкаСуммой,
	|	ТаблицаСкидок.абс_ТипЦен КАК ТипЦен,
	|	ТаблицаСкидок.Валюта,
	|	УстановкаСкидокНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	УстановкаСкидокНоменклатурыТовары.Лео_Цена КАК СпецЦена
	|ПОМЕСТИТЬ ТаблицаСкидокСНоменклатурой
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокНоменклатуры.Товары КАК УстановкаСкидокНоменклатурыТовары
	|		ПО ТаблицаСкидок.Ссылка = УстановкаСкидокНоменклатурыТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Сумма,
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаСкидокСНоменклатурой.Условие,
	|	ТаблицаСкидокСНоменклатурой.ПроцентСкидкиНаценки,
	|	ТаблицаСкидокСНоменклатурой.ОграничениеСкидкиНаценки,
	|	ТаблицаСкидокСНоменклатурой.ПрименятьСкидкуДоОграничения,
	|	ТаблицаСкидокСНоменклатурой.УсловиеДляСкидкиКоличеством,
	|	ТаблицаСкидокСНоменклатурой.СкидкаКоличеством,
	|	ТаблицаСкидокСНоменклатурой.СкидкаСуммой,
	|	ТаблицаСкидокСНоменклатурой.ТипЦен,
	|	ТаблицаСкидокСНоменклатурой.Валюта,
	|	ТаблицаТоваров.Количество,
	|	ТаблицаТоваров.Цена,
	|	ТаблицаСкидокСНоменклатурой.СпецЦена
	|ПОМЕСТИТЬ ТаблицаТоваровСоСкидками
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСкидокСНоменклатурой КАК ТаблицаСкидокСНоменклатурой
	|		ПО (ВЫБОР
	|				КОГДА ТаблицаСкидокСНоменклатурой.Номенклатура ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ТаблицаТоваров.Номенклатура = ТаблицаСкидокСНоменклатурой.Номенклатура
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровСоСкидками.НомерСтроки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаТоваровСоСкидками.Условие ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТаблицаТоваровСоСкидками.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.БезУсловий)
	|							ИЛИ ТаблицаТоваровСоСкидками.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.абс_ПроцентомСОграничением)
	|						ТОГДА ВЫБОР
	|								КОГДА ТаблицаТоваровСоСкидками.СпецЦена > 0
	|									ТОГДА ТаблицаТоваровСоСкидками.Цена * ТаблицаТоваровСоСкидками.Количество - ТаблицаТоваровСоСкидками.СпецЦена * ТаблицаТоваровСоСкидками.Количество
	|								ИНАЧЕ ТаблицаТоваровСоСкидками.Цена * ТаблицаТоваровСоСкидками.Количество * ТаблицаТоваровСоСкидками.ПроцентСкидкиНаценки / 100
	|							КОНЕЦ
	|					КОГДА ТаблицаТоваровСоСкидками.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.абс_Количеством)
	|						ТОГДА ВЫБОР
	|								КОГДА ТаблицаТоваровСоСкидками.УсловиеДляСкидкиКоличеством = 0
	|									ТОГДА 0
	|								ИНАЧЕ (ВЫРАЗИТЬ(ТаблицаТоваровСоСкидками.Количество / ТаблицаТоваровСоСкидками.УсловиеДляСкидкиКоличеством - 0.5 КАК ЧИСЛО(5, 0))) * ТаблицаТоваровСоСкидками.Цена * ТаблицаТоваровСоСкидками.СкидкаКоличеством
	|							КОНЕЦ
	|					КОГДА ТаблицаТоваровСоСкидками.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.абс_СпециальнаяЦена)
	|						ТОГДА ВЫБОР
	|								КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL 
	|									ТОГДА 0
	|								ИНАЧЕ ТаблицаТоваровСоСкидками.Цена * ТаблицаТоваровСоСкидками.Количество - ТаблицаТоваровСоСкидками.Количество * ЦеныНоменклатурыСрезПоследних.Цена
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК Скидка,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТоваровСоСкидками.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.абс_СуммойНаДокумент)
	|				ТОГДА ВЫБОР
	|						КОГДА ВсеТовары.ОбщаяСумма = 0
	|							ТОГДА 0
	|						ИНАЧЕ ТаблицаТоваровСоСкидками.Цена * ТаблицаТоваровСоСкидками.Количество / ВсеТовары.ОбщаяСумма * ТаблицаТоваровСоСкидками.СкидкаСуммой
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СкидкаСуммой
	|ИЗ
	|	ТаблицаТоваровСоСкидками КАК ТаблицаТоваровСоСкидками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаДок, ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО (ВЫБОР
	|				КОГДА ТаблицаТоваровСоСкидками.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.абс_СпециальнаяЦена)
	|					ТОГДА ТаблицаТоваровСоСкидками.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|							И ТаблицаТоваровСоСкидками.ТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеТовары КАК ВсеТовары
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваровСоСкидками.НомерСтроки";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("МассивСкидок", МассивСкидок);
	Если Док.ДатаПоДаннымПокупателя = Дата("0001","01","01","00","00","00") Тогда
		ДатаРасчетаСкидок = Док.Дата;
	Иначе
		ДатаРасчетаСкидок = Док.ДатаПоДаннымПокупателя;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаДок",ДатаРасчетаСкидок);
	
	Если Товары.Итог("Лео_КомпенсирующаяСкидка")>0 Тогда
		Сообщить("Внимание! Компенсирующая скидка отменена из-за внесения изменений в Заказ. Назначьте компенсирующую скидку повторно!",СтатусСообщения.Внимание);	
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Док.Товары.Найти(Выборка.НомерСтроки, "НомерСтроки");
		//+Лео Сафонов ЕА Очищаем компенсирующую скидку
		СтрокаТЧ.Лео_КомпенсирующаяСкидка = 0;
		СтрокаТЧ.Лео_КомпенсирующаяСкидкаСНДС = 0;
		//-Лео Сафонов ЕА Очищаем компенсирующую скидку

		СтрокаТЧ.абс_СуммаАвтоматическойСкидки = Выборка.Скидка + Выборка.СкидкаСуммой;
		СтрокаТЧ.ПроцентАвтоматическихСкидок = ?(СтрокаТЧ.Цена = 0 или СтрокаТЧ.Количество = 0, 0, СтрокаТЧ.абс_СуммаАвтоматическойСкидки / (СтрокаТЧ.Цена * СтрокаТЧ.Количество) * 100);
		СтрокаТЧ.ПроцентСкидкиНаценки = ?(СтрокаТЧ.Цена = 0 или СтрокаТЧ.Количество = 0, 0, СтрокаТЧ.абс_СуммаРучнойСкидки / (СтрокаТЧ.Цена * СтрокаТЧ.Количество) * 100); 
		СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество - СтрокаТЧ.абс_СуммаАвтоматическойСкидки - СтрокаТЧ.абс_СуммаРучнойСкидки ;
		//+Лео Сафонов ЕА Поиск оптимальной цены с учетом скидки
		Лео_РасчитатьОптимальнуюЦенуСоСкидкой(СтрокаТЧ);
		//-Лео Сафонов ЕА Поиск оптимальной цены с учетом скидки
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, Док);
	КонецЦикла;
	
КонецПроцедуры

//+Лео Сафонов ЕА Поиск оптимальной цены с учетом скидки, что бы обратный расчет давал ту же сумму с учетом скидки
Процедура Лео_РасчитатьОптимальнуюЦенуСоСкидкой(СтрокаТЧ)  Экспорт
	
	ЦенаСУчетомСкидки = Число(?(СтрокаТЧ.Количество = 0 или СтрокаТЧ.Сумма = 0, 0, Формат(СтрокаТЧ.Сумма/СтрокаТЧ.Количество,"ЧЦ=15; ЧДЦ=2")));
    Если СтрокаТЧ.Сумма = 0 Тогда
	    СтрокаТЧ.Лео_ЦенаСУчетомСкидки =  0;
		СтрокаТЧ.Лео_СуммаОкругляющейСкидки = 0;
	ИначеЕсли СтрокаТЧ.Сумма = ЦенаСУчетомСкидки*СтрокаТЧ.Количество Тогда
		СтрокаТЧ.Лео_ЦенаСУчетомСкидки =  ЦенаСУчетомСкидки;
		СтрокаТЧ.Лео_СуммаОкругляющейСкидки = 0;
    ИначеЕсли СтрокаТЧ.Сумма  < ЦенаСУчетомСкидки*СтрокаТЧ.Количество Тогда
        ЦенаСУчетомСкидки = ЦенаСУчетомСкидки - 0.01;
		СтрокаТЧ.Лео_СуммаОкругляющейСкидки = СтрокаТЧ.Сумма - ЦенаСУчетомСкидки*СтрокаТЧ.Количество;
		СтрокаТЧ.Сумма =  ЦенаСУчетомСкидки*СтрокаТЧ.Количество;
		СтрокаТЧ.Лео_ЦенаСУчетомСкидки =  ЦенаСУчетомСкидки;
	Иначе
		СтрокаТЧ.Лео_ЦенаСУчетомСкидки =  ЦенаСУчетомСкидки;
		СтрокаТЧ.Лео_СуммаОкругляющейСкидки = СтрокаТЧ.Сумма - ЦенаСУчетомСкидки*СтрокаТЧ.Количество;
		СтрокаТЧ.Сумма =  ЦенаСУчетомСкидки*СтрокаТЧ.Количество;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивСкидокСНевыполненнымиУсловиями(МассивСкидок,Док) Экспорт
	
	МассивСкидокСНевыполненнымиУсловиями = Новый Массив;
	
	Для каждого ДокументСкидки из МассивСкидок Цикл
		Если ДокументСкидки.Условие = Перечисления.УсловияСкидкиНаценки.абс_ПроцентомСОграничением Тогда
			УсловиеВыполнено = ПроверитьВыполнениеУсловияСкидки(ДокументСкидки, Док);
			Если Не УсловиеВыполнено Тогда
				МассивСкидокСНевыполненнымиУсловиями.Добавить(ДокументСкидки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСкидокСНевыполненнымиУсловиями;
	
КонецФункции

Функция ПроверитьВыполнениеУсловияСкидки(ДокументСкидки, ДокументЗаказ) Экспорт
	УсловияВыполнены = Истина;
	ОграничениеСкидкиНаценки = ДокументСкидки.ОграничениеСкидкиНаценки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	абс_СкидкиНаценки.Номенклатура,
	               |	абс_СкидкиНаценки.ОграничениеСкидкиНаценки КАК ЛимитСумма,
	               |	абс_СкидкиНаценки.Лимит_Количество КАК ЛимитКоличество,
	               |	СУММА(ЗаказПокупателяТовары.Количество) КАК ЗаказКоличество,
	               |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)) КАК ОтгруженоКоличество,
	               |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.абс_СуммаАвтоматическойСкидки, 0)) КАК ОтгруженоСумма,
	               |	абс_СкидкиНаценки.Номенклатура.Артикул КАК Артикул,
	               |	СУММА(ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки) КАК ЗаказСумма
	               |ИЗ
	               |	РегистрСведений.абс_СкидкиНаценки КАК абс_СкидкиНаценки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |		ПО абс_СкидкиНаценки.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	               |			СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	               |			СУММА(ЗаказПокупателяТовары.абс_СуммаАвтоматическойСкидки) КАК абс_СуммаАвтоматическойСкидки
	               |		ИЗ
	               |			Документ.ЗаказПокупателя.абс_СкидкиНаценки КАК ЗаказПокупателяабс_СкидкиНаценки
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |				ПО ЗаказПокупателяабс_СкидкиНаценки.Ссылка = ЗаказПокупателяТовары.Ссылка
	               |		ГДЕ
	               |			ЗаказПокупателяабс_СкидкиНаценки.Скидка = &СсылкаСкидка
	               |			И ЗаказПокупателяТовары.Ссылка <> &СсылкаЗаказ
	               |			И ЗаказПокупателяТовары.Ссылка.Проведен = ИСТИНА
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказПокупателяТовары.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО абс_СкидкиНаценки.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |ГДЕ
	               |	абс_СкидкиНаценки.Регистратор = &СсылкаСкидка
	               |	И ЗаказПокупателяТовары.Ссылка = &СсылкаЗаказ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	абс_СкидкиНаценки.Номенклатура,
	               |	абс_СкидкиНаценки.Лимит_Количество,
	               |	абс_СкидкиНаценки.ОграничениеСкидкиНаценки,
	               |	абс_СкидкиНаценки.Номенклатура.Артикул"	;
	
	 Запрос.УстановитьПараметр("СсылкаСкидка",ДокументСкидки);
     Запрос.УстановитьПараметр("СсылкаЗаказ",ДокументЗаказ);

	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		  Если Выборка.ОтгруженоКоличество + Выборка.ЗаказКоличество > Выборка.ЛимитКоличество Тогда
		       Сообщить("Артикул " + Выборка.Артикул + ": превышение лимита на " + Строка(Выборка.ОтгруженоКоличество + Выборка.ЗаказКоличество - Выборка.ЛимитКоличество) + " шт."); 
			   УсловияВыполнены = Ложь;
		   КонецЕсли;
		   Если Выборка.ОтгруженоСумма + Выборка.ЗаказСумма >= Выборка.ЛимитСумма Тогда
		       Сообщить("Артикул " + Выборка.Артикул + ": превышение суммы на " + Строка(Выборка.ОтгруженоСумма - Выборка.ЛимитСумма) + " руб.");
			   УсловияВыполнены = Ложь;
		  КонецЕсли;
	 КонецЦикла;
	 Возврат  УсловияВыполнены;
КонецФункции

Функция ПолучитьИмяСкидки(Скидка) Экспорт
	
	Если Скидка.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий Тогда
		ИмяСкидки = "Скидка "+Скидка.ПроцентСкидкиНаценки+"%";
	ИначеЕсли Скидка.Условие = Перечисления.УсловияСкидкиНаценки.абс_ПроцентомСОграничением Тогда
		ИмяСкидки = "Скидка процентом с ограничением "+Скидка.Лео_НомерАктивности;
	ИначеЕсли Скидка.Условие = Перечисления.УсловияСкидкиНаценки.абс_Количеством Тогда
		ИмяСкидки = "Скидка количеством ("+Скидка.абс_СкидкаКоличеством+" ед. бесплатно из " + Скидка.абс_УсловиеДляСкидкиКоличеством+")";
	ИначеЕсли Скидка.Условие = Перечисления.УсловияСкидкиНаценки.абс_СуммойНаДокумент Тогда
		ИмяСкидки = "Скидка суммой на документ " + Скидка.абс_СкидкаСуммой + " " + Скидка.Валюта.Наименование;
	ИначеЕсли Скидка.Условие = Перечисления.УсловияСкидкиНаценки.абс_СпециальнаяЦена Тогда
		ИмяСкидки = "Спец. цена " + Скидка.абс_ТипЦен;
	Иначе 
		ИмяСкидки = "Скидка по документу "+Скидка;
	КонецЕсли;
	
	Возврат ИмяСкидки;
	
КонецФункции

Процедура абс_ПередЗаписьюПроверкаНеактивныйКонтрагент(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//{Лео Катанович
	//Если ЗначениеЗаполнено(Источник.Контрагент.абс_СтатусКонтрагента) Тогда
	//	Если Источник.Контрагент.абс_СтатусКонтрагента <> Перечисления.абс_СтатусыКонтрагентов.Активный Тогда
	//		ОбщегоНазначения.СообщитьОбОшибке("Нельзя записать документ с неактивным контрагентом");
	//		Отказ = Истина;
	//	КонецЕсли;
	//Иначе	
	//		ОбщегоНазначения.СообщитьОбОшибке("Нельзя записать документ с неактивным контрагентом");
	//		Отказ = Истина;
	//КонецЕсли;
	//Лео Катанович}
КонецПроцедуры

Процедура ПеренестиВсеСтрокиВНеотгружено(СтруктураПараметров, ДокументОбъект) Экспорт
	
	Для каждого СтрокаТабЧастиТовары из ДокументОбъект.Товары Цикл
	
		НеотгруженноеКоличество =  СтрокаТабЧастиТовары.Количество;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура",СтрокаТабЧастиТовары.Номенклатура);
		ПараметрыОтбора.Вставить("СерияНоменклатуры",СтрокаТабЧастиТовары.СерияНоменклатуры);
		ПараметрыОтбора.Вставить("ПричинаНеотгрузки",СтруктураПараметров.ПричинаНеотгрузки);
		ПараметрыОтбора.Вставить("СкладПретензий",СтруктураПараметров.СкладПретензий);
		ПараметрыОтбора.Вставить("НомерПретензии",СтруктураПараметров.НомерПретензии);
		ПараметрыОтбора.Вставить("ДатаПретензии",СтруктураПараметров.ДатаПретензии);
		
		МассивСтрок = ДокументОбъект.абс_Неотгружено.НайтиСтроки(ПараметрыОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаНеотгруженныхТоваров = ДокументОбъект.абс_Неотгружено.Добавить();
		Иначе
			СтрокаНеотгруженныхТоваров = МассивСтрок[0];
		КонецЕсли;
		
		СтрокаНеотгруженныхТоваров.Номенклатура      = СтрокаТабЧастиТовары.Номенклатура;
		СтрокаНеотгруженныхТоваров.СерияНоменклатуры = СтрокаТабЧастиТовары.СерияНоменклатуры;
		СтрокаНеотгруженныхТоваров.Количество        = СтрокаНеотгруженныхТоваров.Количество + НеотгруженноеКоличество;
		СтрокаНеотгруженныхТоваров.ЕдиницаИзмерения  = СтрокаТабЧастиТовары.ЕдиницаИзмерения;
		СтрокаНеотгруженныхТоваров.ПричинаНеотгрузки = СтруктураПараметров.ПричинаНеотгрузки;
		СтрокаНеотгруженныхТоваров.НомерПретензии	 = СтруктураПараметров.НомерПретензии;
		СтрокаНеотгруженныхТоваров.ДатаПретензии	 = СтруктураПараметров.ДатаПретензии;
		СтрокаНеотгруженныхТоваров.СкладПретензий	 = СтруктураПараметров.СкладПретензий;
		
		Сумма = ?(ДокументОбъект.СуммаВключаетНДС,СтрокаТабЧастиТовары.Сумма,СтрокаТабЧастиТовары.Сумма+СтрокаТабЧастиТовары.СуммаНДС); 
		
		СтрокаНеотгруженныхТоваров.Сумма = Сумма;
		//СтрокаНеотгруженныхТоваров.Цена              = ?(СтрокаНеотгруженныхТоваров.Количество=0,0,СтрокаНеотгруженныхТоваров.Сумма/СтрокаНеотгруженныхТоваров.Количество);		
		СтрокаНеотгруженныхТоваров.Цена = СтрокаТабЧастиТовары.Цена;
		СтрокаНеотгруженныхТоваров.СуммаНДС  = УчетНДС.РассчитатьСуммуНДС(СтрокаНеотгруженныхТоваров.Сумма,ДокументОбъект.УчитыватьНДС, ДокументОбъект.СуммаВключаетНДС,УчетНДС.ПолучитьСтавкуНДС(СтрокаТабЧастиТовары.СтавкаНДС));
		СтрокаНеотгруженныхТоваров.СтавкаНДС =  СтрокаТабЧастиТовары.СтавкаНДС;


	КонецЦикла;
	
	ДокументОбъект.Товары.Очистить();
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСкладаВРеализации(Реализация, Отказ) Экспорт
	
	Сделка = Реализация.Сделка;
	Если ЗначениеЗаполнено(Сделка) И ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если Сделка.СкладГруппа<>Реализация.Склад Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Склад в документе " + Реализация.Склад + " отличается от склада в Заказе покупателя " + Сделка.СкладГруппа);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОсновныеРеквизитыКонтрагента(КонтрагентОбъект, Отказ) Экспорт
	
	//проверка, заполнение основного способа доставки
	Если Не ЗначениеЗаполнено(КонтрагентОбъект.абс_ОсновнойСпособДоставки) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_СпособыДоставкиКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.абс_СпособыДоставкиКонтрагентов КАК абс_СпособыДоставкиКонтрагентов
		|ГДЕ
		|	абс_СпособыДоставкиКонтрагентов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец",КонтрагентОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Если Выборка.Количество()=1 Тогда
				Выборка.Следующий();
				КонтрагентОбъект.абс_ОсновнойСпособДоставки = Выборка.Ссылка;
			Иначе
				ОписаниеОшибки = "Не указан основной способ доставки контрагента";
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//проверка, заполнение основного банковского счета
  	Если Не ЗначениеЗаполнено(КонтрагентОбъект.ОсновнойБанковскийСчет) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец",КонтрагентОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Если Выборка.Количество()=1 Тогда
				Выборка.Следующий();
				КонтрагентОбъект.ОсновнойБанковскийСчет = Выборка.Ссылка;
			Иначе
				ОписаниеОшибки = "Не указан основной банковский счет контрагента";
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//проверка, заполнение основного договора
  	Если Не ЗначениеЗаполнено(КонтрагентОбъект.ОсновнойДоговорКонтрагента) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец",КонтрагентОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Если Выборка.Количество()=1 Тогда
				Выборка.Следующий();
				КонтрагентОбъект.ОсновнойДоговорКонтрагента = Выборка.Ссылка;
			Иначе
				ОписаниеОшибки = "Не указан основной договор контрагента";
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//проверка, заполнение основного контактного лица
  	Если Не ЗначениеЗаполнено(КонтрагентОбъект.ОсновноеКонтактноеЛицо) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
		|ГДЕ
		|	КонтактныеЛицаКонтрагентов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец",КонтрагентОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Если Выборка.Количество()=1 Тогда
				Выборка.Следующий();
				КонтрагентОбъект.ОсновноеКонтактноеЛицо = Выборка.Ссылка;
			Иначе
				ОписаниеОшибки = "Не указано основное контактное лицо контрагента";
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОсновнойАдресКонтрагента(Контрагент, Отказ) Экспорт
	
	//проверка, установка основного адреса
	ОсновнойАдрес = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Контрагент);
	Если Не ЗначениеЗаполнено(ОсновнойАдрес) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.абс_ДатаАктуальностиКИ
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Контрагент
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			Если Выборка.Количество()=1 Тогда
				Выборка.Следующий();
				НаборКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
				НаборКИ.Отбор.Объект.Установить(Выборка.Объект);
				НаборКИ.Отбор.Тип.Установить(Выборка.Тип);
				НаборКИ.Отбор.Вид.Установить(Выборка.Вид);
				НаборКИ.Отбор.абс_ДатаАктуальностиКИ.Установить(Выборка.абс_ДатаАктуальностиКИ);
				НаборКИ.Прочитать();
				НаборКИ[0].ЗначениеПоУмолчанию = Истина;
				НаборКИ.Записать();
			Иначе
				ОписаниеОшибки = "Не указан основной адрес контрагента";
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

Процедура абс_ПроверкаНомераДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	Возврат;
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Номер = ПолучитьЧисловойНомерДокумента(Источник);
	Период = НачалоГода(Источник.Дата);
	МетаданныеДокумента = Источник.Метаданные();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НомераДокументов.Документ
	|ИЗ
	|	РегистрСведений.абс_НомераДокументов КАК абс_НомераДокументов
	|ГДЕ
	|	абс_НомераДокументов.Номер = &Номер
	|	И абс_НомераДокументов.Дата = &Период
	|	И абс_НомераДокументов.Организация = &Организация
	|	И НЕ абс_НомераДокументов.Документ = &Ссылка
	|	И абс_НомераДокументов.Документ ССЫЛКА Документ." + МетаданныеДокумента.Имя;
	
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Источник.Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		НаборЗаписей = РегистрыСведений.абс_НомераДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Источник.Ссылка);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Источник.Ссылка;
		Запись.Номер = Номер;
		Запись.Дата = Период;
		Запись.Организация = Источник.Организация;
		
		НаборЗаписей.Записать();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбщегоНазначения.СообщитьОбОшибке("Номер не уникален! Используется в документе " + Выборка.Документ);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЧисловойНомерДокумента(Документ) Экспорт
	
	Номер = СокрЛП(Документ.Номер);
	
	ЕстьСимвол = Ложь;
	
	Для НомерСимвола=1 по СтрДлина(Номер)Цикл
		
		Символ = Сред(Номер, СтрДлина(Номер)-НомерСимвола+1, 1);
		
		Если Символ="-" Тогда
			ЕстьСимвол = Истина;
			Прервать;
		КонецЕсли;
		
		Попытка
			ЧисловоеЗначение = Число(Символ);
		Исключение
			ЕстьСимвол = Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Если ЕстьСимвол Тогда
		Если НомерСимвола = 1 Тогда
			Возврат 0;
		Иначе
			Возврат Число(Сред(Номер,СтрДлина(Номер)-НомерСимвола+2,НомерСимвола-1));
		КонецЕсли;
	Иначе
		Возврат Число(Номер);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПодписьОтветственного(ВыводитьОснование=Истина, ДокументОснование = Неопределено) Экспорт
	
	ОсновнаяПодпись = Неопределено;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.ОсновнаяПодпись,
		|	ВЫБОР
		|		КОГДА НЕ абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле1
		|ИЗ
		|	РегистрСведений.абс_ПодписиОтветственныхПоОрганизациям.СрезПоследних(&ДатаДок, Организация = &Организация) КАК абс_ПодписиОтветственныхПоОрганизациямСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь = &ТекПользователь
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Поле1 УБЫВ";
		
		Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
		Запрос.УстановитьПараметр("ДатаДок", ДокументОснование.Дата);
		Запрос.УстановитьПараметр("ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОсновнаяПодпись = Выборка.ОсновнаяПодпись;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновнаяПодпись) Тогда
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;

		ОсновнаяПодпись = ТекПользователь.абс_ДанныеПодписи;
		
	КонецЕсли;
	
	СтруктураПодписи = Новый Структура();
	
	СтруктураПодписи.Вставить("ФизЛицо"				, ОсновнаяПодпись.ФизЛицо);
	СтруктураПодписи.Вставить("Должность"			, ОсновнаяПодпись.Должность);
	СтруктураПодписи.Вставить("ДокументОснование"	, ОсновнаяПодпись.ДокументОснование);
	
	Если ЗначениеЗаполнено(СтруктураПодписи) Тогда
        Если ВыводитьОснование Тогда 
			СтруктураПодписи.Вставить("РасшифровкаПодписи"	, ОбщегоНазначения.ФамилияИнициалыФизЛица(ОсновнаяПодпись.ФизЛицо) + Символы.ПС + ОсновнаяПодпись.ДокументОснование);
		Иначе
			СтруктураПодписи.Вставить("РасшифровкаПодписи"	, ОбщегоНазначения.ФамилияИнициалыФизЛица(ОсновнаяПодпись.ФизЛицо));
		КонецЕсли;
	Иначе
		СтруктураПодписи.Вставить("РасшифровкаПодписи"	, "");
	КонецЕсли;
	
	Возврат СтруктураПодписи;
	
КонецФункции

Функция ЛеоПолучитьПодписьОтветственногоХардкод(ВыводитьОснование=Истина, ДокументОснование = Неопределено)  Экспорт
	
ОсновнаяПодпись = Неопределено;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.ОсновнаяПодпись,
		|	ВЫБОР
		|		КОГДА НЕ абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Поле1
		|ИЗ
		|	РегистрСведений.абс_ПодписиОтветственныхПоОрганизациям.СрезПоследних(&ДатаДок, Организация = &Организация) КАК абс_ПодписиОтветственныхПоОрганизациямСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА абс_ПодписиОтветственныхПоОрганизациямСрезПоследних.Пользователь = &ТекПользователь
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
		Запрос.УстановитьПараметр("ДатаДок", ДокументОснование.Дата);
		
		//// <<Горбунов. Откорректировал, чтобы в леовите всегда была фамилия Лупач, в леотоне - Глухова
		//Если ДокументОснование.Организация.Код = "О00000003"  Тогда// печать Лиовит Нутрио.
		//	ПользовательДляОтчета = Справочники.Пользователи.НайтиПоНаименованию("Лупач Наталия Эдуардовна");
		//ИначеЕсли ДокументОснование.Организация.Код = "О00000001" Тогда// печать Леотон.
		//	ПользовательДляОтчета = Справочники.Пользователи.НайтиПоНаименованию("Глухова Светлана Леонидовна");
		//Иначе
		//	ПользовательДляОтчета = Справочники.Пользователи.ПустаяСсылка();
		//КонецЕсли;
		//Запрос.УстановитьПараметр("ТекПользователь", ПользовательДляОтчета);
		//// >>Горбунов
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОсновнаяПодпись = Выборка.ОсновнаяПодпись;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновнаяПодпись) Тогда
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		ОсновнаяПодпись = ТекПользователь.абс_ДанныеПодписи;
		
	КонецЕсли;
	
	СтруктураПодписи = Новый Структура();
	
	СтруктураПодписи.Вставить("ФизЛицо"				, ОсновнаяПодпись.ФизЛицо);
	СтруктураПодписи.Вставить("Должность"			, ОсновнаяПодпись.Должность);
	СтруктураПодписи.Вставить("ДокументОснование"	, ОсновнаяПодпись.ДокументОснование);
	
	Если ЗначениеЗаполнено(СтруктураПодписи) Тогда
		Если ВыводитьОснование Тогда 
			СтруктураПодписи.Вставить("РасшифровкаПодписи"	, ОбщегоНазначения.ФамилияИнициалыФизЛица(ОсновнаяПодпись.ФизЛицо) + Символы.ПС + ОсновнаяПодпись.ДокументОснование);
		Иначе
			СтруктураПодписи.Вставить("РасшифровкаПодписи"	, ОбщегоНазначения.ФамилияИнициалыФизЛица(ОсновнаяПодпись.ФизЛицо));
		КонецЕсли;
	Иначе
		СтруктураПодписи.Вставить("РасшифровкаПодписи"	, "");
	КонецЕсли;
	
	Возврат СтруктураПодписи;
	
КонецФункции

Функция ПроверитьВеденияОтгрузокПоСериям() Экспорт
	
	ВыводитьСерии = Ложь;	
	Если Не Метаданные.Константы.Найти("абс_ВестиОтгрузкуПоСериям") = Неопределено Тогда
		ВыводитьСерии = Константы.абс_ВестиОтгрузкуПоСериям.Получить();
	КонецЕсли;
	
	Возврат ВыводитьСерии;
		
КонецФункции

Функция ПроверитьУчетПоСериям(ДатаЗаказа) Экспорт
	
	ВыводитьСерии = Ложь;	
	Если Не Метаданные.Константы.Найти("абс_ДатаНачалаУчетаПоСериям") = Неопределено Тогда
		ДатаНачалаУчетаПоСериям = Константы.абс_ДатаНачалаУчетаПоСериям.Получить();
		Если ЗначениеЗаполнено(ДатаНачалаУчетаПоСериям) И ДатаЗаказа >=  ДатаНачалаУчетаПоСериям Тогда
			ВыводитьСерии = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВыводитьСерии;
		
КонецФункции

Процедура ПроверитьЗаполнитьМенеджеровПоБизнесРегиону(МассивРегионов) Экспорт
	
	// Найдем контрагентов, в которых используется бизнес-регион
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК КонтрагентСсылка,
	|	Контрагенты.ОсновнойМенеджерПокупателя КАК ОсновнойМенеджер,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ВторойМенеджер
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО Контрагенты.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ВторойМенеджер))
	|ГДЕ
	|	(Контрагенты.Регион В (&МассивРегионов)
	|			ИЛИ Контрагенты.абс_Отдел В (&МассивРегионов)
	|			ИЛИ Контрагенты.абс_БизнесРегион В (&МассивРегионов)
	|			ИЛИ Контрагенты.абс_Территория В (&МассивРегионов)
	|			ИЛИ Контрагенты.абс_Город В (&МассивРегионов))
	|	И НЕ Контрагенты.ЭтоГруппа");
	
	Запрос.УстановитьПараметр("МассивРегионов", МассивРегионов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.КонтрагентСсылка.ПолучитьОбъект();
		
		КонтрагентИзменен = Ложь;
		
		абс_Город 			= КонтрагентОбъект.ПолучитьБизнесРегионПоУровню(3);
		абс_Территория 		= КонтрагентОбъект.ПолучитьБизнесРегионПоУровню(2);
		абс_БизнесРегион 	= КонтрагентОбъект.ПолучитьБизнесРегионПоУровню(1);
		абс_Отдел 			= КонтрагентОбъект.ПолучитьБизнесРегионПоУровню(0);
		
		Если НЕ КонтрагентОбъект.абс_Город = абс_Город Тогда
			КонтрагентОбъект.абс_Город = абс_Город;
			КонтрагентИзменен = Истина;
		КонецЕсли;
		
		Если НЕ КонтрагентОбъект.абс_Территория = абс_Территория Тогда
			КонтрагентОбъект.абс_Территория = абс_Территория;
			КонтрагентИзменен = Истина;
		КонецЕсли;
		
		Если НЕ КонтрагентОбъект.абс_БизнесРегион = абс_БизнесРегион Тогда
			КонтрагентОбъект.абс_БизнесРегион = абс_БизнесРегион;
			КонтрагентИзменен = Истина;
		КонецЕсли;
		
		Если НЕ КонтрагентОбъект.абс_Отдел = абс_Отдел Тогда
			КонтрагентОбъект.абс_Отдел = абс_Отдел;
			КонтрагентИзменен = Истина;
		КонецЕсли;		

		ОсновнойМенеджер 	= абс_БизнесРегион.абс_Менеджер;
		ВторойМенеджер		= абс_Территория.абс_Менеджер;
		
		Если НЕ КонтрагентОбъект.ОсновнойМенеджерПокупателя = ОсновнойМенеджер Тогда
			КонтрагентОбъект.ОсновнойМенеджерПокупателя = ОсновнойМенеджер;
			КонтрагентИзменен = Истина;
		КонецЕсли;
		
		ПерезаполнитьТЧМенеджеры = Ложь;
		
		Если КонтрагентОбъект.МенеджерыПокупателя.Количество() = 1 Тогда
			Если НЕ КонтрагентОбъект.МенеджерыПокупателя[0].МенеджерПокупателя = ОсновнойМенеджер Тогда
				ПерезаполнитьТЧМенеджеры = Истина;
			КонецЕсли;
		Иначе
			ПерезаполнитьТЧМенеджеры = Истина;
		КонецЕсли;
		
		Если ПерезаполнитьТЧМенеджеры Тогда
			КонтрагентОбъект.МенеджерыПокупателя.Очистить();			
			КонтрагентОбъект.МенеджерыПокупателя.Добавить().МенеджерПокупателя = ОсновнойМенеджер;
			КонтрагентИзменен = Истина;
		КонецЕсли;
		
		Если КонтрагентИзменен Тогда
			КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
			КонтрагентОбъект.Записать();
		КонецЕсли;
		
		Если НЕ Выборка.ВторойМенеджер = ВторойМенеджер Тогда			
			НаборСвойства = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			
			НаборСвойства.Отбор.Объект.Установить(КонтрагентОбъект.Ссылка);
			НаборСвойства.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.абс_ВторойМенеджер);
			
			НаборСвойства.Прочитать();
			
			НаборСвойства.Очистить();
			
			ЗаписьСвойство = НаборСвойства.Добавить();
			
			ЗаписьСвойство.Объект 			= КонтрагентОбъект.Ссылка;
			ЗаписьСвойство.Свойство         = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ВторойМенеджер;
			ЗаписьСвойство.Значение			= ВторойМенеджер;
			
			НаборСвойства.Записать();			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьДатуОплаты(ДокОбъект, РежимВызова = "", мСтароеЗначениеДоговора=неопределено) Экспорт
	
	ДоговорКонтрагента 	= ДокОбъект.ДоговорКонтрагента;
	//{Лео Катанович
	//ДатаОтгрузки 		= ?(ЗначениеЗаполнено(ДокОбъект.ДатаОтгрузки), ДокОбъект.ДатаОтгрузки, ДокОбъект.Дата);
	ДатаОтгрузки 		= ДокОбъект.ДатаОтгрузки;
    //Лео Катанович}
	Если НЕ ЗначениеЗаполнено(ДатаОтгрузки) Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	
	//+ Сафонов ЕА 
	//ЧислоДнейДоОплаты = ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности;
	//
	//ДатаОплатыНовая = НачалоДня(ДатаОтгрузки) + 86400 * ЧислоДнейДоОплаты;

	ЧислоДнейПредоплаты =ДоговорКонтрагента.Лео_ЧислоДнейПредоплаты;
	ЧислоДнейДоОплаты = ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности;
	
	Если ЧислоДнейДоОплаты <> 0 Тогда
		ДатаОплатыНовая = НачалоДня(ДатаОтгрузки) + 86400 * ЧислоДнейДоОплаты;
	Иначе
		ДатаОплатыНовая = НачалоДня(ДатаОтгрузки) - 86400 * ЧислоДнейПредоплаты;
	КонецЕсли;
	
	///если суббота или вс- перенесем на понедельник
	Если  Деньнедели(ДатаОплатыНовая)=6 Тогда
		 ДатаОплатыНовая = НачалоДня(ДатаОплатыНовая) + 86400 * 2;
	ИначеЕсли  Деньнедели(ДатаОплатыНовая)=7 Тогда
		 ДатаОплатыНовая = НачалоДня(ДатаОплатыНовая) + 86400 * 1;
	КонецЕсли;
	
	/////
	
	
	//- Сафонов ЕА

	
	
	Если ДокОбъект.ДатаОплаты <> ДатаОплатыНовая Тогда

#Если Клиент Тогда
	
	// Проверка режима вызова процедуры
	ТекстВопроса = "";
	Если РежимВызова = "ДатаДокумента" Тогда
		ТекстВопроса = "Изменилась дата документа. ";
	ИначеЕсли РежимВызова = "ДоговорКонтрагента" Тогда
		Если мСтароеЗначениеДоговора<>Справочники.ДоговорыКонтрагентов.ПустаяСсылка() И 
			мСтароеЗначениеДоговора<> ДоговорКонтрагента Тогда
			ТекстВопроса = "Изменился договор с контрагентом. ";
		КонецЕсли;	
	КонецЕсли;
	Если Вопрос(ТекстВопроса + "Пересчитать дату оплаты?", 
		РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
#КонецЕсли

		ДокОбъект.ДатаОплаты = ДатаОплатыНовая;
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьДатуОплатыРеализации(ДокОбъект, ВыводитьВопрос = Истина) Экспорт
	
	ДоговорКонтрагента 	= ДокОбъект.ДоговорКонтрагента;
	ДатаДокумента 		= ДокОбъект.Дата;

	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	ЧислоДнейДоОплаты = ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности;
	
	ДатаОплатыНовая = НачалоДня(ДатаДокумента) + 86400 * ЧислоДнейДоОплаты;
	
	
	
	
	Если  Деньнедели(ДатаОплатыНовая)=6 Тогда
		 ДатаОплатыНовая = НачалоДня(ДатаОплатыНовая) + 86400 * 2;
	ИначеЕсли  Деньнедели(ДатаОплатыНовая)=7 Тогда
		 ДатаОплатыНовая = НачалоДня(ДатаОплатыНовая) + 86400 * 1;
	КонецЕсли;
	
	
	
	
	Если ДокОбъект.абс_ДатаОплаты <> ДатаОплатыНовая Тогда
		
		#Если Клиент Тогда
			
			Если ВыводитьВопрос Тогда
				
				Если Вопрос("Пересчитать дату оплаты?", 
					РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		#КонецЕсли
		
		ДокОбъект.абс_ДатаОплаты = ДатаОплатыНовая;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьВидАдресаСтрокой(ВидАдреса) Экспорт
	
	Если ВидАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
		Возврат "ЮридическийАдрес";
	ИначеЕсли ВидАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
		Возврат "ФактическийАдрес";
	ИначеЕсли ВидАдреса = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента Тогда
		Возврат "АдресДоставки";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРеализациюПоЗаказу(ЗаказПокупателя) Экспорт
	
	Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Сделка = &Сделка
		|	И РеализацияТоваровУслуг.Проведен";
		Запрос.УстановитьПараметр("Сделка", ЗаказПокупателя);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Реализация = Выборка.Ссылка;
		Конецесли;
	КонецЕсли;
	
	Возврат Реализация;
	
КонецФункции

Функция ЗапретИзмененияКоличестваВЗаказе(ЗаказПокупателя) Экспорт
	
	ЗапретИзмененияКоличества = Ложь;
	
	Если ЗаказПокупателя.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Согласован
		ИЛИ ЗаказПокупателя.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке
		ИЛИ ЗаказПокупателя.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен Тогда
		
		Реализация = ПолучитьРеализациюПоЗаказу(ЗаказПокупателя);
		
		Если ЗначениеЗаполнено(Реализация) Тогда
			Если Реализация.Проведен Тогда
				ЗапретИзмененияКоличества = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ЗапретИзмененияКоличества;
	
КонецФункции

Функция ВыполнятьКонтрольОстатковПоЗаказу(ЗаказПокупателя) Экспорт
	
	ВыполнятьКонтрольОстатков = Ложь;
	
	Реализация = ПолучитьРеализациюПоЗаказу(ЗаказПокупателя);
	
	Если ЗаказПокупателя.абс_Статус = Перечисления.абс_СтатусыОтгрузки.КОтгрузке и Не ЗначениеЗаполнено(Реализация) Тогда
		ВыполнятьКонтрольОстатков = Истина;	
	КонецЕсли;
	
	Возврат ВыполнятьКонтрольОстатков;
	
КонецФункции


//+Лео ZAA
Процедура лео_ПриКопированииНоменклатураПриКопировании(Источник, ОбъектКопирования) Экспорт
	// Вставить содержимое обработчика.
	
	Источник.лео_ДопДанные = ПоместитьВоВременноеХранилище(ОбъектКопирования.Код, Новый УникальныйИдентификатор);
	
КонецПроцедуры

Процедура лео_ЗаполнитьЕдИзм_Свойства(Источник) Экспорт
	// Вставить содержимое обработчика.
	
	Если  НЕ ЗначениеЗаполнено(Источник.лео_ДопДанные) тогда
	 Возврат;
	КонецЕсли; 
	
	_Код = ПолучитьИзВременногоХранилища(Источник.лео_ДопДанные);
	
	
	//спр = Справочники.Лео_Настройки.НайтиПоНаименованию("НоменклатураОбъектКопирования");
	//_ОбъектКопирования = спр._Ссылка;
	_ОбъектКопирования = Справочники.Номенклатура.НайтиПоКоду(_Код);
	
	Если _ОбъектКопирования.Пустая() тогда
		 возврат;
	КонецЕсли;
	////////////////Вкладка "Единицы" элемента справочника "Номенклатура"///////////
	ЗапросЕдИзм = Новый Запрос;
	ЗапросЕдИзм.Текст = "ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка,
	|	ЕдиницыИзмерения.Владелец,
	//	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕдиницыИзмерения.Код,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаПоКлассификатору,
	|	ЕдиницыИзмерения.Наименование,
	|	ЕдиницыИзмерения.Коэффициент,
	|	ЕдиницыИзмерения.Вес,
	|	ЕдиницыИзмерения.ВесНетто,
	|	ЕдиницыИзмерения.Объем,
	|	ЕдиницыИзмерения.ПорогОкругления,
	|	ЕдиницыИзмерения.ПредупреждатьОНецелыхМестах,
	|	ЕдиницыИзмерения.абс_Высота,
	|	ЕдиницыИзмерения.абс_Глубина,
	|	ЕдиницыИзмерения.абс_Ширина,
	|	ЕдиницыИзмерения.абс_ЛинейныеРазмерыПредставление,
	|	ЕдиницыИзмерения.абс_РазрешатьДробноеКоличествоМест,
	|	ЕдиницыИзмерения.Лео_ТипУпаковки,
	|	ЕдиницыИзмерения.Лео_ЧистыйВес,
	|	ЕдиницыИзмерения.Лео_Комментарий
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	//|		ПО ЕдиницыИзмерения.Владелец = Номенклатура.Ссылка
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Номенклатура";
	
	ЗапросЕдИзм.УстановитьПараметр("Номенклатура",_ОбъектКопирования);
	РезультатЕдИзм=ЗапросЕдИзм.Выполнить().Выбрать();
	
	
	ЗапВлад = Новый Запрос;
	ЗапВлад.Текст = 
	"ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка,
	|	ЕдиницыИзмерения.Владелец
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Владелец";
	
	ЗапВлад.УстановитьПараметр("Владелец", Источник);
	
	Результат = ЗапВлад.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() цикл
		
		
		ВыборкаДетальныеЗаписи.Следующий();
		СпрВлад =  ВыборкаДетальныеЗаписи.Ссылка;
		
		
		
		//СпрВлад = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("Владелец",Источник.Ссылка);
		
		//Если РезультатЕдИзм.Количество() > 0 и НЕ СпрВлад.Пустая() ТОГДА 
			//РезультатЕдИзм.Следующий();						
			
	Пока РезультатЕдИзм.Следующий() Цикл    
			
			//Если СпрВлад = Источник.ЕдиницаХраненияОстатков тогда
			Если РезультатЕдИзм.Код = РезультатЕдИзм.Владелец.ЕдиницаХраненияОстатков.Код тогда
				
				НоваяСтрока = СпрВлад.ПолучитьОбъект();    
				
				//НоваяСтрока.Владелец                     = Источник.Ссылка;
				//НоваяСтрока.Владелец                     = _Ссылка;
				//НоваяСтрока.ЕдиницаПоКлассификатору      = РезультатЕдИзм.ПоКлассификатору;
				//НоваяСтрока.Наименование                 = РезультатЕдИзм.Наименование;
				//НоваяСтрока.Коэффициент                  = РезультатЕдИзм.Коэффициент;
				НоваяСтрока.Вес                          = РезультатЕдИзм.Вес;
				НоваяСтрока.ВесНетто                     = РезультатЕдИзм.ВесНетто;
				НоваяСтрока.Объем                        = РезультатЕдИзм.Объем;
				НоваяСтрока.ПорогОкругления              = РезультатЕдИзм.ПорогОкругления;
				НоваяСтрока.ПредупреждатьОНецелыхМестах  = РезультатЕдИзм.ПредупреждатьОНецелыхМестах;
				
				
				НоваяСтрока.абс_Высота                          = РезультатЕдИзм.абс_Высота;
				НоваяСтрока.абс_Глубина                         = РезультатЕдИзм.абс_Глубина;
				НоваяСтрока.абс_Ширина                          = РезультатЕдИзм.абс_Ширина;
				НоваяСтрока.абс_ЛинейныеРазмерыПредставление    = РезультатЕдИзм.абс_ЛинейныеРазмерыПредставление;
				НоваяСтрока.абс_РазрешатьДробноеКоличествоМест  = РезультатЕдИзм.абс_РазрешатьДробноеКоличествоМест;
				
				НоваяСтрока.Лео_ТипУпаковки                     = РезультатЕдИзм.Лео_ТипУпаковки;
				НоваяСтрока.Лео_ЧистыйВес                       = РезультатЕдИзм.Лео_ЧистыйВес;
				НоваяСтрока.Лео_Комментарий                     = РезультатЕдИзм.Лео_Комментарий;
				
				НоваяСтрока.Записать();
				
			иначе
				
				НоваяСтрока = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();    
				//ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЕдИзм);
				НоваяСтрока.Владелец                     = Источник;
				//НоваяСтрока.Владелец                     = _Ссылка;
				НоваяСтрока.ЕдиницаПоКлассификатору      = РезультатЕдИзм.ЕдиницаПоКлассификатору;
				НоваяСтрока.Наименование                 = РезультатЕдИзм.Наименование;
				НоваяСтрока.Коэффициент                  = РезультатЕдИзм.Коэффициент;
				НоваяСтрока.Вес                          = РезультатЕдИзм.Вес;
				НоваяСтрока.ВесНетто                     = РезультатЕдИзм.ВесНетто;
				НоваяСтрока.Объем                        = РезультатЕдИзм.Объем;
				НоваяСтрока.ПорогОкругления              = РезультатЕдИзм.ПорогОкругления;
				НоваяСтрока.ПредупреждатьОНецелыхМестах  = РезультатЕдИзм.ПредупреждатьОНецелыхМестах;
				
				
				НоваяСтрока.абс_Высота                          = РезультатЕдИзм.абс_Высота;
				НоваяСтрока.абс_Глубина                         = РезультатЕдИзм.абс_Глубина;
				НоваяСтрока.абс_Ширина                          = РезультатЕдИзм.абс_Ширина;
				НоваяСтрока.абс_ЛинейныеРазмерыПредставление    = РезультатЕдИзм.абс_ЛинейныеРазмерыПредставление;
				НоваяСтрока.абс_РазрешатьДробноеКоличествоМест  = РезультатЕдИзм.абс_РазрешатьДробноеКоличествоМест;
				
				НоваяСтрока.Лео_ТипУпаковки                     = РезультатЕдИзм.Лео_ТипУпаковки;
				НоваяСтрока.Лео_ЧистыйВес                       = РезультатЕдИзм.Лео_ЧистыйВес;
				НоваяСтрока.Лео_Комментарий                     = РезультатЕдИзм.Лео_Комментарий;
				
				НоваяСтрока.Записать();
				
				
				
				//КонецЦикла;
			КонецЕсли; 
			КонецЦикла;
		//КонецЕсли; 
	//КонецЦикла;
	
	
	//////////////Вкладка "Свойства" элемента справочника "Номенклатура"///////////    
	ЗапросСвойства = Новый Запрос;
	ЗапросСвойства.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО Номенклатура.Ссылка = ЗначенияСвойствОбъектов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Номенклатура.ЕдиницаДляОтчетов = ЕдиницыИзмерения.Ссылка
	|			И Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|			И Номенклатура.ЕдиницаИзмеренияМест = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
	ЗапросСвойства.УстановитьПараметр("Номенклатура",_ОбъектКопирования);
	Результат=ЗапросСвойства.Выполнить().Выбрать();
	
	
	Если НЕ Результат.Количество() = 0 ТОГДА 
		
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
		//Движения.Записывать = Истина;
		
		НаборЗаписей.Прочитать();
		
		Пока Результат.Следующий() Цикл
			Набор = НаборЗаписей.Добавить();    
			Набор.Объект      = Источник.Ссылка;
			//Движение.Объект      = СcылкаОбъекта;
			Набор.Свойство = Результат.Свойство;
			Набор.Значение = Результат.Значение;
			
		КонецЦикла;
		НаборЗаписей.Записать(Истина); 
	КонецЕсли; 
	
	
	
	////////////////Вкладка "Штрихкоды" элемента справочника "Номенклатура"///////////		
	
	ЗапросСвойства = Новый Запрос;
	ЗапросСвойства.Текст = "ВЫБРАТЬ
	|	Штрихкоды.Штрихкод,
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ТипШтрихкода,
	|	Штрихкоды.ЕдиницаИзмерения,
	|	Штрихкоды.ХарактеристикаНоменклатуры,
	|	Штрихкоды.СерияНоменклатуры,
	|	Штрихкоды.Качество
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Владелец = &Владелец";
	
	ЗапросСвойства.УстановитьПараметр("Владелец",_ОбъектКопирования);
	Рез = ЗапросСвойства.Выполнить();
	Если НЕ Рез.Пустой() тогда
		
		НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Владелец.Установить(Источник);
		//Движения.Записывать = Истина;
		
		НаборЗаписей.Прочитать();
		Выборка = Рез.Выбрать();
		Пока Выборка.Следующий() Цикл
			Набор = НаборЗаписей.Добавить();    
			ЗаполнитьЗначенияСвойств(Набор,Выборка);
			Набор.Владелец = Источник;
		КонецЦикла;
		Набор.Владелец = Источник;
		
		НаборЗаписей.Записать(Истина); 
	КонецЕсли;
	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнено обновление ед.измерений, свойств, штрихкода");
	
КонецПроцедуры


Функция _СписокПользователей_Лео_Настройки(Родитель,ТекПользователь,ДопРеквизит_1,ДопРеквизит_2) Экспорт
	
		Признак = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_Настройки.Ссылка
		|ИЗ
		|	Справочник.Лео_Настройки КАК Лео_Настройки
		|ГДЕ
		|	Лео_Настройки.Родитель = &Родитель
		|	И Лео_Настройки._Ссылка = &_Ссылка
		|	И Лео_Настройки.ДопРеквизит_1 = &ДопРеквизит_1
		|	И Лео_Настройки.ДопРеквизит_2 = &ДопРеквизит_2
		|	И Лео_Настройки.Использовать = &Использовать";

	Запрос.УстановитьПараметр("_Ссылка", ТекПользователь);
	Запрос.УстановитьПараметр("ДопРеквизит_1", ДопРеквизит_1);
	Запрос.УстановитьПараметр("ДопРеквизит_2", ДопРеквизит_2);
	Запрос.УстановитьПараметр("Использовать", Истина);
	Запрос.УстановитьПараметр("Родитель", Родитель);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если НЕ Результат.Пустой() тогда
		Признак = Истина;
	КонецЕсли;

	возврат Признак
	
КонецФункции



Функция _ОпределитьПланСпецификациюПоУмолчанию (Ном, ДатаКон) Экспорт
	
	перем Спец;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Период,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры
	|ИЗ
	|	РегистрСведений.Лео_ПлановыеСпецификацииНоменклатуры.СрезПоследних(&ДатаКон, Номенклатура = &Номенклатура) КАК Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Номенклатура", Ном);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Спец = ВыборкаДетальныеЗаписи.СпецификацияНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	
	возврат Спец
	
КонецФункции	

Процедура Лео_ПланПроизводстваОборудованиеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	
	Движения = Источник.Движения;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПланПроизводства") тогда
		План = Источник.СоставПлана.Выгрузить();  // из ТЧ
		План.Свернуть("Период,Номенклатура,ЕдиницаИзмерения,Спецификация,лео_Оборудование,лео_Подразделение,Лео_ЭтоРаспоряжение,Лео_РаспоряжениеНомер,Распоряжение","Количество");
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") тогда	
		План = Источник.Продукция.Выгрузить();  // из ТЧ
		План.Свернуть("Номенклатура,ЕдиницаИзмерения,Спецификация","Количество");
	КонецЕсли;
	
	Движения.Лео_ПланыПроизводства.Записывать = Истина;
	Движения.Лео_ПланыПроизводства.Очистить();
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.Лео_ПланыПроизводства.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаПлан);
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПланПроизводства") тогда
			
			Движение.Лео_оборудование = ТекСтрокаПлан.лео_Оборудование;
			Движение.Подразделение = ТекСтрокаПлан.лео_Подразделение;
			Движение.Сценарий = Источник.Сценарий;
			Движение.абс_ВидПланаПроизводства =  Источник.абс_ВидПланаПроизводства;
			Движение.ДокументПланирования =  Источник.Ссылка;
			Движение.Период = НачалоДня(ТекСтрокаПлан.Период);
			Движение.Лео_ЭтоРаспоряжение = ТекСтрокаПлан.Лео_ЭтоРаспоряжение;
			Движение.Лео_РаспоряжениеНомер = ТекСтрокаПлан.Лео_РаспоряжениеНомер;
			Движение.Распоряжение = ТекСтрокаПлан.Распоряжение;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") тогда	
			Движение.Лео_оборудование = Источник.Лео_оборудование;
			Движение.Подразделение = Источник.Подразделение;
			Движение.Сценарий = Справочники.СценарииПланирования.Факт;
			Движение.абс_ВидПланаПроизводства =  Перечисления.абс_ВидыПлановПроизводства.Основной;
			Движение.Период = НачалоДня(Источник.Дата);  
			Движение.Лео_ЭтоРаспоряжение = Источник.Лео_ЭтоРаспоряжение;
			Если Источник.Лео_ЭтоРаспоряжение Тогда
				Движение.Распоряжение = Источник.Распоряжение;
			Иначе	                                           
				Движение.Распоряжение = Справочники.Лео_РаспоряженияНаВыпуск.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		Движение.Комментарий = СокрЛП(Источник.Комментарий);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура _ИнициализацияРезультатаРазузлования(Результат, Параметры)
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура("ПолноеРазузлование");
		
	ИначеЕсли НЕ Результат.Свойство("ПолноеРазузлование") Тогда
		
		Результат.Вставить("ПолноеРазузлование");
		
	КонецЕсли;
		
	Если НЕ Результат.Свойство("МаксимальныйУровень") Тогда
		
		Результат.Вставить("МаксимальныйУровень", 0);
		
	Иначе
		
		Результат.МаксимальныйУровень = 0;
		
	КонецЕсли;
	
	Если НЕ Результат.Свойство("КоличествоВыпусков") Тогда
		
		Результат.Вставить("КоличествоВыпусков", 0);
		
	Иначе
		
		Результат.КоличествоВыпусков = 0;
		
	КонецЕсли;
	
	Если Результат.Свойство("ПолноеРазузлование") И Результат.ПолноеРазузлование = Неопределено Тогда
		
		Результат.ПолноеРазузлование = Новый ТаблицаЗначений;
		
		Результат.ПолноеРазузлование.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.ПолноеРазузлование.Колонки.Добавить("СопутствующееИзделие", Новый ОписаниеТипов("Булево"));
		Результат.ПолноеРазузлование.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ПолноеРазузлование.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
		Результат.ПолноеРазузлование.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("ДоляСтоимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ПолноеРазузлование.Колонки.Добавить("СтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ВидВоспроизводства", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыВоспроизводстваНоменклатуры"));
		Результат.ПолноеРазузлование.Колонки.Добавить("СписаниеКомплектующей", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСписанияКомплектующих"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ПолноеРазузлование.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		Результат.ПолноеРазузлование.Колонки.Добавить("Последовательность");
		
		Если Результат.Свойство("СопутствующиеИзделия") ИЛИ Параметры.РазмещатьВСопутствующихИзделиях Тогда
			
			Результат.ПолноеРазузлование.Колонки.Добавить("КоличествоТочное", Новый ОписаниеТипов("Число"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.Свойство("ВыходныеИзделия") И Результат.ВыходныеИзделия = Неопределено Тогда
		
		Результат.ВыходныеИзделия = Новый ТаблицаЗначений;
		
		Результат.ВыходныеИзделия.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.ВыходныеИзделия.Колонки.Добавить("СопутствующееИзделие", Новый ОписаниеТипов("Булево"));
		Результат.ВыходныеИзделия.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ВыходныеИзделия.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ВыходныеИзделия.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ВыходныеИзделия.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("ДоляСтоимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ВыходныеИзделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.ВыходныеИзделия.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ВыходныеИзделия.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		
	КонецЕсли;
	
	Если Результат.Свойство("ИсходныеКомплектующие") И Результат.ИсходныеКомплектующие = Неопределено Тогда
		
		Результат.ИсходныеКомплектующие = Новый ТаблицаЗначений;
		
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("СтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ВидВоспроизводства", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыВоспроизводстваНоменклатуры"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("СписаниеКомплектующей", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСписанияКомплектующих"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		
	КонецЕсли;
	
	Если Результат.Свойство("ВозвратныеОтходы") И Результат.ВозвратныеОтходы = Неопределено Тогда
		
		Результат.ВозвратныеОтходы = Новый ТаблицаЗначений;
		
		Результат.ВозвратныеОтходы.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("СуммаРегл", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("СтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("СписаниеКомплектующей", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСписанияКомплектующих"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		
	КонецЕсли;
	
	Если (Параметры.РазмещатьВСопутствующихИзделиях И (НЕ Результат.Свойство("СопутствующиеИзделия") ИЛИ Результат.Свойство("СопутствующиеИзделия") И Результат.СопутствующиеИзделия = Неопределено)) ИЛИ (Результат.Свойство("СопутствующиеИзделия") И Результат.СопутствующиеИзделия = Неопределено) Тогда
		
		Если НЕ Результат.Свойство("СопутствующиеИзделия") Тогда
			
			Результат.Вставить("СопутствующиеИзделия");
			
		КонецЕсли;
		
		Результат.СопутствующиеИзделия = Новый ТаблицаЗначений;
		
		Результат.СопутствующиеИзделия.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("СопутствующееИзделие", Новый ОписаниеТипов("Булево"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ДоляСтоимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		Результат.СопутствующиеИзделия.Колонки.Добавить("ИсходноеКоличество", Новый ОписаниеТипов("Число"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("КоэффициентПриведения", Новый ОписаниеТипов("Число"));
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализацияРезультатаРазузлования()


//////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
//+Разузлование номенклатуры


// Основная = 1 Основная спецификация
// Основная = 0 Плановая спецификация
Функция Лео_РазузловатьНоменклатуру(Спецификация,Количество,КоличествоУровнейРазузлования,Основная,ДатаСпецификации,ИспользоватьИсключения = Ложь) Экспорт
	
   Спецификация = Спецификация;	
//	Количество	 = Количество;	
	
	СтруктураИсточник = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество, Спецификация");
	
	мИспользоватьТолькоСборочныеСпецификации = глЗначениеПеременной("ИспользоватьТолькоСборочныеСпецификации");
	
	//Если Не ИспользоватьВидСпецификации(мИспользоватьТолькоСборочныеСпецификации)
	// ИЛИ Спецификация.ВидСпецификации = Перечисления.ВидыСпецификаций.Сборочная Тогда
	// сообщить(Спецификация);
	Если Спецификация.ВидСпецификации = Перечисления.ВидыСпецификаций.Сборочная Тогда
		
		Если Спецификация.ВыходныеИзделия.Количество() > 0 Тогда
			СтруктураИсточник.Вставить("Номенклатура", 					Спецификация.ВыходныеИзделия[0].Номенклатура);
			СтруктураИсточник.Вставить("ХарактеристикаНоменклатуры", 	Спецификация.ВыходныеИзделия[0].ХарактеристикаНоменклатуры);
			СтруктураИсточник.Вставить("ЕдиницаИзмерения", 				Спецификация.ВыходныеИзделия[0].ЕдиницаИзмерения);
			СтруктураИсточник.Вставить("Коэффициент", 					Спецификация.ВыходныеИзделия[0].ЕдиницаИзмерения.Коэффициент);
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураИсточник.Вставить("Количество",   Количество);
	СтруктураИсточник.Вставить("Спецификация", Спецификация);
	
	РезультатРазузлования = Новый Структура;
	РезультатРазузлования.Вставить("ИсходныеКомплектующие");
	РезультатРазузлования.Вставить("ВыходныеИзделия");
	РезультатРазузлования.Вставить("ВозвратныеОтходы");
	
	Отбор = Новый Структура("СписаниеКомплектующей", Перечисления.ВариантыСписанияКомплектующих.Всегда);
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДатаСпецификации", ДатаСпецификации);
	Параметры.Вставить("КоличествоУровнейРазузлования", КоличествоУровнейРазузлования);
	Параметры.Вставить("Отбор", Отбор);
	Параметры.Вставить("ИспользоватьИсключения", ИспользоватьИсключения);

	
	Если Основная тогда // Основная
	      РазузлованиеНоменклатуры.РазузловатьНоменклатуру(СтруктураИсточник, РезультатРазузлования, Параметры);
    Иначе               // Плановая
	      _пРазузловатьНоменклатуру(СтруктураИсточник, РезультатРазузлования, Параметры);
	КонецЕсли;
	
	ИсходныеКомплектующие = РезультатРазузлования.ИсходныеКомплектующие;
	ВыходныеИзделия       = РезультатРазузлования.ВыходныеИзделия;
	ТабОтходы             = РезультатРазузлования.ВозвратныеОтходы;
	
	_Стр = Новый Структура;
	_Стр.Вставить("ИсходныеКомплектующие",ИсходныеКомплектующие);
	_Стр.Вставить("ВыходныеИзделия"      ,ВыходныеИзделия);
	_Стр.Вставить("ТабОтходы"            ,ТабОтходы);
	
	/////////////////////////////////////////////////
	Для каждого сс из ИсходныеКомплектующие цикл
		Если сс.Спецификация = Справочники.СпецификацииНоменклатуры.ПустаяСсылка() тогда
			 сс.Спецификация = СтруктураИсточник.Спецификация;
	    КонецЕсли;
	КонецЦикла;
	
	Возврат _Стр;
	
КонецФункции

// Основная = 1 Основная спецификация
// Основная = 0 Плановая спецификация
Функция Лео_ПолучитьКоличествоУровнейРазузлования(Спецификация,Количество,Основная,ДатаП) экспорт
	
	
		//+ Количество уровней разузлования
		_СтруктураР = Лео_РазузловатьНоменклатуру(Спецификация,Количество,1,Основная,ДатаП);
		ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие;
		
		_ПолностьюРазузлован = Ложь; УровеньРазузлования = 1;
		Пока НЕ _ПолностьюРазузлован цикл
			Для каждого стр из ТЗ_ИсходныеКомплектующие цикл
				Если Не стр.Разузлован тогда
					_СтруктураР = Лео_РазузловатьНоменклатуру(стр.Спецификация,стр.Количество,1,Основная,ДатаП);
					УровеньРазузлования = УровеньРазузлования + 1;
				КонецЕсли;
				Если УровеньРазузлования>50 И ПараметрыСеанса.ТекущийПользователь.Наименование= "Цепелев Кирилл Алексеевич" Тогда
					//Сообщить("зацикливание "+стр.Спецификация);
					_ПолностьюРазузлован = Истина;
				КонецЕсли;	
				//ОбработкаПрерыванияПользователя();
			КонецЦикла;
			     ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие.Скопировать();
			Если ТЗ_ИсходныеКомплектующие.НайтиСтроки(Новый Структура("Разузлован",Ложь)).Количество() = 0 тогда
				_ПолностьюРазузлован = Истина;
			Конецесли;	 
			//ОбработкаПрерыванияПользователя();
		КонецЦикла;
		//- Количество уровней разузлования
		
		возврат УровеньРазузлования;
	
КонецФункции	

Функция Лео_ПолучитьКоличествоУровнейРазузлованияДо50(Спецификация,Количество,Основная,ДатаП) экспорт
	
		//+ Количество уровней разузлования
		_СтруктураР = Лео_РазузловатьНоменклатуру(Спецификация,Количество,1,Основная,ДатаП);
		ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие;
		
		_ПолностьюРазузлован = Ложь; УровеньРазузлования = 1;
		Пока НЕ _ПолностьюРазузлован цикл
			Для каждого стр из ТЗ_ИсходныеКомплектующие цикл
				Если Не стр.Разузлован тогда
					_СтруктураР = Лео_РазузловатьНоменклатуру(стр.Спецификация,стр.Количество,1,Основная,ДатаП);
					УровеньРазузлования = УровеньРазузлования + 1;
				КонецЕсли;
				Если УровеньРазузлования > 50 Тогда
					//Сообщить("зацикливание "+стр.Спецификация);
					_ПолностьюРазузлован = Истина;
				КонецЕсли;	
				//ОбработкаПрерыванияПользователя();
			КонецЦикла;
			     ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие.Скопировать();
			Если ТЗ_ИсходныеКомплектующие.НайтиСтроки(Новый Структура("Разузлован",Ложь)).Количество() = 0 тогда
				_ПолностьюРазузлован = Истина;
			Конецесли;	 
			//ОбработкаПрерыванияПользователя();
		КонецЦикла;
		//- Количество уровней разузлования
		возврат УровеньРазузлования;
	
КонецФункции	



// Выполняет разузлование номенклатуры или спецификации.
//
// Параметры:
//   Источник - тип "Структура" (нельзя использовать элемент коллекции).
//     Свойства:
//       - Номенклатура - необязательный в случае указания спецификации (если не указан, тогда выполняется разузлование спецификации).
//       - ХарактеристикаНоменклатуры - необязательный.
//       - ЕдиницаИзмерения - необязательный (если не указан, тогда единица хранения остатков номенклатуры).
//       - Коэффициент - необязательный (если не указан, тогда коэффициент единица измерения).
//       - Количество - необязательный (если не указан, тогда 1).
//       - Спецификация - необязательный в случае указания номенклатуры (если не указан, тогда основная спецификация номенклатуры).
//
//   Результат - тип "Структура"
//     Свойства:
//       - ПолноеРазузлование - необязательный (если не указан, тогда будет создан, так как полное разулование выполняется всегда).
//       - ВыходныеИзделия - необязательный (если не указан, тогда расчет выходных изделий не выполняется).
//       - ИсходныеКомплектующие - необязательный (если не указан, тогда расчет исходных комплектующих не выполняется).
//       - ВозвратныеОтходы - необязательный (если не указан, тогда расчет возвратных отходов не выполняется).
//       - СопутствующиеИзделия - необязательный (если не указан, тогда расчет сопутствующих изделий не выполняется).
//  
//   Параметры - тип "Структура"
//     Свойства:
//       - ПараметрыВыпуска - тип "Соответсвие" (ключ - имя параметра, значение - значение параметра). Необязательный.
//       - КоличествоУровнейРазузлования - тип "Число" (0 - полное разузлование, 1 - последний передел и т.д). Необязательный. Значение по умолчанию - 0.
//       - ДатаСпецификации - дата, на которую будут получены основные спецификации номенклатуры. Необязательный. Значение по умолчанию - текущая дата.
//       - Отбор - структура, свойства которой являются имена колонок результата разузлования, а значениями значения отбора (значение или массив значений).
//       - РазмещатьВСопутствующихИзделиях - тип "Булево"
//
// Возвращаемое значение:
//   Массив, содержащий структуры с содержанием ошибок, полученных в результате разлования.
//     Свойства структуры:
//       - СтатусОшибки
//       - Причина
//       - ОписаниеОшибки
//       - Спецификация
//       - НомерСтроки
//       - Последовательность
//
// Значения, возвращаемые в структуру "Результат".
//
//   Таблица значений "ПолноеРазузлование"
//     - Уровень
//     - Разузлован
//     - Номенклатура
//     - ХарактеристикаНоменклатуры
//     - ЕдиницаИзмерения
//     - Коэффициент
//     - Количество
//     - МинимальнаяПартия
//     - Кратность
//     - ДоляСтоимости
//     - СтатьяЗатрат
//     - ВидВоспроизводства
//     - СписаниеКомплектующей
//     - Спецификация
//     - ТочкаМаршрута
//     - Подразделение
//     - РабочийЦентр
//     - Последовательность
//
//   Таблица значений "ВыходныеИзделия"
//     - Уровень
//     - Разузлован
//     - Номенклатура
//     - ХарактеристикаНоменклатуры
//     - ЕдиницаИзмерения
//     - Коэффициент
//     - Количество
//     - МинимальнаяПартия
//     - Кратность
//     - ДоляСтоимости
//     - Спецификация
//     - ТочкаМаршрута
//     - Подразделение
//     - РабочийЦентр
//
//   Таблица значений "ИсходныеКомплектующие"
//     - Уровень
//     - Разузлован
//     - Номенклатура
//     - ХарактеристикаНоменклатуры
//     - ЕдиницаИзмерения
//     - Коэффициент
//     - Количество
//     - СтатьяЗатрат
//     - МинимальнаяПартия
//     - Кратность
//     - ВидВоспроизводства
//     - СписаниеКомплектующей
//     - Спецификация
//     - ТочкаМаршрута
//     - Подразделение
//     - РабочийЦентр
//
//   Таблица значений "ВозвратныеОтходы"
//     - Уровень
//     - Номенклатура
//     - ХарактеристикаНоменклатуры
//     - ЕдиницаИзмерения
//     - Коэффициент
//     - Количество
//     - Сумма
//     - СуммаРегл
//     - СтатьяЗатрат
//     - СписаниеКомплектующей
//     - ТочкаМаршрута
//     - Подразделение
//     - РабочийЦентр
//
//   Таблица значений "СопутствующиеИзделия"
//     - Уровень
//     - Разузлован
//     - Номенклатура
//     - ХарактеристикаНоменклатуры
//     - ЕдиницаИзмерения
//     - Коэффициент
//     - Количество
//     - МинимальнаяПартия
//     - Кратность
//     - ДоляСтоимости
//     - Спецификация
//     - ТочкаМаршрута
//     - Подразделение
//     - РабочийЦентр
//     - ИсходноеКоличество
//     - КоэффициентПриведения
//
//   - МаксимальныйУровень
//
Функция _пРазузловатьНоменклатуру(Источник, Результат = Неопределено, Параметры = Неопределено) Экспорт
	
	ИнициализацияПараметров(Параметры);
	//ИнициализацияРезультатаРазузлования(Результат, Параметры);
	_ИнициализацияРезультатаРазузлования(Результат, Параметры);
	
	
	МассивОшибок = Новый Массив;
	Уровень = 0;
	
	Если Источник.Свойство("Номенклатура") И ТипЗнч(Источник.Номенклатура) = Тип("СправочникСсылка.Номенклатура") И НЕ Источник.Номенклатура.Пустая() Тогда
		
		// Исходная строка добавляется в результат разузлования
		НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
			
		НоваяСтрока.Уровень = Уровень;
		НоваяСтрока.Разузлован = Ложь;
		НоваяСтрока.НоменклатурнаяГруппа = Источник.Номенклатура.НоменклатурнаяГруппа;
		НоваяСтрока.Номенклатура = Источник.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = ?(Источник.Свойство("ХарактеристикаНоменклатуры"), Источник.ХарактеристикаНоменклатуры, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		НоваяСтрока.ЕдиницаИзмерения = ?(Источник.Свойство("ЕдиницаИзмерения"), Источник.ЕдиницаИзмерения, НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков);
		НоваяСтрока.Коэффициент = ?(Источник.Свойство("Коэффициент"), Источник.Коэффициент, НоваяСтрока.ЕдиницаИзмерения.Коэффициент);
		НоваяСтрока.Количество = ?(Источник.Свойство("Количество"), Источник.Количество, 1);
		УстановитьВидВоспроизводства(НоваяСтрока);
		//{Лео Катанович
		//НоваяСтрока.Спецификация = _пПолучитьСпецификацию(Источник, Параметры);
		НоваяСтрока.Спецификация = ?(ЗначениеЗаполнено(Источник.Спецификация),Источник.Спецификация,_пПолучитьСпецификацию(Источник, Параметры));
		//Лео Катанович}
		УстановитьПараметрыВыходногоИзделия(НоваяСтрока);
		
		Если НЕ ДобавитьСпецификациюВПоследовательность(НоваяСтрока.Спецификация, НоваяСтрока.Последовательность) Тогда
			
			НоваяСтрока.Разузлован = Истина;
			ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), НоваяСтрока.Спецификация, Неопределено, НоваяСтрока.Последовательность, МассивОшибок);
			
		КонецЕсли;
		
		Параметры.Вставить("Спецификация", НоваяСтрока.Спецификация);
		Параметры.Вставить("КоличествоВыпусков", ПолучитьКоличествоВыпусков(НоваяСтрока.Спецификация, НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры, НоваяСтрока.Коэффициент, НоваяСтрока.Количество));
		Параметры.Вставить("ДоляСтоимости", ПолучитьДолюСтоимости(НоваяСтрока.Спецификация, НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры, НоваяСтрока.Коэффициент));
		
		Результат.КоличествоВыпусков = Параметры.КоличествоВыпусков;
		
	ИначеЕсли Источник.Свойство("Спецификация") И ТипЗнч(Источник.Спецификация) = Тип("СправочникСсылка.СпецификацииНоменклатуры") И НЕ Источник.Спецификация.Пустая() Тогда
		
		ВыходноеИзделие = ПолучитьВыходныеИзделия(Источник.Спецификация);
		
		Если ВыходноеИзделие.Количество() = 0 Тогда
			
			НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
					
			НоваяСтрока.Уровень = Уровень;
			НоваяСтрока.Разузлован = Ложь;
			НоваяСтрока.СопутствующееИзделие = Ложь;
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Количество = ?(Источник.Свойство("Количество"), Источник.Количество, 1);
			НоваяСтрока.Спецификация = Источник.Спецификация;
				
			Если НЕ ДобавитьСпецификациюВПоследовательность(НоваяСтрока.Спецификация, НоваяСтрока.Последовательность) Тогда
					
				НоваяСтрока.Разузлован = Истина;
				ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), НоваяСтрока.Спецификация, Неопределено, НоваяСтрока.Последовательность, МассивОшибок);
					
			КонецЕсли;
			
		Иначе
			
			Пока ВыходноеИзделие.Следующий() Цикл
							
				НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
					
				НоваяСтрока.Уровень = Уровень;
				НоваяСтрока.Разузлован = Ложь;
				НоваяСтрока.СопутствующееИзделие = ВыходноеИзделие.СопутствующееИзделие;
				НоваяСтрока.НомерОперацииМаршрута = ВыходноеИзделие.НомерОперацииМаршрута;
				НоваяСтрока.НоменклатурнаяГруппа = ВыходноеИзделие.НоменклатурнаяГруппа;
				НоваяСтрока.Номенклатура = ВыходноеИзделие.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = ВыходноеИзделие.ХарактеристикаНоменклатуры;
				НоваяСтрока.ЕдиницаИзмерения = ВыходноеИзделие.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = ВыходноеИзделие.Коэффициент;
				НоваяСтрока.Количество = ?(Источник.Свойство("Количество"), ВыходноеИзделие.Количество * Источник.Количество, ВыходноеИзделие.Количество);
				НоваяСтрока.Спецификация = Источник.Спецификация;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыходноеИзделие, "МинимальнаяПартия, Кратность, ДоляСтоимости, ТочкаМаршрута, Подразделение, РабочийЦентр");
				
				Если НЕ ДобавитьСпецификациюВПоследовательность(НоваяСтрока.Спецификация, НоваяСтрока.Последовательность) Тогда
					
					НоваяСтрока.Разузлован = Истина;
					ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), НоваяСтрока.Спецификация, Неопределено, НоваяСтрока.Последовательность, МассивОшибок);
					
				КонецЕсли;
							
			КонецЦикла;
			
		КонецЕсли;
		
		Параметры.Вставить("Спецификация", Источник.Спецификация);
		Параметры.Вставить("КоличествоВыпусков", УправлениеПланированием.ПолучитьДробь(Источник.Количество, Источник.Количество));
		Параметры.Вставить("ДоляСтоимости", УправлениеПланированием.ПолучитьДробь(Источник.Количество, Источник.Количество));
		
		Результат.КоличествоВыпусков = Параметры.КоличествоВыпусков;
		
	Иначе
		
		ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Не указана номенклатура или спецификация для разузлования.'"), НСтр("ru='Разузлование'"), Неопределено, Неопределено, Неопределено, МассивОшибок);
		
	КонецЕсли;
	
	Пока Истина Цикл
		
		Если Параметры.КоличествоУровнейРазузлования < 0 Тогда // Разузлование не требуется
			
			Прервать;
			
		КонецЕсли;
		
		// Получение позиций, требующих разузлования
		СтрокиТекущегоУровня = Результат.ПолноеРазузлование.НайтиСтроки(Новый Структура("Разузлован, Уровень", Ложь, Уровень));
		
		Если СтрокиТекущегоУровня.Количество() = 0 Тогда // Нет данных для разузлования
			
			Прервать;
			
		ИначеЕсли Параметры.КоличествоУровнейРазузлования > 0 И Уровень = Параметры.КоличествоУровнейРазузлования Тогда // Достигнут требуемый уровень разузлования
			
			Для каждого СтрокаТекущегоУровня из СтрокиТекущегоУровня Цикл
				
				СтрокаТекущегоУровня.Разузлован = Истина;
				
			КонецЦикла;
			
			Прервать;
			
		КонецЕсли;
			
		Уровень = Уровень + 1;
			
		Для каждого СтрокаТекущегоУровня из СтрокиТекущегоУровня Цикл
			
			СтрокаТекущегоУровня.Разузлован = Истина;
			
			Если СтрокаТекущегоУровня.Спецификация <> Неопределено И НЕ СтрокаТекущегоУровня.Спецификация.Пустая() Тогда
					
				НеразмещенноеКоличество = РазместитьВСопутствующихИзделиях(СтрокаТекущегоУровня, Параметры, Результат);
				
				ДобавитьВВыходныеИзделия(Результат, СтрокаТекущегоУровня, Параметры);
				
				Если СтрокаТекущегоУровня.СопутствующееИзделие ИЛИ НеразмещенноеКоличество = 0 Тогда
					
					Продолжить;
					
				Иначе
					
					ДобавитьВСопутствующиеИзделия(СтрокаТекущегоУровня, Результат);
					
				КонецЕсли;
				
				КоличествоВыпусков = ПолучитьКоличествоВыпусков(СтрокаТекущегоУровня.Спецификация, СтрокаТекущегоУровня.Номенклатура, СтрокаТекущегоУровня.ХарактеристикаНоменклатуры, СтрокаТекущегоУровня.Коэффициент, НеразмещенноеКоличество);
				ДоляСтоимости = ПолучитьДолюСтоимости(СтрокаТекущегоУровня.Спецификация, СтрокаТекущегоУровня.Номенклатура, СтрокаТекущегоУровня.ХарактеристикаНоменклатуры, НеразмещенноеКоличество);
					
				КоэффициентОсновногоСырья = 0;
				
				ИсходноеКомплектующее = ПолучитьИсходныеКомплектующие(СтрокаТекущегоУровня.Спецификация, Источник);
				
				Пока ИсходноеКомплектующее.Следующий() Цикл
					
					Если Результат.Свойство("СопутствующиеИзделия") Тогда
						
						Результат.ПолноеРазузлование.Колонки.Количество.Имя = "КоличествоОкругленное";
						Результат.ПолноеРазузлование.Колонки.КоличествоТочное.Имя = "Количество";
						
					КонецЕсли;
						
					_пДобавитьВПолноеРазулование(ИсходноеКомплектующее, СтрокаТекущегоУровня, КоличествоВыпусков, КоэффициентОсновногоСырья, Параметры, Уровень, Результат, МассивОшибок);
					
					Если Результат.Свойство("СопутствующиеИзделия") Тогда
						
						Результат.ПолноеРазузлование.Колонки.Количество.Имя = "КоличествоТочное";
						Результат.ПолноеРазузлование.Колонки.КоличествоОкругленное.Имя = "Количество";
						
					КонецЕсли;
						
				КонецЦикла;
				
				ВозвратныйОтход = ПолучитьВозвратныеОтходы(СтрокаТекущегоУровня.Спецификация, Источник);
				
				Пока ВозвратныйОтход.Следующий() Цикл
						
					ДобавитьВВозвратныеОтходы(ВозвратныйОтход, СтрокаТекущегоУровня, КоличествоВыпусков, КоэффициентОсновногоСырья, ДоляСтоимости, Параметры, Уровень, Результат, МассивОшибок);
						
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Результат.МаксимальныйУровень = Макс(Результат.МаксимальныйУровень, Уровень);
		
	КонецЦикла;
	
	ВыполнитьОтбор(Результат, Параметры);
	
	Возврат МассивОшибок;
	
КонецФункции // РазузловатьНоменклатуру()

Функция _пПолучитьСпецификацию(ИсходнаяСтрока, Параметры)
	
	Попытка
		
		ВидВоспроизводства = ИсходнаяСтрока.ВидВоспроизводства;
		
	Исключение
		
		ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство;
		
	КонецПопытки;
	
	Если ВидВоспроизводства <> Перечисления.ВидыВоспроизводстваНоменклатуры.Производство И ВидВоспроизводства <> Перечисления.ВидыВоспроизводстваНоменклатуры.Переработка Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Попытка
		
		Спецификация = ИсходнаяСтрока.Спецификация;
		
		Если ТипЗнч(Спецификация) <> Тип("СправочникСсылка.СпецификацииНоменклатуры") ИЛИ Спецификация.Пустая() Тогда
			
			Спецификация = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		Спецификация = Неопределено;
		
	КонецПопытки;
	
	//Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		
		Попытка
			
			Подразделение = ИсходнаяСтрока.ТочкаМаршрута.Подразделение;
			
		Исключение
			
			Подразделение = Неопределено;
			
		КонецПопытки;
		
		Спецификация = _пОпределитьСпецификациюПоУмолчанию(ИсходнаяСтрока.Номенклатура, ИсходнаяСтрока.ХарактеристикаНоменклатуры, Параметры.ДатаСпецификации, Подразделение);
		
	//КонецЕсли;
	
	Возврат Спецификация;
	
КонецФункции // ПолучитьСпецификацию()

Функция _пОпределитьСпецификациюПоУмолчанию(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, Момент, Подразделение = Неопределено) Экспорт

	Спецификация = Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
	
	
	// Плановая
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лео_ПлановыеСпецификацииНоменклатуры.СпецификацияНоменклатуры КАК СпецификацияНоменклатуры,
	|	1 КАК Приоритет
	|ИЗ
	|	РегистрСведений.Лео_ПлановыеСпецификацииНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И Подразделение = &Подразделение) КАК Лео_ПлановыеСпецификацииНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("Дата", ?(ТипЗнч(Момент) = Тип("Дата"), Момент, ТекущаяДата()));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ХарактеристикаНоменклатуры = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатурыПустаяСсылка", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Подразделение", ?(Подразделение = Неопределено, Справочники.Подразделения.ПустаяСсылка(), Подразделение));
	Запрос.УстановитьПараметр("ПодразделениеПустаяСсылка", Справочники.Подразделения.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Спецификация = Выборка.СпецификацияНоменклатуры;
		
	КонецЕсли;
	
	Если Спецификация.Пустая() тогда
		//Основная
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лео_ПлановыеСпецификацииНоменклатуры.СпецификацияНоменклатуры КАК СпецификацияНоменклатуры,
		|	1 КАК Приоритет
		|ИЗ
		|	РегистрСведений.ОсновныеСпецификацииНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатурыПустаяСсылка
		|				И Подразделение = &ПодразделениеПустаяСсылка) КАК Лео_ПлановыеСпецификацииНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет");
		
		
		//Зароднюк измененно на арактеристикаНоменклатурыПустаяСсылка и ПодразделениеПустаяСсылка
		Запрос.УстановитьПараметр("Дата", ?(ТипЗнч(Момент) = Тип("Дата"), Момент, ТекущаяДата()));
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ХарактеристикаНоменклатуры = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры));
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатурыПустаяСсылка", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("Подразделение", ?(Подразделение = Неопределено, Справочники.Подразделения.ПустаяСсылка(), Подразделение));
		Запрос.УстановитьПараметр("ПодразделениеПустаяСсылка", Справочники.Подразделения.ПустаяСсылка());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Спецификация = Выборка.СпецификацияНоменклатуры;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Спецификация.Пустая() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена спецификация для " + Номенклатура.Артикул); 
	КонецЕсли;
	//Сообщить("************");
	//Сообщить(Номенклатура);
	//Сообщить(Спецификация);
	Возврат Спецификация;

КонецФункции // ОпределитьСпецификациюПоУмолчанию()

Функция _пДобавитьВПолноеРазулование(СтрокаСпецификации, ИсходнаяСтрока, КоличествоВыпусков, КоэффициентОсновногоСырья, Параметры, Уровень, Результат, МассивОшибок, ПоследовательностьУзлов = Неопределено)
	
	НоваяСтрока = Неопределено;
	
	Если СтрокаСпецификации.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.Номенклатура Тогда
						
		НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
							
		НоваяСтрока.Уровень = Уровень;
		НоваяСтрока.НомерОперацииМаршрута = СтрокаСпецификации.НомерОперацииМаршрута;
		НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;
		НоваяСтрока.Номенклатура = СтрокаСпецификации.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаСпецификации.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения = СтрокаСпецификации.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = СтрокаСпецификации.Коэффициент;
		НоваяСтрока.Количество = СтрокаСпецификации.Количество;
			
		РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
		
		Если СтрокаСпецификации.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
			
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
			
		Иначе
			
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
			
		КонецЕсли;
						
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации, "МинимальнаяПартия, Кратность, СтатьяЗатрат, ВидВоспроизводства, Спецификация, СписаниеКомплектующей, ТочкаМаршрута, Подразделение, РабочийЦентр");
		УстановитьВидВоспроизводства(НоваяСтрока);
		НоваяСтрока.Спецификация = _пПолучитьСпецификацию(НоваяСтрока, Параметры);
		УстановитьРазузлован(НоваяСтрока, Параметры);
		
		Если НЕ ДобавитьСпецификациюВПоследовательность(НоваяСтрока.Спецификация, НоваяСтрока.Последовательность, ИсходнаяСтрока.Последовательность) Тогда
								
			НоваяСтрока.Разузлован = Истина;
			ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
								
		КонецЕсли;
		
		ОбновитьСопутствующиеИзделия(НоваяСтрока, ИсходнаяСтрока, Результат);
							
	ИначеЕсли СтрокаСпецификации.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.Узел Тогда
		
		Если ДобавитьСпецификациюВПоследовательность(СтрокаСпецификации.Номенклатура, ПоследовательностьУзлов) Тогда
			
			// Перед обходом состава узла необходимо сохранить текущую последовательность узлов
			ПоследовательностьУзловТекущая = Неопределено;
			ДобавитьСпецификациюВПоследовательность(ПоследовательностьУзлов, ПоследовательностьУзловТекущая);
										
			ИсходноеКомплектующее = ПолучитьИсходныеКомплектующие(СтрокаСпецификации.Номенклатура, ИсходнаяСтрока, Новый Структура("НомерОперацииМаршрута", СтрокаСпецификации.НомерОперацииМаршрута));
				
			Пока ИсходноеКомплектующее.Следующий() Цикл
				
				ПараметрыИсходногоКомплектующего = Новый Структура("Количество, Последовательность");
				ЗаполнитьЗначенияСвойств(ПараметрыИсходногоКомплектующего, СтрокаСпецификации);
				
				РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, СтрокаСпецификации, ПараметрыИсходногоКомплектующего, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
				
				КоличествоВыпусковУзла = УправлениеПланированием.ПолучитьДробь(ПараметрыИсходногоКомплектующего.Количество * КоличествоВыпусков.Числитель, КоличествоВыпусков.Знаменатель);
				
				Если Результат.Свойство("СопутствующиеИзделия") Тогда
					
					//Корректирка количества в соответствии с минимальной партией и кратностью потребления узла
					КоличествоВыпусковУзла.Значение = УправлениеПланированием.ПривестиКМинимальнойПартииКратности(КоличествоВыпусковУзла.Значение, СтрокаСпецификации.МинимальнаяПартия, СтрокаСпецификации.Кратность);
					КоличествоВыпусковУзла.Значение = УправлениеПланированием.ОкруглитьВБольшуюСторону(КоличествоВыпусковУзла.Значение, 3);
					КоличествоВыпусковУзла.Числитель = УправлениеПланированием.ОкруглитьВБольшуюСторону(КоличествоВыпусковУзла.Значение * КоличествоВыпусковУзла.Знаменатель, 3);
					
				КонецЕсли;
				
				ДобавленнаяСтрока = _пДобавитьВПолноеРазулование(ИсходноеКомплектующее, ИсходнаяСтрока, КоличествоВыпусковУзла, КоэффициентОсновногоСырья, Параметры, Уровень, Результат, МассивОшибок, ПоследовательностьУзлов);
				
				// По окончании рекурсивного обхода необходимо установить последовательность узлов в текущую
				ПоследовательностьУзлов = Неопределено;
				ДобавитьСпецификациюВПоследовательность(ПоследовательностьУзловТекущая, ПоследовательностьУзлов);
				
				Если ДобавленнаяСтрока <> Неопределено Тогда
					
					Если НЕ ДобавитьСпецификациюВПоследовательность(ПоследовательностьУзлов, ДобавленнаяСтрока.Последовательность, ИсходнаяСтрока.Последовательность) Тогда
											
						ДобавленнаяСтрока.Разузлован = Истина;
						ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, ИсходнаяСтрока.Последовательность, МассивОшибок);
											
					КонецЕсли;
					
				КонецЕсли;
									
			КонецЦикла;
										
		Иначе
		
			ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, ИсходнаяСтрока.Последовательность, МассивОшибок);
			
		КонецЕсли;
		
	ИначеЕсли СтрокаСпецификации.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.АвтоподборНоменклатуры Тогда
						
		Если СтрокаСпецификации.ВариантАвтоподбора = Перечисления.ВариантыАвтоподбораНоменклатуры.ПолучитьИзСвойства Тогда
			
			НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
			НоваяСтрока.Уровень = Уровень;
       		НоваяСтрока.НомерОперацииМаршрута = СтрокаСпецификации.НомерОперацииМаршрута;
			НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;

			Если НЕ АвтоподборНоменклатурыИзСвойства(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок) Тогда
								
				Результат.ПолноеРазузлование.Удалить(НоваяСтрока);
				Возврат Неопределено;
								
			КонецЕсли;
							
			НоваяСтрока.Количество = СтрокаСпецификации.Количество;
			
			РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
			
			Если СтрокаСпецификации.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
				
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
				
			Иначе
				
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
				
			КонецЕсли;
							
		ИначеЕсли СтрокаСпецификации.ВариантАвтоподбора = Перечисления.ВариантыАвтоподбораНоменклатуры.УказываетсяДляСвойства Тогда
			
			НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
			НоваяСтрока.Уровень = Уровень;
       		НоваяСтрока.НомерОперацииМаршрута = СтрокаСпецификации.НомерОперацииМаршрута;
			НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;
							
			Если НЕ АвтоподборНоменклатурыДляСвойства(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок) Тогда
								
				Результат.ПолноеРазузлование.Удалить(НоваяСтрока);
				Возврат Неопределено;
								
			КонецЕсли;
			
			РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
			
			Если СтрокаСпецификации.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
				
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
				
			Иначе
				
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
				
			КонецЕсли;
							
		КонецЕсли;
						
		Если НоваяСтрока <> Неопределено Тогда
			
			АвтоподборХарактеристики(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок);
							
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации, "МинимальнаяПартия, Кратность, СтатьяЗатрат, ВидВоспроизводства, Спецификация, СписаниеКомплектующей, ТочкаМаршрута, Подразделение, РабочийЦентр");
			УстановитьВидВоспроизводства(НоваяСтрока);
			НоваяСтрока.Спецификация = _пПолучитьСпецификацию(НоваяСтрока, Параметры);
			УстановитьРазузлован(НоваяСтрока,Параметры);
			
			Если НЕ ДобавитьСпецификациюВПоследовательность(НоваяСтрока.Спецификация, НоваяСтрока.Последовательность, ИсходнаяСтрока.Последовательность) Тогда
									
				НоваяСтрока.Разузлован = Истина;
				ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
									
			КонецЕсли;
			
			ОбновитьСопутствующиеИзделия(НоваяСтрока, ИсходнаяСтрока, Результат);
			
		КонецЕсли;
						
	ИначеЕсли СтрокаСпецификации.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.АвтоподборХарактеристики Тогда
						
		НоваяСтрока = Результат.ПолноеРазузлование.Добавить();
							
		НоваяСтрока.Уровень = Уровень;
   		НоваяСтрока.НомерОперацииМаршрута = СтрокаСпецификации.НомерОперацииМаршрута;
		НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;
		НоваяСтрока.Номенклатура = СтрокаСпецификации.Номенклатура;
						
		АвтоподборХарактеристики(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок);
						
		НоваяСтрока.ЕдиницаИзмерения = СтрокаСпецификации.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = СтрокаСпецификации.Коэффициент;
		НоваяСтрока.Количество = СтрокаСпецификации.Количество;
				
		РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
		
		Если СтрокаСпецификации.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
			
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
			
		Иначе
				
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецификации, "МинимальнаяПартия, Кратность, СтатьяЗатрат, ВидВоспроизводства, Спецификация, СписаниеКомплектующей, ТочкаМаршрута, Подразделение, РабочийЦентр");
		УстановитьВидВоспроизводства(НоваяСтрока);
		НоваяСтрока.Спецификация = _пПолучитьСпецификацию(НоваяСтрока, Параметры);
		УстановитьРазузлован(НоваяСтрока, Параметры);
		
		Если НЕ ДобавитьСпецификациюВПоследовательность(НоваяСтрока.Спецификация, НоваяСтрока.Последовательность, ИсходнаяСтрока.Последовательность) Тогда
								
			НоваяСтрока.Разузлован = Истина;
			ДобавитьВОшибки(СтатусСообщения.ОченьВажное, НСтр("ru='Обнаружено зацикливание в структуре изделия.'"), НСтр("ru='Зацикливание'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
								
		КонецЕсли;
		
		ОбновитьСопутствующиеИзделия(НоваяСтрока, ИсходнаяСтрока, Результат);
						
	КонецЕсли;
	
	Если НоваяСтрока <> Неопределено И Результат.Свойство("СопутствующиеИзделия") Тогда
		
		НоваяСтрока.КоличествоОкругленное = НоваяСтрока.Количество;
		
	КонецЕсли;
	
	ДобавитьВИсходныеКомплектующие(Результат, НоваяСтрока, Параметры);
	
	Если НоваяСтрока <> Неопределено И СтрокаСпецификации.ОсновноеСырье Тогда
		
		КоэффициентОсновногоСырья = НоваяСтрока.Количество / ?(СтрокаСпецификации.Количество = 0, 1, СтрокаСпецификации.Количество);
		
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции // ДобавитьВПолноеРазулование()

////////////////////////////////////////

Функция ПолучитьТипКолонкиРабочийЦентр()
	
	Если Метаданные.Справочники.Найти("РабочиеЦентры") <> Неопределено Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры, СправочникСсылка.ГруппыЗаменяемостиРабочихЦентров");
	Иначе
		Возврат Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьВВыходныеИзделия(Результат, ВыходныеИзделия, Параметры)
	
	Если НЕ Результат.Свойство("ВыходныеИзделия") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Если ТипЗнч(ВыходныеИзделия) = Тип("Массив") Тогда
		
		Для каждого ВыходноеИзделие из ВыходныеИзделия Цикл
			
			НоваяСтрока = Результат.ВыходныеИзделия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыходноеИзделие);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыходныеИзделия) = Тип("ТаблицаЗначений") Тогда
		
		УправлениеПланированием.ДополнитьТаблицу(Результат.ВыходныеИзделия, ВыходныеИзделия);
		
	ИначеЕсли  ТипЗнч(ВыходныеИзделия) = Тип("СтрокаТаблицыЗначений") Тогда
		
		НоваяСтрока = Результат.ВыходныеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыходныеИзделия);
		
	КонецЕсли;
		
КонецПроцедуры // ДобавитьВВыходныеИзделия()

Процедура ДобавитьВИсходныеКомплектующие(Результат, ИсходныеКомплектующие, Параметры)
	
	Если НЕ Результат.Свойство("ИсходныеКомплектующие") Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Если ТипЗнч(ИсходныеКомплектующие) = Тип("Массив") Тогда
		
		Для каждого ИсходноеКомплектующее из ИсходныеКомплектующие Цикл
			
			НоваяСтрока = Результат.ИсходныеКомплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходноеКомплектующее);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ИсходныеКомплектующие) = Тип("ТаблицаЗначений") Тогда
		
		УправлениеПланированием.ДополнитьТаблицу(Результат.ИсходныеКомплектующие, ИсходныеКомплектующие);
		
	ИначеЕсли  ТипЗнч(ИсходныеКомплектующие) = Тип("СтрокаТаблицыЗначений") Тогда
		
		НоваяСтрока = Результат.ИсходныеКомплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходныеКомплектующие);
		
	КонецЕсли;
		
КонецПроцедуры // ДобавитьВИсходныеКомплектующие()

Процедура ДобавитьВВозвратныеОтходы(ВозвратныйОтход, ИсходнаяСтрока, КоличествоВыпусков, КоэффициентОсновногоСырья, ДоляСтоимости, Параметры, Уровень, Результат, МассивОшибок)
	
	Если НЕ Результат.Свойство("ВозвратныеОтходы") Тогда
		
		Возврат;
			
	КонецЕсли;
		
	Если ВозвратныйОтход.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.Номенклатура Тогда
						
		НоваяСтрока = Результат.ВозвратныеОтходы.Добавить();
							
		НоваяСтрока.Уровень = Уровень;
		НоваяСтрока.НомерОперацииМаршрута = ВозвратныйОтход.НомерОперацииМаршрута;
		НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;
		НоваяСтрока.Номенклатура = ВозвратныйОтход.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = ВозвратныйОтход.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения = ВозвратныйОтход.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = ВозвратныйОтход.Коэффициент;
		НоваяСтрока.Количество = ВозвратныйОтход.Количество;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратныйОтход, "СтатьяЗатрат, СписаниеКомплектующей, ТочкаМаршрута, Подразделение, РабочийЦентр");
		
		РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
		
		Если ВозвратныйОтход.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
			
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
			
		Иначе
				
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
			
		КонецЕсли;
		
		НоваяСтрока.Сумма = ВозвратныйОтход.Сумма * НоваяСтрока.Количество / ?(ВозвратныйОтход.Количество = 0, 1, ВозвратныйОтход.Количество);
		НоваяСтрока.СуммаРегл = ВозвратныйОтход.СуммаРегл * НоваяСтрока.Количество / ?(ВозвратныйОтход.Количество = 0, 1, ВозвратныйОтход.Количество);
		
	ИначеЕсли ВозвратныйОтход.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.АвтоподборНоменклатуры Тогда
						
		НоваяСтрока = Результат.ВозвратныеОтходы.Добавить();
							
		НоваяСтрока.Уровень = Уровень;
		НоваяСтрока.НомерОперацииМаршрута = ВозвратныйОтход.НомерОперацииМаршрута;
		НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;
						
		Если ВозвратныйОтход.ВариантАвтоподбора = Перечисления.ВариантыАвтоподбораНоменклатуры.ПолучитьИзСвойства Тогда

			Если НЕ АвтоподборНоменклатурыИзСвойства(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, МассивОшибок) Тогда
								
				Результат.ВозвратныеОтходы.Удалить(НоваяСтрока);
				Возврат;
								
			КонецЕсли;
							
			НоваяСтрока.Количество = ВозвратныйОтход.Количество;
							
			РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
			
			Если ВозвратныйОтход.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
				
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
				
			Иначе
					
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
					
			КонецЕсли;
							
		ИначеЕсли ВозвратныйОтход.ВариантАвтоподбора = Перечисления.ВариантыАвтоподбораНоменклатуры.УказываетсяДляСвойства Тогда
							
			Если НЕ АвтоподборНоменклатурыДляСвойства(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, МассивОшибок, Истина) Тогда
								
				Результат.ВозвратныеОтходы.Удалить(НоваяСтрока);
				Возврат;
								
			КонецЕсли;
			
			РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
			
			Если ВозвратныйОтход.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
				
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
				
			Иначе
					
				НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
				
			КонецЕсли;
							
		КонецЕсли;
						
		АвтоподборХарактеристики(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, МассивОшибок, Истина);
						
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратныйОтход, "СтатьяЗатрат, СписаниеКомплектующей, ТочкаМаршрута, Подразделение, РабочийЦентр");
		
		НоваяСтрока.Сумма = ВозвратныйОтход.Сумма * НоваяСтрока.Количество / ?(ВозвратныйОтход.Количество = 0, 1, ВозвратныйОтход.Количество);
		НоваяСтрока.СуммаРегл = ВозвратныйОтход.СуммаРегл * НоваяСтрока.Количество / ?(ВозвратныйОтход.Количество = 0, 1, ВозвратныйОтход.Количество);
						
	ИначеЕсли ВозвратныйОтход.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.АвтоподборХарактеристики Тогда
						
		НоваяСтрока = Результат.ВозвратныеОтходы.Добавить();
							
		НоваяСтрока.Уровень = Уровень;
		НоваяСтрока.НомерОперацииМаршрута = ВозвратныйОтход.НомерОперацииМаршрута;
		НоваяСтрока.НоменклатурнаяГруппа = ИсходнаяСтрока.НоменклатурнаяГруппа;
		НоваяСтрока.Номенклатура = ВозвратныйОтход.Номенклатура;
						
		АвтоподборХарактеристики(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, МассивОшибок, Истина);
						
		НоваяСтрока.ЕдиницаИзмерения = ВозвратныйОтход.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент = ВозвратныйОтход.Коэффициент;
		НоваяСтрока.Количество = ВозвратныйОтход.Количество;
						
		РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, ВозвратныйОтход, НоваяСтрока, КоэффициентОсновногоСырья, Параметры.ПараметрыВыпуска, МассивОшибок);
		
		Если ВозвратныйОтход.УказаниеНорматива = Перечисления.ВидыУказанияНорматива.НаКоличествоОсновногоСырья Тогда
			
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоэффициентОсновногоСырья;
			
		Иначе
					
			НоваяСтрока.Количество = НоваяСтрока.Количество * КоличествоВыпусков.Числитель / КоличествоВыпусков.Знаменатель;
			
		КонецЕсли;
						
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратныйОтход, "СтатьяЗатрат, СписаниеКомплектующей, ТочкаМаршрута, Подразделение, РабочийЦентр");
		
		НоваяСтрока.Сумма = ВозвратныйОтход.Сумма * НоваяСтрока.Количество / ?(ВозвратныйОтход.Количество = 0, 1, ВозвратныйОтход.Количество);
		НоваяСтрока.СуммаРегл = ВозвратныйОтход.СуммаРегл * НоваяСтрока.Количество / ?(ВозвратныйОтход.Количество = 0, 1, ВозвратныйОтход.Количество);
						
	КонецЕсли;
	
КонецПроцедуры // ДобавитьВВозвратныеОтходы()

Процедура ДобавитьВСопутствующиеИзделия(Источник, Результат)
	
	Если НЕ Результат.Свойство("СопутствующиеИзделия") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Получение выходных изделия по спецификации
	ВыходныеИзделия = ПолучитьВыходныеИзделия(Источник);
	
	Пока ВыходныеИзделия.Следующий() Цикл
		
		// Все строки выходных изделий переносятся в таблицу сопутствующих изделий, т.к. каждое выходное изделие может оказаться сопутствующим
		НоваяСтрока = Результат.СопутствующиеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыходныеИзделия);
		
		// Отдельно сохраняется исходное количество сопутствующих изделий для последующих расчетов
		НоваяСтрока.ИсходноеКоличество = ?(Результат.КоличествоВыпусков.Знаменатель = 0, 0, НоваяСтрока.Количество * Результат.КоличествоВыпусков.Числитель / Результат.КоличествоВыпусков.Знаменатель);
		
		// Начальное значение коэффициента приведения, означает что коэффициент еще не рассчитывался
		НоваяСтрока.КоэффициентПриведения = - 1;
		
		НоваяСтрока.Спецификация = Источник.Спецификация;
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьВСопутствующиеИзделия()

Процедура ОбновитьСопутствующиеИзделия(НоваяСтрока, ИсходнаяСтрока, Результат)
	
	Если НЕ Результат.Свойство("СопутствующиеИзделия") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Расчет количества комплектующей в соответствии с кратностью и минимальной партией ее потребления
	ПриведенноеКоличество = УправлениеПланированием.ПривестиКМинимальнойПартииКратности(НоваяСтрока.Количество, НоваяСтрока.МинимальнаяПартия, НоваяСтрока.Кратность);
	
	Если НоваяСтрока.Количество = 0 Тогда
		
		КоэффициентПриведения = 0;
		
	Иначе
		
		// Коэффициент приведения показывает, во сколько раз увеличилось потребление после корректировки
		Если ПриведенноеКоличество = НоваяСтрока.Количество Тогда
			
			// Если приведения количества не было, необходимо округлить до 3 знаков количество комплектующей
			// Округление в большую сторону, т.к. уменьшать количество комплектующей нельзя
			ПриведенноеКоличество = УправлениеПланированием.ОкруглитьВБольшуюСторону(ПриведенноеКоличество, 3);
			
			// ZAA - 1
			// Округление по арифметическим правилам.
			ПриведенноеКоличество = Окр(НоваяСтрока.Количество,3);
			// ZAA - 2
			
			// При округлении образetncz сопутствующий выпуск основной номенклатуры
			КоэффициентПриведения = 1;
			
		Иначе
			
		    КоэффициентПриведения = ПриведенноеКоличество / НоваяСтрока.Количество;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Поиск сопутствующих изделия данной спецификации
	СтрокиСопутствующихИзделий = Результат.СопутствующиеИзделия.НайтиСтроки(Новый Структура("Спецификация", ИсходнаяСтрока.Спецификация));
	
	Для Каждого СтрокаСопутствующихИзделий Из СтрокиСопутствующихИзделий Цикл
		
		// Если коэффициент приведения текущей строки = 0, значит сопутствующего выпуска не будет - корректировка не нужна
		Если СтрокаСопутствующихИзделий.КоэффициентПриведения <> 0 Тогда
			
			// Расчет коэффициента приведения каждого сопутствующего изделия
			СтрокаСопутствующихИзделий.КоэффициентПриведения = ?(СтрокаСопутствующихИзделий.КоэффициентПриведения = -1, КоэффициентПриведения, Мин(КоэффициентПриведения, СтрокаСопутствующихИзделий.КоэффициентПриведения));
				
			// Для основной номенклатуры действует доп.условие - необходимо вычитать исходное количество, т.к. оно уже содержится в таблице продукции при вызове разузлования
			СтрокаСопутствующихИзделий.Количество = СтрокаСопутствующихИзделий.ИсходноеКоличество * СтрокаСопутствующихИзделий.КоэффициентПриведения - ?(СтрокаСопутствующихИзделий.СопутствующееИзделие,0, СтрокаСопутствующихИзделий.ИсходноеКоличество);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Корректировка количества комплектующей
	НоваяСтрока.Количество = ?(НоваяСтрока.Количество = 0, 0, ПриведенноеКоличество);
	
КонецПроцедуры // ОбновитьСопутствующиеИзделия()

Функция РазместитьВСопутствующихИзделиях(Источник, Параметры, Результат)
	
	НеразмещенноеКоличество = Источник.Количество;
	
	Если НЕ Параметры.РазмещатьВСопутствующихИзделиях ИЛИ Результат.СопутствующиеИзделия.Количество() = 0 ИЛИ Источник.Количество <= 0 Тогда
		
		Возврат НеразмещенноеКоличество;
		
	КонецЕсли;
	
	СтрокиСопутствующихИзделий = Результат.СопутствующиеИзделия.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Источник.Номенклатура, Источник.ХарактеристикаНоменклатуры));
	
	Для каждого СтрокаСопутствующегоИзделия из СтрокиСопутствующихИзделий Цикл
		
		Если СтрокаСопутствующегоИзделия.Количество > 0 Тогда
			
			// Пересчет количества сопутствующего изделия в единицу источника
			КоличествоСопутствующегоИзделия = Источник.Коэффициент * (СтрокаСопутствующегоИзделия.Количество / СтрокаСопутствующегоИзделия.Коэффициент);
			
			//Расчет количества к размещению в данной строке сопутствующего изделия
			КоличествоКРазмещению = Мин(КоличествоСопутствующегоИзделия, Источник.Количество);
			
			//Корректировка количества источника
			НеразмещенноеКоличество = НеразмещенноеКоличество - КоличествоКРазмещению;
			
			// Пересчет количества к размещению в единицу сопутствующего изделия
			КоличествоКРазмещениюСопутствующегоИзделия = СтрокаСопутствующегоИзделия.Коэффициент * (КоличествоКРазмещению / Источник.Коэффициент);
			
			//Корректировка сопутствующего изделия
			СтрокаСопутствующегоИзделия.Количество = СтрокаСопутствующегоИзделия.Количество - КоличествоКРазмещениюСопутствующегоИзделия;
			
			Если НеразмещенноеКоличество = 0 Тогда
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат НеразмещенноеКоличество;
	
КонецФункции //РазместитьВСопутствующихИзделиях

Функция ПолучитьВыходныеИзделия(Источник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыходныеИзделия.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ОсновноеИзделие
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыходныеИзделияСХарактеристикой.НомерСтроки КАК НомерСтроки,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияСХарактеристикой
	|	ГДЕ
	|		ВыходныеИзделияСХарактеристикой.Ссылка = &Спецификация
	|		И ВыходныеИзделияСХарактеристикой.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияСХарактеристикой.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыходныеИзделияБезХарактеристики.НомерСтроки,
	|		2
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияБезХарактеристики
	|	ГДЕ
	|		ВыходныеИзделияБезХарактеристики.Ссылка = &Спецификация
	|		И ВыходныеИзделияБезХарактеристики.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияБезХарактеристики.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыходныеИзделияБезХарактеристики.НомерСтроки,
	|		3
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияБезХарактеристики
	|	ГДЕ
	|		ВыходныеИзделияБезХарактеристики.Ссылка = &Спецификация
	|		И ВыходныеИзделияБезХарактеристики.Номенклатура = &Номенклатура) КАК ВыходныеИзделия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыходныеИзделия.Приоритет,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпецификацииНоменклатурыВыходныеИзделия.Ссылка КАК Ссылка,
	|	СпецификацииНоменклатурыВыходныеИзделия.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &Номенклатура = НЕОПРЕДЕЛЕНО
	|				И &ХарактеристикаНоменклатуры = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА СпецификацииНоменклатурыВыходныеИзделия.НомерСтроки = 1
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОсновноеИзделие.НомерСтроки ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК СопутствующееИзделие,
	|	СпецификацииНоменклатурыВыходныеИзделия.НомерОперацииМаршрута КАК НомерОперацииМаршрута,
	|	СпецификацииНоменклатурыВыходныеИзделия.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СпецификацииНоменклатурыВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ОсновноеИзделие.НомерСтроки ЕСТЬ НЕ NULL 
	|				И &ХарактеристикаНоменклатуры <> НЕОПРЕДЕЛЕНО
	|			ТОГДА &ХарактеристикаНоменклатуры
	|		ИНАЧЕ СпецификацииНоменклатурыВыходныеИзделия.ХарактеристикаНоменклатуры
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	СпецификацииНоменклатурыВыходныеИзделия.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СпецификацииНоменклатурыВыходныеИзделия.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА СпецификацииНоменклатурыВыходныеИзделия.Номенклатура.ЕдиницаХраненияОстатков
	|		ИНАЧЕ СпецификацииНоменклатурыВыходныеИзделия.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	(ВЫБОР
	|		КОГДА СпецификацииНоменклатурыВыходныеИзделия.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА СпецификацииНоменклатурыВыходныеИзделия.Номенклатура.ЕдиницаХраненияОстатков
	|		ИНАЧЕ СпецификацииНоменклатурыВыходныеИзделия.ЕдиницаИзмерения
	|	КОНЕЦ).Коэффициент КАК Коэффициент,
	|	СпецификацииНоменклатурыВыходныеИзделия.МинимальнаяПартия КАК МинимальнаяПартия,
	|	СпецификацииНоменклатурыВыходныеИзделия.Кратность КАК Кратность,
	|	СпецификацииНоменклатурыВыходныеИзделия.ДоляСтоимости КАК ДоляСтоимости,
	|	СпецификацииНоменклатурыВыходныеИзделия.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЕСТЬNULL(СпецификацииНоменклатурыВыходныеИзделия.ТочкаМаршрута.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(СпецификацииНоменклатурыВыходныеИзделия.ТочкаМаршрута.РабочийЦентр, НЕОПРЕДЕЛЕНО) КАК РабочийЦентр
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОсновноеИзделие КАК ОсновноеИзделие
	|		ПО СпецификацииНоменклатурыВыходныеИзделия.НомерСтроки = ОсновноеИзделие.НомерСтроки
	|ГДЕ
	|	СпецификацииНоменклатурыВыходныеИзделия.Ссылка = &Спецификация");
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.СпецификацииНоменклатуры") Тогда
		
		Запрос.УстановитьПараметр("Спецификация", Источник);
		Запрос.УстановитьПараметр("Номенклатура", Неопределено);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Неопределено);
		
	Иначе
		
		Запрос.УстановитьПараметр("Спецификация", Источник.Спецификация);
		Запрос.УстановитьПараметр("Номенклатура", Источник.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ЗначениеЗаполнено(Источник.ХарактеристикаНоменклатуры), Источник.ХарактеристикаНоменклатуры, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // ПолучитьВыходныеИзделия()

Функция ПолучитьИсходныеКомплектующие(Спецификация, Источник, НаследуемыеСвойства = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсходныеКомплектующие.Ссылка КАК Ссылка,
	|	ИсходныеКомплектующие.НомерСтроки КАК НомерСтроки,
	|	ИсходныеКомплектующие.ВидНорматива КАК ВидНорматива,
	|	ЕСТЬNULL(&НомерОперацииМаршрута, ИсходныеКомплектующие.НомерОперацииМаршрута) КАК НомерОперацииМаршрута,
	|	ИсходныеКомплектующие.Номенклатура КАК Номенклатура,
	|	ИсходныеКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ИсходныеКомплектующие.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ИсходныеКомплектующие.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ИсходныеКомплектующие.Номенклатура.ЕдиницаХраненияОстатков
	|		ИНАЧЕ ИсходныеКомплектующие.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	(ВЫБОР
	|		КОГДА ИсходныеКомплектующие.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ИсходныеКомплектующие.Номенклатура.ЕдиницаХраненияОстатков
	|		ИНАЧЕ ИсходныеКомплектующие.ЕдиницаИзмерения
	|	КОНЕЦ).Коэффициент КАК Коэффициент,
	|	ИсходныеКомплектующие.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ИсходныеКомплектующие.МинимальнаяПартия КАК МинимальнаяПартия,
	|	ИсходныеКомплектующие.Кратность КАК Кратность,
	|	ИсходныеКомплектующие.ПозицияПоСпецификации КАК ПозицияПоСпецификации,
	|	ВЫБОР
	|		КОГДА ИсходныеКомплектующие.Ссылка.ИспользоватьВидВоспроизводства = ИСТИНА
	|			ТОГДА ИсходныеКомплектующие.ВидВоспроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидВоспроизводства,
	|	ВЫБОР
	|		КОГДА ИсходныеКомплектующие.Ссылка.ИспользоватьВидВоспроизводства = ИСТИНА
	|			ТОГДА ИсходныеКомплектующие.Спецификация
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Спецификация,
	|	ВЫБОР
	|		КОГДА ИсходныеКомплектующие.Ссылка.ИспользоватьУправлениеСписанием = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ИсходныеКомплектующие.СписаниеКомплектующей = ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ЗадаетсяВСвойстве)
	|							ИЛИ ИсходныеКомплектующие.СписаниеКомплектующей = ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.Всегда)
	|					ИНАЧЕ ИсходныеКомплектующие.СписаниеКомплектующей
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.Всегда)
	|	КОНЕЦ КАК СписаниеКомплектующей,
	|	ИсходныеКомплектующие.СвойствоДляСписания КАК СвойствоДляСписания,
	|	ВЫБОР
	|		КОГДА ИсходныеКомплектующие.Ссылка.ИспользоватьФормулы = ИСТИНА
	|			ТОГДА ИсходныеКомплектующие.Формула
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Формула,
	|	ВЫБОР
	|		КОГДА ИсходныеКомплектующие.Ссылка.ИспользоватьУказаниеНорматива = ИСТИНА
	|			ТОГДА ИсходныеКомплектующие.УказаниеНорматива
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УказаниеНорматива,
	|	ИсходныеКомплектующие.ОсновноеСырье КАК ОсновноеСырье,
	|	ИсходныеКомплектующие.ВариантАвтоподбора КАК ВариантАвтоподбора,
	|	ИсходныеКомплектующие.Свойство КАК Свойство,
	|	ИсходныеКомплектующие.КлючСвязи КАК КлючСвязи,
	|	ИсходныеКомплектующие.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЕСТЬNULL(ИсходныеКомплектующие.ТочкаМаршрута.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ИсходныеКомплектующие.ТочкаМаршрута.РабочийЦентр, НЕОПРЕДЕЛЕНО) КАК РабочийЦентр
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК ИсходныеКомплектующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО (ЗначенияСвойствОбъектов.Объект = &ХарактеристикаНоменклатуры)
	|			И (ЗначенияСвойствОбъектов.Свойство = ИсходныеКомплектующие.СвойствоДляСписания)
	|ГДЕ
	|	ИсходныеКомплектующие.Ссылка = &Спецификация
	|	И (ИсходныеКомплектующие.Ссылка.ИспользоватьУправлениеСписанием = ЛОЖЬ
	|			ИЛИ ИсходныеКомплектующие.Ссылка.ИспользоватьУправлениеСписанием = ИСТИНА
	|				И ИсходныеКомплектующие.СписаниеКомплектующей <> ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ЗадаетсяВСвойстве)
	|			ИЛИ ИсходныеКомплектующие.Ссылка.ИспользоватьУправлениеСписанием = ИСТИНА
	|				И ИсходныеКомплектующие.СписаниеКомплектующей = ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ЗадаетсяВСвойстве)
	|				И ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЛОЖЬ) = ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСырье УБЫВ");
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Если ТипЗнч(Источник) = Тип("Структура") Тогда
		
		Если Источник.Свойство("ХарактеристикаНоменклатуры") Тогда
			
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Источник.ХарактеристикаНоменклатуры);
			
		Иначе
			
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			
		КонецЕсли;
		
	Иначе
		
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Источник.ХарактеристикаНоменклатуры);
		
	КонецЕсли;
	
	Если ТипЗнч(НаследуемыеСвойства) = Тип("Структура") Тогда
		
		Если НаследуемыеСвойства.Свойство("НомерОперацииМаршрута") Тогда
			
			Запрос.УстановитьПараметр("НомерОперацииМаршрута", НаследуемыеСвойства.НомерОперацииМаршрута);
			
		Иначе
			
			Запрос.УстановитьПараметр("НомерОперацииМаршрута", NULL);
			
		КонецЕсли;
		
	Иначе
			
		Запрос.УстановитьПараметр("НомерОперацииМаршрута", NULL);
	
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // ПолучитьИсходныеКомплектующие()

Функция ПолучитьВозвратныеОтходы(Спецификация, Источник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратныеОтходы.Ссылка КАК Ссылка,
	|	ВозвратныеОтходы.НомерСтроки КАК НомерСтроки,
	|	ВозвратныеОтходы.ВидНорматива КАК ВидНорматива,
	|	ВозвратныеОтходы.НомерОперацииМаршрута КАК НомерОперацииМаршрута,
	|	ВозвратныеОтходы.Номенклатура КАК Номенклатура,
	|	ВозвратныеОтходы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВозвратныеОтходы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВозвратныеОтходы.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВозвратныеОтходы.Номенклатура.ЕдиницаХраненияОстатков
	|		ИНАЧЕ ВозвратныеОтходы.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	(ВЫБОР
	|		КОГДА ВозвратныеОтходы.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ВозвратныеОтходы.Номенклатура.ЕдиницаХраненияОстатков
	|		ИНАЧЕ ВозвратныеОтходы.ЕдиницаИзмерения
	|	КОНЕЦ).Коэффициент КАК Коэффициент,
	|	ВозвратныеОтходы.Сумма КАК Сумма,
	|	ВозвратныеОтходы.СуммаРегл КАК СуммаРегл,
	|	ВозвратныеОтходы.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВЫБОР
	|		КОГДА ВозвратныеОтходы.Ссылка.ИспользоватьУправлениеСписанием = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ВозвратныеОтходы.СписаниеКомплектующей = ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ЗадаетсяВСвойстве)
	|							ИЛИ ВозвратныеОтходы.СписаниеКомплектующей = ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.Всегда)
	|					ИНАЧЕ ВозвратныеОтходы.СписаниеКомплектующей
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.Всегда)
	|	КОНЕЦ КАК СписаниеКомплектующей,
	|	ВозвратныеОтходы.СвойствоДляСписания КАК СвойствоДляСписания,
	|	ВЫБОР
	|		КОГДА ВозвратныеОтходы.Ссылка.ИспользоватьФормулы = ИСТИНА
	|			ТОГДА ВозвратныеОтходы.Формула
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Формула,
	|	ВЫБОР
	|		КОГДА ВозвратныеОтходы.Ссылка.ИспользоватьУказаниеНорматива = ИСТИНА
	|			ТОГДА ВозвратныеОтходы.УказаниеНорматива
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УказаниеНорматива,
	|	ВозвратныеОтходы.ВариантАвтоподбора КАК ВариантАвтоподбора,
	|	ВозвратныеОтходы.Свойство КАК Свойство,
	|	ВозвратныеОтходы.КлючСвязи КАК КлючСвязи,
	|	ВозвратныеОтходы.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЕСТЬNULL(ВозвратныеОтходы.ТочкаМаршрута.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(ВозвратныеОтходы.ТочкаМаршрута.РабочийЦентр, НЕОПРЕДЕЛЕНО) КАК РабочийЦентр
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры.ВозвратныеОтходы КАК ВозвратныеОтходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО (ЗначенияСвойствОбъектов.Объект = &ХарактеристикаНоменклатуры)
	|			И (ЗначенияСвойствОбъектов.Свойство = ВозвратныеОтходы.СвойствоДляСписания)
	|ГДЕ
	|	ВозвратныеОтходы.Ссылка = &Спецификация
	|	И ВозвратныеОтходы.Ссылка.ИспользоватьВозвратныеОтходы = ИСТИНА
	|	И (ВозвратныеОтходы.Ссылка.ИспользоватьУправлениеСписанием = ЛОЖЬ
	|			ИЛИ ВозвратныеОтходы.Ссылка.ИспользоватьУправлениеСписанием = ИСТИНА
	|				И ВозвратныеОтходы.СписаниеКомплектующей <> ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ЗадаетсяВСвойстве)
	|			ИЛИ ВозвратныеОтходы.Ссылка.ИспользоватьУправлениеСписанием = ИСТИНА
	|				И ВозвратныеОтходы.СписаниеКомплектующей = ЗНАЧЕНИЕ(Перечисление.ВариантыСписанияКомплектующих.ЗадаетсяВСвойстве)
	|				И ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЛОЖЬ) = ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Если Источник.Свойство("ХарактеристикаНоменклатуры") Тогда
		
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Источник.ХарактеристикаНоменклатуры);
		
	Иначе
		
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // ПолучитьВозвратныеОтходы()

Функция АвтоподборНоменклатурыИзСвойства(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектов.Значение КАК Номенклатура,
	|	ЗначенияСвойствОбъектов.Значение.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	ЗначенияСвойствОбъектов.Значение.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура");
		
	Запрос.УстановитьПараметр("Объект", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Свойство", СтрокаСпецификации.Свойство);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
			
		Если ТипЗнч(Выборка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = Выборка.Коэффициент;
			Возврат Истина;
				
		Иначе
				
			ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор номенклатуры из свойства: '") + СокрЛП(СтрокаСпецификации.Свойство.Наименование), НСтр("ru='Несоответствие типов. Полученный тип: '") + ТипЗнч(Выборка.Номенклатура) + НСтр("ru=' Требуемый тип: '") + Тип("СправочникСсылка.Номенклатура"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
			Возврат Ложь;
				
		КонецЕсли;
			
	Иначе
			
		ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор номенклатуры из свойства: '") + СокрЛП(СтрокаСпецификации.Свойство.Наименование), НСтр("ru='Не задано значение свойства'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
		Возврат Ложь;
			
	КонецЕсли;
		
КонецФункции // АвтоподборНоменклатурыИзСвойства()

Функция АвтоподборНоменклатурыДляСвойства(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок, ВозвратныйОтход = Ложь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СпецификацииНоменклатурыАвтоподборНоменклатуры.НомерСтроки КАК НомерСтроки,
	|	СпецификацииНоменклатурыАвтоподборНоменклатуры.Номенклатура КАК Номенклатура,
	|	СпецификацииНоменклатурыАвтоподборНоменклатуры.Количество КАК Количество,
	|	СпецификацииНоменклатурыАвтоподборНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпецификацииНоменклатурыАвтоподборНоменклатуры.ЕдиницаИзмерения.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.АвтоподборНоменклатуры" + ?(ВозвратныйОтход, "Отходы", "") + " КАК СпецификацииНоменклатурыАвтоподборНоменклатуры
	|		ПО ЗначенияСвойствОбъектов.Значение = СпецификацииНоменклатурыАвтоподборНоменклатуры.Значение
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И СпецификацииНоменклатурыАвтоподборНоменклатуры.Ссылка = &Спецификация
	|	И СпецификацииНоменклатурыАвтоподборНоменклатуры.КлючСвязи = &КлючСвязи
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
		
	Запрос.УстановитьПараметр("Объект", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Свойство", СтрокаСпецификации.Свойство);
	Запрос.УстановитьПараметр("Спецификация", СтрокаСпецификации.Ссылка);
	Запрос.УстановитьПараметр("КлючСвязи", СтрокаСпецификации.КлючСвязи);

	РезультатЗапроса = Запрос.Выполнить();
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
			
		Если ТипЗнч(Выборка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = Выборка.Коэффициент;
			НоваяСтрока.Количество = ?(Выборка.Количество = 0, СтрокаСпецификации.Количество, Выборка.Количество);
				
			Возврат Истина;
				
		Иначе
				
			ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор номенклатуры для свойства: '") + СокрЛП(СтрокаСпецификации.Свойство.Наименование), НСтр("ru='Несоответствие типов. Полученный тип: '") + ТипЗнч(Выборка.Номенклатура) + НСтр("ru=' Требуемый тип: '") + Тип("СправочникСсылка.Номенклатура"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
			Возврат Ложь;
				
		КонецЕсли;
			
	Иначе
			
		ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор номенклатуры для свойства: '") + СокрЛП(СтрокаСпецификации.Свойство.Наименование), НСтр("ru='Для указанного значения свойства не найдено соответствие.'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
		Возврат Ложь;
			
	КонецЕсли;
		
КонецФункции // АвтоподборНоменклатурыДляСвойства()

Функция АвтоподборХарактеристики(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, МассивОшибок, ВозвратныйОтход = Ложь)
	
	Если СтрокаСпецификации.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.АвтоподборНоменклатуры Тогда
		
		Если СтрокаСпецификации.Ссылка["АвтоподборХарактеристики" + ?(ВозвратныйОтход, "Отходы", "")].Найти(СтрокаСпецификации.КлючСвязи, "КлючСвязи") = Неопределено Тогда
			
			Возврат Истина;
			
		ИначеЕсли НЕ НоваяСтрока.Номенклатура.ВестиУчетПоХарактеристикам Тогда
			
			ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор характеристики.'"), НСтр("ru='Для номенклатуры не ведется учет по характеристикам'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
			Возврат Ложь;
			
		КонецЕсли;
		
	ИначеЕсли СтрокаСпецификации.ВидНорматива = Перечисления.ВидыНормативовНоменклатуры.АвтоподборХарактеристики И НЕ НоваяСтрока.Номенклатура.ВестиУчетПоХарактеристикам Тогда
		
		ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор характеристики.'"), НСтр("ru='Для номенклатуры не ведется учет по характеристикам'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
		Возврат Ложь;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоСовпавшихСвойст) КАК КоличествоСовпавшихСвойст,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПодбираемыеХарактеристики.Ссылка КАК ХарактеристикаНоменклатуры,
	|		КОЛИЧЕСТВО(СпецификацииНоменклатурыАвтоподборХарактеристики.Свойство) КАК КоличествоСовпавшихСвойст
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК ПодбираемыеХарактеристики
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.АвтоподборХарактеристики" + ?(ВозвратныйОтход, "Отходы", "") + " КАК СпецификацииНоменклатурыАвтоподборХарактеристики
	|			ПО (СпецификацииНоменклатурыАвтоподборХарактеристики.Ссылка = &Спецификация)
	|				И (СпецификацииНоменклатурыАвтоподборХарактеристики.КлючСвязи = &КлючСвязи)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовИсходнаяХарактеристика
	|			ПО (ЗначенияСвойствОбъектовИсходнаяХарактеристика.Объект = &Объект)
	|				И (СпецификацииНоменклатурыАвтоподборХарактеристики.Свойство = ЗначенияСвойствОбъектовИсходнаяХарактеристика.Свойство)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовПодбираемаяХарактеристика
	|			ПО (ЗначенияСвойствОбъектовПодбираемаяХарактеристика.Объект = ПодбираемыеХарактеристики.Ссылка)
	|				И (СпецификацииНоменклатурыАвтоподборХарактеристики.Свойство = ЗначенияСвойствОбъектовПодбираемаяХарактеристика.Свойство)
	|	ГДЕ
	|		ПодбираемыеХарактеристики.Владелец = &Владелец
	|		И ЕСТЬNULL(ЗначенияСвойствОбъектовИсходнаяХарактеристика.Значение, НЕОПРЕДЕЛЕНО) = ЕСТЬNULL(ЗначенияСвойствОбъектовПодбираемаяХарактеристика.Значение, НЕОПРЕДЕЛЕНО)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПодбираемыеХарактеристики.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.АвтоподборХарактеристики" + ?(ВозвратныйОтход, "Отходы", "") + " КАК СпецификацииНоменклатурыАвтоподборХарактеристики
	|		ПО (СпецификацииНоменклатурыАвтоподборХарактеристики.Ссылка = &Спецификация)
	|			И (СпецификацииНоменклатурыАвтоподборХарактеристики.КлючСвязи = &КлючСвязи)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоСовпавшихСвойст) = КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпецификацииНоменклатурыАвтоподборХарактеристики.Свойство)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоСовпавшихСвойст УБЫВ");
	
	Запрос.УстановитьПараметр("Объект", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Владелец", НоваяСтрока.Номенклатура);
	Запрос.УстановитьПараметр("Спецификация", СтрокаСпецификации.Ссылка);
	Запрос.УстановитьПараметр("КлючСвязи", СтрокаСпецификации.КлючСвязи);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
			
		Если ТипЗнч(Выборка.ХарактеристикаНоменклатуры) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
				
			НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			Возврат Истина;
				
		Иначе
				
			ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор характеристики.'"), НСтр("ru='Автоподбор характеристики'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
			Возврат Ложь;
				
		КонецЕсли;
			
	Иначе
			
		ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Не выполнен автоподбор характеристики.'"), НСтр("ru='Автоподбор характеристики'"), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
		Возврат Ложь;
			
	КонецЕсли;
	
КонецФункции // АвтоподборХарактеристики()

Функция РассчитатьКоличествоПоФормуле(ИсходнаяСтрока, СтрокаСпецификации, НоваяСтрока, КоэффициентОсновногоСырья, ПараметрыВыпуска, МассивОшибок)
	
	Если ПустаяСтрока(СтрокаСпецификации.Формула) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ПараметрыВыпуска = Неопределено Тогда
		
		ПараметрыВыпуска = Новый Соответствие;
		
	КонецЕсли;
	
	Формула = СтрокаСпецификации.Формула;
	ФормулаДляРазбора = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрокаСпецификации.Формула, "[", Символы.ПС + "["), "]", "]" + Символы.ПС), "{", Символы.ПС + "{"), "}", "}" + Символы.ПС);
	
	СтруктураПараметров = Новый Структура;
	СоответствиеПараметров = Новый Соответствие;
	
	Для Индекс = 1 По СтрЧислоСтрок(ФормулаДляРазбора) Цикл
		
		ТекущаяСтрока = СокрЛП(СтрПолучитьСтроку(ФормулаДляРазбора, Индекс));
		ИмяПараметра = "Параметр" + Формат(Индекс, "ЧГ=0");
		
		Если Лев(ТекущаяСтрока, 2) = "[#" Тогда
			
			Формула = СтрЗаменить(Формула, ТекущаяСтрока, "НоваяСтрока." + СтрЗаменить(СтрЗаменить(ТекущаяСтрока, "[#", ""), "#]", ""));
			
		ИначеЕсли (Лев(ТекущаяСтрока, 1) = "{" ИЛИ Лев(ТекущаяСтрока, 1) = "[") И СоответствиеПараметров[ТекущаяСтрока] = Неопределено Тогда
			
			Формула = СтрЗаменить(Формула, ТекущаяСтрока, "СтруктураПараметров." + ИмяПараметра);
			СоответствиеПараметров.Вставить(ТекущаяСтрока, ИмяПараметра);
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;

	КонецЦикла;
	
	МассивПараметров = Новый Массив;
	МассивСвойств = Новый Массив;
	
	Для каждого Параметр из СоответствиеПараметров Цикл
		
		Если Лев(Параметр.Ключ, 1) = "[" Тогда
			
			МассивПараметров.Добавить(СтрЗаменить(СтрЗаменить(Параметр.Ключ, "[", ""), "]", ""));
			
		ИначеЕсли Лев(Параметр.Ключ, 1) = "{" Тогда
			
			МассивСвойств.Добавить(СтрЗаменить(СтрЗаменить(Параметр.Ключ, "{", ""), "}", ""));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивПараметров.Количество() > 0 Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыВыпускаПродукции.ВидПараметра.Наименование КАК Наименование,
		|	ПараметрыВыпускаПродукции.Значение КАК Значение
		|ИЗ
		|	Справочник.СпецификацииНоменклатуры.ПараметрыВыпускаПродукции КАК ПараметрыВыпускаПродукции
		|ГДЕ
		|	ПараметрыВыпускаПродукции.Ссылка = &Спецификация
		|	И ПараметрыВыпускаПродукции.ВидПараметра.Наименование В(&МассивПараметров)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование,
		|	Значение");
			
		Запрос.УстановитьПараметр("Спецификация", ?(СтрокаСпецификации.Ссылка.ВидСпецификации = Перечисления.ВидыСпецификаций.Узел, ИсходнаяСтрока.Спецификация, СтрокаСпецификации.Ссылка));
		Запрос.УстановитьПараметр("МассивПараметров", МассивПараметров);
		
		РезультатЗапроса = Запрос.Выполнить();
				
		Если НЕ РезультатЗапроса.Пустой() Тогда
					
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если НЕ СтруктураПараметров.Свойство(СоответствиеПараметров["[" + Выборка.Наименование + "]"]) Тогда
					
					Если ПараметрыВыпуска[Выборка.Наименование] = Неопределено Тогда
						
						СтруктураПараметров.Вставить(СоответствиеПараметров["[" + Выборка.Наименование + "]"], Выборка.Значение);
						
					Иначе
						
						СтруктураПараметров.Вставить(СоответствиеПараметров["[" + Выборка.Наименование + "]"], ПараметрыВыпуска[Выборка.Наименование]);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивСвойств.Количество() > 0 Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Наименование,
		|	ЗначенияСвойствОбъектов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство.Наименование В(&МассивСвойств)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование,
		|	Значение");
			
		Запрос.УстановитьПараметр("Объект", ИсходнаяСтрока.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("МассивСвойств", МассивСвойств);
			
		РезультатЗапроса = Запрос.Выполнить();
				
		Если НЕ РезультатЗапроса.Пустой() Тогда
					
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если НЕ СтруктураПараметров.Свойство(СоответствиеПараметров["{" + Выборка.Наименование + "}"]) Тогда
					
					СтруктураПараметров.Вставить(СоответствиеПараметров["{" + Выборка.Наименование + "}"], Выборка.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
					
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		НоваяСтрока.Количество = Вычислить(Формула);
		Возврат Истина;
				
	Исключение
				
		НоваяСтрока.Количество = 0;
		
		Если НоваяСтрока.Владелец().Колонки.Найти("Последовательность") = Неопределено Тогда
			
			ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Ошибка расчета количества по формуле.'"), ОписаниеОшибки(), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, Новый Массив, МассивОшибок);
			
		Иначе
			
			ДобавитьВОшибки(СтатусСообщения.Важное, НСтр("ru='Ошибка расчета количества по формуле.'"), ОписаниеОшибки(), ИсходнаяСтрока.Спецификация, СтрокаСпецификации.НомерСтроки, НоваяСтрока.Последовательность, МассивОшибок);
			
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецПопытки
	
КонецФункции // РассчитатьКоличествоПоФормуле()

Процедура УстановитьПараметрыВыходногоИзделия(НоваяСтрока)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВыходныеИзделия.НомерОперацииМаршрута КАК НомерОперацииМаршрута,
	|	ВыходныеИзделия.МинимальнаяПартия КАК МинимальнаяПартия,
	|	ВыходныеИзделия.Кратность КАК Кратность,
	|	ВыходныеИзделия.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВыходныеИзделия.Подразделение КАК Подразделение,
	|	ВыходныеИзделия.РабочийЦентр КАК РабочийЦентр,
	|	ВыходныеИзделия.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыходныеИзделия.НомерСтроки КАК НомерСтроки,
	|		ВыходныеИзделия.НомерОперацииМаршрута КАК НомерОперацииМаршрута,
	|		ВыходныеИзделия.МинимальнаяПартия КАК МинимальнаяПартия,
	|		ВыходныеИзделия.Кратность КАК Кратность,
	|		ВыходныеИзделия.ТочкаМаршрута КАК ТочкаМаршрута,
	|		ВыходныеИзделия.ТочкаМаршрута.Подразделение КАК Подразделение,
	|		ВыходныеИзделия.ТочкаМаршрута.РабочийЦентр КАК РабочийЦентр,
	|		1 КАК Приоритет
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделия
	|	ГДЕ
	|		ВыходныеИзделия.Номенклатура = &Номенклатура
	|		И ВыходныеИзделия.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|		И ВыходныеИзделия.Ссылка = &Спецификация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыходныеИзделия.НомерСтроки,
	|		ВыходныеИзделия.НомерОперацииМаршрута,
	|		ВыходныеИзделия.МинимальнаяПартия,
	|		ВыходныеИзделия.Кратность,
	|		ВыходныеИзделия.ТочкаМаршрута,
	|		ВыходныеИзделия.ТочкаМаршрута.Подразделение,
	|		ВыходныеИзделия.ТочкаМаршрута.РабочийЦентр,
	|		2
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделия
	|	ГДЕ
	|		ВыходныеИзделия.Номенклатура = &Номенклатура
	|		И ВыходныеИзделия.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		И ВыходныеИзделия.Ссылка = &Спецификация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыходныеИзделия.НомерСтроки,
	|		ВыходныеИзделия.НомерОперацииМаршрута,
	|		ВыходныеИзделия.МинимальнаяПартия,
	|		ВыходныеИзделия.Кратность,
	|		ВыходныеИзделия.ТочкаМаршрута,
	|		ВыходныеИзделия.ТочкаМаршрута.Подразделение,
	|		ВыходныеИзделия.ТочкаМаршрута.РабочийЦентр,
	|		3
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделия
	|	ГДЕ
	|		ВыходныеИзделия.Номенклатура = &Номенклатура
	|		И ВыходныеИзделия.Ссылка = &Спецификация) КАК ВыходныеИзделия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ВыходныеИзделия.НомерСтроки");
	
	Запрос.УстановитьПараметр("Спецификация", НоваяСтрока.Спецификация);
	Запрос.УстановитьПараметр("Номенклатура", НоваяСтрока.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНоменклатуры), НоваяСтрока.ХарактеристикаНоменклатуры, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		НоваяСтрока.НомерОперацииМаршрута = "";
		НоваяСтрока.МинимальнаяПартия = 0;
		НоваяСтрока.Кратность = 0;
		НоваяСтрока.ТочкаМаршрута = Справочники.ТочкиМаршрута.ПустаяСсылка();
		НоваяСтрока.Подразделение = НоваяСтрока.ТочкаМаршрута.Подразделение;
		НоваяСтрока.РабочийЦентр = НоваяСтрока.ТочкаМаршрута.РабочийЦентр;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "НомерОперацииМаршрута, МинимальнаяПартия, Кратность, ТочкаМаршрута, Подразделение, РабочийЦентр");
	
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрыВыходногоИзделия()

Функция ПолучитьКоличествоВыпусков(Спецификация, Номенклатура, ХарактеристикаНоменклатуры, Коэффициент, Количество)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВыходныеИзделия.Количество / &Коэффициент КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Приоритет,
	|		ВыходныеИзделияСХарактеристикой.НомерСтроки КАК НомерСтроки,
	|		ВыходныеИзделияСХарактеристикой.Количество * ЕСТЬNULL(ВыходныеИзделияСХарактеристикой.ЕдиницаИзмерения.Коэффициент, 1) КАК Количество
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияСХарактеристикой
	|	ГДЕ
	|		ВыходныеИзделияСХарактеристикой.Ссылка = &Спецификация
	|		И ВыходныеИзделияСХарактеристикой.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияСХарактеристикой.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|		И ВыходныеИзделияСХарактеристикой.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		2,
	|		ВыходныеИзделияБезХарактеристики.НомерСтроки,
	|		ВыходныеИзделияБезХарактеристики.Количество * ЕСТЬNULL(ВыходныеИзделияБезХарактеристики.ЕдиницаИзмерения.Коэффициент, 1)
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияБезХарактеристики
	|	ГДЕ
	|		ВыходныеИзделияБезХарактеристики.Ссылка = &Спецификация
	|		И ВыходныеИзделияБезХарактеристики.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияБезХарактеристики.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		И ВыходныеИзделияБезХарактеристики.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		3,
	|		ВыходныеИзделияБезХарактеристики.НомерСтроки,
	|		ВыходныеИзделияБезХарактеристики.Количество * ЕСТЬNULL(ВыходныеИзделияБезХарактеристики.ЕдиницаИзмерения.Коэффициент, 1)
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияБезХарактеристики
	|	ГДЕ
	|		ВыходныеИзделияБезХарактеристики.Ссылка = &Спецификация
	|		И ВыходныеИзделияБезХарактеристики.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияБезХарактеристики.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		4,
	|		1,
	|		1) КАК ВыходныеИзделия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыходныеИзделия.Приоритет,
	|	ВыходныеИзделия.НомерСтроки");
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ?(ЗначениеЗаполнено(ХарактеристикаНоменклатуры), ХарактеристикаНоменклатуры, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Коэффициент", ?(Коэффициент = 0, 1, Коэффициент));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат УправлениеПланированием.ПолучитьДробь(Количество, Выборка.Количество);
	
КонецФункции // ПолучитьКоличествоВыпусков()

Функция ПолучитьДолюСтоимости(Спецификация, Номенклатура, ХарактеристикаНоменклатуры, Коэффициент)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВыходныеИзделия.ДоляСтоимости / &Коэффициент КАК ДоляСтоимости,
	|	ЕСТЬNULL(ДоляСтоимостиВсехВыходныхИзделийПоСпецификации.ДоляСтоимости, 0) КАК ДоляСтоимостиВсехВыходныхИзделий
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Приоритет,
	|		ВыходныеИзделияСХарактеристикой.НомерСтроки КАК НомерСтроки,
	|		ВыходныеИзделияСХарактеристикой.ДоляСтоимости * ЕСТЬNULL(ВыходныеИзделияСХарактеристикой.ЕдиницаИзмерения.Коэффициент, 1) КАК ДоляСтоимости
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияСХарактеристикой
	|	ГДЕ
	|		ВыходныеИзделияСХарактеристикой.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияСХарактеристикой.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|		И ВыходныеИзделияСХарактеристикой.Ссылка = &Спецификация
	|		И ВыходныеИзделияСХарактеристикой.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		2,
	|		ВыходныеИзделияБезХарактеристики.НомерСтроки,
	|		ВыходныеИзделияБезХарактеристики.ДоляСтоимости * ЕСТЬNULL(ВыходныеИзделияБезХарактеристики.ЕдиницаИзмерения.Коэффициент, 1)
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияБезХарактеристики
	|	ГДЕ
	|		ВыходныеИзделияБезХарактеристики.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияБезХарактеристики.Ссылка = &Спецификация
	|		И ВыходныеИзделияБезХарактеристики.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		И ВыходныеИзделияБезХарактеристики.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		3,
	|		ВыходныеИзделияБезХарактеристики.НомерСтроки,
	|		ВыходныеИзделияБезХарактеристики.ДоляСтоимости * ЕСТЬNULL(ВыходныеИзделияБезХарактеристики.ЕдиницаИзмерения.Коэффициент, 1)
	|	ИЗ
	|		Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделияБезХарактеристики
	|	ГДЕ
	|		ВыходныеИзделияБезХарактеристики.Номенклатура = &Номенклатура
	|		И ВыходныеИзделияБезХарактеристики.Ссылка = &Спецификация
	|		И ВыходныеИзделияБезХарактеристики.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		4,
	|		1,
	|		0) КАК ВыходныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВыходныеИзделия.ДоляСтоимости) КАК ДоляСтоимости
	|		ИЗ
	|			Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК ВыходныеИзделия
	|		ГДЕ
	|			ВыходныеИзделия.Ссылка = &Спецификация
	|			И ВыходныеИзделия.Количество > 0) КАК ДоляСтоимостиВсехВыходныхИзделийПоСпецификации
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыходныеИзделия.Приоритет,
	|	ВыходныеИзделия.НомерСтроки");
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Коэффициент", ?(Коэффициент = 0, 1, Коэффициент));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат УправлениеПланированием.ПолучитьДробь(?(Выборка.ДоляСтоимостиВсехВыходныхИзделий = 0, 0, Выборка.ДоляСтоимости), ?(Выборка.ДоляСтоимостиВсехВыходныхИзделий = 0, 1, Выборка.ДоляСтоимостиВсехВыходныхИзделий));
	
КонецФункции // ПолучитьДолюСтоимости()

Функция ДобавитьСпецификациюВПоследовательность(Спецификация, Последовательность, ПредыдущаяПоследовательность = Неопределено)
	
	Если Спецификация = Неопределено ИЛИ (ТипЗнч(Спецификация) = Тип("СправочникСсылка.СпецификацииНоменклатуры") И Спецификация.Пустая()) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ТипЗнч(Последовательность) <> Тип("Массив") Тогда
		
		Последовательность = Новый Массив;
		
	КонецЕсли;
	
	Если ПредыдущаяПоследовательность <> Неопределено Тогда
				
		Для каждого ЭлементПоследовательности из ПредыдущаяПоследовательность Цикл
			
			Последовательность.Добавить(ЭлементПоследовательности);
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если Последовательность.Найти(Спецификация) <> Неопределено Тогда
			
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(Спецификация) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассиваСпецификаций из Спецификация Цикл
			
			Последовательность.Добавить(ЭлементМассиваСпецификаций);
			
		КонецЦикла;
		
	Иначе
		
		Последовательность.Добавить(Спецификация);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ДобавитьСпецификациюВПоследовательность()

Процедура УстановитьВидВоспроизводства(НоваяСтрока)
	
	Если НоваяСтрока.ВидВоспроизводства = Неопределено ИЛИ НоваяСтрока.ВидВоспроизводства.Пустая() Тогда
		
		Если НоваяСтрока.Номенклатура.ВидВоспроизводства.Пустая() Тогда
			
			НоваяСтрока.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Закупка;
			
		Иначе
			
			НоваяСтрока.ВидВоспроизводства = НоваяСтрока.Номенклатура.ВидВоспроизводства;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидВоспроизводства()

Процедура УстановитьРазузлован(НоваяСтрока, Параметры)
	
	Если НоваяСтрока.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Производство ИЛИ НоваяСтрока.ВидВоспроизводства = Перечисления.ВидыВоспроизводстваНоменклатуры.Переработка Тогда
		НоваяСтрока.Разузлован = Ложь;
	Иначе
		НоваяСтрока.Разузлован = Истина;
	КонецЕсли;
	//{Лео Катанович	 
	    Если Параметры.Свойство("ИспользоватьИсключения") Тогда
 	         Если Параметры.ИспользоватьИсключения Тогда
				 ТаблицаИсключенийРазузлования = ПолучитьТаблицуИсключенийРазузлования();
                 СтруктураПоиска = Новый Структура("Номенклатура", НоваяСтрока.Номенклатура);
		         СтрокиИсключений = ТаблицаИсключенийРазузлования.НайтиСтроки(СтруктураПоиска);
		         Если СтрокиИсключений.Количество() > 0 Тогда
                      НоваяСтрока.Разузлован = Истина;
				 КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	 
  // Лео Катанович}
	
КонецПроцедуры // УстановитьРазузлован()

Процедура ВыполнитьОтбор(Результат, Параметры)
	
	Если ТипЗнч(Параметры.Отбор) <> Тип("Структура") ИЛИ Параметры.Отбор.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Свойство("ПолноеРазузлование") Тогда
		
		МассивУдаляемыхСтрок = Новый Массив;
		
		Для каждого ТекущаяСтрока из Результат.ПолноеРазузлование Цикл
			
			Если НЕ СоответствуетОтбору(Результат.ПолноеРазузлование, ТекущаяСтрока, Параметры.Отбор) Тогда
				
				МассивУдаляемыхСтрок.Добавить(ТекущаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого УдаляемаяСтрока из МассивУдаляемыхСтрок Цикл
			
			Результат.ПолноеРазузлование.Удалить(УдаляемаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Свойство("ВыходныеИзделия") Тогда
		
		МассивУдаляемыхСтрок = Новый Массив;
		
		Для каждого ТекущаяСтрока из Результат.ВыходныеИзделия Цикл
			
			Если НЕ СоответствуетОтбору(Результат.ВыходныеИзделия, ТекущаяСтрока, Параметры.Отбор) Тогда
				
				МассивУдаляемыхСтрок.Добавить(ТекущаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого УдаляемаяСтрока из МассивУдаляемыхСтрок Цикл
			
			Результат.ВыходныеИзделия.Удалить(УдаляемаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Свойство("ИсходныеКомплектующие") Тогда
		
		МассивУдаляемыхСтрок = Новый Массив;
		
		Для каждого ТекущаяСтрока из Результат.ИсходныеКомплектующие Цикл
			
			Если НЕ СоответствуетОтбору(Результат.ИсходныеКомплектующие, ТекущаяСтрока, Параметры.Отбор) Тогда
				
				МассивУдаляемыхСтрок.Добавить(ТекущаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого УдаляемаяСтрока из МассивУдаляемыхСтрок Цикл
			
			Результат.ИсходныеКомплектующие.Удалить(УдаляемаяСтрока);
			
		КонецЦикла;

	КонецЕсли;
	
	Если Результат.Свойство("ВозвратныеОтходы") Тогда
		
		МассивУдаляемыхСтрок = Новый Массив;
		
		Для каждого ТекущаяСтрока из Результат.ВозвратныеОтходы Цикл
			
			Если НЕ СоответствуетОтбору(Результат.ВозвратныеОтходы, ТекущаяСтрока, Параметры.Отбор) Тогда
				
				МассивУдаляемыхСтрок.Добавить(ТекущаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого УдаляемаяСтрока из МассивУдаляемыхСтрок Цикл
			
			Результат.ВозвратныеОтходы.Удалить(УдаляемаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьОтбор()

Функция СоответствуетОтбору(ТаблицаИсточник, ПроверяемаяСтрока, Отбор)
	
	Для каждого ЭлементОтбора из Отбор Цикл
		
		Если ТаблицаИсточник.Колонки.Найти(ЭлементОтбора.Ключ) = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ТипЗнч(ЭлементОтбора.Значение) = Тип("Массив") Тогда
			
			СоответствуетОтбору = Ложь;
			
			Для каждого Значение из ЭлементОтбора.Значение Цикл
				
				Если ПроверяемаяСтрока[ЭлементОтбора.Ключ] = Значение Тогда
					
					СоответствуетОтбору = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ СоответствуетОтбору Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ЭлементОтбора.Значение <> Неопределено Тогда
			
			Если ПроверяемаяСтрока[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // СоответствуетОтбору()

Процедура ИнициализацияРезультатаРазузлования(Результат, Параметры)
	
	Если Результат = Неопределено Тогда
		
		Результат = Новый Структура("ПолноеРазузлование");
		
	ИначеЕсли НЕ Результат.Свойство("ПолноеРазузлование") Тогда
		
		Результат.Вставить("ПолноеРазузлование");
		
	КонецЕсли;
		
	Если НЕ Результат.Свойство("МаксимальныйУровень") Тогда
		
		Результат.Вставить("МаксимальныйУровень", 0);
		
	Иначе
		
		Результат.МаксимальныйУровень = 0;
		
	КонецЕсли;
	
	Если НЕ Результат.Свойство("КоличествоВыпусков") Тогда
		
		Результат.Вставить("КоличествоВыпусков", 0);
		
	Иначе
		
		Результат.КоличествоВыпусков = 0;
		
	КонецЕсли;
	
	Если Результат.Свойство("ПолноеРазузлование") И Результат.ПолноеРазузлование = Неопределено Тогда
		
		Результат.ПолноеРазузлование = Новый ТаблицаЗначений;
		
		Результат.ПолноеРазузлование.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.ПолноеРазузлование.Колонки.Добавить("СопутствующееИзделие", Новый ОписаниеТипов("Булево"));
		Результат.ПолноеРазузлование.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ПолноеРазузлование.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ПолноеРазузлование.Колонки.Добавить("ДоляСтоимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ПолноеРазузлование.Колонки.Добавить("СтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ВидВоспроизводства", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыВоспроизводстваНоменклатуры"));
		Результат.ПолноеРазузлование.Колонки.Добавить("СписаниеКомплектующей", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСписанияКомплектующих"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.ПолноеРазузлование.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ПолноеРазузлование.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ПолноеРазузлование.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		Результат.ПолноеРазузлование.Колонки.Добавить("Последовательность");
		
		Если Результат.Свойство("СопутствующиеИзделия") ИЛИ Параметры.РазмещатьВСопутствующихИзделиях Тогда
			
			Результат.ПолноеРазузлование.Колонки.Добавить("КоличествоТочное", Новый ОписаниеТипов("Число"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.Свойство("ВыходныеИзделия") И Результат.ВыходныеИзделия = Неопределено Тогда
		
		Результат.ВыходныеИзделия = Новый ТаблицаЗначений;
		
		Результат.ВыходныеИзделия.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.ВыходныеИзделия.Колонки.Добавить("СопутствующееИзделие", Новый ОписаниеТипов("Булево"));
		Результат.ВыходныеИзделия.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ВыходныеИзделия.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ВыходныеИзделия.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ВыходныеИзделия.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВыходныеИзделия.Колонки.Добавить("ДоляСтоимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ВыходныеИзделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.ВыходныеИзделия.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ВыходныеИзделия.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ВыходныеИзделия.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		
	КонецЕсли;
	
	Если Результат.Свойство("ИсходныеКомплектующие") И Результат.ИсходныеКомплектующие = Неопределено Тогда
		
		Результат.ИсходныеКомплектующие = Новый ТаблицаЗначений;
		
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("СтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ВидВоспроизводства", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыВоспроизводстваНоменклатуры"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("СписаниеКомплектующей", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСписанияКомплектующих"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ИсходныеКомплектующие.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		
	КонецЕсли;
	
	Если Результат.Свойство("ВозвратныеОтходы") И Результат.ВозвратныеОтходы = Неопределено Тогда
		
		Результат.ВозвратныеОтходы = Новый ТаблицаЗначений;
		
		Результат.ВозвратныеОтходы.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("СуммаРегл", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.ВозвратныеОтходы.Колонки.Добавить("СтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("СписаниеКомплектующей", Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыСписанияКомплектующих"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.ВозвратныеОтходы.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		
	КонецЕсли;
	
	Если (Параметры.РазмещатьВСопутствующихИзделиях И (НЕ Результат.Свойство("СопутствующиеИзделия") ИЛИ Результат.Свойство("СопутствующиеИзделия") И Результат.СопутствующиеИзделия = Неопределено)) ИЛИ (Результат.Свойство("СопутствующиеИзделия") И Результат.СопутствующиеИзделия = Неопределено) Тогда
		
		Если НЕ Результат.Свойство("СопутствующиеИзделия") Тогда
			
			Результат.Вставить("СопутствующиеИзделия");
			
		КонецЕсли;
		
		Результат.СопутствующиеИзделия = Новый ТаблицаЗначений;
		
		Результат.СопутствующиеИзделия.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Разузлован", Новый ОписаниеТипов("Булево"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("СопутствующееИзделие", Новый ОписаниеТипов("Булево"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("НомерОперацииМаршрута", Новый ОписаниеТипов("Строка"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("МинимальнаяПартия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ДоляСтоимости", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("ТочкаМаршрута", Новый ОписаниеТипов("СправочникСсылка.ТочкиМаршрута"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("РабочийЦентр", ПолучитьТипКолонкиРабочийЦентр());
		Результат.СопутствующиеИзделия.Колонки.Добавить("ИсходноеКоличество", Новый ОписаниеТипов("Число"));
		Результат.СопутствующиеИзделия.Колонки.Добавить("КоэффициентПриведения", Новый ОписаниеТипов("Число"));
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализацияРезультатаРазузлования()

Процедура ИнициализацияПараметров(Параметры)
	
	Если Параметры = Неопределено ИЛИ ТипЗнч(Параметры) <> Тип("Структура") Тогда
		
		Параметры = Новый Структура;
		
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ПараметрыВыпуска") Тогда
		
		Параметры.Вставить("ПараметрыВыпуска");
		
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("КоличествоУровнейРазузлования") Тогда
		
		Параметры.Вставить("КоличествоУровнейРазузлования", 0);
		
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ДатаСпецификации") Тогда
		
		Параметры.Вставить("ДатаСпецификации", ТекущаяДата());
		
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Отбор") Тогда
		
		Параметры.Вставить("Отбор", Новый Структура);
		
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("РазмещатьВСопутствующихИзделиях") Тогда
		
		Параметры.Вставить("РазмещатьВСопутствующихИзделиях", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализацияПараметров()

Процедура ДобавитьВОшибки(СтатусОшибки, Причина, ОписаниеОшибки, Спецификация, НомерСтрокиСпецификации, Последовательность, МассивОшибок)
		
	МассивОшибок.Добавить(Новый Структура(
	"СтатусОшибки,
	|Причина,
	|ОписаниеОшибки,
	|Спецификация,
	|НомерСтроки,
	|Последовательность",
	СтатусОшибки,
	Причина,
	ОписаниеОшибки,
	Спецификация,
	НомерСтрокиСпецификации,
	Последовательность));
	
КонецПроцедуры // ДобавитьВОшибки()

//-Разузлование номенклатуры
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////



// Фрешнес
Функция ПолучитьЦенуПоступления(Номенклатура,СерияНоменклатуры,ДатаКон) экспорт
	
	Цена = 0;
	
	Если СерияНоменклатуры = NULL тогда СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() конецЕсли;
	
	//сообщить("++++++++++++++++++++++++++++++++++++++++++++");
	//сообщить(Номенклатура);
	//сообщить(СерияНоменклатуры);
	
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыНаСкладахОбороты.Регистратор КАК ДокПТУ,
	|	ТоварыНаСкладахОбороты.Склад,
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.СерияНоменклатуры,
	|	ТоварыНаСкладахОбороты.КоличествоПриход
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			,
	|			&ДатаКон,
	|			Регистратор,
	//|			Склад = &Склад
	|			Номенклатура = &Номенклатура
	|				И СерияНоменклатуры = &СерияНоменклатуры
	|           ) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	или ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	|"
	;
	//Если ЗначениеЗаполнено(Склад) тогда
	//Текст = Текст + "И	ТоварыНаСкладахОбороты.Склад В (&Склад) "
	//Конецесли;
	Текст = Текст +
	"
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	//Если ЗначениеЗаполнено(Склад) тогда
	//Запрос.УстановитьПараметр("Склад", Склад);
    //КонецЕсли;

   	Запрос.Текст = Текст;

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		
		Запрос = Новый Запрос;
		Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ПоступлениеТоваровУслугТовары.Цена ";
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокПТУ) = Тип("ДокументСсылка.ОприходованиеТоваров") тогда
        Текст = Текст + "
		|ИЗ
		|	Документ.ОприходованиеТоваров.Товары КАК ПоступлениеТоваровУслугТовары";
			
		иначе
        Текст = Текст + "
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары";
		КонецЕсли;
        Текст = Текст + "
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
		|	И ПоступлениеТоваровУслугТовары.СерияНоменклатуры = &СерияНоменклатуры";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
		Запрос.УстановитьПараметр("Ссылка", ВыборкаДетальныеЗаписи.ДокПТУ);
		Запрос.Текст = Текст;
		
		Если НЕ Результат.Пустой() тогда
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи1 = Результат.Выбрать();
			ВыборкаДетальныеЗаписи1.Следующий(); 
			Цена = ВыборкаДетальныеЗаписи1.Цена;
		КонецЕсли;
	КонецЕсли;
	
	// Если цены не находим берем из прайса 
	  Если Цена = 0 или Цена = 1 тогда
	  Цена = ПолучитьЦенуПоПрайсуЛеоНастройки(ДатаКон,Номенклатура,"Фрешнес_ТипЦен");     
	  КонецЕсли;
	
	возврат Цена;
	
	//сообщить(Цена);

	
КонецФункции


//Реестр поступлений Закупки
//ВидВалюты: 1 - GBP, 2 - USD, 3 - EUR
Функция ПолучитьЦенуВалютыНаДату(ВидВалюты,Цена,ДатаКурса) экспорт
	
	ЦенаВзаиморасчетов = 0;
	//GBP		
	Если ВидВалюты = 1 тогда	
		ВалютаВзаиморасчетов =  Справочники.Валюты.НайтиПоКоду("826");
		СтруктураКурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", ВалютаВзаиморасчетов));
		
		//USD
	ИначеЕсли ВидВалюты = 2 тогда	
		ВалютаВзаиморасчетов =  Справочники.Валюты.НайтиПоКоду("840");
		СтруктураКурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", ВалютаВзаиморасчетов));
		
		//EUR
	ИначеЕсли ВидВалюты = 3 тогда	
		ВалютаВзаиморасчетов =  Справочники.Валюты.НайтиПоКоду("978");
		СтруктураКурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", ВалютаВзаиморасчетов));
	КонецЕсли;
	
	
	ЦенаВзаиморасчетов   = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Цена, Справочники.Валюты.НайтиПоКоду("643"),
	ВалютаВзаиморасчетов,
	1, СтруктураКурсВалюты.Курс,
	1, 1); 
	

	возврат ЦенаВзаиморасчетов;
	
КонецФункции


Функция п_ПолучитьЦенуВалютыНаДату(ВидВалюты,Цена,ДатаКурса,Контрагент,СуммаУпрПриход) экспорт
	
	//Если была оплата, то берем курс на дату оплаты
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОбороты.Контрагент,
		|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовПриход,
		|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаУпрПриход,
		|	ВзаиморасчетыСКонтрагентамиОбороты.Регистратор,
		|	ВзаиморасчетыСКонтрагентамиОбороты.Период
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, , Регистратор, Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОбороты
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОбороты.СуммаУпрПриход = &СуммаУпрПриход";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СуммаУпрПриход", СуммаУпрПриход);

	Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() тогда 
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
    ДатаКурса = ВыборкаДетальныеЗаписи.Период;	
	КонецЕсли;
	///////////////////////////////////////////////////////////
	
	
	
	ЦенаВзаиморасчетов = 0;
	//GBP		
	Если ВидВалюты = 1 тогда	
		ВалютаВзаиморасчетов =  Справочники.Валюты.НайтиПоКоду("826");
		СтруктураКурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", ВалютаВзаиморасчетов));
		
		//USD
	ИначеЕсли ВидВалюты = 2 тогда	
		ВалютаВзаиморасчетов =  Справочники.Валюты.НайтиПоКоду("840");
		СтруктураКурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", ВалютаВзаиморасчетов));
		
		//EUR
	ИначеЕсли ВидВалюты = 3 тогда	
		ВалютаВзаиморасчетов =  Справочники.Валюты.НайтиПоКоду("978");
		СтруктураКурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", ВалютаВзаиморасчетов));
	КонецЕсли;
	
	
	ЦенаВзаиморасчетов   = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Цена, Справочники.Валюты.НайтиПоКоду("643"),
	ВалютаВзаиморасчетов,
	1, СтруктураКурсВалюты.Курс,
	1, 1); 
	

	возврат ЦенаВзаиморасчетов;
	
КонецФункции



Функция ПолучитьСтавкуНДСПоСуммам(Сумма,СуммаБезНДС) экспорт
	
	СтавкаНДС = Окр((Сумма - СуммаБезНДС)*100 / СуммаБезНДС);
	
	Если СтавкаНДС = 18 тогда
		_НДС = перечисления.СтавкиНДС.НДС18;
	ИначеЕсли СтавкаНДС = 20 тогда
	    _НДС = перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДС = 10 тогда
		_НДС = перечисления.СтавкиНДС.НДС10;		
	ИначеЕсли СтавкаНДС = 5 тогда
	    _НДС = перечисления.СтавкиНДС.НДС5;	
	ИначеЕсли СтавкаНДС = 7 тогда
		_НДС = перечисления.СтавкиНДС.НДС7;	
	ИначеЕсли СтавкаНДС = 0 тогда
		_НДС = перечисления.СтавкиНДС.БезНДС;		
	Конецесли;	
	
	возврат _НДС;
	
КонецФункции	
	


// СебестоимостьСиМ_РН_ЛеоУчетЗатрат_1
Функция ПолучитьЦенуПоступленияПоследнююПоНоменклатуре(Номенклатура,ДатаКон) экспорт
	
	Цена = 0;
	
	//Если СерияНоменклатуры = NULL тогда СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка() конецЕсли;
	
	//сообщить("++++++++++++++++++++++++++++++++++++++++++++");
	//сообщить(Номенклатура);
	//сообщить(СерияНоменклатуры);
	
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыНаСкладахОбороты.Регистратор КАК ДокПТУ,
	|	ТоварыНаСкладахОбороты.Склад,
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.СерияНоменклатуры,
	|	ТоварыНаСкладахОбороты.КоличествоПриход
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			,
	|			&ДатаКон,
	|			Регистратор,
	//|			Склад = &Склад
	|			Номенклатура = &Номенклатура
	|           ) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	или ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
	|"
	;
	//Если ЗначениеЗаполнено(Склад) тогда
	//Текст = Текст + "И	ТоварыНаСкладахОбороты.Склад В (&Склад) "
	//Конецесли;
	Текст = Текст +
	"
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Если ЗначениеЗаполнено(Склад) тогда
	//Запрос.УстановитьПараметр("Склад", Склад);
    //КонецЕсли;

   	Запрос.Текст = Текст;

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		
		Запрос = Новый Запрос;
		Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ПоступлениеТоваровУслугТовары.Цена ";
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокПТУ) = Тип("ДокументСсылка.ОприходованиеТоваров") тогда
        Текст = Текст + "
		|ИЗ
		|	Документ.ОприходованиеТоваров.Товары КАК ПоступлениеТоваровУслугТовары";
			
		иначе
        Текст = Текст + "
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары";
		КонецЕсли;
        Текст = Текст + "
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура";
		
		
		
	Текст = Текст +
	"
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Ссылка", ВыборкаДетальныеЗаписи.ДокПТУ);
		Запрос.Текст = Текст;
		
		Если НЕ Результат.Пустой() тогда
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи1 = Результат.Выбрать();
			ВыборкаДетальныеЗаписи1.Следующий(); 
			Цена = ВыборкаДетальныеЗаписи1.Цена;
		КонецЕсли;
	КонецЕсли;
	
	// Если цены не находим берем из прайса 
	  Если Цена = 0 или Цена = 1 тогда
	  Цена = ПолучитьЦенуПоПрайсуЛеоНастройки(ДатаКон,Номенклатура,"Фрешнес_ТипЦен");     
	  КонецЕсли;
	
	возврат Цена;
	
	//сообщить(Цена);

	
КонецФункции


//Анализ списаний

Функция ПолучитьЦенуПоПрайсуЛеоНастройки(ДатаКон,_Номенклатура,назТипЦен) экспорт
	
	_Цена = 0;
	
	_ТипЦен = Справочники.Лео_Настройки.НайтиПоНаименованию(назТипЦен);
	Если НЕ _ТипЦен.Пустая() и _ТипЦен.Использовать тогда
		_ТипЦен = _ТипЦен._Ссылка;
		  сПараметров = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаКон,Новый Структура("ТипЦен,Номенклатура",_ТипЦен,_Номенклатура));
		
		  _Цена = сПараметров.Цена;
		
		
		
		
	КонецЕсли;	  
	
	Возврат _Цена;
	
	
КонецФункции


////////////////////////////////////////////////////////////
Функция Лео_ПолучитьЦенуПоПрайсуТипЦен(ДатаКон,_Номенклатура,_ТипЦен) экспорт
	
	_Цена = 0;
	
	//_ТипЦен = Справочники.Лео_Настройки.НайтиПоНаименованию(назТипЦен);
	Если НЕ _ТипЦен.Пустая() тогда
		//_ТипЦен = _ТипЦен._Ссылка;
		  сПараметров = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаКон,Новый Структура("ТипЦен,Номенклатура",_ТипЦен,_Номенклатура));
		
		  _Цена = сПараметров.Цена;
		
		
		
		
	КонецЕсли;	  
	
	Возврат _Цена;
	
	
КонецФункции

Функция Лео_ПолучитьЦенуПоПрайсуСтатусный(ДатаКон,_Номенклатура,Договор) экспорт
	
	_Цена = 0;
	
    _Цена =  Лео_ПолучитьСтруктуруЦенПоДоговору(ДатаКон,_Номенклатура,Договор).СтатуснаяЦена;

	Возврат _Цена;
	
	
КонецФункции

Функция Лео_ПолучитьЦенуПоПрайсуСоСкидкой(ДатаКон,_Номенклатура,Договор) экспорт
	
	_Цена = 0;
	
    _Цена =  Лео_ПолучитьСтруктуруЦенПоДоговору(ДатаКон,_Номенклатура,Договор).СкидкаЦена;

	Возврат _Цена;
	
	
КонецФункции


Функция Лео_ПолучитьНаименованиеПоПрайсуСтатусный(ДатаКон,_Номенклатура,Договор) экспорт
	
	
    ТипЦен =  Лео_ПолучитьСтруктуруЦенПоДоговору(ДатаКон,_Номенклатура,Договор).СтатуснаяЦенаНаименование;

	Возврат ТипЦен;
	
	
КонецФункции

Функция Лео_ПолучитьНаименованиеПоПрайсуСоСкидкой(ДатаКон,_Номенклатура,Договор) экспорт
	
	
    ТипЦен =  Лео_ПолучитьСтруктуруЦенПоДоговору(ДатаКон,_Номенклатура,Договор).СкидкаЦенаНаименование;

	Возврат ТипЦен;
	
	
КонецФункции

Функция Лео_ПолучитьСтруктуруЦенПоДоговору (ДатаКон,_Номенклатура,Договор) экспорт
	
	//_Цена = 0;
	
    сЦен = Новый Структура();
	сЦен.Вставить("СтатуснаяЦена",0);
	сЦен.Вставить("СкидкаЦена",0);

	сЦен.Вставить("СтатуснаяЦенаНаименование",Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());
	сЦен.Вставить("СкидкаЦенаНаименование",Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());
	
	
	//_ТипЦен = Справочники.Лео_Настройки.НайтиПоНаименованию(назТипЦен);
	Если НЕ Договор.Пустая() тогда
		//_ТипЦен = _ТипЦен._Ссылка;
		
		
		
		  сПараметров = РегистрыСведений.Лео_СкидкиОтБазовыеЦены.ПолучитьПоследнее(ДатаКон,Новый Структура("Договор",Договор));
		
		  сЦен.СтатуснаяЦена = Лео_ПолучитьЦенуПоПрайсуТипЦен(ДатаКон,_Номенклатура,сПараметров.СтатусныйТипЦен);
		  сЦен.СкидкаЦена = Лео_ПолучитьЦенуПоПрайсуТипЦен(ДатаКон,_Номенклатура,сПараметров.ТипЦенСоСкидкой);
		   
		  сЦен.СтатуснаяЦенаНаименование = сПараметров.СтатусныйТипЦен;
		  сЦен.СкидкаЦенаНаименование    = сПараметров.ТипЦенСоСкидкой;
		  
		  
		
	КонецЕсли;	  
	
	Возврат сЦен;
	
	
КонецФункции






Функция ПолучитьЦенуПоПрайсуЛеоНастройкиЗапрос(ДатаКон,_Артикул,назТипЦен) экспорт
	
	_Цена = 0;
	
	_ТипЦен = Справочники.Лео_Настройки.НайтиПоНаименованию(назТипЦен);
	Если НЕ _ТипЦен.Пустая() и _ТипЦен.Использовать тогда
		_ТипЦен = _ТипЦен._Ссылка;
		//  сПараметров = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаКон,Новый Структура("ТипЦен,Номенклатура",_ТипЦен,_Номенклатура));
		//
		//  _Цена = сПараметров.Цена;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПометкаУдаления
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура.Артикул = &Артикул
		|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних";
		
		Запрос.УстановитьПараметр("Артикул", _Артикул);
		Запрос.УстановитьПараметр("ТипЦен", _ТипЦен);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() тогда
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий(); 
			_Цена = ВыборкаДетальныеЗаписи.Цена;
		КонецЕсли;
		
	КонецЕсли;	  
	
	Возврат _Цена;
	
	
КонецФункции




Функция ПолучитьЦенуПоПрайсуЛеоНастройкиЗапросСФОТ(ДатаКон,_Артикул,Ном,назТипЦен,назТипЦенФОТ,_АртикулПродукция) экспорт
	
	_Цена = 0;
	
	_ТипЦен = Справочники.Лео_Настройки.НайтиПоНаименованию(назТипЦен);
	_ТипЦенФОТ = Справочники.Лео_Настройки.НайтиПоНаименованию(назТипЦенФОТ);
	
	_ВидНоменклатуры = Ном.ВидНоменклатуры;
	
	Если НЕ _ТипЦен.Пустая() и _ТипЦен.Использовать тогда
		_ТипЦен = _ТипЦен._Ссылка;
		_ТипЦенФОТ = _ТипЦенФОТ._Ссылка;
		
		//  сПараметров = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаКон,Новый Структура("ТипЦен,Номенклатура",_ТипЦен,_Номенклатура));
		//
		//  _Цена = сПараметров.Цена;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПометкаУдаления
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура.Артикул = &Артикул
		|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних";
		
		
		
		Если Лев(СокрЛП(_ВидНоменклатуры),3) = "ФОТ" тогда
		Запрос.УстановитьПараметр("ТипЦен", _ТипЦенФОТ);
		Запрос.УстановитьПараметр("Артикул", _АртикулПродукция);
		
		    иначе
		Запрос.УстановитьПараметр("ТипЦен", _ТипЦен);
		Запрос.УстановитьПараметр("Артикул", _Артикул);
		
		КонецЕсли;
		
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() тогда
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий(); 
			_Цена = ВыборкаДетальныеЗаписи.Цена;
		КонецЕсли;
		
	КонецЕсли;	  
	
	Возврат _Цена;
	
	
КонецФункции




// Товары на складах (Комплектующие)
Функция пПолучитьПартиюПТУ(ДатаКон,Номенклатура,СерияНоменклатуры,Склад)экспорт
	
	мСтруктура = Новый Структура;


	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТоварыНаСкладахОбороты.Регистратор как ДокПТУ,
		|	ТоварыНаСкладахОбороты.Регистратор.Контрагент как Контрагент,
		|	ТоварыНаСкладахОбороты.Склад,
		|	ТоварыНаСкладахОбороты.Номенклатура,
		|	ТоварыНаСкладахОбороты.СерияНоменклатуры,
		|	ТоварыНаСкладахОбороты.КоличествоПриход
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(
		|			,
		|			&ДатаКон,
		|			Регистратор,
		|			Номенклатура = &Номенклатура
		|				И СерияНоменклатуры = &СерияНоменклатуры
		|				И Склад = &Склад) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|	И ТоварыНаСкладахОбороты.КоличествоПриход > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыНаСкладахОбороты.Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);

	Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
	мСтруктура.Вставить("Контрагент",Выборка.Контрагент);	
	мСтруктура.Вставить("ДокПТУ",Выборка.ДокПТУ);	
	
    иначе
	
	мСтруктура.Вставить("Контрагент",Справочники.Контрагенты.ПустаяСсылка());	
	мСтруктура.Вставить("ДокПТУ",документы.ПоступлениеТоваровУслуг.ПустаяСсылка());	
	
	
    КонецЕсли;
	
	возврат мСтруктура
	
КонецФункции	


// РН Лео_Продажи
Процедура _СформироватьДвиженияПоРН_Лео_Продажи(ДокПродажи)
	
	Движения = ДокПродажи.Движения.Лео_Продажи;
	Движения.Записывать = Истина;
	
	
	Если ТипЗнч(ДокПродажи) = Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда
		
		ТЗ = ДокПродажи.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура,СерияНоменклатуры,ХарактеристикаНоменклатуры,ЗаказПокупателя","Количество,Сумма,СуммаНДС");
		ТЗ.колонки.Добавить("Стоимость");
		ТЗ.колонки.Добавить("НДС");
		Для каждого тт из ТЗ цикл
			тт.Стоимость = тт.Сумма;
			тт.НДС = тт.СуммаНДС;
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(ДокПродажи) = Тип("ДокументОбъект.КорректировкаРеализации") тогда
		ТЗ = ДокПродажи.Движения.Продажи.Выгрузить();
		ТЗ.Колонки.Добавить("СерияНоменклатуры");
		Для каждого нн из ТЗ цикл
			мПоиска = ДокПродажи.Товары.Найти(нн.Номенклатура,"Номенклатура");
			Если мПоиска <> неопределено тогда
			нн.СерияНоменклатуры = мПоиска.СерияНоменклатуры;		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Для каждого сс из ТЗ цикл
		Движение =  Движения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,сс);
		Если ДокПродажи.СуммаВключаетНДС тогда
			Движение.СтоимостьБезНДС = сс.Стоимость - сс.НДС;
		иначе
			Движение.СтоимостьБезНДС = сс.Стоимость;
		Конецесли;
		Движение.Период      = ДокПродажи.Дата;
		Движение.Организация = ДокПродажи.Организация;
		Движение.Контрагент  = ДокПродажи.Контрагент;
		Движение.ДоговорКонтрагента = ДокПродажи.ДоговорКонтрагента;
		Движение.ДокументПродажи    = ДокПродажи.Ссылка;
		Движение.Проект             = ДокПродажи.Проект;
		Движение.Подразделение      = ДокПродажи.Подразделение;
		
		Движение.НДС = сс.НДС;
		Движение.СтоимостьБезСкидок = Движение.СтоимостьБезНДС;
	КонецЦикла;
	

	
	
КонецПроцедуры	


// Лео_ПартияНоменклатуры

Процедура Лео_СформироватьЗаписи_Лео_ПартияНоменклатуры(Источник,Отказ)
	
	// Чистим движения по док Оприходования
	НаборЗаписей = РегистрыСведений.Лео_ПартияНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОприходования.Установить(Источник.Ссылка);
	НаборЗаписей.Записать();
	
	// Заполняем РС
	  ТЗтовары = Источник.Товары.Выгрузить();
	  ТЗтовары.Свернуть("Номенклатура,СерияНоменклатуры,Цена,СтавкаНДС","Количество,Сумма,СуммаНДС");
	  
	  Для каждого сс из ТЗтовары цикл
	  НоваяЗапись = РегистрыСведений.Лео_ПартияНоменклатуры.СоздатьМенеджерЗаписи();
	
		НоваяЗапись.Период                = НачалоДня(Источник.Дата);
		НоваяЗапись.Склад                 = Источник.СкладОрдер;
		НоваяЗапись.Контрагент            = Источник.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = Источник.ДоговорКонтрагента;
		НоваяЗапись.ЗаказПоставщику       = Источник.Сделка;
		НоваяЗапись.ДокументОприходования = Источник.Ссылка;
		
		НоваяЗапись.Номенклатура          = сс.Номенклатура;
		НоваяЗапись.СерияНоменклатуры     = сс.СерияНоменклатуры;
		НоваяЗапись.Количество            = сс.Количество;
		//НоваяЗапись.Цена                  = сс.Цена  * ?(Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643"),1,Источник.КурсВзаиморасчетов);
		//НоваяЗапись.Стоимость             = сс.Сумма * ?(Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643"),1,Источник.КурсВзаиморасчетов);
		
		
		ЦенаНДС  = УчетНДС.РассчитатьСуммуНДС(сс.Цена,Источник.УчитыватьНДС,Источник.СуммаВключаетНДС,УчетНДС.ПолучитьСтавкуНДС(сс.СтавкаНДС));
		
		//СуммаНДС = УчетНДС.РассчитатьСуммуНДС(сс.Сумма,Источник.УчитыватьНДС,Источник.СуммаВключаетНДС,сс.СтавкаНДС);
		Если (Источник.УчитыватьНДС) и (Источник.СуммаВключаетНДС) тогда // включает
			
			//ЦенаНДС =  ?(Источник.СуммаВключаетНДС,ЦенаНДС,0);
			//СуммаНДС = ?(Источник.СуммаВключаетНДС,сс.СуммаНДС,0);
			
			Цена      = сс.Цена - ЦенаНДС;
			Стоимость = сс.Сумма - сс.СуммаНДС;
			
			ЦенаСНДС      = сс.Цена;
			СтоимостьСНДС = сс.Сумма;
			
			
		ИначеЕсли (Источник.УчитыватьНДС) и НЕ(Источник.СуммаВключаетНДС) тогда // сверху
			
			Цена      = сс.Цена;
			Стоимость = сс.Сумма;
			
			ЦенаСНДС      = сс.Цена + ЦенаНДС;
			СтоимостьСНДС = сс.Сумма + сс.СуммаНДС;
			
			
		иначе	
			
			Цена      = сс.Цена;
			Стоимость = сс.Сумма;
			
			ЦенаСНДС      = сс.Цена;
			СтоимостьСНДС = сс.Сумма;
			
			
		КонецЕсли;	
			

		НоваяЗапись.Цена                  = (Цена)  * ?(Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643"),1,Источник.КурсВзаиморасчетов);
		НоваяЗапись.Стоимость             = (Стоимость) * ?(Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643"),1,Источник.КурсВзаиморасчетов);
		
		НоваяЗапись.ЦенаСНДС              = (ЦенаСНДС)  * ?(Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643"),1,Источник.КурсВзаиморасчетов);
		НоваяЗапись.СтоимостьСНДС         = (СтоимостьСНДС) * ?(Источник.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643"),1,Источник.КурсВзаиморасчетов);
		
		
		НоваяЗапись.Записать(Истина);

	  КонецЦикла;
	
	
КонецПроцедуры

Процедура Лео_ПоступлениеОтменаПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
	  
	  Набор = РегистрыСведений.Лео_ПартияНоменклатуры.СоздатьНаборЗаписей();
	  Набор.Отбор.ДокументОприходования.Установить(Источник.Ссылка);
	  Набор.Записать();
	
КонецПроцедуры


// Подбор серий в Документ ПеремещениеТоваров на основании Внутреннего заказа

// Возвращает таблицу остатков по сериям на заданом складе в заданной организации.
// Используется при заполении по кнопке "Заполнить и провести" в документах, списывающих товары.
//
// Параметры:
//  Склад              - склад, на котором получаются остатки,
//  Организация        - организация, по которой получаются остатки
//  МассивНоменклатуры - массив, содержащий номенклатуру, по которой необходимо получить остатки
//
Функция Лео_ПолучитьТаблицуОстатковПоСериям(_тВнутреннийЗаказ, СкладДоговор, Организация, МассивНоменклатуры, Комиссионер = Неопределено, НТТ = Ложь, ТаблицаРезервовПоСериям=неопределено,КонДата=неопределено) Экспорт

	//Если НТТ Тогда
	//	Возврат ПолучитьТаблицуОстатковПоСериямДляНТТ(СкладДоговор, МассивНоменклатуры,?(КонДата=неопределено,Дата("00010101000000"),КонДата));
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Запрос.УстановитьПараметр("Новый",        Справочники.Качество.Новый);
	Запрос.УстановитьПараметр("КонДата",      ?(КонДата=неопределено,Дата("00010101000000"),КонДата));
	
	Если Комиссионер = Неопределено Тогда
		Если ТипЗнч(СкладДоговор) = Тип("Массив") Тогда
			МассивСклады = СкладДоговор;
		Иначе
			МассивСклады = Новый Массив;
			МассивСклады.Добавить(СкладДоговор);
		КонецЕсли;
		
		ИмяРегистра = "ТоварыНаСкладах";
		
		Запрос.УстановитьПараметр("Комиссионер",        Справочники.Контрагенты.ПустаяСсылка());
		Запрос.УстановитьПараметр("Склад",              МассивСклады);
	Иначе
		ИмяРегистра = "ТоварыПереданные";
		Запрос.УстановитьПараметр("Комиссионер",        Комиссионер);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", СкладДоговор);
		МассивСклады = Новый Массив;
		МассивСклады.Добавить(Справочники.Склады.ПустаяСсылка());
		Запрос.УстановитьПараметр("Склад",              МассивСклады);
	КонецЕсли;
	МожноПревышатьОстатокПоОрганизации=УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(Организация);
	КонтролироватьОстатокПоОрганизацииПоСкладу = ложь;
	СтруктураУП = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиУпр(ТекущаяДата(), Ложь);
	Если ЗначениеЗаполнено(СтруктураУП) Тогда
		КонтролироватьОстатокПоОрганизацииПоСкладу = СтруктураУП.ВестиУчетТоваровОрганизацийВРазрезеСкладов;
	КонецЕсли;
		
	ТекстЗапросаПоОрганизации = "
	|ВЫБРАТЬ 
	|   истина 						   								   КАК флОстатокОрганизации,
	|	ТоварыОрганизацийОстатки.Номенклатура                          КАК Номенклатура,
	|	ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры            КАК ХарактеристикаНоменклатуры,
	|	ТоварыОрганизацийОстатки.СерияНоменклатуры                     КАК СерияНоменклатуры,
	|	ТоварыОрганизацийОстатки.СерияНоменклатуры.СрокГодности        КАК СрокГодности,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыОрганизацийОстатки.СерияНоменклатуры)      КАК СерияНоменклатурыПредставление,
	|	ТоварыОрганизацийОстатки.Качество                              КАК Качество,
	|	ТоварыОрганизацийОстатки.Склад                                 КАК Склад,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток                     КАК Остаток,
	|	ТоварыКПередачеОрганизацийОрганизацийОстатки.КоличествоОстаток КАК ОстатокКПередаче
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(&КонДата,
	|"+ ?(МожноПревышатьОстатокПоОрганизации, "", "		    Организация                = &Организация
	|		  И") + " Номенклатура               В (&Номенклатура)
	|		  И Комиссионер                = &Комиссионер
	|	  	  "+?(КонтролироватьОстатокПоОрганизацииПоСкладу,"И Склад В (&Склад)","")+"
	|	) КАК ТоварыОрганизацийОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки(&КонДата,
	|"+ ?(МожноПревышатьОстатокПоОрганизации,"","		    Организация                = &Организация
	|		  И") + " Номенклатура               В (&Номенклатура)
	|	  	  "+?(КонтролироватьОстатокПоОрганизацииПоСкладу,"И Склад В (&Склад)","")+"
	|	) КАК ТоварыКПередачеОрганизацийОрганизацийОстатки
	|ПО
	|	ТоварыОрганизацийОстатки.Номенклатура                 = ТоварыКПередачеОрганизацийОрганизацийОстатки.Номенклатура
	|	И ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры = ТоварыКПередачеОрганизацийОрганизацийОстатки.ХарактеристикаНоменклатуры
	|	И ТоварыОрганизацийОстатки.СерияНоменклатуры          = ТоварыКПередачеОрганизацийОрганизацийОстатки.СерияНоменклатуры
	|	И ТоварыОрганизацийОстатки.Организация = ТоварыКПередачеОрганизацийОрганизацийОстатки.Организация
	|	И ТоварыОрганизацийОстатки.Качество                   = ТоварыКПередачеОрганизацийОрганизацийОстатки.Качество
	|	И ТоварыОрганизацийОстатки.Склад                      = ТоварыКПередачеОрганизацийОрганизацийОстатки.Склад";

	Если Комиссионер = Неопределено Тогда
		Если ИмяРегистра = "ТоварыНаСкладах" Тогда
			ТекстЗапросаСклады = "
			|(ВЫБРАТЬ
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
			|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
			|	ТоварыНаСкладахОстатки.Качество,
			|	ТоварыНаСкладахОстатки.Склад,
			|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТоварыНаСкладах.Номенклатура,
			|		ТоварыНаСкладах.ХарактеристикаНоменклатуры,
			|		ТоварыНаСкладах.СерияНоменклатуры,
			|		ТоварыНаСкладах.Качество,
			|		ТоварыНаСкладах.Склад,
			|		ТоварыНаСкладах.КоличествоОстаток
			|	ИЗ
			|		РегистрНакопления.ТоварыНаСкладах.Остатки(&КонДата, Склад В (&Склад)
			|		   И Номенклатура В (&Номенклатура)) ТоварыНаСкладах
			|	ОБЪЕДИНИТЬ ВСЕ
			|	ВЫБРАТЬ
			|		ТоварыВРознице.Номенклатура,
			|		ТоварыВРознице.ХарактеристикаНоменклатуры,
			|		ТоварыВРознице.СерияНоменклатуры,
			|		ТоварыВРознице.Качество,
			|		ТоварыВРознице.Склад,
			|		ТоварыВРознице.КоличествоОстаток
			|	ИЗ
			|		РегистрНакопления.ТоварыВРознице.Остатки(&КонДата, Склад В (&Склад)
			|		   И Номенклатура В (&Номенклатура)) ТоварыВРознице
			|	) КАК ТоварыНаСкладахОстатки
			|	СГРУППИРОВАТЬ ПО
			|		ТоварыНаСкладахОстатки.Номенклатура,
			|		ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
			|		ТоварыНаСкладахОстатки.СерияНоменклатуры,
			|		ТоварыНаСкладахОстатки.Качество,
			|		ТоварыНаСкладахОстатки.Склад
			|) ТоварыНаСкладахОстатки
			|";
		Иначе
			ТекстЗапросаСклады = "
			|	РегистрНакопления.ТоварыПереданные.Остатки(&КонДата, Номенклатура В (&Номенклатура)) КАК ТоварыНаСкладахОстатки
			|";
		КонецЕсли;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.флОстатокОрганизации 							 КАК флОстатокОрганизации,
		|	ВложенныйЗапрос.Номенклатура                                     КАК Номенклатура,
		|	ВложенныйЗапрос.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентХраненияОстатков,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
		|	ВложенныйЗапрос.СерияНоменклатуры                                КАК СерияНоменклатуры,
		|	ВложенныйЗапрос.СерияНоменклатуры.СрокГодности                   КАК СрокГодности,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияНоменклатуры)	  			 КАК СерияНоменклатурыПредставление,
		|	ВложенныйЗапрос.Качество                                         КАК Качество,
		|	ВложенныйЗапрос.Склад                                            КАК Склад,
		|	МИНИМУМ(ВложенныйЗапрос.Остаток)                                 КАК Остаток," 
		+ ?(ИмяРегистра = "ТоварыНаСкладах", "
		|	МИНИМУМ(ВложенныйЗапрос.ОстатокКПередаче)                        КАК ОстатокКПередаче", "
		|	0                                                                КАК ОстатокКПередаче") + "
		|ИЗ
		|	(ВЫБРАТЬ
		|	ложь 												  КАК флОстатокОрганизации,
		|	ТоварыНаСкладахОстатки.Номенклатура                   КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры     КАК ХарактеристикаНоменклатуры,
		|	ТоварыНаСкладахОстатки.СерияНоменклатуры              КАК СерияНоменклатуры,
		|	ТоварыНаСкладахОстатки.СерияНоменклатуры.СрокГодности КАК СрокГодности,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыНаСкладахОстатки.СерияНоменклатуры) КАК СерияНоменклатурыПредставление,
		|	"+ ?(ИмяРегистра = "ТоварыНаСкладах", "ТоварыНаСкладахОстатки.Качество", "&Новый") + " КАК Качество,
		|	"+ ?(ИмяРегистра <> "ТоварыПереданные", "ТоварыНаСкладахОстатки.Склад",     "NULL")  + " КАК Склад,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток              КАК Остаток,"
		+ ?(ИмяРегистра = "ТоварыНаСкладах", "
		|	ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток     КАК ОстатокКПередаче", "
		|	0                                                     КАК ОстатокКПередаче") + "
		|ИЗ
		|" + ТекстЗапросаСклады + ?(ИмяРегистра = "ТоварыНаСкладах","
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&КонДата,
		|		Склад В (&Склад)
		|	  И Номенклатура               В (&Номенклатура)
		|	) КАК ТоварыКПередачеСоСкладовОстатки
		|ПО
		|	ТоварыНаСкладахОстатки.Номенклатура               = ТоварыКПередачеСоСкладовОстатки.Номенклатура
		|	И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
		|	И ТоварыНаСкладахОстатки.СерияНоменклатуры          = ТоварыКПередачеСоСкладовОстатки.СерияНоменклатуры
		|	И ТоварыНаСкладахОстатки.Качество                   = ТоварыКПередачеСоСкладовОстатки.Качество
		|", "
		|") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|"
		+ ТекстЗапросаПоОрганизации + ") КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.флОстатокОрганизации,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|	ВложенныйЗапрос.СерияНоменклатуры,
		|	ВложенныйЗапрос.Качество,
		|	ВложенныйЗапрос.Склад
		|";

	Иначе
		
		Запрос.Текст = СтрЗаменить(ТекстЗапросаПоОрганизации,"ВЫБРАТЬ","ВЫБРАТЬ РАЗРЕШЕННЫЕ");
		
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();

	// Таблица остатков по организации
	ТаблицаПоОрганизации = РезультатЗапроса.Выгрузить();
	
	Если Комиссионер = Неопределено Тогда
		Сч = 0;
		Пока Сч < ТаблицаПоОрганизации.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоОрганизации.Получить(Сч);
			Если не СтрокаТаблицы.флОстатокОрганизации Тогда
				ТаблицаПоОрганизации.Удалить(СтрокаТаблицы);
			Иначе
				Если ЗначениеЗаполнено(СтрокаТаблицы.ОстатокКПередаче) Тогда
					СтрокаТаблицы.Остаток = Макс(СтрокаТаблицы.Остаток - СтрокаТаблицы.ОстатокКПередаче,0);
				КонецЕсли;
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;

		// Таблица остатков на складах
		ТаблицаПоСкладам = РезультатЗапроса.Выгрузить();
		Сч = 0;
		Пока Сч < ТаблицаПоСкладам.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоСкладам.Получить(Сч);
			Если СтрокаТаблицы.флОстатокОрганизации Тогда
				ТаблицаПоСкладам.Удалить(СтрокаТаблицы);
			Иначе
				Если ЗначениеЗаполнено(СтрокаТаблицы.ОстатокКПередаче) Тогда
					СтрокаТаблицы.Остаток = СтрокаТаблицы.Остаток - СтрокаТаблицы.ОстатокКПередаче;
				КонецЕсли;
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;

		// Корректировка остатков склада
		Если не МожноПревышатьОстатокПоОрганизации Тогда
			Для Каждого СтрокаОрганизации ИЗ ТаблицаПоОрганизации Цикл

				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура",               СтрокаОрганизации.Номенклатура);
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаОрганизации.ХарактеристикаНоменклатуры);
				СтруктураПоиска.Вставить("СерияНоменклатуры",          СтрокаОрганизации.СерияНоменклатуры);
				СтруктураПоиска.Вставить("Качество",                   СтрокаОрганизации.Качество);
				Если КонтролироватьОстатокПоОрганизацииПоСкладу и ЗначениеЗаполнено(СтрокаОрганизации.Склад) Тогда
					СтруктураПоиска.Вставить("Склад",                   СтрокаОрганизации.Склад);
				КонецЕсли;
				
				СтрокиПоСкладам      = ТаблицаПоСкладам.НайтиСтроки(СтруктураПоиска);
				ОстатокПоОрганизации = ?(НЕ ЗначениеЗаполнено(СтрокаОрганизации.Остаток), 0, СтрокаОрганизации.Остаток);

				Для Каждого СтрокаСклада Из СтрокиПоСкладам Цикл

					ОстатокПоСкладу      = ?(НЕ ЗначениеЗаполнено(СтрокаСклада.Остаток), 0, СтрокаСклада.Остаток);
					МинимальныйОстаток   = Мин(ОстатокПоСкладу, ОстатокПоОрганизации);
					МинимальныйОстаток   = ?(МинимальныйОстаток < 0, 0, МинимальныйОстаток);
					ОстатокПоОрганизации = ОстатокПоОрганизации - МинимальныйОстаток;
					СтрокаСклада.Остаток = МинимальныйОстаток;

				КонецЦикла;
			КонецЦикла;
			//удаление строк из остатков по складам, для которых вообще нет остатков по организации
			Для каждого СтрокаСклада из ТаблицаПоСкладам цикл
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Номенклатура",               СтрокаСклада.Номенклатура);
				СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаСклада.ХарактеристикаНоменклатуры);
				СтруктураПоиска.Вставить("СерияНоменклатуры",          СтрокаСклада.СерияНоменклатуры);
				СтруктураПоиска.Вставить("Качество",                   СтрокаСклада.Качество);
				Если КонтролироватьОстатокПоОрганизацииПоСкладу Тогда
					СтруктураПоиска.Вставить("Склад",                   СтрокаСклада.Склад);
				КонецЕсли;
				
	            СтрокиПоОрганизации      = ТаблицаПоОрганизации.НайтиСтроки(СтруктураПоиска);
				Если СтрокиПоОрганизации.Количество()=0 Тогда
					СтрокаСклада.Остаток = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ТаблицаПоСкладам.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СрокГодности, СерияНоменклатурыПредставление, Качество, Склад", "Остаток");
		
		//Если глЗначениеПеременной("ИспользоватьУказаниеСерийНоменклатурыПриРезервировании") Тогда
		//	//для учета серий товара, зарезервированных под конкретный заказ покупателя, необходимо следующее:
		//	//1) В любом случае - из доступного остатка по серии на складе исключить резерв по серии под заказ покупателя
		//	//2) Если списание происходит из резерва по заказу покупателя - подобрать серии, которые зарезервированы под заказ покупателя 
		//	//		(заполнить предназначенную для этого таблицу ТаблицаРезервовПоСериям)
		//	ЗапросРезервы = новый Запрос;
		//	ЗапросРезервы.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	|Номенклатура,
		//	|ХарактеристикаНоменклатуры,
		//	|СерияНоменклатуры,
		//	|СерияНоменклатуры.СрокГодности  КАК СрокГодности,
		//	|ПРЕДСТАВЛЕНИЕ(СерияНоменклатуры) КАК СерияНоменклатурыПредставление,
		//	|Склад,
		//	|&Новый КАК Качество,
		//	|ДокументРезерва,
		//	|КоличествоОстаток КАК Остаток
		//	|ИЗ
		//	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&КонДата,Склад В (&Склад)
		//	|	  И Номенклатура  В (&Номенклатура)
		//	|	  И ВЫРАЗИТЬ(ДокументРезерва КАК ДОкумент.ЗаказПокупателя).ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей = истина
		//	|							 ) КАК РезервыПоСерии
		//	|ГДЕ КоличествоОстаток>0";
		//	ЗапросРезервы.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
		//	ЗапросРезервы.УстановитьПараметр("Новый",        Справочники.Качество.Новый);
		//	ЗапросРезервы.УстановитьПараметр("Склад",        МассивСклады);
		//	ЗапросРезервы.УстановитьПараметр("КонДата",      ?(КонДата=неопределено,Дата("00010101000000"),КонДата));

		//	РезультатЗапроса = ЗапросРезервы.Выполнить();
		//	
		//	//этап1 - уменьшение свободного остатка по серии на количество серии в резерве под заказ
		//	Выборка = РезультатЗапроса.Выбрать();
		//	
		//	Пока Выборка.Следующий() цикл
		//		//уменьшение остатка на количество резерва
		//		нстр = ТаблицаПоСкладам.Добавить();
		//		ЗаполнитьЗначенияСвойств(нстр, Выборка);
		//		нстр.Остаток = (-1)*Выборка.Остаток;
		//	КонецЦикла;
		//	ТаблицаПоСкладам.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СрокГодности, СерияНоменклатурыПредставление, Качество, Склад", "Остаток");
		//	//удалим строки с пустым остатком
		//	КоличествоСтрок = ТаблицаПоСкладам.Количество();
		//	
		//	Для а=1 по КоличествоСтрок цикл
		//		Если ТаблицаПоСкладам[КоличествоСтрок-а].Остаток<=0 Тогда
		//			ТаблицаПоСкладам.Удалить(КоличествоСтрок-а);
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	//этап2 - при необходимости готовим таблицу с данными по зарезервированным сериям номенклатуры
		//	Если ТаблицаРезервовПоСериям<>неопределено Тогда
		//		ТаблицаРезервовПоСериям =  РезультатЗапроса.Выгрузить();
		//	КонецЕсли;
		//	
		//КонецЕсли;

		ТаблицаСерий = ТаблицаПоСкладам.Скопировать();
		
		// добавляем недостающее количество Номенклатуры в Перемещение из Внутреннего заказа без серии
		_тВнутреннийЗаказ.Свернуть("Номенклатура","Количество");
		ТаблицаПоСкладам.Свернуть("Номенклатура","Остаток");
		Для каждого оо из _тВнутреннийЗаказ цикл
			    мСтр = ТаблицаПоСкладам.НайтиСтроки(Новый Структура("Номенклатура",оо.Номенклатура));
				Если мСтр.Количество() > 0 тогда
					Если оо.Количество > мСтр[0].Остаток тогда
						мСерий = ТаблицаСерий.НайтиСтроки(Новый Структура("Номенклатура",оо.Номенклатура));
						сСтр = ТаблицаСерий.Добавить();
						ЗаполнитьЗначенияСвойств(сСтр,мСерий[0]);
						сСтр.Остаток = оо.Количество - мСтр[0].Остаток;
						сСтр.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
						сСтр.СерияНоменклатурыПредставление = "";
						сСтр.СрокГодности = Дата(1,1,1);
						сообщить("Добалена номенклатура: " + сокрлп(оо.Номенклатура) + " без серии, в количестве: " + сокрлп(сСтр.Остаток),СтатусСообщения.Внимание);
					КонецЕсли;	
				иначе
						сСтр = ТаблицаСерий.Добавить();
						сСтр.Номенклатура = оо.Номенклатура;
						сСтр.Остаток = оо.Количество ;
						сСтр.СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
						сСтр.СерияНоменклатурыПредставление = "";
						сСтр.СрокГодности = Дата(1,1,1);
						сСтр.Склад = СкладДоговор;
						сСтр.Качество = Справочники.Качество.Новый;
						сообщить("Добалена номенклатура: " + сокрлп(оо.Номенклатура) + " без серии, в количестве: " + сокрлп(сСтр.Остаток),СтатусСообщения.Внимание);
					
				Конецесли;
		КонецЦикла;		
	Иначе
		ТаблицаПоОрганизации.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СрокГодности, СерияНоменклатурыПредставление, Качество", "Остаток");
		ТаблицаСерий = ТаблицаПоОрганизации.Скопировать();
	КонецЕсли;
	
	ТаблицаСерий.Сортировать("Номенклатура, ХарактеристикаНоменклатуры, СрокГодности, СерияНоменклатурыПредставление");

	Возврат ТаблицаСерий;

КонецФункции // ПолучитьТаблицуОстатковПоСериям()



Функция ПолучитьВидНоменклатурыПФ()Экспорт
	возврат Справочники.ВидыНоменклатуры.НайтиПоКоду("000000004");
КонецФункции	


Функция ПолучитьВидНоменклатурыКонечнаяПродукция()Экспорт
	возврат Справочники.ВидыНоменклатуры.НайтиПоКоду("000000008");
КонецФункции	



Функция Лео_ПолучитьСрокГодностиНаДату(Номенклатура, ДатаКон) экспорт
	
	СрокГодности = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерииНоменклатуры.Ссылка,
		|	СерииНоменклатуры.СрокГодности КАК _СрокГодности,
		|	СерииНоменклатуры.абс_ДатаПроизводства,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.абс_ДатаПроизводства = СерииНоменклатуры.СрокГодности
		|			ТОГДА 1
		|		ИНАЧЕ РАЗНОСТЬДАТ(СерииНоменклатуры.абс_ДатаПроизводства, СерииНоменклатуры.СрокГодности, ДЕНЬ)
		|	КОНЕЦ КАК СрокГодности,
		|	СерииНоменклатуры.Владелец
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &Владелец
		|	И СерииНоменклатуры.абс_ДатаПроизводства <= &абс_ДатаПроизводства
		|
		|УПОРЯДОЧИТЬ ПО
		|	_СрокГодности УБЫВ";

	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("абс_ДатаПроизводства", ДатаКон);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СрокГодности =  Выборка.СрокГодности;

	КонецЕсли;
	
	возврат СрокГодности;
	
КонецФункции	



//{ОКК (УК) 
Функция Лео_ПечатьУК(ТЗ) Экспорт
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("Номенклатура");
	//ТЗ.Колонки.Добавить("СерияНоменклатуры");
	
	
	
	ТабДокумент  = Новый ТабличныйДокумент;
	
	//// Зададим параметры печатной формы по умолчанию
	//ТабДокумент.РазмерКолонтитулаСверху = 0;
	//ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	//ТабДокумент.АвтоМасштаб             = Истина;
	//ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	//ТабДокумент.ТолькоПросмотр          = Истина;
	
	
	//ТабДокумент.АвтоМасштаб = Истина;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.ПолеСверху = 0;
	//ТабДокумент.ПолеСнизу = 0;
	//ТабДокумент.ТолькоПросмотр = Истина;
	////ТабДокумент.МасштабПечати = масштабп
	
	
	
	// Восстановим установленные пользователем пар аметры печатной формы
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УдостоверениеКачества";
	
	Макет = ПолучитьОбщийМакет("Лео_МакетУК");
	ОбластьМакетаШапка           = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаб              = Макет.ПолучитьОбласть("ШапкаТаб");
	ОбластьПараметры             = Макет.ПолучитьОбласть("Параметры");
	ОбластьСтрокаТаб             = Макет.ПолучитьОбласть("СтрокаТаб");
	ОбластьПодвал                = Макет.ПолучитьОбласть("Подвал");
	
	
	
	
	//ДЛя каждого сс из СсылкаНаОбъект.Товары цикл
	ДЛя каждого сс из ТЗ цикл
		
		
		ОбластьМакетаШапка.Параметры.НаименованиеПродукции = сс.Номенклатура.НаименованиеПолное;
		
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ТЗпараметров = ПолучитьТЗпараиетров(сс.Номенклатура);
		Если ТЗпараметров = неопределено тогда продолжить КонецЕсли;
		
		_ТекстШаблонПараметра = "ШаблонПараметра";
		ТЗпараметров.сортировать("НомерСтроки");
		Для каждого пар из ТЗпараметров цикл
			
			ОбластьПараметры.НайтиТекст(_ТекстШаблонПараметра).Текст = пар.ШаблонПараметра;
			
			Если Найти(пар.Параметр,".") > 0 тогда
				_ПостФикс = Прав(пар.Параметр,СтрДлина(пар.Параметр)-Найти(пар.Параметр,"."));
				пПоиска = Лев(пар.Параметр,Найти(пар.Параметр,".")-1);	
				Если ТЗ.Колонки.Найти(пПоиска) = неопределено тогда
				пПоиска = сс.Номенклатура[пПоиска];	
				ОбластьПараметры.Параметры[пар.Параметр] = пПоиска[_ПостФикс];
				иначе
				ОбластьПараметры.Параметры[пар.Параметр] = сс[пПоиска][_ПостФикс];
			    КонецЕсли;
			ИначеЕсли пар.Параметр = "СвидетельствоГосРегистрация" тогда
			
			     ОбластьПараметры.Параметры[пар.Параметр] = ПолучитьСвидетельствоГосРегистрация(сс.СерияНоменклатуры); 
				 
			ИначеЕсли пар.Параметр = "СвидетельствоДекларация" тогда
			
			     ОбластьПараметры.Параметры[пар.Параметр] = ПолучитьСвидетельствоДекларация(сс.Номенклатура,сс.СерияНоменклатуры); 
				 
			ИначеЕсли пар.Параметр = "ПартияКоличествоШт" тогда
				
				//Если ТЗ.Колонки.Найти("Количество") = неопределено тогда 
			     ОбластьПараметры.Параметры[пар.Параметр] = Формат(ПолучитьПартияКоличествоШт(сс.СерияНоменклатуры),"ЧГ=0"); 
				 //иначе
			     //ОбластьПараметры.Параметры[пар.Параметр] = Формат(сс.Количество,"ЧГ=0"); 
				//КонецЕсли;	 
			ИначеЕсли пар.Параметр = "СрокГодности" тогда
				 
			     ОбластьПараметры.Параметры[пар.Параметр] = ПолучитьСрокГодности(сс.СерияНоменклатуры); 
				 
			ИначеЕсли пар.Параметр = "СерийныйНомер" тогда
				 
			     ОбластьПараметры.Параметры[пар.Параметр] = СокрЛП(сс.СерияНоменклатуры.СерийныйНомер); 
				 
			// +++ Жигалев (формат даты изготовления) 11.05.2023	 
			ИначеЕсли пар.Параметр = "СерияНоменклатуры" тогда
				 
			     ОбластьПараметры.Параметры[пар.Параметр] = Формат(Дата(Строка(сс[пар.Параметр]) + " 00:00:01"),"ДФ=dd.MM.yy"); 
	        // --- Жигалев (формат даты изготовления) 11.05.2023
				 
				 
			иначе
				Если ЗначениеЗаполнено(пар.Параметр) тогда 
				ОбластьПараметры.Параметры[пар.Параметр] = сс[пар.Параметр];
				КонецЕсли;
			КонецЕсли;	
			
			//ОбластьПараметры.Параметры[пар.Параметр] = сс[пар.Параметр];
			ТабДокумент.Вывести(ОбластьПараметры);
			_ТекстШаблонПараметра = пар.ШаблонПараметра;
		КонецЦикла;
		
		
		//ТабДокумент.Вывести(ОбластьПараметры);
		ТабДокумент.Вывести(ОбластьШапкаТаб);
		
		ТЗпоказателей = ПолучитьТЗпоказателей(сс.Номенклатура);
		Если ТЗпоказателей = неопределено тогда продолжить КонецЕсли;
		
		ТЗпоказателей.сортировать("НомерСтроки");
		Для каждого пок из ТЗпоказателей цикл
			
			ОбластьСтрокаТаб.Параметры.НаименованиеПоказателя = пок.НаименованиеПоказателя;
			//ОбластьСтрокаТаб.Параметры.ТУ = пок.ТУ;
			ОбластьСтрокаТаб.Параметры.ТУ = ПолучитьПоказатель(сс,пок.ТУ);
			
			
			ОбластьСтрокаТаб.Параметры.Фактически = ПолучитьПоказатель(сс,пок.Фактически);
			
			ТабДокумент.Вывести(ОбластьСтрокаТаб);
		КонецЦикла;
		
		
		
		сТабНоменклатура = ПолучитьСтруктуруТабНоменклатура(сс.Номенклатура);	
		// ТУ
		Если сТабНоменклатура = неопределено тогда
		   ОбластьПодвал.Параметры.ТУ = СокрЛП(сс.Номенклатура.Лео_ОКК_ТУ);
		   иначе
		   ОбластьПодвал.Параметры.ТУ = СокрЛП(сТабНоменклатура.Лео_ОКК_ТУ);
		КонецЕсли;
	
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	
	
	// Знаки качества
	Если сТабНоменклатура <> неопределено тогда
		//ЗнакиКачества = ТЗ[0].Лео_ОКК_ВнешнийВид;
		ЗнакиКачества = СокрЛП(сТабНоменклатура.Лео_ОКК_ВнешнийВид);
		Если ЗначениеЗаполнено(ЗнакиКачества) тогда
			ОбластьЗнакиКачества                = Макет.ПолучитьОбласть(ЗнакиКачества);
			ТабДокумент.Вывести(ОбластьЗнакиКачества);
		КонецЕсли;
	КонецЕсли;
	
	
	
	//ОбластьМакета.Параметры.ПредставлениеПодраз деления = Шапка.Подразделение;
	//ОбластьМакета.Параметры.ПредставлениеПодразделения = "";
	
	//ДопПараметры
	
	//+Сафонов Е А 
	//Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
	//	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,КПП,"+?(ДополнительныеПараметры.ВидАдресаГрузополучателя = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, "ЮридическийАдрес", "ФактическийАдрес" )+",Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	//	
	//	Если ДополнительныеПараметры.ВыводитьАдресДоставки И ЗначениеЗаполнено(ДополнительныеПараметры.ВидАдресаДоставки) Тогда
	//		ОбластьМакета.Параметры.АдресДоставки = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, абс_Дистрибуция.ПолучитьВидАдресаСтрокой(ДополнительныеПараметры.ВидАдресаДоставки));
	//	Иначе
	//		ОбластьМакета.Параметры.АдресДоставки = "";
	//	КонецЕсли;
	//Иначе
	//	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	//	
	//	Если СокрЛП(Шапка.АдресДоставки) <> "" Тогда
	//		ОбластьМакета.Параметры.АдресДоставки = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(Шапка.АдресДоставки);
	//	Иначе
	//		ОбластьМакета.Параметры.АдресДоставки = ФормированиеПечатныхФормСервер.ОписаниеОрганизации(СведенияОГрузополучателе, "ФактическийАдрес");
	//	КонецЕсли;		
	//КонецЕсли;
	
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ТолькоПросмотр = Истина;
	//ТабДокумент.МасштабПечати = масштабп
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьСтруктуруТабНоменклатура(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ГруппаПродукцииДляУКТабНоменклатура.Ссылка,
		|	Лео_ГруппаПродукцииДляУКТабНоменклатура.Номенклатура,
		|	Лео_ГруппаПродукцииДляУКТабНоменклатура.Артикул,
		|	Лео_ГруппаПродукцииДляУКТабНоменклатура.Лео_ОКК_ТУ,
		|	Лео_ГруппаПродукцииДляУКТабНоменклатура.Лео_ОКК_ВнешнийВид
		|ИЗ
		|	Справочник.Лео_ГруппаПродукцииДляУК.ТабНоменклатура КАК Лео_ГруппаПродукцииДляУКТабНоменклатура
		|ГДЕ
		|	Лео_ГруппаПродукцииДляУКТабНоменклатура.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Результат = Запрос.Выполнить();
    сСтруктура = неопределено;
	Если НЕ Результат.Пустой() тогда
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
	     сСтруктура = Новый Структура;
		 сСтруктура.Вставить("Лео_ОКК_ТУ",Выборка.Лео_ОКК_ТУ);
		 сСтруктура.Вставить("Лео_ОКК_ВнешнийВид",Выборка.Лео_ОКК_ВнешнийВид);
	КонецЕсли;
	
	Возврат сСтруктура;
	
КонецФункции


Функция ПолучитьСвидетельствоГосРегистрация(СерияНоменклатуры)
	
	СвидГос = "";
	
	Для каждого ии из СерияНоменклатуры.абс_УдостоверенияКачества цикл
		Если ии.Сертификат.ВидСертификата = Перечисления.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации тогда
			 СвидГос = СокрЛП(ии.Сертификат.Номер) + " от " + Формат(ии.Сертификат.ДатаНачалаДействияСертификата,"ДФ=dd.MM.yyyy") + "г.";
		КонецЕсли;	
	КонецЦикла;	
	
	
	Возврат СвидГос;
	
КонецФункции


Функция ПолучитьСвидетельствоДекларация(Номенклатура,СерияНоменклатуры)
	
	СвидГос = "";
	

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	абс_ТоварыСертификатовСрезПоследних.Регистратор.Номер КАК Номер,
	//	|	абс_ТоварыСертификатовСрезПоследних.Регистратор.ДатаНачалаДействияСертификата КАК ДатаНачалаДействияСертификата,
	//	|	ВЫБОР
	//	|		КОГДА абс_ТоварыСертификатовСрезПоследних.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации)
	//	|			ТОГДА 1
	//	|		КОГДА абс_ТоварыСертификатовСрезПоследних.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия)
	//	|			ТОГДА 2
	//	|		КОГДА абс_ТоварыСертификатовСрезПоследних.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза)
	//	|			ТОГДА 3
	//	|	КОНЕЦ КАК Индекс
	//	|ИЗ
	//	|	РегистрСведений.абс_ТоварыСертификатов.СрезПоследних(
	//	|			,
	//	|			Номенклатура = &Номенклатура
	//	|				И ВидСертификата В (&мВидСертификата)) КАК абс_ТоварыСертификатовСрезПоследних
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Индекс";
	//	
	//мВидСертификата = Новый Массив;
	//мВидСертификата.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации);
	//мВидСертификата.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия);
	//мВидСертификата.Добавить(Перечисления.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза);
	//	

	//Запрос.УстановитьПараметр("мВидСертификата", мВидСертификата);
	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	//Результат = Запрос.Выполнить();

	//
	//Если НЕ Результат.Пустой() тогда
	//	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//	//Пока ВыборкаДетальныеЗаписи.Следующий() цикл 		 
	//		ВыборкаДетальныеЗаписи.Следующий(); 
	//		СвидГос = СокрЛП(ВыборкаДетальныеЗаписи.Номер) + " от " + Формат(ВыборкаДетальныеЗаписи.ДатаНачалаДействияСертификата,"ДФ=dd.MM.yyyy") + "г.";
	//	//КонецЦикла;
	//КонецЕсли;
	
	
	
	Для каждого ии из СерияНоменклатуры.абс_УдостоверенияКачества цикл
		//Если ии.Сертификат.ВидСертификата = Перечисления.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации тогда
			 СвидГос = СокрЛП(ии.Сертификат.Номер) + " от " + Формат(ии.Сертификат.ДатаНачалаДействияСертификата,"ДФ=dd.MM.yyyy") + "г.";
	    //КонецЕсли;	
	КонецЦикла;	
	
	
	Возврат СвидГос;
	
КонецФункции


Функция ПолучитьПартияКоличествоШт(СерияНоменклатуры)
	
	КолШтПартииВыпуск = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОбороты.КоличествоПриход
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, СерияНоменклатуры = &СерияНоменклатуры) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровИзПереработки ИЛИ 
		|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену";

	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() тогда
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
         Пока ВыборкаДетальныеЗаписи.Следующий() цикл
		     КолШтПартииВыпуск = КолШтПартииВыпуск + ВыборкаДетальныеЗаписи.КоличествоПриход;
		 КонецЦикла;
    КонецЕсли;
	Возврат КолШтПартииВыпуск;
	
КонецФункции


Функция ПолучитьРазностьДат(Дата1, Дата2, ПериодДетализации)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(&Дата1, &Дата2, МЕСЯЦ) КАК РазностьДат";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МЕСЯЦ", ПериодДетализации);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.РазностьДат;
	
КонецФункции


Функция ПолучитьСрокГодности(СерияНоменклатуры)
	
			//Срок годности
			// РАЗНОСТЬДАТ(СерииНоменклатуры.абс_ДатаПроизводства, СерииНоменклатуры.СрокГодности, ДЕНЬ)
	
	сТрокаСрокГодности = "";
	
	//мДлинаСуток = 86400; // в секундах
	//Дней = Окр((НачалоДня(СерииНоменклатуры.СрокГодност) - НачалоДня(СерииНоменклатуры.абс_ДатаПроизводства)) / мДлинаСуток);

	сГод   = ПолучитьРазностьДат(СерияНоменклатуры.абс_ДатаПроизводства,СерияНоменклатуры.СрокГодности,"ГОД");
	сМесяц = ПолучитьРазностьДат(СерияНоменклатуры.абс_ДатаПроизводства,СерияНоменклатуры.СрокГодности,"МЕСЯЦ");
	
	//Если сГод >= 1 тогда
	Если сМесяц%12 = 0 тогда
	сТрокаСрокГодности = СокрЛП(сГод) + " " + гПрописью(сГод);
		иначе
	сТрокаСрокГодности = СокрЛП(сМесяц) + " " + мПрописью(сМесяц);
	КонецЕсли;
	
	Возврат сТрокаСрокГодности;
	
КонецФункции


Функция гПрописью(Год)
	
	сГод = "";
	Если Год = 1 тогда сГод = "год"
	ИначеЕсли Год = 2 или Год = 3 или Год = 4 тогда сГод = "года"
	ИначеЕсли Год >= 5 тогда сГод = "лет"
	КонецЕсли;	
	
	Возврат сГод;
	
КонецФункции


Функция мПрописью(Месяц)
	
	сМесяц = "";
	Если Месяц = 1 тогда сМесяц = "месяц"
	ИначеЕсли Месяц = 2 или Месяц = 3 или Месяц = 4 тогда сМесяц = "месяца"
	ИначеЕсли Месяц >= 5 тогда сМесяц = "месяцев"
	КонецЕсли;	
	
	Возврат сМесяц;
	
КонецФункции


	

Функция ПолучитьТЗпоказателей(Номенклатура)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лео_ГруппаПродукции.ТабПоказателей.(
	|		Ссылка,
	|		НомерСтроки,
	|		НаименованиеПоказателя,
	|		ТУ,
	|		Фактически
	|	)
	|ИЗ
	|	Справочник.Лео_ГруппаПродукцииДляУК КАК Лео_ГруппаПродукции
	|ГДЕ
	|	Лео_ГруппаПродукции.ТабНоменклатура.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		ТЗ =  ВыборкаДетальныеЗаписи.ТабПоказателей.выгрузить();
	КонецЕсли;
	
	
	
	возврат ТЗ
	
КонецФункции	

Функция ПолучитьТЗпараиетров(Номенклатура)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лео_ГруппаПродукции.ТабПараметры.(
	|		Ссылка,
	|		НомерСтроки,
	|		ШаблонПараметра,Параметр
	|	)
	|ИЗ
	|	Справочник.Лео_ГруппаПродукцииДляУК КАК Лео_ГруппаПродукции
	|ГДЕ
	|	Лео_ГруппаПродукции.ТабНоменклатура.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		ТЗ =  ВыборкаДетальныеЗаписи.ТабПараметры.выгрузить();
	КонецЕсли;
	
	
	
	возврат ТЗ
	
КонецФункции	

Функция ПолучитьПоказатель(сс,парПараметр)
	
			Если Найти(парПараметр,"СерияНоменклатуры.") > 0 тогда
				_ПостФикс = Прав(парПараметр,СтрДлина(парПараметр)-Найти(парПараметр,"."));
				_парПараметр = сс[Лев(парПараметр,Найти(парПараметр,".")-1)][_ПостФикс];
			иначе
				_парПараметр = парПараметр;
			КонецЕсли;	
			
			
			возврат _парПараметр
			
		КонецФункции			
//ОКК (УК)} 



//{ Сохраненные настройки 
Процедура ПриОткрытииОтчетаВосстановлениеНастроек(ОтчетОбъект) Экспорт
    
    Если ОтчетОбъект.мТекущаяНастройка <> Неопределено Тогда
        Возврат;    
    КонецЕсли;
    
    СтруктураНастройки = Новый Структура;
    СтруктураНастройки.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
    СтруктураНастройки.Вставить("ИмяОбъекта", Строка(ОтчетОбъект));
    
    Если ФормироватьСУказаннойНастройкой(ОтчетОбъект, СтруктураНастройки) 
        ИЛИ УниверсальныеМеханизмы.ПолучитьНастройкуИспользоватьПриОткрытии(СтруктураНастройки) Тогда        
        ОтчетОбъект.мТекущаяНастройка = СтруктураНастройки;
        ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастройки.СохраненнаяНастройка);
        ОтчетОбъект.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
    КонецЕсли;
    
    #Если Клиент Тогда
    Попытка
        Если ОтчетОбъект.мФормироватьОтчетПриОткрытии Тогда
            ФормаОтчета = ОтчетОбъект.ПолучитьФорму();    
            Если ФормаОтчета.Открыта() Тогда
                ОтчетОбъект.СкомпоноватьРезультат(ФормаОтчета.ЭлементыФормы.Результат, ФормаОтчета.ДанныеРасшифровки);
            КонецЕсли;
        КонецЕсли;
    Исключение
    
    КонецПопытки;
    #КонецЕсли

КонецПроцедуры

Процедура ПриЗакрытииОтчетаСохранениеНастроек(ОтчетОбъект) Экспорт
        
    Если НЕ (ОтчетОбъект.мТекущаяНастройка = Неопределено 
     ИЛИ ОтчетОбъект.мТекущаяНастройка.НаименованиеНастройки = Неопределено) 
     И ОтчетОбъект.мТекущаяНастройка.Пользователь = ПараметрыСеанса.ТекущийПользователь 
     И ОтчетОбъект.мТекущаяНастройка.Свойство("СохранятьАвтоматически") И ОтчетОбъект.мТекущаяНастройка.СохранятьАвтоматически Тогда            
        СтруктураНастройки = Новый Структура;
        СтруктураНастройки.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
        СтруктураНастройки.Вставить("ИмяОбъекта", Строка(ОтчетОбъект));
        СтруктураНастройки.Вставить("НаименованиеНастройки", ОтчетОбъект.мТекущаяНастройка.НаименованиеНастройки);
        СтруктураНастройки.Вставить("СохраненнаяНастройка", ОтчетОбъект.КомпоновщикНастроек.Настройки);
        СтруктураНастройки.Вставить("ИспользоватьПриОткрытии", ОтчетОбъект.мТекущаяНастройка.ИспользоватьПриОткрытии);
        СтруктураНастройки.Вставить("СохранятьАвтоматически", ОтчетОбъект.мТекущаяНастройка.СохранятьАвтоматически);        
        УниверсальныеМеханизмы.СохранитьНастройку(СтруктураНастройки);
    КонецЕсли;
    
КонецПроцедуры

Процедура Восстановитьнастройки(ОтчетОбъект) Экспорт    
    
    СтруктураНастройки = Новый Структура;
    СтруктураНастройки.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
    СтруктураНастройки.Вставить("ИмяОбъекта", Строка(ОтчетОбъект));
    СтруктураНастройки.Вставить("НаименованиеНастройки", Неопределено);
    
    Результат = УниверсальныеМеханизмы.ВосстановлениеНастроек(СтруктураНастройки);
    
    Если Результат <> Неопределено Тогда            
        ОтчетОбъект.мТекущаяНастройка = Результат;
        ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Результат.СохраненнаяНастройка);
        ОтчетОбъект.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
    Иначе        
        ОтчетОбъект.мТекущаяНастройка = СтруктураНастройки;        
    КонецЕсли;
    
КонецПроцедуры

Процедура СохранитьНастройки(ОтчетОбъект) Экспорт
    
    СтруктураНастройки = Новый Структура;
    СтруктураНастройки.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
    СтруктураНастройки.Вставить("ИмяОбъекта", Строка(ОтчетОбъект));
    СтруктураНастройки.Вставить("НаименованиеНастройки", ?(ОтчетОбъект.мТекущаяНастройка = Неопределено, Неопределено, ОтчетОбъект.мТекущаяНастройка.НаименованиеНастройки));
    СтруктураНастройки.Вставить("СохраненнаяНастройка", ОтчетОбъект.КомпоновщикНастроек.Настройки);
    СтруктураНастройки.Вставить("ИспользоватьПриОткрытии", Ложь);
    СтруктураНастройки.Вставить("СохранятьАвтоматически", Ложь);
    
    Результат = УниверсальныеМеханизмы.СохранениеНастроек(СтруктураНастройки);
    
    Если Результат <> Неопределено Тогда            
        ОтчетОбъект.мТекущаяНастройка = Результат;            
    Иначе        
        ОтчетОбъект.мТекущаяНастройка = СтруктураНастройки;        
    КонецЕсли;
        
КонецПроцедуры

Функция ФормироватьСУказаннойНастройкой(ОтчетОбъект, СтруктураНастройки) Экспорт

    ПользовательНастроек = Неопределено;
    НаименованиеНастроек = Неопределено;
    ДопСвойства = ОтчетОбъект.ДополнительныеСвойства;
    Если НЕ (ДопСвойства.Свойство("ПользовательНастроек", ПользовательНастроек)
        И ЗначениеЗаполнено(ПользовательНастроек)
        И ДопСвойства.Свойство("НаименованиеНастроек", НаименованиеНастроек)
        И ЗначениеЗаполнено(НаименованиеНастроек)) Тогда
        Возврат Ложь;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    СохраненныеНастройки.НаименованиеНастройки,
    |    СохраненныеНастройки.СохраненнаяНастройка,
    |    СохраненныеНастройки.ИспользоватьПриОткрытии,
    |    СохраненныеНастройки.СохранятьАвтоматически
    |ИЗ
    |    РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
    |ГДЕ
    |    СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
    |    И СохраненныеНастройки.НаименованиеНастройки = &НаименованиеНастройки
    |    И СохраненныеНастройки.Пользователь = &Пользователь";
    Запрос.УстановитьПараметр("ИмяОбъекта"                , Строка(ОтчетОбъект));
    Запрос.УстановитьПараметр("Пользователь"            , ПользовательНастроек);
    Запрос.УстановитьПараметр("НаименованиеНастройки"    , НаименованиеНастроек);
    
    РезультатЗапроса = Запрос.Выполнить();
    Если РезультатЗапроса.Пустой() Тогда
        Возврат Ложь;    
    КонецЕсли;
    
    ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
    
    ВыборкаИзРезультатаЗапроса.Следующий();
    СтруктураНастройки.Вставить("Пользователь"                , ПользовательНастроек);
    СтруктураНастройки.Вставить("НаименованиеНастройки"        , ВыборкаИзРезультатаЗапроса.НаименованиеНастройки);
    СтруктураНастройки.Вставить("СохраненнаяНастройка"        , ВыборкаИзРезультатаЗапроса.СохраненнаяНастройка.Получить());
    СтруктураНастройки.Вставить("ИспользоватьПриОткрытии"    , ВыборкаИзРезультатаЗапроса.ИспользоватьПриОткрытии);
    СтруктураНастройки.Вставить("СохранятьАвтоматически"    , ВыборкаИзРезультатаЗапроса.СохранятьАвтоматически);
        
    Возврат Истина;
    
КонецФункции
// Сохраненные настройки} 



//-Лео ZAA
	
//{Лео Катанович
Функция ПолучитьТаблицуИсключенийРазузлования()
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	Лео_ТаблицаИсключенийРазузлования.Номенклатура КАК Номенклатура
	                |ИЗ
	                |	РегистрСведений.Лео_ТаблицаИсключенийРазузлования КАК Лео_ТаблицаИсключенийРазузлования";
	 				
	 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
  
 
 Функция ПолучитьЦенуПоследнейРеализации(Период,Номенклатура,Контрагент)  Экспорт
	 Цена = 0;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ВЫРАЗИТЬ(ЗаказыПокупателей.Цена КАК ЧИСЛО(15, 2)) КАК Цена
	                |ИЗ
	                |	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	                |ГДЕ
	                |	ЗаказыПокупателей.Период <= &Период
	                |	И ЗаказыПокупателей.Номенклатура = &Номенклатура
	                |	И ЗаказыПокупателей.ДоговорКонтрагента.Владелец = &Контрагент
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЗаказыПокупателей.Период УБЫВ";
	     Запрос.УстановитьПараметр("Период", Период);
		 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		 Запрос.УстановитьПараметр("Контрагент", Контрагент);
				
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		  Цена =  Выборка.Цена;
	 КонецЦикла;	 
	 
	 Возврат Цена;
	 
 КонецФункции 
 
 
 Функция НоменклатураВходитВПапку(Номенклатура) Экспорт
	
	ВходитВПапку = Ложь;

	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Родитель,
		|	Номенклатура.ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Родитель В ИЕРАРХИИ(&мРодитель)
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Ссылка = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
		мРодитель = Новый Массив;
		мРодитель.Добавить(Справочники.Лео_Настройки.НайтиПоКоду("000000116").ДопРеквизит_1);
		мРодитель.Добавить(Справочники.Лео_Настройки.НайтиПоКоду("000000116").ДопРеквизит_2);
		Запрос.УстановитьПараметр("мРодитель", мРодитель);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВходитВПапку = Не РезультатЗапроса.Пустой();
		
	Возврат ВходитВПапку;
	
КонецФункции	

 
//Лео Катанович}
    //никитин Лео
	функция лео_ПолучитьЦенуСНДСпоРегиструПартииЛео(номенклатура,серия,Датакон)  Экспорт
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
              //    сообщить("""""""");
				//  сообщить(номенклатура);
				 // сообщить(серия);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПартияНоменклатурыСрезПоследних.ЦенаСНДС  как ценаСНДС
		|ИЗ
		|	РегистрСведений.Лео_ПартияНоменклатуры.СрезПоследних(
		|			&ДатаКон,
		|			Номенклатура = &Номенклатура
		|				И СерияНоменклатуры = &Серия) КАК Лео_ПартияНоменклатурыСрезПоследних";

	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		возврат ВыборкаДетальныеЗаписи.ценаСНДС;

	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	возврат 0;
	
		
		
		
	конеЦФункции	



	
