
 
  Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
		
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ВысотаИзображения = ВернутьЗначениеПараметраНастройкиСКД(КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы, "РазмерИзображения", 100); //В средних символах
	
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("РазмерИзображения", ВысотаИзображения);

	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровки);

	ПроцессорКомпоновкиСКД = Новый ПроцессорКомпоновкиДанных;

	ПроцессорКомпоновкиСКД.Инициализировать(Макет,, ДанныеРасшифровки);

	ДокументРезультат.Очистить();

	ПроцессорВыводаСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;

	ПроцессорВыводаСКД.УстановитьДокумент(ДокументРезультат);

	ПроцессорВыводаСКД.Вывести(ПроцессорКомпоновкиСКД);
	
	КолвоСтрок = ДокументРезультат.ВысотаТаблицы;
	КолвоКолонок = ДокументРезультат.ШиринаТаблицы;
	Для Строка = 1 По КолвоСтрок Цикл
		Для Колонка = 1 По КолвоКолонок Цикл
			Область =  ДокументРезультат.Область(Строка,Колонка);
			Расшифровка = Область.Расшифровка;
			Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
				ПоляРасшифровки = ДанныеРасшифровки.Элементы.Получить(Расшифровка).ПолучитьПоля();
				ФайлКартинки = ПоляРасшифровки.Найти("Изображение");
				Если ФайлКартинки <> Неопределено Тогда
					
					КартинкаДД =(ФайлКартинки.Значение.Хранилище.Получить());
					
					Если КартинкаДД <> Неопределено Тогда
						Область.ВысотаСтроки = ВысотаИзображения;
						Область.ШиринаКолонки =  Область.ВысотаСтроки/5;
						
						КартинкаДок = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
						КартинкаДок.Картинка = КартинкаДД;
						
						КартинкаДок.РазмерКартинки = РазмерКартинки.Пропорционально;
						//КартинкаДок.ГраницаСлева =   Ложь;
						//КартинкаДок.ГраницаСправа =   Ложь;
						//КартинкаДок.ГраницаСверху =   Ложь;
						//КартинкаДок.ГраницаСнизу =   Ложь;
						КартинкаДок.Расположить(Область);	
						КартинкаДок.ГиперСсылка = Истина;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

  
 Процедура ВывестиИзображениеЭлементаНоменклатуры(ТД, ЭлементСправочника, Область, ВысотаИзображения)
	 Попытка
		 
	ТД.Область(ТД.ВысотаТаблицы,1).ВысотаСтроки = ?(ВысотаИзображения >0,ВысотаИзображения,100);
	Область.ШиринаКолонки =  ВысотаИзображения;
 
		 
	 Рисунок = ТД.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	 
	 ТД.Рисунки[Рисунок.Имя].Картинка =(ЭлементСправочника.Хранилище.Получить());
	 Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
     Рисунок.Расположить(Область);
     Рисунок.ГиперСсылка = Истина;

	     Исключение
	 
	 КонецПопытки;
	 
		 
КонецПроцедуры 


Функция ВернутьЗначениеПараметраНастройкиСКД(КоллекцияЭлементовНастройки, ИмяНастройки, ЗначениеПоУмолчанию = Неопределено)

     Настройка = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяНастройки);
	 Если Настройка = Неопределено Тогда
		 Возврат ЗначениеПоУмолчанию;
	 КонецЕсли;
	 

    // НастрокаПоИД = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Настройка.ИдентификаторПользовательскойНастройки);
	 
	 //Если НастрокаПоИД = Неопределено Тогда
	 //	Возврат ЗначениеПоУмолчанию;
	 //КонецЕсли;

		 Если Не ЗначениеЗаполнено(Настройка.Значение)  Тогда
         
             Настройка.Значение = ЗначениеПоУмолчанию;
         КонецЕсли;
     
     Возврат ?(Настройка.Использование, Настройка.Значение, ЗначениеПоУмолчанию);
 КонецФункции
 //////////////////////////////////


Процедура ВыгрузитьНаСервере()  Экспорт
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Контрагент");
	
	Если ПараметрСКД = Неопределено тогда 
	Сообщить("Выберите контрагента");
	Возврат
	Конецесли;
	
	Если ПараметрСКД <> Неопределено Тогда
		Если ПараметрСКД.Значение = Справочники.Контрагенты.НайтиПоКоду("УТ0006921") //еАптека ООО
			или  ПараметрСКД.Значение = Справочники.Контрагенты.НайтиПоКоду("К00000291") //ПРОТЕК ЦВ АО 
			Тогда
			иначе
			Сообщить("Выгрузка для контрагента не предусмотрена");
			Возврат;
		КонецЕсли;	
	КонецЕсли;

	// Вставить содержимое обработчика.
	//ТабЗначений = КомпоновщикНастроек.Результат.Выгрузить();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",	ТЗ);

	Запрос.Текст = "ВЫБРАТЬ *
	|ПОМЕСТИТЬ Таблица	            
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|///////////////////////////////////////////
	|ВЫБРАТЬ
	| Таблица.Номенклатура,
	| Таблица.ШтрихКод,
	| Таблица.ЕдиницаИзмерения,	
	| МИНИМУМ(Таблица.СерияНоменклатуры.абс_ДатаПроизводства) КАК СерияНоменклатуры,
	| МАКСИМУМ(Таблица.СерияНоменклатуры.Лео_Производитель) КАК Производитель,
	| МИНИМУМ(Таблица.СерияНоменклатуры.СрокГодности) КАК СрокГодности,
	| МАКСИМУМ(Таблица.ЦенаСНДС),	                                             
	| СУММА(Таблица.СвободныйОстаток) КАК Остаток	
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Номенклатура, Таблица.ШтрихКод, Таблица.ЕдиницаИзмерения";
	
	ТЗВыгрузка = Запрос.Выполнить().Выгрузить();
	//абс_обменДаннымиСервер.ВыгрузитьФайлОбменаСервер(ТЗВыгрузка,НастройкиОбмена);	
	
	Если ПараметрСКД.Значение = Справочники.Контрагенты.НайтиПоКоду("УТ0006921") тогда
	 ВыгрузитьФайлОбмена(ТЗВыгрузка);
		иначе
	 _ВыгрузитьФайлОбмена(ТЗ);
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура _ВыгрузитьФайлОбмена(Результат) Экспорт

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("CODE");
	ТЗ.Колонки.Добавить("TORG_NAME");
	ТЗ.Колонки.Добавить("PRICE");
	Для каждого сс из Результат цикл
		пп = ТЗ.Добавить();		
		пп.CODE = сс.ШтрихКод;
		пп.TORG_NAME = СокрЛП(сс.Номенклатура);
		пп.PRICE = сс.ЦенаБезНДС;
	КонецЦикла;
	
	
    _ТабДок = ПолучитьМакет("Макет");
    ОбластьПараметров = _ТабДок.ПолучитьОбласть("Строки");
    Для Каждого Стр Из ТЗ Цикл
        ОбластьПараметров.Параметры.CODE = Стр.CODE;
		ОбластьПараметров.Параметры.TORG_NAME = Стр.TORG_NAME;
		ОбластьПараметров.Параметры.PRICE = Стр.PRICE;
        //ОбластьПараметров.Параметры.Наименование = Стр.Наименование;
        _ТабДок.Вывести(ОбластьПараметров);
	КонецЦикла;
		
	//Попытка
	//	_ТабДок.Записать("D:\1C\Протек\1\Example.xls", ТипФайлаТабличногоДокумента.XLSX);
	//	//КопироватьФайл("D:\1C\Протек\1\Example.xls","D:\1C\Протек\1\Example.csv");
	//	
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//КонецПопытки;	
	
	//////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////
	
	//формируем файл выгрузки
	ИмяФайлаВыгрузки = "PRICE.xlsx";
	НастройкиОбмена = Справочники.абс_НастройкиEDIОбмена.НайтиПоНаименованию("ПРОТЕК");
    КаталогНаСервере = "price";

	//сформируем полное имя файла
	ПолноеИмяФайлаВыгрузки = КаталогВременныхФайлов() + ИмяФайлаВыгрузки;
	
    Попытка
        _ТабДок.Записать(ПолноеИмяФайлаВыгрузки, ТипФайлаТабличногоДокумента.XLSX);
		//КопироватьФайл("D:\1C\Протек\1\Example.xls","D:\1C\Протек\1\Example.csv");
		
    Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;	
	
	
	
	
	КлючУникальности = Новый УникальныйИдентификатор;
	ДвоичныйФайл = ПоместитьВоВременноеХранилище (Новый ДвоичныеДанные(ПолноеИмяФайлаВыгрузки), КлючУникальности); 
	ДанныеФайла = ПолучитьИзВременногоХранилища(ДвоичныйФайл);

	////формируем файл выгрузки
	//ИмяФайлаВыгрузки = "PRICE.dbf";
	//ПолноеИмяФайлаВыгрузки = КаталогВременныхФайлов() + ИмяФайлаВыгрузки;
	ДанныеФайла.Записать(ПолноеИмяФайлаВыгрузки);
	
	//Состояние("Установка соединения " + НастройкиОбмена.FTPАдресОбмена);
    FTPСервер = ВыполнитьFTPПодключениеКСерверу(НастройкиОбмена.FTPАдресОбмена, НастройкиОбмена,"", Истина);
	Если  FTPСервер = Неопределено Тогда
		  Возврат;
	КонецЕсли;;
		
	Попытка 
		
	//FTPСервер.УстановитьТекущийКаталог("/"+КаталогНаСервере);
	FTPСервер.Записать(ПолноеИмяФайлаВыгрузки, ИмяФайлаВыгрузки);
	ТекстСообщения = ("Файл отправлен контрагенту на " + НастройкиОбмена.FTPАдресОбмена);
	Сообщить(ТекстСообщения);

	Исключение
		ТекстСообщения = ОписаниеОшибки();
		Сообщить(ТекстСообщения);

	КонецПопытки;

	
	
	
КонецПроцедуры


Процедура ВыгрузитьФайлОбмена(ТабДок) Экспорт
	//формируем файл выгрузки
	ИмяФайлаВыгрузки = "PRICE.dbf";
	НастройкиОбмена = Справочники.абс_НастройкиEDIОбмена.НайтиПоНаименованию("EApteka");
    КаталогНаСервере = "price";

//сформируем полное имя файла
	ПолноеИмяФайлаВыгрузки = КаталогВременныхФайлов() + ИмяФайлаВыгрузки;
	
	БД = Новый XBase;
	БД.Кодировка = КодировкаXBase.OEM;

	БД.Поля.Добавить("CODEPST","C",32);	  // Код товара (уникальный идентификатор) в справочнике поставщика
	БД.Поля.Добавить("NAME","C",80);      // Наименование товара в справочнике поставщика
	БД.Поля.Добавить("CNTR","C",15);      // Наименование страны происхождения товара
	БД.Поля.Добавить("FIRM","C",40);      // Наименование фирмы-производителя
	БД.Поля.Добавить("QNTPACK","N",8);    // Минимальная кратная партия товара
	БД.Поля.Добавить("EAN13","C",13);     // ШтрихКод
	БД.Поля.Добавить("NDS","N",9,2);      // Ставка НДС
	БД.Поля.Добавить("GDATE","D",8);      // Срок годности
	БД.Поля.Добавить("QNT","N",9,2);      // Количество
	БД.Поля.Добавить("GNVLS","N",15,2);   // Признак ЖНВЛП
	БД.Поля.Добавить("PRICE1","N",9,2);   // Цена производителя с НДС
	БД.Поля.Добавить("PRICEGR","N",9,2);  // Цена госрегистрации на ЖНВЛП препараты
	БД.Поля.Добавить("DatePrice","D",8);  // Дата прайса
	////////////////////////////////////////////////////////////////////////////////////////
	БД.СоздатьФайл(ПолноеИмяФайлаВыгрузки);
	БД.Записать();
	БД.АвтоСохранение = Истина;
	Для каждого стр из ТабДок Цикл
		
	БД.Добавить();
	БД.CODEPST =    стр.Номенклатура.Артикул;    
	БД.NAME =       стр.Номенклатура.Наименование;       
	БД.CNTR =       "РОССИЯ";     
	БД.FIRM =       стр.Производитель;
	БД.QNTPACK =    Стр.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент;    
	БД.EAN13 =      стр.ШтрихКод;     
	БД.NDS =        УчетНДС.ПолучитьСтавкуНДС(Стр.Номенклатура.СтавкаНДС);
	БД.GDATE =      стр.СрокГодности;      
	БД.QNT =        МИН(стр.Остаток/Стр.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент*10, стр.Остаток);      
	БД.PRICE1 =     стр.ЦенаСНДС;     
	БД.DatePrice =  ТекущаяДата();   
	
	КонецЦикла;
	БД.ЗакрытьФайл();
	КлючУникальности = Новый УникальныйИдентификатор;
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище (Новый ДвоичныеДанные(ПолноеИмяФайлаВыгрузки), КлючУникальности); 
	абс_ОбменДаннымиСервер.ВыгрузитьФайлОбменаСервер(ДвоичныйФайл,НастройкиОбмена,ИмяФайлаВыгрузки,КаталогНаСервере);

	
КонецПроцедуры



Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена, 
	ДанныеПротокола = "", Знач ВывестиИнформациюВОкноСообщений = Истина, СтруктураОбменаДанными = Неопределено) Экспорт      
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
	#КонецЕсли
	
	Попытка
		
		Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
		НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, ,НастройкиОбмена.ПассивноеFTPСоединение);						
		
	Исключение
		// ошибка при подключении к ftp
		ПроцедурыОбменаДанными.СообщитьПростуюИнформацию("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки(), 
		ДанныеПротокола, ВывестиИнформациюВОкноСообщений, СтруктураОбменаДанными);
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции


