

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//АБС 27.05.2014 44000
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И (
			ЗначениеЗаполнено(Объект.ДатаНачалаДействияСертификата) 	ИЛИ 
			ЗначениеЗаполнено(Объект.ДатаОкончанияДействияСертификата) 	ИЛИ
			ЗначениеЗаполнено(Объект.Комментарий) 						ИЛИ
			ЗначениеЗаполнено(Объект.Неактуальный) 						ИЛИ
			ЗначениеЗаполнено(Объект.ОрганСертификации) 				ИЛИ
			ЗначениеЗаполнено(Объект.ВидСертификата) 					ИЛИ
			ЗначениеЗаполнено(Объект.ФайлСертификата) 					ИЛИ
			Объект.НоменклатураСертификата.Количество() > 0) Тогда
	
		Если Вопрос("Сохранить свойства сертификата?", РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Нет Тогда
			
			Объект.ДатаНачалаДействияСертификата 			= Дата(1,1,1);
			Объект.ДатаОкончанияДействияСертификата 		= Дата(1,1,1);
			Объект.Комментарий 								= "";
			Объект.Неактуальный 							= Ложь;
			Объект.ОрганСертификации 						= "";
			Объект.ВидСертификата 							= "";
			Объект.ФайлСертификата 							= "";
	        Объект.НоменклатураСертификата.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	//АБС 27.05.2014 44000

КонецПроцедуры


&НаКлиенте
Процедура КомандаФайлы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ Вопрос("Документ будет записан. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураЗаписиДокумента = Новый Структура();
		
		СтруктураЗаписиДокумента.Вставить("РежимЗаписи"		, РежимЗаписиДокумента.Запись);
		СтруктураЗаписиДокумента.Вставить("РежимПроведения"	, РежимПроведенияДокумента.Неоперативный);
		
		Записать(СтруктураЗаписиДокумента);
		
	КонецЕсли;
			
	ФормаХранилищаДопИнформации = ПолучитьФорму("Справочник.ХранилищеДополнительнойИнформации.Форма.абс_ФормаСписка");
	ФормаХранилищаДопИнформации.СправочникСписок.Отбор.Объект.Установить(Объект.Ссылка);
	ФормаХранилищаДопИнформации.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПодбор(Команда)
	СтруктураПараметров=Новый Структура();
	СтруктураПараметров.Вставить("ПодбиратьУслуги", Ложь);
	
	ОткрытьФормуМодально("ОбщаяФорма.абс_ФормаПодбораНоменклатуры", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("Номенклатура") Тогда
			Для Каждого Номенклатура из ВыбранноеЗначение.Номенклатура Цикл
				//если номенклатура уже выбрана в ТЧ, то ее добавлять не будем
				МассивСтрок=Объект.НоменклатураСертификата.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
				Если МассивСтрок.Количество()=0 Тогда
					СтрокаТЧ=Объект.НоменклатураСертификата.Добавить();
					СтрокаТЧ.Номенклатура=Номенклатура;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


