&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если НеотгруженноеКоличество > ИсходноеКоличество Тогда
		Предупреждение("Неотгруженное кол-во не может быть больше исходного!");
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НеотгруженноеКоличество",НеотгруженноеКоличество);
	Результат.Вставить("ПричинаНеотгрузки",ПричинаНеотгрузки);
	Результат.Вставить("НомерПретензии",НомерПретензии);
	Результат.Вставить("ДатаПретензии",ДатаПретензии);
	Результат.Вставить("СкладПретензий",СкладПретензий);

	
	Закрыть(Результат);
	
КонецПроцедуры
