
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОтботТЧ();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтботТЧ()
    НовыйНабор = РеквизитФормыВЗначение("ПареметрыРасчетаПремии");
	
	НовыйНабор.Отбор.Сеть.Использование = Истина;
    НовыйНабор.Отбор.Сеть.ВидСравнения = ВидСравнения.Равно;
	НовыйНабор.Отбор.Сеть.Значение = Объект.Ссылка;
	НовыйНабор.Прочитать();
	
	ЗначениеВДанныеФормы(НовыйНабор, ПареметрыРасчетаПремии);
КонецПроцедуры	
	
&НаКлиенте
Процедура ПареметрыРасчетаПремииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Отказ = Истина;
		Иначе
			Попытка
				ЭтаФорма.Записать();
				Отказ = Ложь;
				ОбновитьОтботТЧ();

			Исключение
				Сообщить(ОбщегоНазначения.СформироватьТекстСообщения(ОписаниеОшибки()));
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПареметрыРасчетаПремииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если  Элемент.ТекущиеДанные.Сеть = Справочники.Лео_ТорговыеТочки.ПустаяСсылка() Тогда
		Элемент.ТекущиеДанные.Контрагент = Объект.Владелец;
		Элемент.ТекущиеДанные.Сеть = Объект.Ссылка;
		Элемент.ТекущиеДанные.Действует = Истина;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Набор = ДанныеФормыВЗначение(ПареметрыРасчетаПремии, Тип("РегистрСведенийНаборЗаписей.Лео_ПареметрыРасчетаПремииКлиентам"));
    Таб = Набор.Выгрузить();
    Набор.Загрузить(Таб);
    Набор.Записать();
КонецПроцедуры
